{"topic": "Packaging", "english_title": "Packaging and labeling", "english": "Packaging is the science, art and technology of enclosing or protecting products for distribution, storage, sale, and use.  Packaging also refers to the process of designing, evaluating, and producing packages. Packaging can be described as a coordinated system of preparing goods for transport, warehousing, logistics, sale, and end use. Packaging contains, protects, preserves, transports, informs, and sells. In many countries it is fully integrated into government, business, institutional, industrial, and personal use.\nPackage labeling (American English) or labelling (British English) is any written, electronic, or graphic communication on the package or on a separate but associated label.\n\n\n== History of packaging ==\n\n\n=== Ancient era ===\n\nThe first packages used the natural materials available at the time: baskets of reeds, wineskins (bota bags), wooden boxes, pottery vases, ceramic amphorae, wooden barrels, woven bags, etc. Processed materials were used to form packages as they were developed:  first glass and bronze vessels.  The study of old packages is an essential aspect of archaeology.\nThe first usage of paper for packaging was sheets of treated mulberry bark used by the Chinese to wrap foods as early as the first or second century B.C.The usage of paper-like material in Europe was when the Romans used low grade and recycled papyrus for the packaging of incense.The earliest recorded use of paper for packaging dates back to 1035, when a Persian traveller visiting markets in Cairo, Arab Egypt, noted that vegetables, spices and hardware were wrapped in paper for the customers after they were sold.\n\n\n=== Modern era ===\n\n\n==== Tinplate ====\nThe use of tinplate for packaging dates back to the 18th century. The manufacturing of tinplate was the monopoly of Bohemia for a long time; in 1667 Andrew Yarranton, an English engineer, and Ambrose Crowley brought the method to England where it was improved by ironmasters including Philip Foley. By 1697, John Hanbury had a rolling mill at Pontypool for making \"Pontypoole Plates\". The method pioneered there of rolling iron plates by means of cylinders enabled more uniform black plates to be produced than was possible with the former practice of hammering.\nTinplate boxes first began to be sold from ports in the Bristol Channel in 1725.  The tinplate was shipped from Newport, Monmouthshire. By 1805, 80,000 boxes were made and 50,000 exported. Tobacconists in London began packaging snuff in metal-plated canisters from the 1760s onwards.\n\n\n==== Canning ====\n\nWith the discovery of the importance of airtight containers for food preservation by French inventor Nicholas Appert, the tin canning process was patented by British merchant Peter Durand in 1810. After receiving the patent, Durand did not himself follow up with canning food. He sold his patent in 1812 to two other Englishmen, Bryan Donkin and John Hall, who refined the process and product and set up the world's first commercial canning factory on Southwark Park Road, London. By 1813, they were producing the first canned goods for the Royal Navy.The progressive improvement in canning stimulated the 1855 invention of the can opener. Robert Yeates, a cutlery and surgical instrument maker of Trafalgar Place West, Hackney Road, Middlesex, UK, devised a claw-ended can opener with a hand-operated tool that haggled its way around the top of metal cans. In 1858, another lever-type opener of a more complex shape was patented in the United States by Ezra Warner of Waterbury, Connecticut.\n\n\n==== Paper-based packaging ====\n\nSet-up boxes were first used in the 16th century and modern folding cartons date back to 1839.  The first corrugated box was produced commercially in 1817 in England. Corrugated (also called pleated) paper received a British patent in 1856 and was used as a liner for tall hats. Scottish-born Robert Gair invented the pre-cut paperboard box in 1890—flat pieces manufactured in bulk that folded into boxes. Gair's invention came about as a result of an accident: as a Brooklyn printer and paper-bag maker during the 1870s, he was once printing an order of seed bags, and the metal ruler, commonly used to crease bags, shifted in position and cut them. Gair discovered that by cutting and creasing in one operation he could make prefabricated paperboard boxes.Commercial paper bags were first manufactured in Bristol, England, in 1844, and the American Francis Wolle patented a machine for automated bag-making in 1852.\n\n\n=== 20th century ===\nPackaging advancements in the early 20th century included Bakelite closures on bottles, transparent cellophane overwraps and panels on cartons. These innovations increased processing efficiency and improved food safety.  As additional materials such as aluminum and several types of plastic were developed, they were incorporated into packages to improve performance and functionality.\n\nIn 1952, Michigan State University became the first university in the world to offer a degree in Packaging Engineering.In-plant recycling has long been typical for producing packaging materials. Post-consumer recycling of aluminum and paper-based products has been economical for many years:  since the 1980s, post-consumer recycling has increased due to curbside recycling, consumer awareness, and regulatory pressure.\n\nMany prominent innovations in the packaging industry were developed first for military use.  Some military supplies are packaged in the same commercial packaging used for general industry. Other military packaging must transport materiel, supplies, foods, etc. under severe distribution and storage conditions. Packaging problems encountered in World War II led to Military Standard or \"mil spec\" regulations being applied to packaging, which was then designated \"military specification packaging\". As a prominent concept in the military, mil spec packaging officially came into being around 1941, due to operations in Iceland experiencing critical losses, ultimately attributed to bad packaging. In most cases, mil spec packaging solutions (such as barrier materials, field rations, antistatic bags, and various shipping crates) are similar to commercial grade packaging materials, but subject to more stringent performance and quality requirements.As of 2003, the packaging sector accounted for about two percent of the gross national product in developed countries. About half of this market was related to food packaging.\nIn 2019 the global food packaging market size was estimated at USD 303.26 billion, exhibiting a CAGR of 5.2% over the forecast period. Growing demand for packaged food by consumers owing to quickening pace of life and changing eating habits is expected to have a major impact on the market.\n\n\n== The purposes of packaging and package labels ==\nPackaging and package labeling have several objectives\nPhysical protection – The objects enclosed in the package may require protection from, among other things, mechanical shock, vibration, electrostatic discharge, compression, temperature, etc.\nBarrier protection – A barrier to oxygen, water vapor, dust, etc., is often required. Permeation is a critical factor in design. Some packages contain desiccants or oxygen absorbers to help extend shelf life. Modified atmospheres or controlled atmospheres are also maintained in some food packages. Keeping the contents clean, fresh, sterile and safe for the duration of the intended shelf life is a primary function. A barrier is also implemented in cases where segregation of two materials prior to end use is required, as in the case of special paints, glues, medical fluids, etc.\nContainment or agglomeration – Small objects are typically grouped together in one package for reasons of storage and selling efficiency. For example, a single box of 1000 marbles requires less physical handling than 1000 single marbles. Liquids, powders, and granular materials need containment.\nInformation transmission – Packages and labels communicate how to use, transport, recycle, or dispose of the package or product. With pharmaceuticals, food, medical, and chemical products, some types of information are required by government legislation. Some packages and labels also are used for track and trace purposes. Most items include their serial and lot numbers on the packaging, and in the case of food products, medicine, and some chemicals the packaging often contains an expiry/best-before date, usually in a shorthand form. Packages may indicate their construction material with a symbol.\nMarketing – Packaging and labels can be used by marketers to encourage potential buyers to purchase a product. Package graphic design and physical design have been important and constantly evolving phenomena for several decades. Marketing communications and graphic design are applied to the surface of the package and often to the point of sale display. Most packaging is designed to reflect the brand's message and identity on the one hand while highlighting the respective product concept on the other hand.\n\nSecurity – Packaging can play an important role in reducing the security risks of shipment. Packages can be made with improved tamper resistance to deter manipulation and they can also have tamper-evident features indicating that tampering has taken place. Packages can be engineered to help reduce the risks of package pilferage or the theft and resale of products: Some package constructions are more resistant to pilferage than other types, and some have pilfer-indicating seals. Counterfeit consumer goods, unauthorized sales (diversion), material substitution and tampering can all be minimized or prevented with such anti-counterfeiting technologies. Packages may include authentication seals and use security printing to help indicate that the package and contents are not counterfeit. Packages also can include anti-theft devices such as dye-packs, RFID tags, or electronic article surveillance tags that can be activated or detected by devices at exit points and require specialized tools to deactivate. Using packaging in this way is a means of retail loss prevention.\nConvenience – Packages can have features that add convenience in distribution, handling, stacking, display, sale, opening, reclosing, using, dispensing, reusing, recycling, and ease of disposal\nPortion control – Single serving or single dosage packaging has a precise amount of contents to control usage. Bulk commodities (such as salt) can be divided into packages that are a more suitable size for individual households. It also aids the control of inventory: selling sealed one-liter bottles of milk, rather than having people bring their own bottles to fill themselves.\nBranding/Positioning – Packaging and labels are increasingly used to go beyond marketing to brand positioning, with the materials used and design chosen key to the storytelling element of brand development. Due to the increasingly fragmented media landscape in the digital age this aspect of packaging is of growing importance.\n\n\n== Packaging types ==\n\nPackaging may be of several different types. For example, a transport package or distribution package can be the shipping container used to ship, store, and handle the product or inner packages.  Some identify a consumer package as one which is directed toward a consumer or household.\nPackaging may be described in relation to the type of product being packaged: medical device packaging, bulk chemical packaging, over-the-counter drug packaging, retail food packaging, military materiel packaging, pharmaceutical packaging, etc.\nIt is sometimes convenient to categorize packages by layer or function: primary, secondary, etc.\n\nPrimary packaging is the material that first envelops the product and holds it. This usually is the smallest unit of distribution or use and is the package which is in direct contact with the contents.\nSecondary packaging is outside the primary packaging, and may be used to prevent pilferage or to group primary packages together.\nTertiary or transit packaging is used for bulk handling, warehouse storage and transport shipping. The most common form is a palletized unit load that packs tightly into containers.These broad categories can be somewhat arbitrary.  For example, depending on the use, a shrink wrap can be primary packaging when applied directly to the product, secondary packaging when used to combine smaller packages, or tertiary packaging when used to facilitate some types of distribution, such as to affix a number of cartons on a pallet.\nPackaging can also  have categories based on  the package form.  For example, thermoform packaging and flexible packaging describe broad usage areas.\n\n\n== Labels and symbols used on packages ==\n\nMany types of symbols for package labeling are nationally and internationally standardized.  For consumer packaging, symbols exist for product certifications (such as the FCC and TÜV marks), trademarks, proof of purchase, etc.  Some requirements and symbols exist to communicate aspects of consumer rights and safety, for example the CE marking or the estimated sign that notes conformance to EU weights and measures accuracy regulations. Examples of environmental and recycling symbols include the recycling symbol, the recycling code (which could be a resin identification code), and the \"Green Dot\". Food packaging may show food contact material symbols. In the European Union, products of animal origin which are intended to be consumed by humans have to carry standard, oval-shaped EC identification and health marks for food safety and quality insurance reasons.\nBar codes, Universal Product Codes, and RFID labels are common to allow automated information management in logistics and retailing. Country-of-origin labeling is often used. Some products might use QR codes or similar matrix barcodes. Packaging may have visible registration marks and other printing calibration and troubleshooting cues.\n\n\n=== Consumer package contents ===\nSeveral aspects of  consumer package labeling are subject to regulation.  One of the most important is to accurately state the quantity (weight, volume, count) of the package contents.  Consumers expect that the label accurately reflects the actual contents.  Manufacturers and packagers must have effective quality assurance procedures and accurate equipment; even so, there is inherent variability in all processes.\nRegulations attempt to handle both sides of this.  In the USA, the Fair Packaging and Labeling Act provides requirements for many types of products.  Also, NIST has  Handbook 133, Checking the Net Contents of Packaged Goods.  This is  a procedural guide for compliance testing of net contents and is referenced by several other regulatory agencies.Other regions and countries have their own regulatory requirements.  For example, the UK has its Weights and Measures (Packaged Goods) Regulations as well as several other regulations. In the EEA, products with hazardous formulas need to have a UFI.\n\n\n=== Shipping container labeling ===\n\nTechnologies related to shipping containers are identification codes, bar codes, and electronic data interchange (EDI).  These three core technologies serve to enable the business functions in the process of shipping containers throughout the distribution channel.  Each has an essential function: identification codes either relate product information or serve as keys to other data, bar codes allow for the automated input of identification codes and other data, and EDI moves data between trading partners within the distribution channel.\nElements of these core technologies include UPC and EAN item identification codes, the SCC-14 (UPC shipping container code), the SSCC-18 (Serial Shipping Container Codes), Interleaved 2-of-5 and UCC/EAN-128 (newly designated GS1-128) bar code symbologies, and ANSI ASC X12 and UN/EDIFACT EDI standards.\nSmall parcel carriers often have their own formats.  For example, United Parcel Service has a MaxiCode 2-D code for parcel tracking.\nRFID labels for shipping containers are also increasingly used.  A Wal-Mart division, Sam's Club, has also moved in this direction and is putting pressure on its suppliers to comply.Shipments of hazardous materials or dangerous goods have special information and symbols (labels, placards, etc.) as required by UN, country, and specific carrier requirements. On transport packages, standardized symbols are also used to communicate handling needs. Some are defined in the ASTM D5445 \"Standard Practice for Pictorial Markings for Handling of Goods\" and ISO 780 \"Pictorial marking for handling of goods\".\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== Package development considerations ==\nPackage design and development are often thought of as an integral part of the new product development process.  Alternatively, the development of a package (or component) can be a separate process but must be linked closely with the product to be packaged.\nPackage design starts with the identification of all the requirements: structural design, marketing, shelf life, quality assurance, logistics, legal, regulatory, graphic design, end-use, environmental, etc. The design criteria, performance (specified by package testing),  completion time targets, resources, and cost constraints need to be established and agreed upon.  Package design processes often employ rapid prototyping, computer-aided design, computer-aided manufacturing  and document automation.\n\nAn example of how package design is affected by other factors is its relationship to logistics.  When the distribution system includes individual shipments by a small parcel carrier, the sorting, handling, and mixed stacking make severe demands on the strength and protective ability of the transport package. If the logistics system consists of uniform palletized unit loads, the structural design of the package can be designed to meet those specific needs, such as vertical stacking for a longer time frame.  A package designed for one mode of shipment may not be suited to another.\nWith some types of products, the design process involves detailed regulatory requirements for the packaging.  For example, any package components that may contact foods are designated food contact materials.Toxicologists and food scientists need to verify that such packaging materials are allowed by applicable regulations. Packaging engineers need to verify that the completed package will keep the product safe for its intended shelf life with normal usage.  Packaging processes, labeling, distribution, and sale need to be validated to assure that they comply with regulations that have the well being of the consumer in mind.\nSometimes the objectives of package development seem contradictory.  For example, regulations for an over-the-counter drug might require the package to be tamper-evident and child resistant: These intentionally make the package difficult to open. The intended consumer, however, might be disabled or elderly and unable to readily open the package. Meeting all goals is a challenge.\nPackage design may take place within a company or with various degrees of external packaging engineering: independent contractors, consultants, vendor evaluations, independent laboratories, contract packagers, total outsourcing, etc.  Some sort of formal project planning and project management methodology is required for all but the simplest package design and development programs. An effective quality management system and Verification and Validation protocols are mandatory for some types of packaging and recommended for all.\n\n\n=== Environmental considerations ===\n\nPackage development involves considerations of sustainability, environmental responsibility, and applicable environmental and recycling regulations. It may involve a life cycle assessment\nwhich considers the material and energy inputs and outputs to the package, the packaged product (contents), the packaging process, the logistics system, waste management, etc.  It is necessary to know the relevant regulatory requirements for point of manufacture, sale, and use.\nThe traditional “three R’s” of reduce, reuse, and recycle are part of a waste hierarchy which may be considered in product and package development.\n\nPrevention –  Waste prevention is a primary goal.  Packaging should be used only where needed. Proper packaging can also help prevent waste. Packaging plays an important part in preventing loss or damage to the packaged product (contents). Usually, the energy content and material usage of the product being packaged are much greater than that of the package. A vital function of the package is to protect the product for its intended use: if the product is damaged or degraded, its entire energy and material content may be lost.\nMinimization (also \"source reduction\") – The mass and volume of packaging (per unit of contents) can be measured and used as criteria for minimizing the package in the design process. Usually “reduced” packaging also helps minimize costs. Packaging engineers continue to work toward reduced packaging.\nReuse – Reusable packaging is encouraged.  Returnable packaging has long been useful (and economically viable) for closed-loop logistics systems. Inspection, cleaning, repair, and recouperage are often needed. Some manufacturers re-use the packaging of the incoming parts for a product, either as packaging for the outgoing product or as part of the product itself.\nRecycling – Recycling is the reprocessing of materials (pre- and post-consumer) into new products.  Emphasis is focused on recycling the largest primary components of a package: steel, aluminum, papers, plastics, etc. Small components can be chosen which are not difficult to separate and do not contaminate recycling operations. Packages can sometimes be designed to separate components to better facilitate recycling.\nEnergy recovery – Waste-to-energy and refuse-derived fuel in approved facilities make use of the heat available from incinerating the packaging components.\nDisposal – Incineration, and placement in a sanitary landfill are undertaken for some materials.  Certain US states regulate packages for toxic contents, which have the potential to contaminate emissions and ash from incineration and leachate from landfill. Packages should not be littered.Development of sustainable packaging is an area of considerable interest to standards organizations, governments, consumers, packagers, and retailers.\nSustainability is the fastest-growing driver for packaging development, particularly for packaging manufacturers that work with the world's leading brands, as their CSR (Corporate Social Responsibility) targets often exceed those of the EU Directive.\n\n\n== Packaging machinery ==\n\nChoosing packaging machinery includes an assessment of technical capabilities, labor requirements, worker safety, maintainability, serviceability, reliability, ability to integrate into the packaging line, capital cost, floorspace, flexibility (change-over, materials, multiple products, etc.), energy requirements, quality of outgoing packages, qualifications (for food, pharmaceuticals, etc.), throughput, efficiency, productivity, ergonomics, return on investment, etc.\nPackaging machinery can be:\n\npurchased as standard, off-the-shelf equipment\npurchased custom-made or custom-tailored to specific operations\nmanufactured or modified by in-house engineers and maintenance staffEfforts at packaging line automation increasingly use programmable logic controllers and robotics.\nPackaging machines may be of the following general types:\n\nAccumulating and collating machines\nBlister packs, skin packs and vacuum packaging machines\nBottle caps equipment, over-capping, lidding, closing, seaming and sealing machines\nBox, case, tray, and carrier forming, packing, unpacking, closing, and sealing machines\nCartoning machines\nCleaning, sterilizing, cooling and drying machines\nCoding, printing, marking, stamping, and imprinting machines\nConverting machines\nConveyor belts, accumulating and related machines\nFeeding, orienting, placing and related machines\nFilling machines: handling dry, powdered, solid, liquid, gas, or viscous products\nInspecting: visual, sound, metal detecting, etc.\nLabel dispenser\nOrienting, unscrambling machines\nPackage filling and closing machines\nPalletizing, depalletizing, unit load assembly\nProduct identification: labeling, marking, etc.\nSealing machines: heat sealer or glue units\nSlitting machines\nWeighing machines: check weigher, multihead weigher\nWrapping machines: stretch wrapping, shrink wrap, banding\nForm, fill and seal machines\nOther specialty machinery: slitters, perforating, laser cutters, parts attachment, etc.\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nBrazilian packaging market\nDocument automation\nIn-mould labelling\nPacking problems\nPackage cushioning\nPolypropylene raffia\nResealable packaging\nGift wrapping\nZero-waste lifestyle\n\n\n== References ==\n\n\n=== General references ===\nYam, K.L., \"Encyclopedia of Packaging Technology\", John Wiley & Sons, 2009, ISBN 978-0-470-08704-6\nSoroka, W, Illustrated Glossary of Packaging Terminology Institute of Packaging Professionals,\n\n\n== Further reading ==\nCalver, G., What Is Packaging Design, Rotovision. 2004, ISBN 2-88046-618-0.\nDean, D.A., 'Pharmaceutical Packaging Technology\", 2000, ISBN 0-7484-0440-6\nMeisner, \"Transport Packaging\", Third Edition, IoPP, 2016\nMorris, S.A., \"Food and Package Engineering\", 2011, ISBN 978-0-8138-1479-7\nPilchik, R., \"Validating Medical Packaging\" 2002, ISBN 1-56676-807-1\nRobertson, G.L., \"Food Packaging: Principles and Practice\", 3rd edition, 2013, ISBN 978-1-4398-6241-4\nSelke, S., \"Plastics Packaging\", 2004, ISBN 1-56990-372-7"}