{"topic": "Architecture", "english_title": "Architecture", "english": "Architecture (Latin architectura, from the Greek ἀρχιτέκτων arkhitekton \"architect\", from ἀρχι- \"chief\" and τέκτων \"creator\") is both the process and the product of planning, designing, and constructing buildings or other structures. Architectural works, in the material form of buildings, are often perceived as cultural symbols and as works of art. Historical civilizations are often identified with their surviving architectural achievements.The practice, which began in the prehistoric era, has been used as a way of expressing culture for civilizations on all seven continents. For this reason, architecture is considered to be a form of art. Texts on architecture have been written since ancient time. The earliest surviving text on architectural theory is the 1st century AD treatise De architectura by the Roman architect Vitruvius, according to whom a good building embodies firmitas, utilitas, and venustas (durability, utility, and beauty). Centuries later, Leon Battista Alberti developed his ideas further, seeing beauty as an objective quality of buildings to be found in their proportions. Giorgio Vasari wrote Lives of the Most Excellent Painters, Sculptors, and Architects and put forward the idea of style in the arts in the 16th century. In the 19th century, Louis Sullivan declared that \"form follows function\". \"Function\" began to replace the classical \"utility\" and was understood to include not only practical but also aesthetic, psychological and cultural dimensions. The idea of sustainable architecture was introduced in the late 20th century.\nArchitecture began as rural, oral vernacular architecture that developed from trial and error to successful replication. Ancient urban architecture was preoccupied with building religious structures and buildings symbolizing the political power of rulers until Greek and Roman architecture shifted focus to civic virtues. Indian and Chinese architecture influenced forms all over Asia and Buddhist architecture in particular took diverse local flavors. During the European Middle Ages, pan-European styles of Romanesque and Gothic cathedrals and abbeys emerged while the Renaissance favored Classical forms implemented by architects known by name. Later, the roles of architects and engineers became separated. Modern architecture began after World War I as an avant-garde movement that sought to develop a completely new style appropriate for a new post-war social and economic order focused on meeting the needs of the middle and working classes. Emphasis was put on modern techniques, materials, and simplified geometric forms, paving the way for high-rise superstructures. Many architects became disillusioned with modernism which they perceived as ahistorical and anti-aesthetic, and postmodern and contemporary architecture developed.\nOver the years, the field of architectural construction has branched out to include everything from ship design to interior decorating.\n\n\n== Definitions ==\nArchitecture can mean:\n\nA general term to describe buildings and other physical structures.\nThe art and science of designing buildings and (some) nonbuilding structures.\nThe style of design and method of construction of buildings and other physical structures.\nA unifying or coherent form or structure.\nKnowledge of art, science, technology, and humanity.\nThe design activity of the architect, from the macro-level (urban design, landscape architecture) to the micro-level (construction details and furniture). The practice of the architect, where architecture means offering or rendering professional services in connection with the design and construction of buildings, or built environments.\n\n\n== Theory of architecture ==\n\n \n\nThe philosophy of architecture is a branch of philosophy of art, dealing with aesthetic value of architecture, its semantics and relations with development of culture. Many philosophers and theoreticians from Plato to Michel Foucault, Gilles Deleuze, Robert Venturi and Ludwig Wittgenstein have concerned themselves with the nature of architecture and whether or not architecture is distinguished from building.\n\n\n=== Historic treatises ===\nThe earliest surviving written work on the subject of architecture is De architectura by the Roman architect Vitruvius in the early 1st century AD. According to Vitruvius, a good building should satisfy the three principles of firmitas, utilitas, venustas, commonly known by the original translation – firmness, commodity and delight. An equivalent in modern English would be:\n\nDurability – a building should stand up robustly and remain in good condition\nUtility – it should be suitable for the purposes for which it is used\nBeauty – it should be aesthetically pleasingAccording to Vitruvius, the architect should strive to fulfill each of these three attributes as well as possible. Leon Battista Alberti, who elaborates on the ideas of Vitruvius in his treatise, De re aedificatoria, saw beauty primarily as a matter of proportion, although ornament also played a part. For Alberti, the rules of proportion were those that governed the idealised human figure, the Golden mean. The most important aspect of beauty was, therefore, an inherent part of an object, rather than something applied superficially, and was based on universal, recognisable truths. The notion of style in the arts was not developed until the 16th century, with the writing of Giorgio Vasari. By the 18th century, his Lives of the Most Excellent Painters, Sculptors, and Architects had been translated into Italian, French, Spanish, and English.\nIn the 16th century, Italian Mannerist architect, painter and theorist Sebastiano Serlio wrote Tutte L’Opere D’Architettura et Prospetiva (Complete Works on Architecture and Perspective). This treatise exerted immense influence throughout Europe, being the first handbook that emphasized the practical rather than the theoretical aspects of architecture, and it was the first to catalog the five orders.In the early 19th century, Augustus Welby Northmore Pugin wrote Contrasts (1836) that, as the titled suggested, contrasted the modern, industrial world, which he disparaged, with an idealized image of neo-medieval world. Gothic architecture, Pugin believed, was the only \"true Christian form of architecture.\" The 19th-century English art critic, John Ruskin, in his Seven Lamps of Architecture, published 1849, was much narrower in his view of what constituted architecture. Architecture was the \"art which so disposes and adorns the edifices raised by men ... that the sight of them\" contributes \"to his mental health, power, and pleasure\". For Ruskin, the aesthetic was of overriding significance. His work goes on to state that a building is not truly a work of architecture unless it is in some way \"adorned\". For Ruskin, a well-constructed, well-proportioned, functional building needed string courses or rustication, at the very least.On the difference between the ideals of architecture and mere construction, the renowned 20th-century architect Le Corbusier wrote: \"You employ stone, wood, and concrete, and with these materials you build houses and palaces: that is construction. Ingenuity is at work. But suddenly you touch my heart, you do me good. I am happy and I say: This is beautiful. That is Architecture\". Le Corbusier's contemporary Ludwig Mies van der Rohe said \"Architecture starts when you carefully put two bricks together. There it begins.\"\n\n\n=== Modern concepts ===\nThe notable 19th-century architect of skyscrapers, Louis Sullivan, promoted an overriding precept to architectural design: \"Form follows function\". While the notion that structural and aesthetic considerations should be entirely subject to functionality was met with both popularity and skepticism, it had the effect of introducing the concept of \"function\" in place of Vitruvius' \"utility\". \"Function\" came to be seen as encompassing all criteria of the use, perception and enjoyment of a building, not only practical but also aesthetic, psychological and cultural.\nNunzia Rondanini stated, \"Through its aesthetic dimension architecture goes beyond the functional aspects that it has in common with other human sciences. Through its own particular way of expressing values, architecture can stimulate and influence social life without presuming that, in and of itself, it will promote social development.... To restrict the meaning of (architectural) formalism to art for art's sake is not only reactionary; it can also be a purposeless quest for perfection or originality which degrades form into a mere instrumentality\".Among the philosophies that have influenced modern architects and their approach to building design are Rationalism, Empiricism, Structuralism, Poststructuralism, Deconstruction and Phenomenology.\nIn the late 20th century a new concept was added to those included in the compass of both structure and function, the consideration of sustainability, hence sustainable architecture. To satisfy the contemporary ethos a building should be constructed in a manner which is environmentally friendly in terms of the production of its materials, its impact upon the natural and built environment of its surrounding area and the demands that it makes upon non-sustainable power sources for heating, cooling, water and waste management, and lighting.\n\n\n== History ==\n\n\n=== Origins and vernacular architecture ===\n\n\t\t\n\t\t\n\t\t\nBuilding first evolved out of the dynamics between needs (shelter, security, worship, etc.) and means (available building materials and attendant skills). As human cultures developed and knowledge began to be formalized through oral traditions and practices, building became a craft, and \"architecture\" is the name given to the most highly formalized and respected versions of that craft. It is widely assumed that architectural success was the product of a process of trial and error, with progressively less trial and more replication as the results of the process proved increasingly satisfactory. What is termed vernacular architecture continues to be produced in many parts of the world.\n\n\n=== Prehistoric architecture ===\n\n\t\t\n\t\t\n\t\t\nEarly human settlements were mostly rural. Expending economies resulted in the creation of urban areas which in some cases grew and evolved very rapidly, such as that of Çatal Höyük in Anatolia and Mohenjo Daro of the Indus Valley Civilization in modern-day Pakistan.\nNeolithic settlements and \"cities\" include Göbekli Tepe and Çatalhöyük in Turkey, Jericho in the Levant, Mehrgarh in Pakistan, Knap of Howar and Skara Brae, Orkney Islands, Scotland, and the  Cucuteni-Trypillian culture settlements in Romania, Moldova and Ukraine.\n\n\n=== Ancient architecture ===\n\n\t\t\n\t\t\n\t\t\nIn many ancient civilizations such as those of Egypt and Mesopotamia, architecture and urbanism reflected the constant engagement with the divine and the supernatural, and many ancient cultures resorted to monumentality in architecture to represent symbolically the political power of the ruler, the ruling elite, or the state itself.\nThe architecture and urbanism of the Classical civilizations such as the Greek and the Roman evolved from civic ideals rather than religious or empirical ones and new building types emerged. Architectural \"style\" developed in the form of the Classical orders. Roman architecture was influenced by Greek architecture as they incorporated many Greek elements into their building practices.Texts on architecture have been written since ancient time. These texts provided both general advice and specific formal prescriptions or canons. Some examples of canons are found in the writings of the 1st-century BCE Roman Architect Vitruvius. Some of the most important early examples of canonic architecture are religious.\n\n\n=== Asian architecture ===\n\n\t\t\n\t\t\n\t\t\nThe architecture of different parts of Asia developed along different lines from that of Europe; Buddhist, Hindu and Sikh architecture each having different characteristics. Indian and Chinese architecture have had great influence on the surrounding regions, while Japanese architecture has not.  Buddhist architecture, in particular, showed great regional diversity. Hindu temple architecture, which developed from around the 5th century CE, is in theory governed by concepts laid down in the Shastras, and is concerned with expressing the macrocosm and the microcosm. In many Asian countries, pantheistic religion led to architectural forms that were designed specifically to enhance the natural landscape.\nIn many parts of Asia, even the grandest houses were relatively lightweight structures mainly using wood until recent times, and there are few survivals of great age.  Buddhism was associated with a move to stone and brick religious structures, probably beginning as rock-cut architecture, which has often survived very well.  \nEarly Asian writings on architecture include the Kao Gong Ji of China from the 7th–5th centuries BCE; the Shilpa Shastras of ancient India;  Manjusri Vasthu Vidya Sastra of Sri Lanka and Araniko of Nepal .\n\n\n=== Islamic architecture ===\n\n\t\t\n\t\t\n\t\t\nIslamic architecture began in the 7th century CE, incorporating architectural forms from the ancient Middle East and Byzantium, but also developing features to suit the religious and social needs of the society. Examples can be found throughout the Middle East, Turkey, North Africa, the Indian Sub-continent  and in parts of Europe, such as Spain, Albania, and the Balkan States, as the result of the expansion of the Ottoman Empire.\n\n\n=== Middle Ages ===\n\n\t\t\n\t\t\n\t\t\nIn Europe during the Medieval period, guilds were formed by craftsmen to organize their trades and written contracts have survived, particularly in relation to ecclesiastical buildings. The role of architect was usually one with that of master mason, or Magister lathomorum as they are sometimes described in contemporary documents.\nThe major architectural undertakings were the buildings of abbeys and cathedrals. From about 900 CE onward, the movements of both clerics and tradesmen carried architectural knowledge across Europe, resulting in the pan-European styles Romanesque and Gothic.\nAlso, a significant part of the Middle Ages architectural heritage is numerous fortifications across the continent. From Balkans to Spain, and from Malta to Estonia, these buildings represent an important part of European heritage.\n\n\n=== Renaissance and the architect ===\n\n\t\t\n\t\t\n\t\t\n\t\t\nIn Renaissance Europe, from about 1400 onwards, there was a revival of Classical learning accompanied by the development of Renaissance humanism, which placed greater emphasis on the role of the individual in society than had been the case during the Medieval period. Buildings were ascribed to specific architects – Brunelleschi, Alberti, Michelangelo, Palladio – and the cult of the individual had begun. There was still no dividing line between artist, architect and engineer, or any of the related vocations, and the appellation was often one of regional preference.\nA revival of the Classical style in architecture was accompanied by a burgeoning of science and engineering, which affected the proportions and structure of buildings. At this stage, it was still possible for an artist to design a bridge as the level of structural calculations involved was within the scope of the generalist.\n\n\n=== Early modern and the industrial age ===\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\nWith the emerging knowledge in scientific fields and the rise of new materials and technology, architecture and engineering began to separate, and the architect began to concentrate on aesthetics and the humanist aspects, often at the expense of technical aspects of building design. There was also the rise of the \"gentleman architect\" who usually dealt with wealthy clients and concentrated predominantly on visual qualities derived usually from historical prototypes, typified by the many country houses of Great Britain that were created in the Neo Gothic or Scottish baronial styles.\nFormal architectural training in the 19th century, for example at École des Beaux-Arts in France, gave much emphasis to the production of beautiful drawings and little to context and feasibility.\nMeanwhile, the Industrial Revolution laid open the door for mass production and consumption. Aesthetics became a criterion for the middle class as ornamented products, once within the province of expensive craftsmanship, became cheaper under machine production.\nVernacular architecture became increasingly ornamental. Housebuilders could use current architectural design in their work by combining features found in pattern books and architectural journals.\n\n\n=== Modernism ===\n\n\t\t\n\t\t\n\t\t\nAround the beginning of the 20th century, general dissatisfaction with the emphasis on revivalist architecture and elaborate decoration gave rise to many new lines of thought that served as precursors to Modern architecture. Notable among these is the Deutscher Werkbund, formed in 1907 to produce better quality machine-made objects. The rise of the profession of industrial design is usually placed here. Following this lead, the Bauhaus school, founded in Weimar, Germany in 1919, redefined the architectural bounds prior set throughout history, viewing the creation of a building as the ultimate synthesis—the apex—of art, craft, and technology.\nWhen modern architecture was first practised, it was an avant-garde movement with moral, philosophical, and aesthetic underpinnings. Immediately after World War I, pioneering modernist architects sought to develop a completely new style appropriate for a new post-war social and economic order, focused on meeting the needs of the middle and working classes. They rejected the architectural practice of the academic refinement of historical styles which served the rapidly declining aristocratic order. The approach of the Modernist architects was to reduce buildings to pure forms, removing historical references and ornament in favor of functional details. Buildings displayed their functional and structural elements, exposing steel beams and concrete surfaces instead of hiding them behind decorative forms. Architects such as Frank Lloyd Wright developed organic architecture, in which the form was defined by its environment and purpose, with an aim to promote harmony between human habitation and the natural world with prime examples being Robie House and Fallingwater.\nArchitects such as Mies van der Rohe, Philip Johnson and Marcel Breuer worked to create beauty based on the inherent qualities of building materials and modern construction techniques, trading traditional historic forms for simplified geometric forms, celebrating the new means and methods made possible by the Industrial Revolution, including steel-frame construction, which gave birth to high-rise superstructures. Fazlur Rahman Khan's development of the tube structure was a technological break-through in building ever higher.  By mid-century, Modernism had morphed into the International Style, an aesthetic epitomized in many ways by the Twin Towers of New York's World Trade Center designed by Minoru Yamasaki.\n\n\n=== Postmodernism ===\n\n\t\t\n\t\t\n\t\t\nMany architects resisted modernism, finding it devoid of the decorative richness of historical styles. As the first generation of modernists began to die after World War II, the second generation of architects including Paul Rudolph, Marcel Breuer, and Eero Saarinen tried to expand the aesthetics of modernism with Brutalism, buildings with expressive sculptural façades made of unfinished concrete. But an even new younger postwar generation critiqued modernism and Brutalism for being too austere, standardized, monotone, and not taking into account the richness of human experience offered in historical buildings across time and in different places and cultures.\nOne such reaction to the cold aesthetic of modernism and Brutalism is the school of metaphoric architecture, which includes such things as biomorphism and zoomorphic architecture, both using nature as the primary source of inspiration and design.  While it is considered by some to be merely an aspect of postmodernism, others consider it to be a school in its own right and a later development of expressionist architecture.Beginning in the late 1950s and 1960s, architectural phenomenology emerged as an important movement in the early reaction against modernism, with architects like Charles Moore in the United States, Christian Norberg-Schulz in Norway, and Ernesto Nathan Rogers and Vittorio Gregotti, Michele Valori, Bruno Zevi in Italy, who collectively popularized an interest in a new contemporary architecture aimed at expanding human experience using historical buildings as models and precedents. Postmodernism produced a style that combined contemporary building technology and cheap materials, with the aesthetics of older pre-modern and non-modern styles, from high classical architecture to popular or vernacular regional building styles. Robert Venturi famously defined postmodern architecture as a \"decorated shed\" (an ordinary building which is functionally designed inside and embellished on the outside) and upheld it against modernist and brutalist \"ducks\" (buildings with unnecessarily expressive tectonic forms).\n\n\n=== Architecture today ===\n\n\t\t\n\t\t\n\t\t\nSince the 1980s, as the complexity of buildings began to increase (in terms of structural systems, services, energy and technologies), the field of architecture became multi-disciplinary with specializations for each project type, technological expertise or project delivery methods. Moreover, there has been an increased separation of the 'design' architect  from the 'project' architect who ensures that the project meets the required standards and deals with matters of liability. The preparatory processes for the design of any large building have become increasingly complicated, and require preliminary studies of such matters as durability, sustainability, quality, money, and compliance with local laws. A large structure can no longer be the design of one person but must be the work of many.\nModernism and Postmodernism have been criticised by some members of the architectural profession who feel that successful architecture is not a personal, philosophical, or aesthetic pursuit by individualists; rather it has to consider everyday needs of people and use technology to create liveable environments, with the design process being informed by studies of behavioral, environmental, and social sciences.\nEnvironmental sustainability has become a mainstream issue, with a profound effect on the architectural profession. Many developers, those who support the financing of buildings, have become educated to encourage the facilitation of environmentally sustainable design, rather than solutions based primarily on immediate cost. Major examples of this can be found in passive solar building design, greener roof designs, biodegradable materials, and more attention to a structure's energy usage. This major shift in architecture has also changed architecture schools to focus more on the environment. There has been an acceleration in the number of buildings that seek to meet green building sustainable design principles. Sustainable practices that were at the core of vernacular architecture increasingly provide inspiration for environmentally and socially sustainable contemporary techniques. The U.S. Green Building Council's LEED (Leadership in Energy and Environmental Design) rating system has been instrumental in this.Concurrently, the recent movements of New Urbanism, Metaphoric architecture, Complementary architecture and New Classical architecture promote a sustainable approach towards construction that appreciates and develops smart growth, architectural tradition and classical design. This in contrast to modernist and globally uniform architecture, as well as leaning against solitary housing estates and suburban sprawl. Glass curtain walls, which were the hallmark of the ultra modern urban life in many countries surfaced even in developing countries like Nigeria where international styles had been represented since the mid 20th Century mostly because of the leanings of foreign-trained architects.\n\n\n== Other types of architecture ==\n\n\n=== Landscape architecture ===\n\nLandscape architecture is the design of outdoor public areas, landmarks, and structures to achieve environmental, social-behavioral, or aesthetic outcomes. It involves the systematic investigation of existing social, ecological, and soil conditions and processes in the landscape, and the design of interventions that will produce the desired outcome.  The scope of the profession includes landscape design; site planning; stormwater management; environmental restoration; parks and recreation planning; visual resource management; green infrastructure planning and provision; and private estate and residence landscape master planning and design; all at varying scales of design, planning and management. A practitioner in the profession of landscape architecture is called a landscape architect.\n\n\n=== Interior architecture ===\n\nInterior architecture is the design of a space which has been created by structural boundaries and the human interaction within these boundaries.  It can also be the initial design and plan for use, then later redesign to accommodate a changed purpose, or a significantly revised design for adaptive reuse of the building shell. The latter is often part of sustainable architecture practices, conserving resources through \"recycling\" a structure by adaptive redesign.  Generally referred to as the spatial art of environmental design, form and practice, interior architecture is the process through which the interiors of buildings are designed, concerned with all aspects of the human uses of structural spaces.  Put simply, interior architecture is the design of an interior in architectural terms.\n\n\n=== Naval architecture ===\n\nNaval architecture, also known as naval engineering, is an engineering discipline dealing with the engineering design process, shipbuilding, maintenance, and operation of marine vessels and structures. Naval architecture involves basic and applied research, design, development, design evaluation and calculations during all stages of the life of a marine vehicle. Preliminary design of the vessel, its detailed design, construction, trials, operation and maintenance, launching and dry-docking are the main activities involved. Ship design calculations are also required for ships being modified (by means of conversion, rebuilding, modernization, or repair). Naval architecture also involves the formulation of safety regulations and damage control rules and the approval and certification of ship designs to meet statutory and non-statutory requirements.\n\n\n=== Urban design ===\n\nUrban design is the process of designing and shaping the physical features of cities, towns, and villages. In contrast to architecture, which focuses on the design of individual buildings, urban design deals with the larger scale of groups of buildings, streets and public spaces, whole neighborhoods and districts, and entire cities, with the goal of making urban areas functional, attractive, and sustainable.Urban design is an interdisciplinary field that utilizes elements of many built environment professions, including landscape architecture, urban planning, architecture, civil engineering and municipal engineering. It is common for professionals in all these disciplines to practice urban design. In more recent times different sub-subfields of urban design have emerged such as strategic urban design, landscape urbanism, water-sensitive urban design, and sustainable urbanism.\n\n\n=== Metaphorical \"architectures\" ===\n\"Architecture\" is used as a metaphor for many modern techniques or fields for structuring abstractions.  These include:\n\nComputer architecture, a set of rules and methods that describe the functionality, organization, and implementation of computer systems, with software architecture, hardware architecture and network architecture covering more specific aspects.\nBusiness architecture, defined as \"a blueprint of the enterprise that provides a common understanding of the organization and is used to align strategic objectives and tactical demands\",  Enterprise architecture is another term.\nCognitive architecture theories about the structure of the human mind\nSystem architecture a conceptual model that defines the structure, behavior, and more views of any type of system.\n\n\n=== Seismic architecture ===\nThe term 'seismic architecture' or 'earthquake architecture' was first introduced in 1985 by Robert Reitherman. The phrase “earthquake architecture” is used to describe a degree of architectural expression of earthquake resistance or implication of architectural configuration, form or style in earthquake resistance. It is also used to describe buildings in which seismic design considerations impacted its architecture. It may be considered a new aesthetic approach in designing structures in seismic prone areas.  The wide breadth of expressive possibilities ranges from metaphorical uses of seismic issues, to the more straightforward exposure of seismic\ntechnology. While outcomes of an earthquake architecture can be very diverse in their physical manifestations, architectural expression of seismic principles can also take many forms and levels of sophistication.\n\n\n== See also ==\n\nArchitectural engineering\nArchitectural technology\nIndex of architecture articles\nOutline of architecture\nPhilosophy of architecture\nTimeline of architecture\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nWorld Architecture Community\nArchitecture.com, published by Royal Institute of British Architects\nArchitectural centers and museums in the world, list of links from the UIA\nAmerican Institute of Architects\nGlossary of Architectural Terms\nCities and Buildings Database – Collection of digitized images of buildings and cities drawn from across time and throughout the world from the University of Washington Library\n\"Architecture and Power\", BBC Radio 4 discussion with Adrian Tinniswood, Gillian Darley and Gavin Stamp (In Our Time, Oct. 31, 2002)"}