{"topic": "progressivism", "english_title": "Progressivism", "english": "Progressivism is a political philosophy in support of social reform. Based on the idea of progress in which advancements in science, technology, economic development and social organization are vital to the improvement of the human condition, progressivism became highly significant during the Age of Enlightenment in Europe, out of the belief that Europe was demonstrating that societies could progress in civility from uncivilized conditions to civilization through strengthening the basis of empirical knowledge as the foundation of society. Figures of the Enlightenment believed that progress had universal application to all societies and that these ideas would spread across the world from Europe.The contemporary common political conception of progressivism emerged from the vast social changes brought about by industrialization in the Western world in the late-19th century. Progressives take the view that progress is being stifled by vast economic inequality between the rich and the poor; minimally regulated laissez-faire capitalism with monopolistic corporations; and the intense and often violent conflict between those perceived to be privileged and unprivileged, arguing that measures were needed to address these problems.The meanings of progressivism have varied over time and from different perspectives. Early-20th century progressivism was tied to eugenics and the temperance movement, both of which were promoted in the name of public health and as initiatives toward that goal. Contemporary progressives promote public policies that they believe will lead to positive social change. In the 21st century, a movement that identifies as progressive is \"a social or political movement that aims to represent the interests of ordinary people through political change and the support of government actions\".\n\n\n== History ==\n\n\n=== From the Enlightenment to the Industrial Revolution ===\n\nImmanuel Kant identified progress as being a movement away from barbarism towards civilization. 18th-century philosopher and political scientist Marquis de Condorcet predicted that political progress would involve the disappearance of slavery, the rise of literacy, the lessening of sex inequality, prison reforms which at the time were harsh and the decline of poverty.Modernity or modernization was a key form of the idea of progress as promoted by classical liberals in the 19th and 20th centuries who called for the rapid modernization of the economy and society to remove the traditional hindrances to free markets and free movements of people.\n\nIn the late 19th century, a political view rose in popularity in the Western world that progress was being stifled by vast economic inequality between the rich and the poor, minimally regulated laissez-faire capitalism with out-of-control monopolistic corporations, intense and often violent conflict between capitalists and workers, with a need for measures to address these problems. Progressivism has influenced various political movements. Social liberalism was influenced by British liberal philosopher John Stuart Mill's conception of people being \"progressive beings\". British Prime Minister Benjamin Disraeli developed progressive conservatism under one-nation Toryism.In France, the space between social revolution and the socially-conservative laissez-faire centre-right was filled with the emergence of radicalism which thought that social progress required anti-clericalism, humanism and republicanism. Especially anti-clericalism was the dominant influence on the centre-left in many French- and Romance-speaking countries until the mid 20th-century. In Imperial Germany, Chancellor Otto von Bismarck enacted various progressive social welfare measures out of paternalistic conservative motivations to distance workers from the socialist movement of the time and as humane ways to assist in maintaining the Industrial Revolution.In 1891, the Roman Catholic Church encyclical Rerum novarum issued by Pope Leo XIII condemned the exploitation of labour and urged support for labour unions and government regulation of businesses in the interests of social justice while upholding the right to property and criticizing socialism. A Protestant progressive outlook called the Social Gospel emerged in North America that focused on challenging economic exploitation and poverty and by the mid-1890s was common in many Protestant theological seminaries in the United States.\n\n\n=== Contemporary mainstream political conception to the philosophy ===\n\nIn the United States, progressivism began as an intellectual rebellion against the political philosophy of Constitutionalism as expressed by  John Locke and the founders of the American Republic, whereby the authority of government depends on observing limitations on its just powers. What began as a social movement in the 1890s, grew into a popular political movement referred to as the Progressive era; in the 1912 United States presidential election, all three U.S. presidential candidates claimed to be progressives. While the term progressivism represent a range of diverse political pressure groups, not always united, progressives rejected social Darwinism, believing that the problems society faced such as class warfare, greed, poverty, racism and violence could best be addressed by providing good education, a safe environment and an efficient workplace. Progressives lived mainly in the cities, were college educated and believed that government could be a tool for change. President Theodore Roosevelt of the Republican Party and later the Progressive Party declared that he \"always believed that wise progressivism and wise conservatism go hand in hand\".\n\nPresident Woodrow Wilson was also a member of the American progressive movement within the Democratic Party. Progressive stances have evolved over time. Imperialism was a controversial issue within progressivism in the late 19th and early 20th centuries, particularly in the United States, where some progressives supported American imperialism while others opposed it. In response to World War I, President Woodrow Wilson's Fourteen Points established the concept of national self-determination and criticized imperialist competition and colonial injustices. These views were supported by anti-imperialists in areas of the world that were resisting imperial rule.During the period of acceptance of economic Keynesianism (1930s–1970s), there was widespread acceptance in many nations of a large role for state intervention in the economy. With the rise of neoliberalism and challenges to state interventionist policies in the 1970s and 1980s, centre-left progressive movements responded by adopting the Third Way that emphasized a major role for the market economy. There have been social democrats who have called for the social-democratic movement to move past Third Way. Prominent progressive conservative elements in the British Conservative Party have criticized neoliberalism.In the 21st century, progressives continue to favour public policy that reduces or ameliorates the harmful effects of economic inequality as well as systemic discrimination such as institutional racism; to advocate for environmentally conscious policies as well as for social safety nets and workers' rights; and to oppose the negative externalities inflicted on the environment and society by monopolies or corporate influence on the democratic process. The unifying theme is to call attention to the negative impacts of current institutions or ways of doing things and to advocate for social progress, i.e. for positive change as defined by any of several standards such as expansion of democracy, increased egalitarianism in the form of economic and social equality as well as improved well being of a population. Proponents of social democracy have identified themselves as promoting the progressive cause.\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== External links ==\nProgressivism — entry at the Encyclopædia Britannica\n Media related to Progressivism at Wikimedia Commons\n Quotations related to Progressivism at Wikiquote"}