{"topic": "information", "english_title": "Information", "english": "Information can be thought of as the resolution of uncertainty; it answers the question of \"What an entity is\" and thus defines both its essence and the nature of its characteristics. The concept of information has different meanings in different contexts. Thus the concept becomes synonymous to notions of constraint, communication, control, data, form, education, knowledge, meaning, understanding, mental stimuli, pattern, perception, representation, and entropy.\nInformation is associated with data. The difference is that information resolves uncertainty. Data can represent redundant symbols, but approaches information through optimal data compression.\nInformation can be transmitted in time, via data storage, and space, via communication and telecommunication. Information is expressed either as the content of a message or through direct or indirect observation. That which is perceived can be construed as a message in its own right, and in that sense, information is always conveyed as the content of a message.\nInformation can be encoded into various forms for transmission and interpretation (for example, information may be encoded into a sequence of signs, or transmitted via a signal). It can also be encrypted for safe storage and communication.\nThe uncertainty of an event is measured by its probability of occurrence and is inversely proportional to that. Information theory takes advantage of this simple fact by concluding that more uncertain events, require more information to resolve uncertainty of that event. The bit is a typical unit of information. It is 'that which reduces uncertainty by half'. Other units such as the nat may be used. For example, the information encoded in one \"fair\" coin flip is log2(2/1) = 1 bit, and in two fair coin flips is log2(4/1) = 2 bits. A 2011 Science article estimated that 97% of technologically stored information was already in digital bits in 2007, and that the year 2002 was the beginning of the digital age for information storage (with digital storage capacity bypassing analog for the first time).\n\n\n== Etymology ==\n\nThe English word \"Information\" apparently derives from the Latin stem (information-) of the nominative (informatio): this noun derives from the verb īnfōrmāre (to inform) in the sense of \"to give form to the mind\", \"to discipline\", \"instruct\", \"teach\". Inform itself comes (via French informer) from the Latin verb īnfōrmāre, which means to give form, or to form an idea of. Furthermore, Latin itself already contained the word īnfōrmātiō meaning concept or idea, but the extent to which this may have influenced the development of the word information in English is not clear.\nThe ancient Greek word for form was μορφή (morphe; cf. morph) and also εἶδος (eidos) \"kind, idea, shape, set\", the latter word was famously used in a technical philosophical sense by Plato (and later Aristotle) to denote the ideal identity or essence of something (see Theory of Forms). 'Eidos' can also be associated with thought, proposition, or even concept.\nThe ancient Greek word for information is πληροφορία, which transliterates (plērophoria) from \nπλήρης (plērēs) \"fully\" and φέρω (phorein) frequentative of (pherein) to carry through. It literally means \"bears fully\" or \"conveys fully\". In modern Greek the word Πληροφορία is still in daily use and has the same meaning as the word information in English. In addition to its primary meaning, the word Πληροφορία as a symbol has deep roots in Aristotle's semiotic triangle. In this regard it can be interpreted to communicate information to the one decoding that specific type of sign. This is something that occurs frequently with the etymology of many words in ancient and modern Greek where there is a very strong denotative relationship between the signifier, e.g. the word symbol that conveys a specific encoded interpretation, and the signified, e.g. a concept whose meaning the interpreter attempts to decode.\nIn English, \"information\" is an uncountable mass noun.\n\n\n== Information theory ==\n\nInformation theory is the scientific study of the quantification, storage, and communication of information. The field was fundamentally established by the works of Harry Nyquist and Ralph Hartley, in the 1920s, and Claude Shannon in the 1940s. The field is at the intersection of probability theory, statistics, computer science, statistical mechanics, information engineering, and electrical engineering.\nA key measure in information theory is entropy. Entropy quantifies the amount of uncertainty involved in the value of a random variable or the outcome of a random process. For example, identifying the outcome of a fair coin flip (with two equally likely outcomes) provides less information (lower entropy) than specifying the outcome from a roll of a die (with six equally likely outcomes). Some other important measures in information theory are mutual information, channel capacity, error exponents, and relative entropy. Important sub-fields of information theory include source coding, algorithmic complexity theory, algorithmic information theory, and information-theoretic security.\nApplications of fundamental topics of information theory include lossless data compression (e.g. ZIP files), lossy data compression (e.g. MP3s and JPEGs), and channel coding (e.g. for DSL). Its impact has been crucial to the success of the Voyager missions to deep space, the invention of the compact disc, the feasibility of mobile phones and the development of the Internet. The theory has also found applications in other areas, including statistical inference, cryptography, neurobiology, perception, linguistics, the evolution and function of molecular codes (bioinformatics), thermal physics, quantum computing, black holes, information retrieval, intelligence gathering, plagiarism detection, pattern recognition, anomaly detection and even art creation.\n\n\n== As sensory input ==\nOften information can be viewed as a type of input to an organism or system. Inputs are of two kinds; some inputs are important to the function of the organism (for example, food) or system (energy) by themselves. In his book Sensory Ecology biophysicist David B. Dusenbery called these causal inputs. Other inputs (information) are important only because they are associated with causal inputs and can be used to predict the occurrence of a causal input at a later time (and perhaps another place). Some information is important because of association with other information but eventually there must be a connection to a causal input.\nIn practice, information is usually carried by weak stimuli that must be detected by specialized sensory systems and amplified by energy inputs before they can be functional to the organism or system. For example, light is mainly (but not only, e.g. plants can grow in the direction of the lightsource) a causal input to plants but for animals it only provides information. The colored light reflected from a flower is too weak for photosynthesis but the visual system of the bee detects it and the bee's nervous system uses the information to guide the bee to the flower, where the bee often finds nectar or pollen, which are causal inputs, serving a nutritional function.\n\n\n== As representation and complexity ==\nThe cognitive scientist and applied mathematician Ronaldo Vigo argues that information is a concept that requires at least two related entities to make quantitative sense. These are, any dimensionally defined category of objects S, and any of its subsets R. R, in essence, is a representation of S, or, in other words, conveys representational (and hence, conceptual) information about S. Vigo then defines the amount of information that R conveys about S as the rate of change in the complexity of S whenever the objects in R are removed from S. Under \"Vigo information\", pattern, invariance, complexity, representation, and information—five fundamental constructs of universal science—are unified under a novel mathematical framework. Among other things, the framework aims to overcome the limitations of Shannon-Weaver information when attempting to characterize and measure subjective information.\n\n\n== As an influence that leads to transformation ==\nInformation is any type of pattern that influences the formation or transformation of other patterns. In this sense, there is no need for a conscious mind to perceive, much less appreciate, the pattern. Consider, for example, DNA. The sequence of nucleotides is a pattern that influences the formation and development of an organism without any need for a conscious mind. One might argue though that for a human to consciously define a pattern, for example a nucleotide, naturally involves conscious information processing.\nSystems theory at times seems to refer to information in this sense, assuming information does not necessarily involve any conscious mind, and patterns circulating (due to feedback) in the system can be called information. In other words, it can be said that information in this sense is something potentially perceived as representation, though not created or presented for that purpose. For example, Gregory Bateson defines \"information\" as a \"difference that makes a difference\".If, however, the premise of \"influence\" implies that information has been perceived by a conscious mind and also interpreted by it, the specific context associated with this interpretation may cause the transformation of the information into knowledge. Complex definitions of both \"information\" and \"knowledge\" make such semantic and logical analysis difficult, but the condition of \"transformation\" is an important point in the study of information as it relates to knowledge, especially in the business discipline of knowledge management. In this practice, tools and processes are used to assist a knowledge worker in performing research and making decisions, including steps such as:\n\nReview information to effectively derive value and meaning\nReference metadata if available\nEstablish relevant context, often from many possible contexts\nDerive new knowledge from the information\nMake decisions or recommendations from the resulting knowledgeStewart (2001) argues that transformation of information into knowledge is critical, lying at the core of value creation and competitive advantage for the modern enterprise.\nThe Danish Dictionary of Information Terms argues that information only provides an answer to a posed question. Whether the answer provides knowledge depends on the informed person. So a generalized definition of the concept should be: \"Information\" = An answer to a specific question\".\nWhen Marshall McLuhan speaks of media and their effects on human cultures, he refers to the structure of artifacts that in turn shape our behaviors and mindsets. Also, pheromones are often said to be \"information\" in this sense.\n\n\n== Technologically mediated information ==\n\nIt is estimated that the world's technological capacity to store information grew from 2.6 (optimally compressed) exabytes in 1986 – which is the informational equivalent to less than one 730-MB CD-ROM per person (539 MB per person) – to 295 (optimally compressed) exabytes in 2007. This is the informational equivalent of almost 61 CD-ROM per person in 2007.The world's combined technological capacity to receive information through one-way broadcast networks was the informational equivalent of 174 newspapers per person per day in 2007.The world's combined effective capacity to exchange information through two-way telecommunication networks was the informational equivalent of 6 newspapers per person per day in 2007.As of 2007, an estimated 90% of all new information is digital, mostly stored on hard drives.\n\n\n== As records ==\nRecords are specialized forms of information. Essentially, records are information produced consciously or as by-products of business activities or transactions and retained because of their value. Primarily, their value is as evidence of the activities of the organization but they may also be retained for their informational value. Sound records management ensures that the integrity of records is preserved for as long as they are required.\nThe international standard on records management, ISO 15489, defines records as \"information created, received, and maintained as evidence and information by an organization or person, in pursuance of legal obligations or in the transaction of business\". The International Committee on Archives (ICA) Committee on electronic records defined a record as, \"recorded information produced or received in the initiation, conduct or completion of an institutional or individual activity and that comprises content, context and structure sufficient to provide evidence of the activity\".Records may be maintained to retain corporate memory of the organization or to meet legal, fiscal or accountability requirements imposed on the organization. Willis expressed the view that sound management of business records and information delivered \"...six key requirements for good corporate governance...transparency; accountability; due process; compliance; meeting statutory and common law requirements; and security of personal and corporate information.\"\n\n\n== Semiotics ==\nMichael Buckland has classified \"information\" in terms of its uses: \"information as process\", \"information as knowledge\", and \"information as thing\".Beynon-Davies explains the multi-faceted concept of information in terms of signs and signal-sign systems. Signs themselves can be considered in terms of four inter-dependent levels, layers or branches of semiotics: pragmatics, semantics, syntax, and empirics. These four layers serve to connect the social world on the one hand with the physical or technical world on the other.\nPragmatics is concerned with the purpose of communication. Pragmatics links the issue of signs with the context within which signs are used. The focus of pragmatics is on the intentions of living agents underlying communicative behaviour. In other words, pragmatics link language to action.\nSemantics is concerned with the meaning of a message conveyed in a communicative act. Semantics considers the content of communication. Semantics is the study of the meaning of signs - the association between signs and behaviour. Semantics can be considered as the study of the link between symbols and their referents or concepts – particularly the way that signs relate to human behavior.\nSyntax is concerned with the formalism used to represent a message. Syntax as an area studies the form of communication in terms of the logic and grammar of sign systems. Syntax is devoted to the study of the form rather than the content of signs and sign-systems.\nNielsen (2008) discusses the relationship between semiotics and information in relation to dictionaries. He introduces the concept of lexicographic information costs and refers to the effort a user of a dictionary must make to first find, and then understand data so that they can generate information.\nCommunication normally exists within the context of some social situation. The social situation sets the context for the intentions conveyed (pragmatics) and the form of communication. In a communicative situation intentions are expressed through messages that comprise collections of inter-related signs taken from a language mutually understood by the agents involved in the communication. Mutual understanding implies that agents involved understand the chosen language in terms of its agreed syntax (syntactics) and semantics. The sender codes the message in the language and sends the message as signals along some communication channel (empirics). The chosen communication channel has inherent properties that determine outcomes such as the speed at which communication can take place, and over what distance.\n\n\n== The application of information study ==\nThe information cycle (addressed as a whole or in its distinct components) is of great concern to information technology, information systems, as well as information science. These fields deal with those processes and techniques pertaining to information capture (through sensors) and generation (through computation, formulation or composition), processing (including encoding, encryption, compression, packaging), transmission (including all telecommunication methods), presentation (including visualization / display methods), storage (such as magnetic or optical, including holographic methods), etc.\nInformation visualization (shortened as InfoVis) depends on the computation and digital representation of data, and assists users in pattern recognition and anomaly detection.\n\n\t\t\n\t\t\n\t\t\nInformation security (shortened as InfoSec) is the ongoing process of exercising due diligence to protect information, and information systems, from unauthorized access, use, disclosure, destruction, modification, disruption or distribution, through algorithms and procedures focused on monitoring and detection, as well as incident response and repair.\nInformation analysis is the process of inspecting, transforming, and modelling information, by converting raw data into actionable knowledge, in support of the decision-making process.\nInformation quality (shortened as InfoQ) is the potential of a dataset to achieve a specific (scientific or practical) goal using a given empirical analysis method.\nInformation communication represents the convergence of informatics, telecommunication and audio-visual media & content.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nLiu, Alan (2004). The Laws of Cool: Knowledge Work and the Culture of Information. University of Chicago Press.\nBekenstein, Jacob D. (August 2003). \"Information in the holographic universe\". Scientific American. 289 (2): 58–65. Bibcode:2003SciAm.289b..58B. doi:10.1038/scientificamerican0803-58. PMID 12884539.\nGleick, James (2011). The Information: A History, a Theory, a Flood. New York, NY: Pantheon.\nLin, Shu-Kun (2008). \"Gibbs Paradox and the Concepts of Information, Symmetry, Similarity and Their Relationship\". Entropy. 10 (1): 1–5. arXiv:0803.2571. Bibcode:2008Entrp..10....1L. doi:10.3390/entropy-e10010001. S2CID 41159530.\nFloridi, Luciano (2005). \"Is Information Meaningful Data?\" (PDF). Philosophy and Phenomenological Research. 70 (2): 351–70. doi:10.1111/j.1933-1592.2005.tb00531.x. hdl:2299/1825.\nFloridi, Luciano (2005). \"Semantic Conceptions of Information\".  In Zalta, Edward N. (ed.). The Stanford Encyclopedia of Philosophy (Winter 2005 ed.). Metaphysics Research Lab, Stanford University.\nFloridi, Luciano (2010). Information: A Very Short Introduction. Oxford: Oxford University Press.\nLogan, Robert K. What is Information? - Propagating Organization in the Biosphere, the Symbolosphere, the Technosphere and the Econosphere. Toronto: DEMO Publishing.\nNielsen, Sandro (2008). \"The Effect of Lexicographical Information Costs on Dictionary Making and Use\". Lexikos. 18: 170–89.\nStewart, Thomas (2001). Wealth of Knowledge. New York, NY: Doubleday.\nYoung, Paul (1987). The Nature of Information. Westport, Ct: Greenwood Publishing Group. ISBN 978-0-275-92698-4.\nKenett, Ron S.; Shmueli, Galit (2016). Information Quality: The Potential of Data and Analytics to Generate Knowledge. Chichester, United Kingdom: John Wiley and Sons. doi:10.1002/9781118890622. ISBN 978-1-118-87444-8.\n\n\n== External links ==\nSemantic Conceptions of Information Review by Luciano Floridi for the Stanford Encyclopedia of Philosophy\nPrincipia Cybernetica entry on negentropy\nFisher Information, a New Paradigm for Science: Introduction, Uncertainty principles, Wave equations, Ideas of Escher, Kant, Plato and Wheeler. This essay is continually revised in the light of ongoing research.\nHow Much Information? 2003 an attempt to estimate how much new information is created each year (study was produced by faculty and students at the School of Information Management and Systems at the University of California at Berkeley)\n(in Danish) Informationsordbogen.dk The Danish Dictionary of Information Terms / Informationsordbogen"}