{"topic": "Technocapitalism", "english_title": "Technocapitalism", "english": "Technocapitalism or tech-capitalism refers to changes in capitalism associated with the emergence of new technology sectors, the power of corporations, and new forms of organization.\n\n\n== Corporate power and organization ==\nLuis Suarez-Villa, in his 2009 book Technocapitalism: A Critical Perspective on Technological Innovation and Corporatism argues that it is a new version of capitalism that generates new forms of corporate organization designed to exploit intangibles such as creativity and new knowledge. The new organizations, which he refers to as experimentalist organizations are deeply grounded in technological research, as opposed to manufacturing and services production. They are also heavily dependent on the corporate appropriation of research outcomes as intellectual property.\nThis approach is further developed by Suarez-Villa in his 2012 book Globalization and Technocapitalism: The Political Economy of Corporate Power and Technological Domination, in which he relates the emergence of technocapitalism to globalization and to the growing power of technocapitalist corporations.  Taking into account the new relations of power introduced by the corporations that control technocapitalism, he considers new forms of accumulation involving intangibles—such as creativity and new knowledge—along with intellectual property and technological infrastructure. This perspective on globalization—and the effect of technocapitalism and its corporations—also takes into account the growing global importance of intangibles, the inequalities created between nations at the vanguard of technocapitalism and those that are not, the increasing importance of brain-drain flows between nations, and the rise of what he refers to as a techno-military-corporate complex that is rapidly replacing the old military-industrial complex of the second half of the 20th century.  \nThe concept behind technocapitalism is part of a line of thought that relates science and technology to the evolution of capitalism. At the core of this idea of the evolution of capitalism is that science and technology are not divorced from society—or that they exist in a vacuum, or in a separate reality of their own—out of reach of social action and human decision. Science and technology are part of society, and they are subject to the priorities of capitalism as much as any other human endeavor, if not more so.  Prominent scientists in the early 20th century, such as John Bernal, posited that science has a social function, and cannot be seen as something apart from society.  Other scientists at that time, such as John Haldane, related science to social philosophy, and showed how critical approaches to social analysis are very relevant to science, and to our understanding of the need for science.  In our time, this line of thought has encouraged philosophers such as Andrew Feenberg to adopt and apply a critical theory approach to technology and science, providing many important insights on how scientific and technological decisions—and their outcomes—are shaped by society, and by capitalism and its institutions.The term technocapitalism has been used by one author to denote aspects and ideas that diverge sharply from those explained above. Dinesh D'Souza, writing about Silicon Valley in an article, used the term to describe the corporate environment and venture capital relationships in a high tech-oriented local economy.  His approach to the topic was consonant with that of business journals and the corporate management literature.  Some newspaper articles have also used the term occasionally and in a very general sense, to denote the importance of advanced technologies in the economy.\n\n\n== Forms of tech capitalism ==\nTech capitalism can take many forms such as:\nIP based financing where patents and registered IP of new technology is an instrument for building capitalism. Debt based equity where new and innovative technology is used as the security interest for securing financing or leasing. Tech capitalism in the form of ICOs such as Blockchain capital\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nwww.technocapitalism.com"}