{"topic": "Babysitting", "english_title": "Babysitting", "english": "Babysitting is temporarily caring for a child. Babysitting can be a paid job for all ages; however, it is best known as a temporary activity for young teenagers who are too young to be eligible for employment in the general economy. It provides autonomy from parental control, and spending money, as well as an introduction to the techniques of child care. It emerged as a social role for teenagers in the 1920s, and became especially important in suburban America in the 1950s and 1960s, when there was an abundance of small children. It stimulated an outpouring of folk culture in the form of urban legends, pulp novels, and horror films.\n\n\n== Overall ==\nThe majority of the time, babysitters tend to be in high school or college (age 16+). There are some adults who have in-home childcare as well. They are not babysitters; they are child care providers/early childhood educators providing care and education professionally. The type of work for babysitters also varies from watching a sleeping child, changing diapers, playing games, and preparing meals, to teaching the child to read or even drive, depending on the agreement between parents and babysitter.\nIn some countries various organizations produce courses for babysitters, many focusing on child safety and first aid appropriate for infants and children; these classes or courses can be provided at local hospitals and schools. These educational programs can equip the babysitter with information to keep both the children being cared for, and the sitter themselves, safe in various scenarios. Different activities will be needed for babies and toddlers. It will be beneficial for the babysitters to understand toddler developmental milestones in order to plan for the necessary activities. As paid employees, babysitters often require a disclosure or assessment of one's criminal record in order to ward off possible hebephiles, pedophiles and other unsuitable applicants.\n\n\n== Etymology ==\nThe term \"baby sitter\" first appeared in 1937, while the verb form \"baby-sit\" was first recorded in 1947. The American Heritage College Dictionary notes \"One normally would expect the agent noun babysitter with its -er suffix to come from the verb baby-sit, as diver comes from dive, but in fact babysitter is first recorded in 1937, ten years earlier than the first appearance of baby-sit. Thus the verb was derived from the agent noun rather than the other way around, and represents a good example of back-formation. The use of the word \"sit\" to refer to a person tending to a child is recorded from 1800. The term may have originated from the action of the caretaker \"sitting on\" the baby in one room, while the parents were entertaining or busy in another. It's also theorized that the term may come from hens \"sitting\" on their eggs, thus \"caring for\" their chicks.\n\n\n== International variations in definition ==\nIn British English the term refers only to caring for a child for a few hours, on an informal basis and usually in the evening when the child is asleep for most of the time. In American English the term can include caring for a child for the whole or most of the day, and on a regular or more formal basis, which would be described as childminding in British English.\nIn India and Pakistan, a babysitter or nanny is known as an ayah or aya, a person hired on a longer-term contract basis to look after a child regardless of the presence of the parents.\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Bibliography ===\nMiriam Forman-Brunell. Babysitter: An American History. New York University Press, June, 2009.from English dictionary\n\n\n== External links ==\n The dictionary definition of babysitting at Wiktionary\n\nBabysitting courses provided by the American Red Cross\nYourChild: Babysitter Safety University of Michigan Health System\nA guide to the business of babysitting in the United States\nQuality Child Care From University of Florida/IFAS Department of Family, Youth and Community Sciences, Factors in choosing quality child care."}