{"topic": "Homicide", "english_title": "Homicide", "english": "Homicide is the act of one human killing another. A homicide requires only a volitional act by another person that results in death, and thus a homicide may result from accidental, reckless, or negligent acts even if there is no intent to cause harm. Homicides can be divided into many overlapping legal categories, including murder, manslaughter, justifiable homicide, killing in war (either following the laws of war or as a war crime), euthanasia, and capital punishment, depending on the circumstances of the death. These different types of homicides are often treated very differently in human societies; some are considered crimes, while others are permitted or even ordered by the legal system.\n\n\n== Criminality ==\nCriminal homicide takes many forms including accidental killing or murder. Criminal homicide is divided into two broad categories, murder and manslaughter, based upon the state of mind and intent of the person who commits the homicide.A report issued by the United Nations Office on Drug and Crime in July 2019 documented that nearly 464,000 people around the world were killed in homicides in 2017, a number significantly in excess of the 89,000 killed in armed conflicts during the same period.\n\n\n=== Murder ===\n\nMurder is the most serious crime that can be charged following a homicide. In many jurisdictions, murder may be punished by life in prison or even capital punishment. Although categories of murder can vary by jurisdiction, murder charges fall under two broad categories:\n\nFirst degree murder: The premeditated, unlawful, intentional killing of another person.\nSecond degree murder: The intentional, unlawful killing of another person, but without any premeditation.In some jurisdictions, a homicide that occurs during the commission of a dangerous crime may constitute murder, regardless of the actor's intent to commit homicide.  In the United States, this is known as the felony murder rule. In simple terms, under the felony murder rule a person who commits a felony may be guilty of murder if someone dies as a result of the commission of the crime, including the victim of the felony, a bystander or a co-felon, regardless their intent—or lack thereof—to kill, and even when the death results from the actions of a co-defendant or third party who is reacting to the crime.\n\n\n=== Manslaughter ===\n\nManslaughter is a form of homicide in which the person who commits the homicide either does not intend to kill the victim, or kills the victim as the result of circumstances that would cause a reasonable person to become emotionally or mentally disturbed to the point of potentially losing control of their actions. The distinction between murder and manslaughter is sometimes said to have first been made by the ancient Athenian lawmaker Draco in the 7th century BC. The penalty for manslaughter is normally less than the penalty for murder. The two broad categories of manslaughter are:\nVoluntary manslaughter: the intentional, unpremeditated killing of another person as the result of a disturbed state of mind, or heat of passion.\nInvoluntary manslaughter: the unintentional killing of another person through an act of recklessness that shows indifference to the lives and safety of others, or an act of negligence that could reasonably be foreseen to result in death. The act that results in death may be intentional, such as pushing somebody in anger, but their death (such as by their subsequently falling, striking their head, and suffering a lethal head injury) is not.Another form of manslaughter in some jurisdictions is constructive manslaughter, which may be charged in the event that a person causes a death without intention, but as the result of violating an important safety law or regulation.\n\n\n=== Lawful excuse ===\nNot all homicides are crimes, or subject to criminal prosecution. Some are legally privileged, meaning that they are not criminal acts at all. Others may occur under circumstances that provide the defendant with a full or partial defense to criminal prosecution. Common defenses include:\n\nSelf-defense: while most homicides by civilians are criminally prosecutable, a right of self-defense (often including the right to defend others) is widely recognized, including, in dire circumstances, the use of deadly force.\nMental incapacity: A defendant may attempt to prove that they are not criminally responsible for a homicide due to a mental disorder.  In some jurisdictions, mentally incompetent killers may be involuntarily committed in lieu of criminal trial. Mental health and development are often taken into account during sentencing. For example, in the United States, the death penalty cannot be applied to convicted murderers with intellectual disabilities.\nDefense of infancy – Small children are not held criminally liable before the age of criminal responsibility.  A juvenile court may handle defendants above this age but below the legal age of majority, though because homicide is a serious crime some older minors are charged in an adult justice system.  Age is sometimes also taken into account during sentencing even if the perpetrator is old enough to have criminal responsibility.\nJustifiable homicide or privilege: Due to the circumstances, although a homicide occurs, the act of killing is not unlawful. For example, a killing on the battlefield during war is normally lawful, or a police officer may shoot a dangerous suspect in order to protect the officer's own life or the lives and safety of others.The availability of defenses to a criminal charge following a homicide may affect the homicide rate. For example, it has been suggested that the availability of \"stand your ground\" defense has resulted in an increase in the homicide rate in U.S. jurisdictions that recognize the defense, including Florida.\n\n\n== By state actors ==\nKillings by government agents may be considered lawful or unlawful according to:\n\nDomestic law\nInternational law to which the government has agreed by treaty\nPeremptory norms which are de facto enforced as obligatory on all countries, such as prohibitions against genocide, piracy, and slaveryTypes of state killings include:\n\nCapital punishment, where the judicial system authorizes the death penalty in response to a severe crime, though some countries have abolished it completely\nLawful killing during war, such as the killing of enemy combatants\nLawful use of deadly force by law enforcement officers or military personnel to maintain public safety in emergency situations.\nExtrajudicial killing, where government actors kill people (typically individuals or small groups) without judicial court proceedings\nWar crimes that involve killing (war crimes not authorized by the government may also be committed by individuals who are then subject to domestic military justice)\nWidespread, systematic killing by the government of a particular group, which depending on the target, could be called genocide, politicide, or classicide. In some cases these events may also meet definitions of crimes against humanity.Scholars study especially large homicide events (typically 50,000 deaths in five years or less) as mass killings.  Some medium- and large-scale mass killings by state actors have been termed massacres, though not all such killings have been so named. The term democide has been coined by Rudolph Rummel to describe \"murder by government\" in general, which includes both extrajudicial killings and widespread systematic homicide.\nKillings by government agents might be called \"murder\" or \"mass murder\" in general usage, especially if seen by the commentator as unethical, but the domestic legal definitions of murder, manslaughter, etc., usually exclude killings carried out by lawful government action.\n\n\n=== Systematic government killing ===\nDeliberate massacres of captives or civilians during wartime or periods of civil unrest by the state's military forces include those committed by Genghis Khan, the Golden Horde, the troops of Vlad the Impaler, the British Empire in its colonies, the Empire of Japan, the Soviet Union, Nazi Germany during the Second Sino-Japanese War and World War II, the 1st genocide of the 20th century Armenian genocide by the Ottoman Turks, The Holocaust, the Nanjing Massacre, the Katyn Forest Massacre of Polish citizens in 1940 and the massacres of political prisoners after the launch of Operation Barbarossa, the Three Alls Policy, the massacre of Soviet Jews at Babi Yar, the mass murder of the Hungarian, Serbian and German population in Vojvodina in the \"Vengeance of Bacska\", the murder of 24 unarmed villagers by British troops in the Batang Kali massacre during the Malayan Emergency, the mass killings in Indonesia during Suharto's rise to power, the murder of suspected leftists during Operation Condor in South America, the murder of Vietnamese civilians by American soldiers in the My Lai Massacre during the Vietnam War, the genocidal massacres of the Maya population during the Guatemalan Civil War, the massacre at El Mozote during the Salvadoran Civil War, and repeated attacks on civilians during the Syrian Civil War including the Al-Qubeir massacre.\nActions in which the state indirectly caused the death of large numbers of people include man-made disasters caused by the state, such as the famines in India during British rule, the atrocities in the Congo Free State, the Khmer Rouge years in Cambodia,  the famines and poverty caused by the Great Leap Forward and the Cultural Revolution in the People's Republic of China, and the famine in Yemen triggered by the U.S.–backed Saudi Arabian-led intervention and blockade.\n\n\n== Rates ==\n\n\n=== Global ===\nA 2011 study by the United Nations Office on Drugs and Crime brought together a wide variety of data sources to create a worldwide picture of trends and developments. Sources included multiple agencies and field offices of the United Nations, the World Health Organization, and national and international sources from 207 countries.\nThe report estimated that in 2010, the total number of homicides globally was 468,000. More than a third (36%) occurred in Africa, 31 percent in the Americas, 27 percent in Asia, five percent in Europe and one percent in Oceania. Since 1995, the homicide rate has been falling in Europe, North America, and Asia, but has risen to a near “crisis point” in Central America and the Caribbean. Of all homicides worldwide, 82 percent of the victims were men, and 18 percent were women. On a per-capita scaled level, \"the homicide rate in Africa and the Americas (at 17 and 16 per 100,000 population, respectively) is more than double the global average (6.9 per 100,000), whereas in Asia, Europe and Oceania (between 3 and 4 per 100,000) it is roughly half\".UNODC, in its 2013 global report, estimated the total number of homicides worldwide dropped to 437,000 in 2012. The Americas accounted for 36 percent of all homicides globally, Africa 21 percent, Asia 38 percent, Europe five percent and Oceania 0.3%. The world's average homicide rate stood at 6.2 per 100,000 population in 2012, but the Southern Africa region and Central America have intentional homicide rates four times higher than the world average. They are the most violent regions globally, outside of regions experiencing wars and religious or sociopolitical terrorism. Asia exclusive of West Asia and Central Asia, Western Europe, Northern Europe, as well as Oceania had the lowest homicide rates in the world. About 41 percent of the homicides worldwide occurred in 2012 with the use of guns, 24 percent with sharp objects such as knife, and 35 percent by other means such as poison. The global conviction rate for the crime of intentional homicide in 2012 was 43 percent.The 2011 Global Study on Homicide reported that \"[W]here homicide rates are high and firearms and organized crime in the form of drug trafficking play a substantial role, 1 in 50 men aged 20 will be murdered before they reach the age of 31. At the other, the probability of such an occurrence is up to 400 times lower. [H]omicide is much more common in countries with low levels of human development, high levels of income inequality and weak rule of law than in more equitable societies, where socioeconomic stability seems to be something of an antidote to homicide. In cases of intimate partner and family-related homicide cases, women murdered by their past or present male partner make up the vast majority of homicide victims worldwide.\"\n\n\n=== Historic European ===\nIn the mid-second millennium, local levels of violence in Europe were extremely high by the standards of modern developed countries. Typically, small groups of people would battle their neighbors using the farm tools at hand, such as knives, sickles, hammers, and axes. Mayhem and death were deliberate. The vast majority of Europeans lived in rural areas as late as 1800. Cities were few, and small in size, but their concentration of population was conducive to violence and their trends resembled those in rural areas  Across Europe, homicide trends show a steady long-term decline. Regional differences were small, except that Italy's decline was later and slower. From approximately 1200 AD through 1800 AD, homicide rates from violent local episodes, not including military actions, declined by a factor of ten, from approximately 32 deaths per 100,000 people to 3.2 per 100,000. In the 20th century, the homicide rate fell to 1.4 per 100,000. Police forces seldom existed outside the cities; prisons only became common after 1800. Before then, harsh penalties were imposed for homicide (severe whipping or execution) but they proved ineffective at controlling or reducing the insults to honor that precipitated most of the violence. The decline does not correlate with economics or measures of state control. Most historians attribute the trend in homicides to a steady increase in self-control of the sort promoted by Protestantism, and necessitated by schools and factories.:127–32 Eisner argues that macro-level indicators for societal efforts to promote civility, self-discipline, and long-sightedness are strongly associated with fluctuations in homicide rates over the past six centuries.\n\n\n== See also ==\nList of types of killing\nList of killings by law enforcement officers by countries\n\n\n== References ==\n\n\n== Further reading ==\nLappi-Seppälä, Tapio, and Martti Lehti. \"Cross-comparative perspectives on global homicide trends.\" Crime and Justice 43.1 (2014): 135-230.\nPinker, Steven.  The Better Angels of Our Nature: Why Violence Has Declined (2011)\n\n\n== External links =="}