{"topic": "Governance", "english_title": "Governance", "english": "Governance comprises all of the processes of governing – whether undertaken by the government of a state, by a market, or by a network – over a social system (family, tribe, formal or informal organization, a territory or across territories) and whether through the laws, norms, power or language of an organized society. It relates to \"the processes of interaction and decision-making among the actors involved in a collective problem that lead to the creation, reinforcement, or reproduction of social norms and institutions\".\nIn lay terms, it could be described as the political processes that exist in and between formal institutions.\nA variety of entities (known generically as governing bodies) can govern. The most formal is a government, a body whose sole responsibility and authority is to make binding decisions in a given geopolitical system (such as a state) by establishing laws. Other types of governing include an organization (such as a corporation recognized as a legal entity by a government), a socio-political group (chiefdom, tribe, gang, family, religious denomination, etc.), or another, informal group of people. In business and outsourcing relationships, Governance Frameworks are built into relational contracts that foster long-term collaboration and innovation.Governance is the way rules, norms and actions are structured, sustained\n, regulated and held accountable. The degree of formality depends on the internal rules of a given organization and, externally, with its business partners. As such, governance may take many forms, driven by many different motivations and with many different results. For instance, a government may operate as a democracy where citizens vote on who should govern and the public good is the goal, while a non-profit organization or a corporation may be governed by a small board of directors and pursue more specific aims.\nIn addition, a variety of external actors without decision-making power can influence the process of governing. These include lobbies, think tanks, political parties, non-government organizations, community and media.\nMost institutions of higher education offer governance as an area of study, such as the Balsillie School of International Affairs, Munk School of Global Affairs, Sciences Po Paris, Graduate Institute Geneva, Hertie School, and London School of Economics, among others.\n\n\n== Origin of the word ==\nLike government, the word governance derives, ultimately, from the Greek verb kubernaein [kubernáo] (meaning to steer, the metaphorical sense first being attested in Plato). Its occasional use in English to refer to the specific activity of ruling a country can be traced to early-modern England, when the phrase \"governance of the realm\" appears in works by William Tyndale and in royal correspondence from James V of Scotland to Henry VIII of England. The first usage in connection with institutional structures (as distinct from individual rule) appears in Charles Plummer's The Governance of England (an 1885 translation from a 15th-century Latin manuscript by John Fortescue, also known as The Difference between an Absolute and a Limited Monarchy). This usage of \"governance\" to refer to the arrangements of governing became orthodox including in Sidney Low's seminal text of the same title in 1904 and among some later British constitutional historians.However, the use of the term governance in its current broader sense, encompassing the activities of a wide range of public and private institutions, acquired general currency only as recently as the 1990s, when it was re-minted by economists and political scientists and disseminated by institutions such as the UN, the IMF and the World Bank.\nSince then, the term has gained increasing usage.\n\n\n== Types ==\nGovernance often refers to a particular level of governance associated with a type of organization (including public governance, global governance, non-profit governance, corporate governance, and project governance), a particular 'field' of governance associated with a type of activity or outcome (including environmental governance, internet governance, and information technology governance), or a particular 'model' of governance, often derived as an empirical or normative theory (including regulatory governance, participatory governance, multilevel governance, metagovernance, and collaborative governance).\nGovernance can also define normative or practical agendas. Normative concepts of fair governance or good governance are common among political, public sector, voluntary, and private sector organizations.\n\n\n=== Governance as process ===\nIn its most abstract sense, governance is a theoretical concept referring to the actions and processes by which stable practices and organizations arise and persist. These actions and processes may operate in formal and informal organizations of any size; and they may function for any purpose, good or evil, for profit or not. Conceiving of governance in this way, one can apply the concept to states, to corporations, to non-profits, to NGOs, to partnerships and other associations, to business relationships (especially complex outsourcing relationships), to project teams, and to any number of humans engaged in some purposeful activity.\nMost theories of governance as process arose out of neoclassical economics. These theories build deductive models, based on the assumptions of modern economics, to show how rational actors may come to establish and sustain formal organizations, including firms and states, and informal organizations, such as networks and practices for governing the commons. Many of these theories draw on transaction cost economics.\n\n\n=== Public governance ===\n\nThere is a distinction between the concepts of governance and politics. Politics involves processes by which a group of people (perhaps with divergent opinions or interests) reach collective decisions generally regarded as binding on the group, and enforced as common policy. Governance, on the other hand, conveys the administrative and process-oriented elements of governing rather than its antagonistic ones. Such an argument continues to assume the possibility of the traditional separation between \"politics\" and \"administration\". Contemporary governance practice and theory sometimes questions this distinction, premising that both \"governance\" and \"politics\" involve aspects of power and accountability.\nIn general terms, public governance occurs in three broad ways:\n\nThrough networks involving public-private partnerships (PPP) or with the collaboration of community organisations;\nThrough the use of market mechanisms whereby market principles of competition serve to allocate resources while operating under government regulation;\nThrough top-down methods that primarily involve governments and the state bureaucracy.\n\n\n=== Private governance ===\nPrivate governance occurs when non-governmental entities, including private organizations, dispute resolution organizations, or other third party groups, make rules and/or standards which have a binding effect on the \"quality of life and opportunities of the larger public.\"  Simply put, private—not public—entities are making public policy. For example, insurance companies exert a great societal impact, largely invisible and freely accepted, that is a private form of governance in society; in turn, reinsurers, as private companies, may exert similar private governance over their underlying carriers. The term \"public policy\" should not be exclusively associated with policy that is made by government. Public policy may be created by either the private sector or the public sector. If one wishes to refer only to public policy that is made by government, the best term to use is \"governmental policy,\" which eliminates the ambiguity regarding the agent of the policy making.\n\n\n=== Global governance ===\n\nGlobal governance is defined as \"the complex of formal and informal institutions, mechanisms, relationships, and processes between and among states, markets, citizens and organizations, both inter- and non-governmental, through which collective interests on the global plane are articulated, right and obligations are established, and differences are mediated\". In contrast to the traditional meaning of \"governance\", some authors like James Rosenau have used the term \"global governance\" to denote the regulation of interdependent relations in the absence of an overarching political authority. The best example of this is the international system or relationships between independent states. The term, however, can apply wherever a group of free equals needs to form a regular relationship.\n\n\n=== Governance Analytical Framework ===\nThe Governance Analytical Framework (GAF) is a practical methodology for investigating governance processes, where various stakeholders interact and make decisions regarding collective issues, thus creating or reinforcing social norms and institutions. It is postulated that governance processes can be found in any society, and unlike other approaches, that these can be observed and analysed from a non-normative perspective. It proposes a methodology based on five main analytical units: problems, actors, norms, processes and \"nodal points\". These logically articulated analytical units make up a coherent methodology aimed at being used as a tool for empirical social policy research.\n\n\n=== Nonprofit governance ===\nNonprofit governance has a dual focus: achieving the organization's social mission and ensuring the organization is viable. Both responsibilities relate to fiduciary responsibility that a board of trustees (sometimes called directors, or Board, or Management Committee—the terms are interchangeable) has with respect to the exercise of authority over the explicit actions the organization takes. Public trust and accountability is an essential aspect of organizational viability so it achieves the social mission in a way that is respected by those whom the organization serves and the society in which it is located.\n\n\n=== Corporate governance ===\n\nCorporate organizations often use the word governance to describe both:\n\nThe manner in which boards or their like direct a corporation\nThe laws and customs (rules) applying to that directionCorporate governance consists of the set of processes, customs, policies, laws and institutions affecting the way people direct, administer or control a corporation. Corporate governance also includes the relationships among the many players involved (the stakeholders) and the corporate goals. The principal players include the shareholders, management, and the board of directors. Other stakeholders include employees, suppliers, customers, banks and other lenders, regulators, the environment and the community at large.\nThe first documented use of the word \"corporate governance\" is by Richard Eells (1960, p. 108) to denote \"the structure and functioning of the corporate polity\". The \"corporate government\" concept itself is older and was already used in finance textbooks at the beginning of the 20th century (Becht, Bolton, Röell 2004).\n\n\n=== Project governance ===\n\nProject governance is the management framework within which project decisions are made. Its role is to provide a repeatable and robust system through which an organization can manage its capital investments—project governance handles tasks such as outlining the relationships between all groups involved and describing the flow of information to all stakeholders.\n\n\n=== Environmental governance ===\nGovernance in an environmental context may refer to:\na concept in political ecology which promotes environmental policy that advocates for sustainable human activity (i.e. that governance should be based upon environmental principles).\nthe processes of decision-making involved in the control and management of the environment and natural resources. The International Union for Conservation of Nature (IUCN), define environmental governance as the \"multi-level interactions (i.e., local, national, international/global) among, but not limited to, three main actors, i.e., state, market, and civil society, which interact with one another, whether in formal and informal ways; in formulating and implementing policies in response to environment-related demands and inputs from the society; bound by rules, procedures, processes, and widely accepted behavior; possessing characteristics of 'good governance'; for the purpose of attaining environmentally-sustainable development.\"\n\n\n=== Land governance ===\nLand governance is concerned with issues of land ownership and tenure. It consists of the policies, processes and institutions by which decisions about the access to, use of and control over land are made, implemented and enforced; it is also about managing and reconciling competing claims on land. In developing countries, it is relevant as a tool to contribute to equitable and sustainable development, addressing the phenomenon that is known as ‘land grabbing’. The operational dimension of land governance is land administration.\nSecurity of land tenure is considered to contribute to poverty reduction and food security, since it can enable farmers to fully participate in the economy. Without recognized property rights, it is hard for small entrepreneurs, farmers included, to obtain credit or sell their business – hence the relevance of comprehensive land governance.\nThere is constant feedback between land tenure problems and land governance. For instance, it has been argued that what is frequently called 'land grabbing', was partly made possible by the Washington Consensus-inspired liberalization of land markets in developing countries. Many land acquisition deals were perceived to have negative consequences, and this in turn led to initiatives to improve land governance in developing countries.The quality of land governance depends on its practical implementation, which is known as land administration: ‘the way in which rules of land tenure are made operational’. And another factor is accountability:  the degree to which citizens and stakeholder groups are consulted and can hold to account their authorities.The main international policy initiative to improve land governance is known as the Voluntary Guidelines on the Responsible Governance of Tenure of Land, Fisheries and Forests in the Context of National Food Security (VGGT), endorsed by the Committee on World Food Security (CFS).\n\n\n=== Health governance ===\nAccording to the WHO, \"governance in the health sector refers to a wide range of steering and rule-making related functions carried out by governments/decisions makers as they seek to achieve national health policy objectives that are conducive to universal health coverage.\" A national health policy is a complex and dynamic process, which changes from State to State according to the political, historical and socio-economic situation prevailing in the country. Mainly it seeks to strengthen the health system, making sure that they are capable of meeting the health needs of targeted populations.\nMore broadly, health governance requires a synergistic set of policies, many of which reside in sectors other than health as well as governors beyond the national governments, which must be supported by structures and mechanisms that enable collaboration. For instance, in the European context, it was developed a health policy framework called Health 2020 as a result of the collaboration between State members in the region. It gives policy-makers a vision, a strategic path and a set of priorities to improve health, guaranteeing that it is more equitable and sustainable.\nIn the 21st Century, global trends (e.g., changing population demographics and epidemiology, widening social inequalities, and a context of financial uncertainty) have influenced health system priorities and subsequently the setting of the health governance function. These trends have resulted in the emergence of joint actions of all stakeholders to achieve seminal changes in 21st-century societies. It is also important to consider that people have witnessed a global shift from traditional and reactive healthcare to proactive care, mainly enabled by investment in advanced technologies. Recent artificial Intelligence (AI) and Machine learning have made possible the automation as well as the standardisation of many processes in healthcare, which have also brought to light challenges to the existing governance structures. One of these challenges concerns the ownership of health data.\n\n\n=== Internet governance ===\nInternet governance was defined by the World Summit on the Information Society as \"the development and application by Governments, the private sector and civil society, in their respective roles, of shared principles, norms, rules, decision-making procedures, and programmes that shape the evolution and use of the Internet.\" Internet governance deals with how much influence each sector of society should have on the development of the Internet, such as to what extent the state should be able to censor it, and how issues on the Internet, such as cyber-bullying, should be approached.\n\n\n=== Information technology governance ===\n\nIT governance primarily deals with connections between business focus and IT management. The goal of clear governance is to assure that investment in IT generates business value and mitigates the risks that are associated with IT projects.\n\n\n=== Blockchain governance ===\n\nBlockchains offer a novel way to enforce agreements and achieve cooperation and coordination. The main technical features of blockchains support transparency and traceability of records, information immutability and reliability, and autonomous enforcement of agreements. As such, blockchains will affect traditional forms of governance—most notably, contractual and relational governance—and may change the way to organize collaborations between individuals and between organizations. Blockchain governance relies on a set of protocols and code-based rules. As an original governance mode, it departs from an enforcement through the law (as in contractual governance) or through the value of future relationships (as in relational governance).\n\n\n=== Regulatory governance ===\n\nRegulatory governance reflects the emergence of decentered and mutually adaptive policy regimes which rests on regulation rather than service provision or taxing and spending. The term captures the tendency of policy regimes to deal with complexity with delegated system of rules. It is likely to appear in arenas and nations which are more complex, more global, more contested and more liberally democratic. The term builds upon and extends the terms of the regulatory state on the one hand and governance on the other. While the term regulatory state marginalize non-state actors (NGOs and Business) in the domestic and global level, the term governance marginalizes regulation as a constitutive instrument of governance. The term regulatory governance therefore allows us to understand governance beyond the state and governance via regulation.\n\n\n=== Participatory governance ===\nParticipatory governance focuses on deepening democratic engagement through the participation of citizens in the processes of governance with the state. The idea is that citizens should play a more direct roles in public decision-making or at least engage more deeply with political issues. Government officials should also be responsive to this kind of engagement. In practice, participatory governance can supplement the roles of citizens as voters or as watchdogs through more direct forms of involvement.\n\n\n=== Contract governance ===\n(See also contract management.) Emerging thinking about contract governance is focusing on creating a governance structure in which the parties have a vested interest in managing what are often highly complex contractual arrangements in a more collaborative, aligned, flexible, and credible way. In 1979, Nobel laureate Oliver Williamson wrote that the governance structure for a contract is the \"framework within which the integrity of a transaction is decided\", adding further that \"because contracts are varied and complex, governance structures vary with the nature of the transaction.\"\n\n\n=== Multi-level governance ===\nMulti-level governance is the concept and study of the fact that many intertangled authority structures are present in a global political economy. The theory of multi-level governance, developed mainly by Liesbet Hooghe and Gary Marks, arose from increasing European integration, particularly through the European Union. José Manuel Barroso, former President of the European Commission, has stated that \"the multilevel system of governance on which our European regional policy is based provides a key boost to the Union's competitive edge\" and that, in times of economic crisis, \"multilevel governance must be a priority.\"\n\n\n=== Metagovernance ===\n\"Metagovernance\" is the \"governing of governing\". It represents the established ethical principles, or 'norms', that shape and steer the entire governing process. It is important to note that there are no clearly defined settings within which metagoverning takes place, or particular persons who are responsible for it. While some believe metagovernance to be the role of the state which is assumed to want to steer actors in a particular direction, it can \"potentially be exercised by any resourceful actor\" who wishes to influence the governing process. Examples of this include the publishing of codes of conduct at the highest level of international government, and media focus on specific issues at the sociocultural level. Despite their different sources, both seek to establish values in such a way that they become accepted 'norms'. The fact that 'norms' can be established at any level and can then be used to shape the governance process as whole, means metagovernance is part of both the input and the output of the governing system.\n\n\n=== Collaborative governance ===\n\nA collaborative governance framework uses a relationship management structure, joint performance and transformation management processes and an exit management plan as controlling mechanisms to encourage the organizations to make ethical, proactive changes for the mutual benefit of all the parties.\n\n\n=== Security sector governance ===\n\nSecurity sector governance (SSG) is a subpart concept or framework of security governance that focuses specifically on decisions about security and their implementation within the security sector of a single state. SSG applies the principles of good governance to the security sector in question.\n\n\n== As a normative concept ==\n\n\n=== Fair governance ===\nWhen discussing governance in particular organizations, the quality of governance within the organization is often compared to a standard of good governance. In the case of a business or of a non-profit organization, for example, good governance relates to consistent management, cohesive policies, guidance, processes and decision-rights for a given area of responsibility, and proper oversight and accountability. \"Good governance\" implies that mechanisms function in a way that allows the executives (the \"agents\") to respect the rights and interests of the stakeholders (the \"principals\"), in a spirit of democracy.\n\n\n=== Good governance ===\n\nGood governance is an indeterminate term used in international development literature to describe various normative accounts of how public institutions ought to conduct public affairs and manage public resources. These normative accounts are often justified on the grounds that they are thought to be conducive to economic ends, such as the eradication of poverty and successful economic development. Unsurprisingly different organizations have defined governance and good governance differently to promote different normative ends.\nThe World Bank defines governance as:\n\nthe manner in which power is exercised in the management of a country's economic and social resources for development.\nThe Worldwide Governance Indicators project of the World Bank defines governance as:\n\nthe traditions and institutions by which authority in a country is exercised.\nThis considers the process by which governments are selected, monitored and replaced; the capacity of the government to effectively formulate and implement sound policies and the respect of citizens and the state of the institutions that govern economic and social interactions among them.\nAn alternate definition sees governance as:\n\nthe use of institutions, structures of authority and even collaboration to allocate resources and coordinate or control activity in society or the economy.\nAccording to the United Nations Development Programme's Regional Project on Local Governance for Latin America:\n\nGovernance has been defined as the rules of the political system to solve conflicts between actors and adopt decision (legality). It has also been used to describe the \"proper functioning of institutions and their acceptance by the public\" (legitimacy). And it has been used to invoke the efficacy of government and the achievement of consensus by democratic means (participation).\n\n\n=== Effective governance ===\nThe effectiveness of governments is not a straightforward and consentient type of governance. Measurement and conceptualization of effectiveness is controversial and often used interchangeably with good governance. However, during the period of 1996–2018, an effort was made by the World Bank to create a comparable measure of the performance of governments; the Worldwide Governance Indicators (WGI). The WGI is constituted by over 30 databases which are rescaled and categorized into six categories, among one of these is government effectiveness. According to this category, effective governance is composed by five aspects: the quality of public services, the quality of the civil service, the degree of the government's independence from political pressures, the quality of policy formulation and implementation, and the credibility of the government's commitment to such policies. In short, effective governance is about quality of service, the independence of government and the quality of policies and implementation.\nAdding to these components, one might argue that responsiveness to citizen's needs is high in an effective government. Acting according to these needs, effectiveness is achieved by transparent, decentralized and neutral structures, that are consistent and disciplined. Therefore, efficient financial management, high-quality and committed personnel and formalized and standardized ways of processes is needed. For the latter, governments became much more efficient with the arise of bureaucracies. Nevertheless, governments in a rapidly changing environment need to be able to adapt quickly, so being bounded by rigid structures of functioning could work as a detriment.\nSince the conceptualization of effective governance is not onefold, some more components that might constitute it are suggested: “It should be small in extent with limited intervention in the economy; a clear vision and processes; committed quality personnel that can formulate and implement policies and projects; comprehensive participation with the public; efficient financial management; responsive, transparent and decentralized structures and political stability”.Internal and external effective governance\nThe components of effective governance described above all have a domestic character, within the boundaries of the national territory, national policies and about the inhabitants of a country. This is the internal aspect of effective governance, which mainly focuses on national services and policies. The external aspect of effective governance on the other hand, exclusively focuses on the international domain of politics. It entails the state's capacity to exercise its rights and fulfil its duties in alignment with international law, the representation of its people in the international political landscape and its participation in international relations.The purpose of effective governance in the internal aspect is to be the sovereign within its national territory; in the external aspect to wield sovereignty over international relations. For this reason, it is a necessary characteristic of the state to have unrestricted capacity to act, without any form of dependence in both state and international law. This independency is the core of statehood.\nEffects of effective governance\nIn an attempt to identify predictors of effective government, a study was done to investigate what characteristics of the state are more deeply established by effective governance. The most striking conclusion was that effective governance has a big share in the economic growth and developing, although on the long term. However, this is a bi-directional relationship: economic growth does lead to more effective governance as well. Moreover, effective governance does have a positive influence on reducing corruption, strengthening political stability, contribution to improved rule of law and improved government spending and accountability. As is the case with economic development, it is plausible the argue that effective governance and the named predictors are a positive feedback cycle: they reinforce each other, and so indirectly themselves.\nAbsence of effective governance\nWhen a state fails to govern effectively, this does not simply imply the absence of the characteristics of effective governance. First of all, the absence of effective governance is lack of capacity of the state to supply its inhabitants with political goods, such as rights and freedoms. Zartman describes how absence of effective governance comes about: “as the disintegration ofstate structure, authority (legitimate power), law, and political order”. Five main characteristics are to be differentiated in the absence of effective governance: disorganizing of the structure of the processes in the state, violent conflicts, violations of human rights and social fragmentation, all of which have an endogenous character.\n\n\n=== Measurement and assessment ===\nSince the early years of the 2000s (decade), efforts have been conducted in the research and international development community to assess and measure the quality of governance of countries all around the world. Measuring governance is inherently a controversial and somewhat political exercise. A distinction is therefore made between external assessments, peer assessments and self-assessments. Examples of external assessments are donor assessments or comparative indices produced by international non-governmental organizations. An example of a peer assessment is the African Peer Review Mechanism. Examples of self-assessments are country-led assessments that can be led by government, civil society, researchers and/or other stakeholders at the national level.\nOne of these efforts to create an internationally comparable measure of governance and an example of an external assessment is the Worldwide Governance Indicators project, developed by members of the World Bank and the World Bank Institute. The project reports aggregate and individual indicators for more than 200 countries for six dimensions of governance: voice and accountability, political stability and lack of violence, government effectiveness, regulatory quality, rule of law, control of corruption. To complement the macro-level cross-country Worldwide Governance Indicators, the World Bank Institute developed the World Bank Governance Surveys, which are country-level governance assessment tools that operate at the micro or sub-national level and use information gathered from a country's own citizens, business people and public sector workers to diagnose governance vulnerabilities and suggest concrete approaches for fighting corruption.\nA Worldwide Governance Index (WGI) was developed in 2009 and is open for improvement through public participation. The following domains, in the form of indicators and composite indexes, were selected to achieve the development of the WGI: Peace and Security, Rule of Law, Human Rights and Participation, Sustainable Development, and Human Development. Additionally, in 2009 the Bertelsmann Foundation published the Sustainable Governance Indicators (SGI), which systematically measure the need for reform and the capacity for reform within the Organisation for Economic Co-operation and Development (OECD) countries. The project examines to what extent governments can identify, formulate and implement effective reforms that render a society well-equipped to meet future challenges, and ensure their future viability. Section 10 of the Government Performance and Results Act (GPRA) Modernization Act requires U.S. federal agencies to publish their strategic and performance plans and reports in machine-readable format.\nThe International Budget Partnership (IBP) launched the Open Budget Initiative in 2006 with the release of the first Open Budget Survey (OBS). The OBS is a comprehensive analysis and survey that evaluates whether central governments give the public access to budget documents and provide opportunities for public participation in the budget process. To measure the overall commitment to transparency, the IBP created Open Budget Index (OBI), which assigns a score to each country based on the results of the survey. While the OBS is released biannually, the IBP recently released a new OBS Tracker, which serves as an online tool for civil society, the media, and other actors to monitor in real time whether governments are releasing eight key budget documents. The Open Budget Index data are used by the Open Government Partnership, development aid agencies, and increasingly investors in the private sector as key indicators of governance, particularly fiscal transparency and management of public funds. Examples of country-led assessments include the Indonesian Democracy Index, monitoring of the Millennium Development Goal 9 on Human Rights and Democratic Governance in Mongolia and the Gross National Happiness Index in Bhutan.\nSection 10 of the Government Performance and Results Act Modernization Act (GPRAMA) requires U.S. federal agencies to publish their performance plans and reports in machine-readable format, thereby providing the basis for evaluating the quality of their performance of the governance functions entrusted to them, as specified in their strategic objectives and performance indicators.  Publishing performance reports openly on the Web in a standard, machine-readable format is good practice for all organizations whose plans and reports should be matters of public record.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\n\"Manifesto for Smarter Intervention in Complex Systems\", by Mark Fell, Carré & Strauss. 2013.\nBecht, Marco, Patrick Bolton, Ailsa Röell, \"Corporate Governance and Control\" (October 2002; updated August 2004). ECGI – Finance Working Paper No. 02/2002.\nAsie Dwise (2011), Corporate Governance: An Informative Glimpse, International Journal of Governance. 1(2): 206–14\nEells, R.S.F. (1960), The Meaning of Modern Business: An Introduction to the Philosophy of Large Corporate Enterprise (Columbia University Press, NY).\nHeritier, P. & Silvestri P. (Eds.), Good government, Governance, Human complexity. Luigi Einaudi's legacy and contemporary societies, Leo Olschki, Firenze, 2012.\nSenn, Marcell. Sovereignty – Some critical Remarks on the Genealogy of Governance In: Journal on European History of Law, London: STS Science Centre, Vol. 1, No. 2, pp. 9–13, ISSN 2042-6402.\nTürke, Ralf-Eckhard: Governance – Systemic Foundation and Framework (Contributions to Management Science, Physica of Springer, September 2008).\n\n\n== External links ==\nSustainable Governance Indicators,  Bertelsmann Stiftung\nJournal of Politics & Governance\neGovernance & Governance News"}