{"topic": "therapy", "english_title": "Therapy", "english": "A therapy or medical treatment (often abbreviated tx, Tx, or Tx) is the attempted remediation of a health problem, usually following a medical diagnosis.  \nAs a rule, each therapy has indications and contraindications.  There are many different types of therapy.  Not all therapies are effective.  Many therapies can produce unwanted adverse effects.\nTreatment and therapy are generally considered synonyms.  However,  in the context of mental health, the term therapy may refer specifically to psychotherapy.\n\n\n== History ==\n\n\n== Semantic field ==\nThe words care, therapy, treatment, and intervention overlap in a semantic field, and thus they can be synonymous depending on context. Moving rightward through that order, the connotative level of holism decreases and the level of specificity (to concrete instances) increases. Thus, in health care contexts (where its senses are always noncount), the word care tends to imply a broad idea of everything done to protect or improve someone's health (for example, as in the terms preventive care and primary care, which connote ongoing action), although it sometimes implies a narrower idea (for example, in the simplest cases of wound care or postanesthesia care, a few particular steps are sufficient, and the patient's interaction with that provider is soon finished). In contrast, the word intervention tends to be specific and concrete, and thus the word is often countable; for example, one instance of cardiac catheterization is one intervention performed, and coronary care (noncount) can require a series of interventions (count). At the extreme, the piling on of such countable interventions amounts to interventionism, a flawed model of care lacking holistic circumspection—merely treating discrete problems (in billable increments) rather than maintaining health. Therapy and treatment, in the middle of the semantic field, can connote either the holism of care or the discreteness of intervention, with context conveying the intent in each use. Accordingly, they can be used in both noncount and count senses (for example, therapy for chronic kidney disease can involve several dialysis treatments per week).\nThe words aceology and iamatology are obscure and obsolete synonyms referring to the study of therapies.\nThe English word therapy comes via Latin therapīa from Greek: θεραπεία and literally means \"curing\" or \"healing\".\n\n\n== Types of therapies ==\n\n\n=== By chronology, priority, or intensity ===\n\n\n==== Levels of care ====\nLevels of care classify health care into categories of chronology, priority, or intensity, as follows:\n\nEmergency care handles medical emergencies and is a first point of contact or intake for less serious problems, which can be referred to other levels of care as appropriate.\nIntensive care, also called critical care, is care for extremely ill or injured patients. It thus requires high resource intensity, knowledge, and skill, as well as quick decision making.\nAmbulatory care is care provided on an outpatient basis. Typically patients can walk into and out of the clinic under their own power (hence \"ambulatory\"), usually on the same day.\nHome care is care at home, including care from providers (such as physicians, nurses, and home health aides) making house calls, care from caregivers such as family members, and patient self-care.\nPrimary care is meant to be the main kind of care in general, and ideally a medical home that unifies care across referred providers.\nSecondary care is care provided by medical specialists and other health professionals who generally do not have first contact with patients, for example, cardiologists, urologists and dermatologists. A patient reaches secondary care as a next step from primary care, typically by provider referral although sometimes by patient self-initiative.\nTertiary care is specialized consultative care, usually for inpatients and on referral from a primary or secondary health professional, in a facility that has personnel and facilities for advanced medical investigation and treatment, such as a tertiary referral hospital.\nFollow-up care is additional care during or after convalescence. Aftercare is generally synonymous with follow-up care.\nEnd-of-life care is care near the end of one's life. It often includes the following:\nPalliative care is supportive care, most especially (but not necessarily) near the end of life.\nHospice care is palliative care very near the end of life when cure is very unlikely. Its main goal is comfort, both physical and mental.\n\n\n==== Lines of therapy ====\nTreatment decisions often follow formal or informal algorithmic guidelines. Treatment options can often be ranked or prioritized into lines of therapy: first-line therapy, second-line therapy, third-line therapy, and so on. First-line therapy (sometimes called induction therapy, primary therapy, or front-line therapy) is the first therapy that will be tried. Its priority over other options is usually either: (1) formally recommended on the basis of clinical trial evidence for its best-available combination of efficacy, safety, and tolerability or (2) chosen based on the clinical experience of the physician. If a first-line therapy either fails to resolve the issue or produces intolerable side effects, additional (second-line) therapies may be substituted or added to the treatment regimen, followed by third-line therapies, and so on.\nAn example of a context in which the formalization of treatment algorithms and the ranking of lines of therapy is very extensive is chemotherapy regimens. Because of the great difficulty in successfully treating some forms of cancer, one line after another may be tried. In oncology the count of therapy lines may reach 10 or even 20.\nOften multiple therapies may be tried simultaneously (combination therapy or polytherapy). Thus combination chemotherapy is also called polychemotherapy, whereas chemotherapy with one agent at a time is called single-agent therapy or monotherapy.\nAdjuvant therapy is therapy given in addition to the primary, main, or initial treatment, but simultaneously (as opposed to second-line therapy). Neoadjuvant therapy is therapy that is begun before the main therapy. Thus one can consider surgical excision of a tumor as the first-line therapy for a certain type and stage of cancer even though radiotherapy is used before it; the radiotherapy is neoadjuvant (chronologically first but not primary in the sense of the main event). Premedication is conceptually not far from this, but the words are not interchangeable; cytotoxic drugs to put a tumor \"on the ropes\" before surgery delivers the \"knockout punch\"  are called neoadjuvant chemotherapy, not premedication, whereas things like anesthetics or prophylactic antibiotics before dental surgery are called premedication.\nStep therapy or stepladder therapy is a specific type of prioritization by lines of therapy. It is controversial in American health care because unlike conventional decision-making about what constitutes first-line, second-line, and third-line therapy, which in the U.S. reflects safety and efficacy first and cost only according to the patient's wishes, step therapy attempts to mix cost containment by someone other than the patient (third-party payers) into the algorithm. Therapy freedom and the negotiation between individual and group rights are involved.\n\n\n=== By intent ===\n\n\n=== By therapy composition ===\nTreatments can be classified according to the method of treatment:\n\n\n==== By matter ====\nby drugs: pharmacotherapy, chemotherapy (also, medical therapy often means specifically pharmacotherapy)\nby medical devices: implantation\ncardiac resynchronization therapy\nby specific molecules: molecular therapy (although most drugs are specific molecules, molecular medicine refers in particular to medicine relying on molecular biology)\nby specific biomolecular targets: targeted therapy\nmolecular chaperone therapy\nby chelation: chelation therapy\nby specific chemical elements:\nby metals:\nby heavy metals:\nby gold: chrysotherapy (aurotherapy)\nby platinum-containing drugs: platin therapy\nby biometals\nby lithium: lithium therapy\nby potassium: potassium supplementation\nby magnesium: magnesium supplementation\nby chromium: chromium supplementation; phonemic neurological hypochromium therapy\nby copper: copper supplementation\nby nonmetals:\nby diatomic oxygen: oxygen therapy, hyperbaric oxygen therapy (hyperbaric medicine)\ntransdermal continuous oxygen therapy\nby triatomic oxygen (ozone): ozone therapy\nby fluoride: fluoride therapy\nby other gases: medical gas therapy\nby water:\nhydrotherapy\naquatic therapy\nrehydration therapy\noral rehydration therapy\nwater cure (therapy)\nby biological materials (biogenic substances, biomolecules, biotic materials, natural products), including their synthetic equivalents: biotherapy\nby whole organisms\nby viruses: virotherapy\nby bacteriophages: phage therapy\nby animal interaction: see animal interaction section\nby constituents or products of organisms\nby plant parts or extracts (but many drugs are derived from plants, even when the term phytotherapy is not used)\nscientific type: phytotherapy\ntraditional (prescientific) type: herbalism\nby animal parts: quackery involving shark fins, tiger parts, and so on, often driving threat or endangerment of species\nby genes: gene therapy\ngene therapy for epilepsy\ngene therapy for osteoarthritis\ngene therapy for color blindness\ngene therapy of the human retina\ngene therapy in Parkinson's disease\nby epigenetics: epigenetic therapy\nby proteins: protein therapy (but many drugs are proteins despite not being called protein therapy)\nby enzymes: enzyme replacement therapy\nby hormones: hormone therapy\nhormonal therapy (oncology)\nhormone replacement therapy\nestrogen replacement therapy\nandrogen replacement therapy\nhormone replacement therapy (menopause)\ntransgender hormone therapy\nfeminizing hormone therapy\nmasculinizing hormone therapy\nantihormone therapy\nandrogen deprivation therapy\nby whole cells: cell therapy (cytotherapy)\nby stem cells: stem cell therapy\nby immune cells: see immune system products below\nby immune system products: immunotherapy, host modulatory therapy\nby immune cells:\nT-cell vaccination\ncell transfer therapy\nautologous immune enhancement therapy\nTK cell therapy\nby humoral immune factors: antibody therapy\nby whole serum: serotherapy, including antiserum therapy\nby immunoglobulins: immunoglobulin therapy\nby monoclonal antibodies: monoclonal antibody therapy\nby urine: urine therapy (some scientific forms; many prescientific or pseudoscientific forms)\nby food and dietary choices:\nmedical nutrition therapy\ngrape therapy (quackery)\nby salts (but many drugs are the salts of organic acids, even when drug therapy is not called by names reflecting that)\nby salts in the air\nby natural dry salt air: \"taking the cure\" in desert locales (especially common in prescientific medicine; for example, one 19th-century way to treat tuberculosis)\nby artificial dry salt air:\nlow-humidity forms of speleotherapy\nnegative air ionization therapy\nby moist salt air:\nby natural moist salt air: seaside cure (especially common in prescientific medicine)\nby artificial moist salt air: water vapor forms of speleotherapy\nby salts in the water\nby mineral water: spa cure (\"taking the waters\") (especially common in prescientific medicine)\nby seawater: seaside cure (especially common in prescientific medicine)\nby aroma: aromatherapy\nby other materials with mechanism of action unknown\nby occlusion with duct tape: duct tape occlusion therapy\n\n\n==== By energy ====\nby electric energy as electric current: electrotherapy, electroconvulsive therapy\nTranscranial magnetic stimulation\nby magnetic energy:\nmagnet therapy\npulsed electromagnetic field therapy\nmagnetic resonance therapy\nby electromagnetic radiation (EMR):\nby light: light therapy (phototherapy)\nultraviolet light therapy\nPUVA therapy\nphotodynamic therapy\nphotothermal therapy\ncytoluminescent therapy\nblood irradiation therapy\nby darkness: dark therapy\nby lasers: laser therapy\nlow level laser therapy\nby gamma rays: radiosurgery\nGamma Knife radiosurgery\nstereotactic radiation therapy\ncobalt therapy\nby radiation generally: radiation therapy (radiotherapy)\nintraoperative radiation therapy\nby EMR particles:\nparticle therapy\nproton therapy\nelectron therapy\nintraoperative electron radiation therapy\nAuger therapy\nneutron therapy\nfast neutron therapy\nneutron capture therapy of cancer\nby radioisotopes emitting EMR:\nby nuclear medicine\nby brachytherapy\nquackery type: electromagnetic therapy (alternative medicine)\nby mechanical: manual therapy as massotherapy and therapy by exercise as in physiotherapy and exercise therapy\ninversion therapy\nby sound:\nby ultrasound:\nultrasonic lithotripsy\nextracorporeal shock wave lithotripsy\nextracorporeal shockwave therapy\nsonodynamic therapy\nby music: music therapy\nneurologic music therapy\nby temperature\nby heat: heat therapy (thermotherapy)\nby moderately elevated ambient temperatures: hyperthermia therapy\nby dry warm surroundings: Waon therapy\nby dry or humid warm surroundings: sauna, including infrared sauna, for sweat therapy\nby cold:\nby extreme cold to specific tissue volumes: cryotherapy\nby ice and compression: cold compression therapy\nby ambient cold: hypothermia therapy for neonatal encephalopathy\nby hot and cold alternation: contrast bath therapy\n\n\n==== By procedure and human interaction ====\nSurgery\nby counseling, such as psychotherapy (see also: list of psychotherapies)\nsystemic therapy\nby group psychotherapy\nby cognitive behavioral therapy\nby cognitive therapy\nby behaviour therapy\nby dialectical behavior therapy\nby cognitive emotional behavioral therapy\nby cognitive rehabilitation therapy\nby family therapy\nby education\nby psychoeducation\nby information therapy\nby physical therapy/occupational therapy, vision therapy, massage therapy, chiropractic or acupuncture\nby lifestyle modifications, such as avoiding unhealthy food or maintaining a predictable sleep schedule\nby coaching\n\n\n==== By animal interaction ====\nby pets, assistance animals, or working animals: animal-assisted therapy\nby horses: equine therapy, hippotherapy\nby dogs: pet therapy with therapy dogs, including grief therapy dogs\nby cats: pet therapy with therapy cats\nby fish: ichthyotherapy (wading with fish), aquarium therapy (watching fish)\nby maggots: maggot therapy\nby worms:\nby internal worms: helminthic therapy\nby leeches: leech therapy\nby immersion: animal bath\n\n\n==== By meditation ====\nby mindfulness: mindfulness-based cognitive therapy\n\n\n==== By reading ====\nby bibliotherapy\n\n\n==== By creativity ====\nby expression: expressive therapy\nby writing: writing therapy\njournal therapy\nby play: play therapy\nby art: art therapy\nsensory art therapy\ncomic book therapy\nby gardening: horticultural therapy\nby dance: dance therapy\nby drama: drama therapy\nby recreation: recreational therapy\nby music: music therapy\n\n\n==== By sleeping and waking ====\nby deep sleep: deep sleep therapy\nby sleep deprivation: wake therapy\n\n\n== See also ==\nBiophilia hypothesis\nClassification of Pharmaco-Therapeutic Referrals\nCure\nInterventionism (medicine)\nInverse benefit law\nList of therapies\nGreyhound therapy\nMature minor doctrine\nMedicine\nMedication\nNutraceutical\nPrevention\nPsychotherapy\nTreatment as prevention\nTherapeutic inertia\nTherapeutic nihilism, the idea that treatment is useless\n\n\n== References ==\n\n\n== External links ==\n Media related to Therapies at Wikimedia Commons\n The dictionary definition of therapy at Wiktionary\nAversion therapy (psychology) at the Encyclopædia Britannica\n\"Chapter Nine of the Book of Medicine Dedicated to Mansur, with the Commentary of Sillanus de Nigris\" is a Latin book by Rhazes, from 1483, that is known for its 9th chapter, which is about therapeutics"}