{"topic": "Mesoamerica", "english_title": "Mesoamerica", "english": "Mesoamerica is a historical region and cultural area in North America. It extends from approximately central Mexico through Belize, Guatemala, El Salvador, Honduras, Nicaragua, and northern Costa Rica. Within this region pre-Columbian societies flourished for more than 1,000 years before the Spanish colonization of the Americas. Mesoamerica was the site of two of the most profound historical transformations in world history: primary urban generation, and the formation of New World cultures out of the long encounters among Indigenous, European, African and Asian cultures.In the 16th century, Eurasian diseases such as smallpox and measles, which were endemic among the colonists but new to North America, caused the deaths of upwards of 90% of the indigenous people, resulting in great losses to their societies and cultures. Mesoamerica is one of the five areas in the world where ancient civilization arose independently (see cradle of civilization), and the second in the Americas. Norte Chico (Caral-Supe) in present-day Peru, arose as an independent civilization in the northern coastal region.\n\nAs a cultural area, Mesoamerica is defined by a mosaic of cultural traits developed and shared by its indigenous cultures. Beginning as early as 7000 BCE, the domestication of cacao, maize, beans, tomato, avocado, vanilla, squash and chili, as well as the turkey and dog, resulted in a transition from paleo-Indian hunter-gatherer tribal groupings to the organization of sedentary agricultural villages. In the subsequent Formative period, agriculture and cultural traits such as a complex mythological and religious tradition, a vigesimal numeric system, a complex calendric system, a tradition of ball playing, and a distinct architectural style, were diffused through the area. Also in this period, villages began to become socially stratified and develop into chiefdoms. Large ceremonial centers were built, interconnected by a network of trade routes for the exchange of luxury goods, such as obsidian, jade, cacao, cinnabar, Spondylus shells, hematite, and ceramics. While Mesoamerican civilization knew of the wheel and basic metallurgy, neither of these technologies became culturally important.Among the earliest complex civilizations was the Olmec culture, which inhabited the Gulf Coast of Mexico and extended inland and southwards across the Isthmus of Tehuantepec. Frequent contact and cultural interchange between the early Olmec and other cultures in Chiapas, Oaxaca and Guatemala laid the basis for the Mesoamerican cultural area. All this was facilitated by considerable regional communications in ancient Mesoamerica, especially along the Pacific coast.\nDuring this formative period distinct religious and symbolic traditions spread, as well as the development of artistic and architectural complexes. In the subsequent Preclassic period, complex urban polities began to develop among the Maya, with the rise of centers such as Aguada fénix and Calakmul in Mexico; El Mirador, and Tikal in Guatemala, and the Zapotec at Monte Albán. During this period, the first true Mesoamerican writing systems were developed in the Epi-Olmec and the Zapotec cultures. The Mesoamerican writing tradition reached its height in the Classic Maya hieroglyphic script.\nMesoamerica is one of only three regions of the world where writing is known to have independently developed (the others being ancient Sumer and China). In Central Mexico, the city of Teotihuacan ascended at the height of the Classic period; it formed a military and commercial empire whose political influence stretched south into the Maya area and northward. Upon the collapse of Teotihuacán around 600 AD, competition between several important political centers in central Mexico, such as Xochicalco and Cholula, ensued. At this time during the Epi-Classic period, the Nahua peoples began moving south into Mesoamerica from the North, and became politically and culturally dominant in central Mexico, as they displaced speakers of Oto-Manguean languages.\nDuring the early post-Classic period, Central Mexico was dominated by the Toltec culture, and Oaxaca by the Mixtec. The lowland Maya area had important centers at Chichén Itzá and Mayapán. Towards the end of the post-Classic period, the Aztecs of Central Mexico built a tributary empire covering most of central Mesoamerica.The distinct Mesoamerican cultural tradition ended with the Spanish conquest in the 16th century. Over the next centuries, Mesoamerican indigenous cultures were gradually subjected to Spanish colonial rule. Aspects of the Mesoamerican cultural heritage still survive among the indigenous peoples who inhabit Mesoamerica. Many continue to speak their ancestral languages, and maintain many practices harking back to their Mesoamerican roots.\n\n\n== Etymology and definition ==\n\nThe term Mesoamerica literally means \"middle America\" in Greek. Middle America often refers to a larger area in the Americas, but it has also previously been used more narrowly to refer to Mesoamerica. An example is the title of the 16 volumes of The Handbook of Middle American Indians.  \"Mesoamerica\" is broadly defined as the area that is home to the Mesoamerican civilization, which comprises a group of peoples with close cultural and historical ties. The exact geographic extent of Mesoamerica has varied through time, as the civilization extended North and South from its heartland in southern Mexico.\nThe term was first used by the German ethnologist Paul Kirchhoff, who noted that similarities existed among the various pre-Columbian cultures within the region that included southern Mexico, Guatemala, Belize, El Salvador, western Honduras, and the Pacific lowlands of Nicaragua and northwestern Costa Rica. In the tradition of cultural history, the prevalent archaeological theory of the early to middle 20th century, Kirchhoff defined this zone as a cultural area based on a suite of interrelated cultural similarities brought about by millennia of inter- and intra-regional interaction (i.e., diffusion). Mesoamerica is recognized as a near-prototypical cultural area. This term is now fully integrated in the standard terminology of pre-Columbian anthropological studies. Conversely, the sister terms Aridoamerica and Oasisamerica, which refer to northern Mexico and the western United States, respectively, have not entered into widespread usage.\nSome of the significant cultural traits defining the Mesoamerican cultural tradition are:\n\nsedentism based on maize agriculture\nconstruction of stepped pyramids\nuse of two different calendars (a 260-day ritual calendar and a 365-day calendar based on the solar year)\nvigesimal (base 20) number system\nuse of locally developed pictographic and hieroglyphic (logo-syllabic) writing systems\nuse of natural rubber and the practice of the ritual Mesoamerican ballgame\nuse of bark paper and agave for ritual purposes, and as a medium for writing, and use of agave also for cooking and clothing\npractice of various forms of ritual sacrifice, including human sacrifice\na religious complex based on a combination of shamanism and natural deities, and a shared system of symbols\na linguistic area defined by a number of grammatical traits that have spread through the area by diffusion\n\n\n== Geography ==\n\nLocated on the Middle American isthmus joining North and South America between ca. 10° and 22° northern latitude, Mesoamerica possesses a complex combination of ecological systems, topographic zones, and environmental contexts. These different niches are classified into two broad categories: the lowlands (those areas between sea level and 1000 meters) and the altiplanos, or highlands (situated between 1,000 and 2,000 meters above sea level). In the low-lying regions, sub-tropical and tropical climates are most common, as is true for most of the coastline along the Pacific and Gulf of Mexico and the Caribbean Sea. The highlands show much more climatic diversity, ranging from dry tropical to cold mountainous climates; the dominant climate is temperate with warm temperatures and moderate rainfall. The rainfall varies from the dry Oaxaca and north Yucatán to the humid southern Pacific and Caribbean lowlands.\n\n\n=== Cultural sub-areas ===\nSeveral distinct sub-regions within Mesoamerica are defined by a convergence of geographic and cultural attributes. These sub-regions are more conceptual than culturally meaningful, and the demarcation of their limits is not rigid. The Maya area, for example, can be divided into two general groups: the lowlands and highlands. The lowlands are further divided into the southern and northern Maya lowlands. The southern Maya lowlands are generally regarded as encompassing northern Guatemala, southern Campeche and Quintana Roo in Mexico, and Belize. The northern lowlands cover the remainder of the northern portion of the Yucatán Peninsula. Other areas include Central Mexico, West Mexico, the Gulf Coast Lowlands, Oaxaca, the Southern Pacific Lowlands, and Southeast Mesoamerica (including northern Honduras).\n\n\n=== Topography ===\nThere is extensive topographic variation in Mesoamerica, ranging from the high peaks circumscribing the Valley of Mexico and within the central Sierra Madre mountains to the low flatlands of the northern Yucatán Peninsula. The tallest mountain in Mesoamerica is Pico de Orizaba, a dormant volcano located on the border of Puebla and Veracruz. Its peak elevation is 5,636 m (18,490 ft).\nThe Sierra Madre mountains, which consist of several smaller ranges, run from northern Mesoamerica south through Costa Rica. The chain is historically volcanic. In central and southern Mexico, a portion of the Sierra Madre chain is known as the Eje Volcánico Transversal, or the Trans-Mexican volcanic belt. There are 83 inactive and active volcanoes within the Sierra Madre range, including 11 in Mexico, 37 in Guatemala, 23 in El Salvador, 25 in Nicaragua, and 3 in northwestern Costa Rica. According to the Michigan Technological University, 16 of these are still active. The tallest active volcano is Popocatépetl at 5,452 m (17,887 ft). This volcano, which retains its Nahuatl name, is located 70 km (43 mi) southeast of Mexico City. Other volcanoes of note include Tacana on the Mexico–Guatemala border, Tajumulco and Santamaría in Guatemala, Izalco in El Salvador, Momotombo in Nicaragua, and Arenal in Costa Rica.\nOne important topographic feature is the Isthmus of Tehuantepec, a low plateau that breaks up the Sierra Madre chain between the Sierra Madre del Sur to the north and the Sierra Madre de Chiapas to the south. At its highest point, the Isthmus is 224 m (735 ft) above mean sea level. This area also represents the shortest distance between the Gulf of Mexico and the Pacific Ocean in Mexico. The distance between the two coasts is roughly 200 km (120 mi). The northern side of the Isthmus is swampy and covered in dense jungle—but the Isthmus of Tehuantepec, as the lowest and most level point within the Sierra Madre mountain chain, was nonetheless a main transportation, communication, and economic route within Mesoamerica.\n\n\n=== Bodies of water ===\nOutside of the northern Maya lowlands, rivers are common throughout Mesoamerica. Some of the more important ones served as loci of human occupation in the area. The longest river in Mesoamerica is the Usumacinta, which forms in Guatemala at the convergence of the Salinas or Chixoy and La Pasion River and runs north for 970 km (600 mi)—480 km (300 mi) of which are navigable—eventually draining into the Gulf of Mexico. Other rivers of note include the Rio Grande de Santiago, the Grijalva River, the Motagua River, the Ulúa River, and the Hondo River. The northern Maya lowlands, especially the northern portion of the Yucatán peninsula, are notable for their nearly complete lack of rivers (largely due to the absolute lack of topographic variation). Additionally, no lakes exist in the northern peninsula. The main source of water in this area is aquifers that are accessed through natural surface openings called cenotes.\nWith an area of 8,264 km2 (3,191 sq mi), Lake Nicaragua is the largest lake in Mesoamerica. Lake Chapala is Mexico's largest freshwater lake, but Lake Texcoco is perhaps most well known as the location upon which Tenochtitlan, capital of the Aztec Empire, was founded. Lake Petén Itzá, in northern Guatemala, is notable as where the last independent Maya city, Tayasal (or Noh Petén), held out against the Spanish until 1697. Other large lakes include Lake Atitlán, Lake Izabal, Lake Güija, Lemoa, and Lake Managua.\n\n\n=== Biodiversity ===\nAlmost all ecosystems are present in Mesoamerica; the more well known are the Mesoamerican Barrier Reef System, the second largest in the world, and La Mosquitia (consisting of the Rio Platano Biosphere Reserve, Tawahka Asangni, Patuca National Park, and Bosawas Biosphere Reserve) a rainforest second in size in the Americas only to the Amazonas. The highlands present mixed and coniferous forest. The biodiversity is among the richest in the world, though the number of species in the red list of the IUCN grows every year.\n\n\n== Chronology and culture ==\n\nThe history of human occupation in Mesoamerica is divided into stages or periods. These are known, with slight variation depending on region, as the Paleo-Indian, the Archaic, the Preclassic (or Formative), the Classic, and the Postclassic. The last three periods, representing the core of Mesoamerican cultural fluorescence, are further divided into two or three sub-phases. Most of the time following the arrival of the Spanish in the 16th century is classified as the Colonial period.\nThe differentiation of early periods (i.e., up through the end of the Late Preclassic) generally reflects different configurations of socio-cultural organization that are characterized by increasing socio-political complexity, the adoption of new and different subsistence strategies, and changes in economic organization (including increased interregional interaction). The Classic period through the Postclassic are differentiated by the cyclical crystallization and fragmentation of the various political entities throughout Mesoamerica.\n\n\n=== Paleo-Indian ===\nThe Mesoamerican Paleo-Indian period precedes the advent of agriculture and is characterized by a nomadic hunting and gathering subsistence strategy. Big-game hunting, similar to that seen in contemporaneous North America, was a large component of the subsistence strategy of the Mesoamerican Paleo-Indian.  These sites had obsidian blades and Clovis-style fluted projectile points.\n\n\n=== Archaic ===\nThe Archaic period (8000–2000 BCE) is characterized by the rise of incipient agriculture in Mesoamerica. The initial phases of the Archaic involved the cultivation of wild plants, transitioning into informal domestication and culminating with sedentism and agricultural production by the close of the period. Transformations of natural environments have been a common feature at least since the mid Holocene. Archaic sites include Sipacate in Escuintla, Guatemala, where maize pollen samples date to c. 3500 BCE.\n\n\n=== Preclassic/Formative ===\n\nThe first complex civilization to develop in Mesoamerica was that of the Olmec, who inhabited the gulf coast region of Veracruz throughout the Preclassic period. The main sites of the Olmec include San Lorenzo Tenochtitlán, La Venta, and Tres Zapotes. Specific dates vary, but these sites were occupied from roughly 1200 to 400 BCE. Remains of other early cultures interacting with the Olmec have been found at Takalik Abaj, Izapa, and Teopantecuanitlan, and as far south as in Honduras. Research in the Pacific Lowlands of Chiapas and Guatemala suggest that Izapa and the Monte Alto Culture may have preceded the Olmec. Radiocarbon samples associated with various sculptures found at the Late Preclassic site of Izapa suggest a date of between 1800 and 1500 BCE.During the Middle and Late Preclassic period, the Maya civilization developed in the southern Maya highlands and lowlands, and at a few sites in the northern Maya lowlands. The earliest Maya sites coalesced after 1000 BCE, and include Nakbe, El Mirador, and Cerros. Middle to Late Preclassic Maya sites include Kaminaljuyú, Cival, Edzná, Cobá, Lamanai, Komchen, Dzibilchaltun, and San Bartolo, among others.\nThe Preclassic in the central Mexican highlands is represented by such sites as Tlapacoya, Tlatilco, and Cuicuilco. These sites were eventually superseded by Teotihuacán, an important Classic-era site that eventually dominated economic and interaction spheres throughout Mesoamerica. The settlement of Teotihuacan is dated to the later portion of the Late Preclassic, or roughly 50 CE.\nIn the Valley of Oaxaca, San José Mogote represents one of the oldest permanent agricultural villages in the area, and one of the first to use pottery. During the Early and Middle Preclassic, the site developed some of the earliest examples of defensive palisades, ceremonial structures, the use of adobe, and hieroglyphic writing. Also of importance, the site was one of the first to demonstrate inherited status, signifying a radical shift in socio-cultural and political structure. San José Mogote was eventual overtaken by Monte Albán, the subsequent capital of the Zapotec empire, during the Late Preclassic.\nThe Preclassic in western Mexico, in the states of Nayarit, Jalisco, Colima, and Michoacán also known as the Occidente, is poorly understood. This period is best represented by the thousands of figurines recovered by looters and ascribed to the \"shaft tomb tradition\".\n\n\n==== Preclassic gallery ====\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n=== Classic ===\n\n\n==== Early Classic ====\n\nThe Classic period is marked by the rise and dominance of several polities. The traditional distinction between the Early and Late Classic are marked by their changing fortune and their ability to maintain regional primacy. Of paramount importance are Teotihuacán in central Mexico and Tikal in Guatemala; the Early Classic's temporal limits generally correlate to the main periods of these sites. Monte Alban in Oaxaca is another Classic-period polity that expanded and flourished during this period, but the Zapotec capital exerted less interregional influence than the other two sites.\nDuring the Early Classic, Teotihuacan participated in and perhaps dominated a far-reaching macro-regional interaction network. Architectural and artifact styles (talud-tablero, tripod slab-footed ceramic vessels) epitomized at Teotihuacan were mimicked and adopted at many distant settlements. Pachuca obsidian, whose trade and distribution is argued to have been economically controlled by Teotihuacan, is found throughout Mesoamerica.\nTikal came to dominate much of the southern Maya lowlands politically, economically, and militarily during the Early Classic. An exchange network centered at Tikal distributed a variety of goods and commodities throughout southeast Mesoamerica, such as obsidian imported from central Mexico (e.g., Pachuca) and highland Guatemala (e.g., El Chayal, which was predominantly used by the Maya during the Early Classic), and jade from the Motagua valley in Guatemala. Tikal was often in conflict with other polities in the Petén Basin, as well as with others outside of it, including Uaxactun, Caracol, Dos Pilas, Naranjo, and Calakmul. Towards the end of the Early Classic, this conflict lead to Tikal's military defeat at the hands of Caracol in 562, and a period commonly known as the Tikal Hiatus.\n\n\n===== Early Classic gallery =====\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n==== Late Classic ====\n\nThe Late Classic period (beginning c. 600 CE until 909 CE) is characterized as a period of interregional competition and factionalization among the numerous regional polities in the Maya area. This largely resulted from the decrease in Tikal's socio-political and economic power at the beginning of the period. It was therefore during this time that other sites rose to regional prominence and were able to exert greater interregional influence, including Caracol, Copán, Palenque, and Calakmul (which was allied with Caracol and may have assisted in the defeat of Tikal), and Dos Pilas Aguateca and Cancuén in the Petexbatún region of Guatemala. Around 710, Tikal arose again and started to build strong alliances and defeat its worst enemies. In the Maya area, the Late Classic ended with the so-called \"Maya collapse\", a transitional period coupling the general depopulation of the southern lowlands and development and florescence of centers in the northern lowlands.\n\n\n===== Late Classic gallery =====\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n==== Terminal Classic ====\n\nGenerally applied to the Maya area, the Terminal Classic roughly spans the time between C. 800/850 and c. 1000 CE. Overall, it generally correlates with the rise to prominence of Puuc settlements in the northern Maya lowlands, so named after the hills where they are mainly found. Puuc settlements are specifically associated with a unique architectural style (the \"Puuc architectural style\") that represents a technological departure from previous construction techniques. Major Puuc sites include Uxmal, Sayil, Labna, Kabah, and Oxkintok. While generally concentrated within the area in and around the Puuc hills, the style has been documented as far away as at Chichen Itza to the east and Edzna to the south.\nChichén Itzá was originally thought to have been a Postclassic site in the northern Maya lowlands. Research over the past few decades has established that it was first settled during the Early/Late Classic transition but rose to prominence during the Terminal Classic and Early Postclassic. During its apogee, this widely known site economically and politically dominated the northern lowlands. Its participation in the circum-peninsular exchange route, possible through its port site of Isla Cerritos, allowed Chichén Itzá to remain highly connected to areas such as central Mexico and Central America. The apparent \"Mexicanization\" of architecture at Chichén Itzá led past researchers to believe that Chichén Itzá existed under the control of a Toltec empire. Chronological data refutes this early interpretation, and it is now known that Chichén Itzá predated the Toltec; Mexican architectural styles are now used as an indicator of strong economic and ideological ties between the two regions.\n\n\n===== Terminal Classic gallery =====\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n=== Postclassic ===\nThe Postclassic (beginning 900–1000 CE, depending on area) is, like the Late Classic, characterized by the cyclical crystallization and fragmentation of various polities. The main Maya centers were located in the northern lowlands. Following Chichén Itzá, whose political structure collapsed during the Early Postclassic, Mayapán rose to prominence during the Middle Postclassic and dominated the north for c. 200 years. After Mayapán's fragmentation, political structure in the northern lowlands revolved around large towns or city-states, such as Oxkutzcab and Ti’ho (Mérida, Yucatán), that competed with one another.\n\nToniná, in the Chiapas highlands, and Kaminaljuyú in the central Guatemala highlands, were important southern highland Maya centers. The latter site, Kaminaljuyú, is one of the longest occupied sites in Mesoamerica and was continuously inhabited from c. 800 BCE to around 1200 CE. Other important highland Maya groups include the K'iche' of Utatlán, the Mam in Zaculeu, the Poqomam in Mixco Viejo, and the Kaqchikel at Iximche in the Guatemalan highlands. The Pipil resided in El Salvador, while the Ch'orti' were in eastern Guatemala and northwestern Honduras.\nIn central Mexico, the early portion of the Postclassic correlates with the rise of the Toltec and an empire based at their capital, Tula (also known as Tollan). Cholula, initially an important Early Classic center contemporaneous with Teotihuacan, maintained its political structure (it did not collapse) and continued to function as a regionally important center during the Postclassic. The latter portion of the Postclassic is generally associated with the rise of the Mexica and the Aztec Empire. One of the more commonly known cultural groups in Mesoamerica, the Aztec politically dominated nearly all of central Mexico, the Gulf Coast, Mexico's southern Pacific Coast (Chiapas and into Guatemala), Oaxaca, and Guerrero.\nThe Tarascans (also known as the P'urhépecha) were located in Michoacán and Guerrero. With their capital at Tzintzuntzan, the Tarascan state was one of the few to actively and continuously resist Aztec domination during the Late Postclassic. Other important Postclassic cultures in Mesoamerica include the Totonac along the eastern coast (in the modern-day states of Veracruz, Puebla, and Hidalgo). The Huastec resided north of the Totonac, mainly in the modern-day states of Tamaulipas and northern Veracruz. The Mixtec and Zapotec cultures, centered at Mitla and Zaachila respectively, inhabited Oaxaca.\nThe Postclassic ends with the arrival of the Spanish and their subsequent conquest of the Aztec between 1519 and 1521. Many other cultural groups did not acquiesce until later. For example, Maya groups in the Petén area, including the Itza at Tayasal and the Kowoj at Zacpeten, remained independent until 1697.\nSome Mesoamerican cultures never achieved dominant status or left impressive archaeological remains but are nevertheless noteworthy. These include the Otomi, Mixe–Zoque groups (which may or may not have been related to the Olmecs), the northern Uto-Aztecan groups, often referred to as the Chichimeca, that include the Cora and Huichol, the Chontales, the Huaves, and the Pipil, Xincan and Lencan peoples of Central America.\n\n\n==== Postclassic gallery ====\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n=== Chronology in chart form ===\n\n\n== General characteristics ==\n\n\n=== Subsistence ===\n\nBy roughly 6000 BCE, hunter-gatherers living in the highlands and lowlands of Mesoamerica began to develop agricultural practices with early cultivation of squash and chilli. The earliest example of maize dates to c. 4000 BCE and comes from Guilá Naquitz, a cave in Oaxaca. Earlier maize samples have been documented at the Los Ladrones cave site in Panama, c. 5500 BCE. Slightly thereafter, semi-agrarian communities began to cultivate other crops throughout Mesoamerica. Maize was the most common domesticate, but the common bean, tepary bean, scarlet runner bean, jicama, tomato and squash all became common cultivates by 3500 BCE. At the same time, these communities exploited cotton, yucca, and agave for fibers and textile materials. By 2000 BCE, corn was the staple crop in the region, and remained so through modern times. The Ramón or Breadnut tree (Brosimum alicastrum) was an occasional substitute for maize in producing flour. Fruit was also important in the daily diet of Mesoamerican cultures. Some of the main ones consumed include avocado, papaya, guava, mamey, zapote, and annona.\nMesoamerica lacked animals suitable for domestication, most notably domesticated large ungulates. The lack of draft animals for transportation is one notable difference between Mesoamerica and the cultures of the South American Andes. Other animals, including the duck, dogs, and turkey, were domesticated. Turkey was the first to be domesticated locally, around 3500 BCE. Dogs were the primary source of animal protein in ancient Mesoamerica, and dog bones are common in midden deposits throughout the region.\nSocieties of this region did hunt certain wild species for food. These animals included deer, rabbit, birds, and various types of insects. They also hunted for luxury items, such as feline fur and bird plumage.Mesoamerican cultures that lived in the lowlands and coastal plains settled down in agrarian communities somewhat later than did highland cultures due to the fact that there was a greater abundance of fruits and animals in these areas, which made a hunter-gatherer lifestyle more attractive. Fishing also was a major provider of food to lowland and coastal Mesoamericans creating a further disincentive to settle down in permanent communities.\n\n\n=== Political organization ===\n\nCeremonial centers were the nuclei of Mesoamerican settlements. The temples provided spatial orientation, which was imparted to the surrounding town. The cities with their commercial and religious centers were always political entities, somewhat similar to the European city-state, and each person could identify with the city where they lived.Ceremonial centers were always built to be visible. Pyramids were meant to stand out from the rest of the city, to represent the gods and their powers. Another characteristic feature of the ceremonial centers is historic layers. All the ceremonial edifices were built in various phases, one on top of the other, to the point that what we now see is usually the last stage of construction. Ultimately, the ceremonial centers were the architectural translation of the identity of each city, as represented by the veneration of their gods and masters. Stelae were common public monuments throughout Mesoamerica, and served to commemorate notable successes, events and dates associated with the rulers and nobility of the various sites.\n\n\n=== Economy ===\n\nGiven that Mesoamerica was broken into numerous and diverse ecological niches, none of the societies that inhabited the area were self-sufficient, although very long-distance trade was common only for very rare goods, or luxury materials. For this reason, from the last centuries of the Archaic period (8000 BC– 1000 BC) onward, regions compensated for the environmental inadequacies by specializing in the extraction of certain abundant natural resources and then trading them for necessary unavailable resources through established commercial trade networks.\nThe following is a list of some of the specialized resources traded from the various Mesoamerican sub-regions and environmental contexts:\n\nPacific lowlands: cotton and cochineal\nMaya lowlands and the Gulf Coast: cacao, vanilla, jaguar skins, birds and bird feathers (especially quetzal and macaw)\nCentral Mexico: Obsidian (Pachuca)\nGuatemalan highlands: Obsidian (San Martin Jilotepeque, El Chayal, and Ixtepeque), pyrite, and jade from the Motagua River valley\nCoastal areas: salt, dry fish, shell, and dyes\n\n\n== Common characteristics of Mesoamerican culture ==\n\n\n=== Architecture ===\nMesoamerican architecture is the collective name given to urban, ceremonial and public structures built by pre-Columbian civilizations in Mesoamerica. Although very different in styles, all kinds of mesoamerican architecture show some kind of interrelation, due to very significant cultural exchanges occurred during thousands of years. Among the most well-known structures in Mesoamerica, the flat-top pyramids are a landmark feature of the most developed urban centers.\nTwo characteristics are most notable in Mesoamerican architecture. Firstly, the intimate connection between geography, astronomy and architecture: very often, urban centers or even single buildings are aligned to cardinal directions and/or along particular constellations. Secondly, iconography was considered integral part of architecture, with buildings often being adorned with images of religious and cultural significance.\n\n\n=== Calendrical systems ===\n\nAgriculturally based people historically divide the year into four seasons. These included the two solstices and the two equinoxes, which could be thought of as the four \"directional pillars\" that support the year. These four times of the year were, and still are, important as they indicate seasonal changes that directly impact the lives of Mesoamerican agriculturalists.\nThe Maya closely observed and duly recorded the seasonal markers. They prepared almanacs recording past and recent solar and lunar eclipses, the phases of the moon, the periods of Venus and Mars, the movements of various other planets, and conjunctions of celestial bodies. These almanacs also made future predictions concerning celestial events. These tables are remarkably accurate, given the technology available, and indicate a significant level of knowledge among Maya astronomers.Among the many types of calendars the Maya maintained, the most important include a 260-day cycle, a 360-day cycle or 'year', a 365-day cycle or year, a lunar cycle, and a Venus cycle, which tracked the synodic period of Venus. Maya of the European contact period said that knowing the past aided in both understanding the present and predicting the future (Diego de Landa). The 260-day cycle was a calendar to govern agriculture, observe religious holidays, mark the movements of celestial bodies and memorialize public officials. The 260-day cycle was also used for divination, and (like the Catholic calendar of saints) to name newborns.The names given to the days, months, and years in the Mesoamerican calendar came, for the most part, from animals, flowers, heavenly bodies, and cultural concepts that held symbolic significance in Mesoamerican culture. This calendar was used throughout the history of Mesoamerican by nearly every culture. Even today, several Maya groups in Guatemala, including the K'iche', Q'eqchi', Kaqchikel, and the Mixe people of Oaxaca continue using modernized forms of the Mesoamerican calendar.\n\n\n=== Writing systems ===\n\nThe Mesoamerican scripts deciphered to date are logosyllabic combining the use of logograms with a syllabary, and they are often called hieroglyphic scripts. Five or six different scripts have been documented in Mesoamerica, but archaeological dating methods, and a certain degree of self-interest, create difficulties in establishing priority and thus the forebear from which the others developed. The best documented and deciphered Mesoamerican writing system, and therefore the most widely known, is the classic Maya script. Others include the Olmec, Zapotec, and Epi-Olmec/Isthmian writing systems. An extensive Mesoamerican literature has been conserved partly in indigenous scripts and partly in the postinvasion transcriptions into Latin script.\nThe other glyphic writing systems of Mesoamerica, and their interpretation, have been subject to much debate. One important ongoing discussion regards whether non-Maya Mesoamerican texts can be considered examples of true writing or whether non-Maya Mesoamerican texts are best understood as pictographic conventions that express ideas, specifically religious ones, but don't represent the phonetics of spoken language.\nMesoamerican writing is found in several mediums, including large stone monuments such as stelae, carved directly onto architecture, carved or painted over stucco (e.g., murals), and on pottery. No Precolumbian Mesoamerican society is known to have had widespread literacy, and literacy was probably restricted to particular social classes, including scribes, painters, merchants, and the nobility.\nThe Mesoamerican book was typically written with brush and colored inks on a paper prepared from the inner bark of the ficus amacus. The book consisted of a long strip of the prepared bark, which was folded like a screenfold to define individual pages. The pages were often covered and protected by elaborately carved book boards. Some books were composed of square pages while others were composed of rectangular pages.\nFollowing the Spanish conquests in the sixteenth century, Spanish friars taught indigenous scribes to write their languages in alphabetic texts. Many oral histories of the prehispanic period were subsequently recorded in alphabetic texts.  The indigenous in central and southern Mexico continued to produce written texts in the colonial period, many with pictorial elements.  An important scholarly reference work is the Handbook of Middle American Indians, Guide to Ethnohistorical Sources. Mesoamerican codices survive from the Aztec, Maya, Mixtec, and Zapotec regions.\n\n\n=== Arithmetic ===\n\nMesoamerican arithmetic treated numbers as having both literal and symbolic value, the result of the dualistic nature that characterized Mesoamerican ideology. As mentioned, the Mesoamerican numbering system was vigesimal (i.e., based on the number 20).\nIn representing numbers, a series of bars and dots were employed. Dots had a value of one, and bars had a value of five. This type of arithmetic was combined with a symbolic numerology: '2' was related to origins, as all origins can be thought of as doubling; '3' was related to household fire; '4' was linked to the four corners of the universe; '5' expressed instability; '9' pertained to the underworld and the night; '13' was the number for light, '20' for abundance, and '400' for infinity. The concept of zero was also used, and its representation at the Late Preclassic occupation of Tres Zapotes is one of the earliest uses of zero in human history.\n\n\n=== Food, medicine, and science ===\nMesoamerica would deserve its place in the human pantheon if its inhabitants had only created maize, in terms of harvest weight the world's most important crop. But the inhabitants of Mexico and northern Central America also developed tomatoes, now basic to Italian cuisine; peppers, essential to Thai and Indian food; all the world's squashes (except for a few domesticated in the United States); and many of the beans on dinner plates around the world. One writer estimated these indigenous tribes developed three-fifths of the crops now grown in cultivation, most of them in Mesoamerica. Having secured their food supply, the Mesoamerican societies turned to intellectual pursuits. In a millennium or less, a comparatively short time, they invented their own writing, astronomy and mathematics, including the zero.\nMaize played an important role in Mesoamerican feasts due to its symbolic meaning and abundance. Gods were praised and named after.\nCompanion planting was practiced in various forms by the indigenous peoples of the Americas. They domesticated squash 8,000 to 10,000 years ago, then maize, then common beans, forming the Three Sisters agricultural technique. The cornstalk served as a trellis for the beans to climb, and the beans fixed nitrogen, benefitting the maize.Fray Bernardino de Sahagún collected extensive information on plants, animals, soil types, among other matters from native informants in Book 11, The Earthly Things, of the twelve-volume General History of the Things of New Spain, known as the Florentine Codex, compiled in the third quarter of the sixteenth century. Bernardino de Sahagún reported the ritualistic use of  Psilocybe mushrooms known to the Aztecs as teōnanācatl (agglutinative form of teōtl (god, sacred) and nanācatl (mushroom) in Náhuatl). An earlier work, the Badianus Manuscript or Libellus de Medicinalibus Indorum Herbis is another Aztec codex with written text and illustrations collected from the indigenous viewpoint. The ancient Aztecs used a variety of entheogens within their society.Evidence shows that wild animals were captured and traded for symbolic and ritual purposes.\n\n\n=== Mythology and worldview ===\n\n Shared traits in Mesoamerican mythology are characterized by their common basis as a religion that—though in many Mesoamerican groups developed into complex polytheistic religious systems—retained some shamanistic elements.\n\nThe great breadth of the Mesoamerican pantheon of deities is due to the incorporation of ideological and religious elements from the first primitive religion of Fire, Earth, Water and Nature. Astral divinities (the sun, stars, constellations, and Venus) were adopted and represented in anthropomorphic, zoomorphic, and anthropozoomorphic sculptures, and in day-to-day objects. The qualities of these gods and their attributes changed with the passage of time and with cultural influences from other Mesoamerican groups. The gods are at once three: creator, preserver, and destroyer, and at the same time just one. An important characteristic of Mesoamerican religion was the dualism among the divine entities. The gods represented the confrontation between opposite poles: the positive, exemplified by light, the masculine, force, war, the sun, etc.; and the negative, exemplified by darkness, the feminine, repose, peace, the moon, etc.\nThe typical Mesoamerican cosmology sees the world as separated into a day world watched by the sun and a night world watched by the moon. More importantly, the three superposed levels of the world are united by a Ceiba tree (Yaxche' in Mayan). The geographic vision is also tied to the cardinal points. Certain geographical features are linked to different parts of this cosmovision. Thus mountains and tall trees connect the middle and upper worlds; caves connect the middle and nether worlds.\n\n\n==== Sacrifice ====\nGenerally, sacrifice can be divided into two types: autosacrifice and human sacrifice. The different forms of sacrifice are reflected in the imagery used to evoke ideological structure and sociocultural organization in Mesoamerica. In the Maya area, for example, stele depict bloodletting rituals performed by ruling elites, eagles and jaguars devouring human hearts, jade circles or necklaces that represented hearts, and plants and flowers that symbolized both nature and the blood that provided life. Imagery also showed pleas for rain or pleas for blood, with the same intention to replenish the divine energy. Ritual sacrifice was done in efforts to appease the gods, and was done with the purpose of protection of the population.\n\n\n===== Autosacrifice =====\n\nAutosacrifice, also called bloodletting, is the ritualized practice of drawing blood from oneself. It is commonly seen or represented through iconography as performed by ruling elites in highly ritualized ceremonies, but it was easily practiced in mundane sociocultural contexts (i.e., non-elites could perform autosacrifice). The act was typically performed with obsidian prismatic blades or stingray spines, and blood was drawn from piercing or cutting the tongue, earlobes, and/or genitals (among other locations). Another form of autosacrifice was conducted by pulling a rope with attached thorns through the tongue or earlobes. The blood produced was then collected on amate held in a bowl.\nAutosacrifice was not limited to male rulers, as their female counterparts often performed these ritualized activities. They are typically shown performing the rope and thorns technique. A recently discovered queen's tomb in the Classic Maya site of Waka (also known as El Perú) had a ceremonial stingray spine placed in her genital area, suggesting that women also performed bloodletting in their genitalia.\n\n\n===== Human sacrifice =====\n\nSacrifice had great importance in the social and religious aspects of Mesoamerican culture. First, it showed death transformed into the divine. Death is the consequence of a human sacrifice, but it is not the end; it is but the continuation of the cosmic cycle. Death creates life—divine energy is liberated through death and returns to the gods, who are then able to create more life. Secondly, it justifies war, since the most valuable sacrifices are obtained through conflict. The death of the warrior is the greatest sacrifice and gives the gods the energy to go about their daily activities, such as the bringing of rain. Warfare and capturing prisoners became a method of social advancement and a religious cause. Finally, it justifies the control of power by the two ruling classes, the priests and the warriors. The priests controlled the religious ideology, and the warriors supplied the sacrifices. Historically it was also in discussion that those sacrificed were chosen by the gods, this idea of being \"chosen\" was decided by the gods. This was then displayed by acts, such as being struck by lightning. If someone was struck by lightning and a sacrifice was needed they would often be chosen by their population, as they believed they were chosen by the gods.\n\n\n==== Ballgame ====\n\nThe Mesoamerican ballgame was a sport with ritual associations played for over 3000 years by nearly all pre-Columbian peoples of Mesoamerica. The sport had different versions in different places during the millennia, and a modern version of the game, ulama, is still played in a few places.\nOver 1300 ballcourts have been found throughout Mesoamerica. They vary considerably in size, but they all feature long narrow alleys with side-walls to bounce the balls against.\nThe rules of the ballgame are not known, but it was probably similar to volleyball, where the object is to keep the ball in play. In the most well-known version of the game, the players struck the ball with their hips, though some versions used forearms or employed rackets, bats, or handstones. The ball was made of solid rubber, and weighed up to 4 kg or more, with sizes that differed greatly over time or according to the version played.While the game was played casually for simple recreation, including by children and perhaps even women, the game also had important ritual aspects, and major formal ballgames were held as ritual events, often featuring human sacrifice.\n\n\n==== Astronomy ====\nMesoamerican astronomy included a broad understanding of the cycles of planets and other celestial bodies. Special importance was given to the sun, moon, and Venus as the morning and evening star.Observatories were built at some sites, including the round observatory at Ceibal and the \"Observatorio\" at Xochicalco. Often, the architectural organization of Mesoamerican sites was based on precise calculations derived from astronomical observations. Well-known examples of these include the El Castillo pyramid at Chichen Itza and the Observatorio at Xochicalco. A unique and common architectural complex found among many Mesoamerican sites are E-Groups, which are aligned so as to serve as astronomical observatories. The name of this complex is based on Uaxactun's \"Group E\", the first known observatory in the Maya area. Perhaps the earliest observatory documented in Mesoamerica is that of the Monte Alto culture. This complex consisted of three plain stelae and a temple oriented with respect to the Pleiades.\n\n\n==== Symbolism of space and time ====\n\nIt has been argued that among Mesoamerican societies the concepts of space and time are associated with the four cardinal compass points and linked together by the calendar. Dates or events were always tied to a compass direction, and the calendar specified the symbolic geographical characteristic peculiar to that period. Resulting from the significance held by the cardinal directions, many Mesoamerican architectural features, if not entire settlements, were planned and oriented with respect to directionality.\nIn Maya cosmology, each cardinal point was assigned a specific color and a specific jaguar deity (Bacab). They are as follows:\n\nHobnil, Bacab of the East, associated with the color red and the Kan years\nCan Tzicnal, Bacab of the North, assigned the color white and the Muluc years\nZac Cimi, Bacab of the West, associated with the color black and the Ix years\nHozanek, Bacab of the South, associated with the color yellow and the Cauac years.Later cultures such as the Kaqchikel and K'iche' maintain the association of cardinal directions with each color, but utilized different names.\nAmong the Aztec, the name of each day was associated with a cardinal point (thus conferring symbolic significance), and each cardinal direction was associated with a group of symbols. Below are the symbols and concepts associated with each direction:\n\nEast: croco dile, the serpent, water, cane, and movement. The East was linked to the world priests and associated with vegetative fertility, or, in other words, tropical exuberance.\nNorth: wind, death, the dog, the jaguar, and flint (or chert). The north contrasts with the east in that it is conceptualized as dry, cold, and oppressive. It is considered the nocturnal part of the universe and includes the dwellings of the dead. The dog (xoloitzcuintle) has a very specific meaning, as it accompanies the deceased during the trip to the lands of the dead and helps them cross the river of death that leads into nothingness. (See also Dogs in Mesoamerican folklore and myth).\nWest: the house, the deer, the monkey, the eagle, and rain. The west was associated with the cycles of vegetation, specifically the temperate high plains that experience light rains and the change of seasons.\nSouth: rabbit, the lizard, dried herbs, the buzzard, and flowers. It is related on the one hand to the luminous Sun and the noon heat, and on the other with rain filled with alcoholic drink. The rabbit, the principal symbol of the west, was associated with farmers and with pulque.\n\n\n=== Political and religious art ===\n\nMesoamerican artistic expression was conditioned by ideology and generally focused on themes of religion and/or sociopolitical power. This is largely based on the fact that most works that survived the Spanish conquest were public monuments. These monuments were typically erected by rulers who sought to visually legitimize their sociocultural and political position; by doing so, they intertwined their lineage, personal attributes and achievements, and legacy with religious concepts. As such, these monuments were specifically designed for public display and took many forms, including stele, sculpture, architectural reliefs, and other types of architectural elements (e.g., roofcombs). Other themes expressed include tracking time, glorifying the city, and veneration of the gods—all of which were tied to explicitly aggrandizing the abilities and the reign of the ruler who commissioned the artwork.\nThe majority of artwork created during this historical time was in relation to these topics, religion and politics. Rulers were drawn and sculpted. Historical tales and events were then translated into pieces of art, and art was used to relay religious and political messages.\n\n\n=== Music ===\nArchaeological studies have never discovered any written music from the pre-Columbian era, but musical instruments were found, as well as carvings and depictions, that clearly show how music played a central role in the Mayan religious and societal structures, for example, as accompaniment to celebrations and funerals. Some Mesoamerican civilizations, such as the Maya, commonly played various instruments such as drums, flutes and whistles. Although most of the original Mayan music disappeared following the Spanish colonization, some of it mixed with the incoming Spanish music and exists to date.\n\n\n== See also ==\n\nAmericas (terminology)\nAmericas\nCentral America\nHispanic America\nHispanic and Latino Americans\nIndigenous peoples of Mexico\nIndigenous peoples of the Americas\nLatin America\nMesoamerican region\nMiddle America (Americas)\nPainting in the Americas before European colonization\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n== External links ==\nMaya Culture\nMesoweb.com: a comprehensive site for Mesoamerican civilizations\nMuseum of the Templo Mayor (Mexico) (in Spanish)\nNational Museum of Anthropology and History (Mexico) (in Spanish)\nSelected bibliography concerning war in Mesoamerica (in Spanish)\nWAYEB: European Association of Mayanists\nArqueologia Iberoamericana: Open access international scientific journal devoted to the archaeological study of the American and Iberian peoples. It contains research articles on Mesoamerica.\nVistas: Visual Culture in Spanish America, 1520–1820\n\"Google Scholar Citations: Mesoamerica\"."}