{"topic": "problems", "english_title": "Problem solving", "english": "Problem solving consists of using generic or ad hoc methods in an orderly manner to find solutions to problems. Some of the problem-solving techniques developed and used in philosophy, artificial intelligence, computer science, engineering, mathematics, medicine and societies in general are related to mental problem-solving techniques studied in psychology and cognitive sciences.\n\n\n== Definition ==\nThe term problem solving has a slightly different meaning depending on the discipline. For instance, it is a mental process in psychology and a computerized process in computer science. There are two different types of problems: ill-defined and well-defined; different approaches are used for each. Well-defined problems have specific end goals and clearly expected solutions, while ill-defined problems do not. Well-defined problems allow for more initial planning than ill-defined problems. Solving problems sometimes involves dealing with pragmatics, the way that context contributes to meaning, and semantics, the interpretation of the problem. The ability to understand what the end goal of the problem is, and what rules could be applied represents the key to solving the problem. Sometimes the problem requires abstract thinking or coming up with a creative solution.\n\n\n=== Psychology ===\nProblem solving in psychology refers to the process of finding solutions to problems encountered in life. Solutions to these problems are usually situation or context-specific. The process starts with problem finding and problem shaping, where the problem is discovered and simplified. The next step is to generate possible solutions and evaluate them. Finally a solution is selected to be implemented and verified. Problems have an end goal to be reached and how you get there depends upon problem orientation (problem-solving coping style and skills) and systematic analysis. Mental health professionals study the human problem solving processes using methods such as introspection, behaviorism, simulation, computer modeling, and experiment. Social psychologists look into the person-environment relationship aspect of the problem and independent and interdependent problem-solving methods. Problem solving has been defined as a higher-order cognitive process and intellectual function that requires the modulation and control of more routine or fundamental skills.Problem solving has two major domains: mathematical problem solving and personal problem solving. Both are seen in terms of some difficulty or barrier that is encountered. Empirical research shows many different strategies and factors influence everyday problem solving. Rehabilitation psychologists studying individuals with frontal lobe injuries have found that deficits in emotional control and reasoning can be re-mediated with effective rehabilitation and could improve the capacity of injured persons to resolve everyday problems. Interpersonal everyday problem solving is dependent upon the individual personal motivational and contextual components. One such component is the emotional valence of \"real-world\" problems and it can either impede or aid problem-solving performance. Researchers have focused on the role of emotions in problem solving, demonstrating that poor emotional control can disrupt focus on the target task and impede problem resolution and likely lead to negative outcomes such as fatigue, depression, and inertia. In conceptualization, human problem solving consists of two related processes: problem orientation and the motivational/attitudinal/affective approach to problematic situations and problem-solving skills. Studies conclude people's strategies cohere with their goals and stem from the natural process of comparing oneself with others.\n\n\n=== Cognitive sciences ===\nThe early experimental work of the Gestaltists in Germany placed the beginning of problem solving study (e.g., Karl Duncker in 1935 with his book The psychology of productive thinking). Later this experimental work continued through the 1960s and early 1970s with research conducted on relatively simple (but novel for participants) laboratory tasks of problem solving. The use of simple, novel tasks was due to the clearly defined optimal solutions and short time for solving, which made it possible for the researchers to trace participants' steps in problem-solving process. Researchers' underlying assumption was that simple tasks such as the Tower of Hanoi correspond to the main properties of \"real world\" problems and thus the characteristic cognitive processes within participants' attempts to solve simple problems are the same for \"real world\" problems too; simple problems were used for reasons of convenience and with the expectation that thought generalizations to more complex problems would become possible. Perhaps the best-known and most impressive example of this line of research is the work by Allen Newell and Herbert A. Simon. Other experts have shown that the principle of decomposition improves the ability of the problem solver to make good judgment.\n\n\n=== Computer science ===\nIn computer science and in the part of artificial intelligence that deals with algorithms, problem solving includes techniques of algorithms, heuristics and root cause analysis. The amount of resources (e.g. time, memory, energy) required to solve problems is described by computational complexity theory. In more general terms, problem solving is part of a larger process that encompasses problem determination, de-duplication, analysis, diagnosis, repair, and other steps.\nOther problem solving tools are linear and nonlinear programming, queuing systems, and simulation.Much of computer science involves designing completely automatic systems that will later solve some specific problem—systems to accept input data and, in a reasonable amount of time, calculate the correct response or a correct-enough approximation.\nIn addition, people in computer science spend a surprisingly large amount of human time finding and fixing problems in their programs: Debugging.\n\n\n=== Logic ===\nFormal logic is concerned with such issues as validity, truth, inference, argumentation and proof. In a problem-solving context, it can be used to formally represent a problem as a theorem to be proved, and to represent the knowledge needed to solve the problem as the premises to be used in a proof that the problem has a solution. The use of computers to prove mathematical theorems using formal logic emerged as the field of automated theorem proving in the 1950s. It included the use of heuristic methods designed to simulate human problem solving, as in the Logic Theory Machine, developed by Allen Newell, Herbert A. Simon and J. C. Shaw, as well as algorithmic methods, such as the resolution principle developed by John Alan Robinson.\nIn addition to its use for finding proofs of mathematical theorems, automated theorem-proving has also been used for program verification in computer science. However, already in 1958, John McCarthy proposed the advice taker, to represent information in formal logic and to derive answers to questions using automated theorem-proving. An important step in this direction was made by Cordell Green in 1969, using a resolution theorem prover for question-answering and for such other applications in artificial intelligence as robot planning.\nThe resolution theorem-prover used by Cordell Green bore little resemblance to human problem solving methods. In response to criticism of his approach, emanating from researchers at MIT, Robert Kowalski developed logic programming and SLD resolution, which solves problems by problem decomposition. He has advocated logic for both computer and human problem solving and computational logic to improve human thinking\n\n\n=== Engineering ===\nProblem solving is used when products or processes fail, so corrective action can be taken to prevent further failures. It can also be applied to a product or process prior to an actual failure event—when a potential problem can be predicted and analyzed, and mitigation applied so the problem never occurs. Techniques such as failure mode and effects analysis can be used to proactively reduce the likelihood of problems occurring.\nForensic engineering is an important technique of failure analysis that involves tracing product defects and flaws. Corrective action can then be taken to prevent further failures.\nReverse engineering attempts to discover the original problem-solving logic used in developing a product by taking it apart.\n\n\n=== Military science ===\nIn military science, problem solving is linked to the concept of \"end-states\", the desired condition or situation that strategists wish to generate. The ability to solve problems is important at any military rank, but is highly critical at the command and control level, where it is strictly correlated to the deep understanding of qualitative and quantitative scenarios. Effectiveness of problem solving is used to measure the result of problem solving, tied to accomplishing the goal. Planning for problem-solving is the process of determining how to achieve the goal\n\n\n== Problem-solving strategies ==\n\nProblem-solving strategies are the steps that one would use to find the problems that are in the way to getting to one's own goal. Some refer to this as the \"problem-solving cycle\".In this cycle one will acknowledge, recognize the problem, define the problem, develop a strategy to fix the problem, organize the knowledge of the problem cycle, figure out the resources at the user's disposal, monitor one's progress, and evaluate the solution for accuracy. The reason it is called a cycle is that once one is completed with a problem another will usually pop up.\nInsight is the sudden solution to a long-vexing problem, a sudden recognition of a new idea, or a sudden understanding of a complex situation, an Aha! moment. Solutions found through insight are often more accurate than those found through step-by-step analysis. To solve more problems at a faster rate, insight is necessary for selecting productive moves at different stages of the problem-solving cycle. This problem-solving strategy pertains specifically to problems referred to as insight problem. Unlike Newell and Simon's formal definition of move problems, there has not been a generally agreed upon definition of an insight problem (Ash, Jee, and Wiley, 2012; Chronicle, MacGregor, and Ormerod, 2004; Chu and MacGregor, 2011).Blanchard-Fields looks at problem solving from one of two facets. The first looking at those problems that only have one solution (like mathematical problems, or fact-based questions) which are grounded in psychometric intelligence. The other is socioemotional in nature and have answers that change constantly (like what's your favorite color or what you should get someone for Christmas).\nThe following techniques are usually called problem-solving strategies\nAbstraction: solving the problem in a model of the system before applying it to the real system\nAnalogy: using a solution that solves an analogous problem\nBrainstorming: (especially among groups of people) suggesting a large number of solutions or ideas and combining and developing them until an optimum solution is found\nCritical thinking\nDivide and conquer: breaking down a large, complex problem into smaller, solvable problems\nHypothesis testing: assuming a possible explanation to the problem and trying to prove (or, in some contexts, disprove) the assumption\nLateral thinking: approaching solutions indirectly and creatively\nMeans-ends analysis: choosing an action at each step to move closer to the goal\nMethod of focal objects: synthesizing seemingly non-matching characteristics of different objects into something new\nMorphological analysis: assessing the output and interactions of an entire system\nProof: try to prove that the problem cannot be solved. The point where the proof fails will be the starting point for solving it\nReduction: transforming the problem into another problem for which solutions exist\nResearch: employing existing ideas or adapting existing solutions to similar problems\nRoot cause analysis: identifying the cause of a problem\nTrial-and-error: testing possible solutions until the right one is found\n\n\n== Problem-solving methods ==\n\nEight Disciplines Problem Solving\nGROW model\nHow to Solve ItLateral thinking\nOODA loop (observe, orient, decide, and act)\nPDCA (plan–do–check–act)\nRoot cause analysis\nRPR problem diagnosis (rapid problem resolution)\nTRIZ (in Russian: Teoriya Resheniya Izobretatelskikh Zadach, \"theory of solving inventor's problems\")\nA3 problem solving\nSystem dynamics\nHive mind\nExperimental Action Plan\n\n\n== Common barriers ==\nCommon barriers to problem solving are mental constructs that impede our ability to correctly solve problems. These barriers prevent people from solving problems in the most efficient manner possible. Five of the most common processes and factors that researchers have identified as barriers to problem solving are confirmation bias, mental set, functional fixedness, unnecessary constraints, and irrelevant information.\n\n\n=== Confirmation bias ===\n\nConfirmation bias is an unintentional bias caused by the collection and use of data in a way that favors a preconceived notion. The beliefs affected by confirmation bias do not need to have motivation, the desire to defend or find substantiation for beliefs that are important to that person. Research has found that professionals within scientific fields of study also experience confirmation bias. Andreas Hergovich, Reinhard Schott, and Christoph Burger's experiment conducted online, for instance, suggested that professionals within the field of psychological research are likely to view scientific studies that agree with their preconceived notions more favorably than studies that clash with their established beliefs. According to Raymond Nickerson, one can see the consequences of confirmation bias in real-life situations, which range in severity from inefficient government policies to genocide. Nickerson argued that those who killed people accused of witchcraft demonstrated confirmation bias with motivation. Researcher Michael Allen found evidence for confirmation bias with motivation in school children who worked to manipulate their science experiments in such a way that would produce favorable results. However, confirmation bias does not necessarily require motivation. In 1960, Peter Cathcart Wason conducted an experiment in which participants first viewed three numbers and then created a hypothesis that proposed a rule that could have been used to create that triplet of numbers. When testing their hypotheses, participants tended to only create additional triplets of numbers that would confirm their hypotheses, and tended not to create triplets that would negate or disprove their hypotheses. Thus research also shows that people can and do work to confirm theories or ideas that do not support or engage personally significant beliefs.\n\n\n=== Mental set ===\n\nMental set was first articulated by Abraham Luchins in the 1940s and demonstrated in his well-known water jug experiments. In these experiments, participants were asked to fill one jug with a specific amount of water using only other jugs (typically three) with different maximum capacities as tools. After Luchins gave his participants a set of water jug problems that could all be solved by employing a single technique, he would then give them a problem that could either be solved using that same technique or a novel and simpler method. Luchins discovered that his participants tended to use the same technique that they had become accustomed to despite the possibility of using a simpler alternative. Thus mental set describes one's inclination to attempt to solve problems in such a way that has proved successful in previous experiences. However, as Luchins' work revealed, such methods for finding a solution that have worked in the past may not be adequate or optimal for certain new but similar problems. Therefore, it is often necessary for people to move beyond their mental sets in order to find solutions. This was again demonstrated in Norman Maier's 1931 experiment, which challenged participants to solve a problem by using a household object (pliers) in an unconventional manner. Maier observed that participants were often unable to view the object in a way that strayed from its typical use, a phenomenon regarded as a particular form of mental set (more specifically known as functional fixedness, which is the topic of the following section). When people cling rigidly to their mental sets, they are said to be experiencing fixation, a seeming obsession or preoccupation with attempted strategies that are repeatedly unsuccessful. In the late 1990s, researcher Jennifer Wiley worked to reveal that expertise can work to create a mental set in people considered to be experts in their fields, and she gained evidence that the mental set created by expertise could lead to the development of fixation.\n\n\n=== Functional fixedness ===\n\nFunctional fixedness is a specific form of mental set and fixation, which was alluded to earlier in the Maier experiment, and furthermore it is another way in which cognitive bias can be seen throughout daily life. Tim German and Clark Barrett describe this barrier as the fixed design of an object hindering the individual's ability to see it serving other functions. In more technical terms, these researchers explained that \"[s]ubjects become 'fixed' on the design function of the objects, and problem solving suffers relative to control conditions in which the object's function is not demonstrated.\" Functional fixedness is defined as only having that primary function of the object itself hinder the ability of it serving another purpose other than its original function. In research that highlighted the primary reasons that young children are immune to functional fixedness, it was stated that \"functional fixedness...[is when] subjects are hindered in reaching the solution to a problem by their knowledge of an object's conventional function.\" Furthermore, it is important to note that functional fixedness can be easily expressed in commonplace situations. For instance, imagine the following situation: a man sees a bug on the floor that he wants to kill, but the only thing in his hand at the moment is a can of air freshener. If the man starts looking around for something in the house to kill the bug with instead of realizing that the can of air freshener could in fact be used not only as having its main function as to freshen the air, he is said to be experiencing functional fixedness. The man's knowledge of the can being served as purely an air freshener hindered his ability to realize that it too could have been used to serve another purpose, which in this instance was as an instrument to kill the bug. Functional fixedness can happen on multiple occasions and can cause us to have certain cognitive biases. If people only see an object as serving one primary focus, then they fail to realize that the object can be used in various ways other than its intended purpose. This can in turn cause many issues with regards to problem solving. \nFunctional fixedness limits the ability for people to solve problems accurately by causing one to have a very narrow way of thinking. Functional fixedness can be seen in other types of learning behaviors as well. For instance, research has discovered the presence of functional fixedness in many educational instances. Researchers Furio, Calatayud, Baracenas, and Padilla stated that \"... functional fixedness may be found in learning concepts as well as in solving chemistry problems.\" There was more emphasis on this function being seen in this type of subject and others.\nThere are several hypotheses in regards to how functional fixedness relates to problem solving. There are also many ways in which a person can run into problems while thinking of a particular object with having this function. If there is one way in which a person usually thinks of something rather than multiple ways then this can lead to a constraint in how the person thinks of that particular object. This can be seen as narrow minded thinking, which is defined as a way in which one is not able to see or accept certain ideas in a particular context. Functional fixedness is very closely related to this as previously mentioned. This can be done intentionally and or unintentionally, but for the most part it seems as if this process to problem solving is done in an unintentional way.\nFunctional fixedness can affect problem solvers in at least two particular ways. The first is with regards to time, as functional fixedness causes people to use more time than necessary to solve any given problem. Secondly, functional fixedness often causes solvers to make more attempts to solve a problem than they would have made if they were not experiencing this cognitive barrier. In the worst case, functional fixedness can completely prevent a person from realizing a solution to a problem. Functional fixedness is a commonplace occurrence, which affects the lives of many people.\n\n\n=== Unnecessary constraints ===\nUnnecessary constraints are another very common barrier that people face while attempting to problem-solve. This particular phenomenon occurs when the subject, trying to solve the problem subconsciously, places boundaries on the task at hand, which in turn forces him or her to strain to be more innovative in their thinking. The solver hits a barrier when they become fixated on only one way to solve their problem, and it becomes increasingly difficult to see anything but the method they have chosen. Typically, the solver experiences this when attempting to use a method they have already experienced success from, and they can not help but try to make it work in the present circumstances as well, even if they see that it is counterproductive.Groupthink, or taking on the mindset of the rest of the group members, can also act as an unnecessary constraint while trying to solve problems. This is due to the fact that with everybody thinking the same thing, stopping on the same conclusions, and inhibiting themselves to think beyond this. This is very common, but the most well-known example of this barrier making itself present is in the famous example of the dot problem. In this example, there are nine dots lying on a grid three dots across and three dots running up and down. The solver is then asked to draw no more than four lines, without lifting their pen or pencil from the paper. This series of lines should connect all of the dots on the paper. Then, what typically happens is the subject creates an assumption in their mind that they must connect the dots without letting his or her pen or pencil go outside of the square of dots. Standardized procedures like this can often bring mentally invented constraints of this kind, and researchers have found a 0% correct solution rate in the time allotted for the task to be completed. The imposed constraint inhibits the solver to think beyond the bounds of the dots. It is from this phenomenon that the expression \"think outside the box\" is derived.This problem can be quickly solved with a dawning of realization, or insight. A few minutes of struggling over a problem can bring these sudden insights, where the solver quickly sees the solution clearly. Problems such as this are most typically solved via insight and can be very difficult for the subject depending on either how they have structured the problem in their minds, how they draw on their past experiences, and how much they juggle this information in their working memories In the case of the nine-dot example, the solver has already been structured incorrectly in their minds because of the constraint that they have placed upon the solution. In addition to this, people experience struggles when they try to compare the problem to their prior knowledge, and they think they must keep their lines within the dots and not go beyond. They do this because trying to envision the dots connected outside of the basic square puts a strain on their working memory.The solution to the problem becomes obvious as insight occurs following incremental movements made toward the solution. These tiny movements happen without the solver knowing. Then when the insight is realized fully, the \"aha\" moment happens for the subject. These moments of insight can take a long while to manifest or not so long at other times, but the way that the solution is arrived at after toiling over these barriers stays the same.\n\n\n=== Irrelevant information ===\n\nIrrelevant information is information presented within a problem that is unrelated or unimportant to the specific problem. Within the specific context of the problem, irrelevant information would serve no purpose in helping solve that particular problem. Often irrelevant information is detrimental to the problem solving process. It is a common barrier that many people have trouble getting through, especially if they are not aware of it. Irrelevant information makes solving otherwise relatively simple problems much harder.For example: \"Fifteen percent of the people in Topeka have unlisted telephone numbers. You select 200 names at random from the Topeka phone book. How many of these people have unlisted phone numbers?\"The people that are not listed in the phone book would not be among the 200 names you selected. The individuals looking at this task would have naturally wanted to use the 15% given to them in the problem. They see that there is information present and they immediately think that it needs to be used. This of course is not true. These kinds of questions are often used to test students taking aptitude tests or cognitive evaluations. They aren't meant to be difficult but they are meant to require thinking that is not necessarily common. Irrelevant Information is commonly represented in math problems, word problems specifically, where numerical information is put for the purpose of challenging the individual.\nOne reason irrelevant information is so effective at keeping a person off topic and away from the relevant information, is in how it is represented. The way information is represented can make a vast difference in how difficult the problem is to be overcome. Whether a problem is represented visually, verbally, spatially, or mathematically, irrelevant information can have a profound effect on how long a problem takes to be solved; or if it's even possible. The Buddhist monk problem is a classic example of irrelevant information and how it can be represented in different ways:\n\nA Buddhist monk begins at dawn one day walking up a mountain, reaches the top at sunset, meditates at the top for several days until one dawn when he begins to walk back to the foot of the mountain, which he reaches at sunset. Making no assumptions about his starting or stopping or about his pace during the trips, prove that there is a place on the path which he occupies at the same hour of the day on the two separate journeys.This problem is near impossible to solve because of how the information is represented. Because it is written out in a way that represents the information verbally, it causes us to try and create a mental image of the paragraph. This is often very difficult to do especially with all the irrelevant information involved in the question. This example is made much easier to understand when the paragraph is represented visually. Now if the same problem was asked, but it was also accompanied by a corresponding graph, it would be far easier to answer this question; irrelevant information no longer serves as a road block. By representing the problem visually, there are no difficult words to understand or scenarios to imagine. The visual representation of this problem has removed the difficulty of solving it.\nThese types of representations are often used to make difficult problems easier. They can be used on tests as a strategy to remove Irrelevant Information, which is one of the most common forms of barriers when discussing the issues of problem solving. Identifying crucial information presented in a problem and then being able to correctly identify its usefulness is essential. Being aware of irrelevant information is the first step in overcoming this common barrier.\n\n\n=== Other barriers for individuals ===\nIndividual humans engaged in problem-solving tend to overlook subtractive changes, including those that are critical elements of efficient solutions. This tendency to solve by first, only or mostly creating or adding elements, rather than by subtracting elements or processes is shown to intensify with higher cognitive loads such as information overload.\n\n\n== Dreaming: problem-solving without waking consciousness ==\nProblem solving can also occur without waking consciousness. There are many reports of scientists and engineers who solved problems in their dreams. Elias Howe, inventor of the sewing machine, figured out the structure of the bobbin from a dream.The chemist August Kekulé was considering how benzene arranged its six carbon and hydrogen atoms. Thinking about the problem, he dozed off, and dreamt of dancing atoms that fell into a snakelike pattern, which led him to discover the benzene ring. As Kekulé wrote in his diary,\n\nOne of the snakes seized hold of its own tail, and the form whirled mockingly before my eyes. As if by a flash of lightning I awoke; and this time also I spent the rest of the night in working out the consequences of the hypothesis.\nThere also are empirical studies of how people can think consciously about a problem before going to sleep, and then solve the problem with a dream image. Dream researcher William C. Dement told his undergraduate class of 500 students that he wanted them to think about an infinite series, whose first elements were OTTFF, to see if they could deduce the principle behind it and to say what the next elements of the series would be. He asked them to think about this problem every night for 15 minutes before going to sleep and to write down any dreams that they then had. They were instructed to think about the problem again for 15 minutes when they awakened in the morning.\nThe sequence OTTFF is the first letters of the numbers: one, two, three, four, five. The next five elements of the series are SSENT (six, seven, eight, nine, ten). Some of the students solved the puzzle by reflecting on their dreams. One example was a student who reported the following dream:\nI was standing in an art gallery, looking at the paintings on the wall. As I walked down the hall, I began to count the paintings: one, two, three, four, five. As I came to the sixth and seventh, the paintings had been ripped from their frames. I stared at the empty frames with a peculiar feeling that some mystery was about to be solved. Suddenly I realized that the sixth and seventh spaces were the solution to the problem!\nWith more than 500 undergraduate students, 87 dreams were judged to be related to the problems students were assigned (53 directly related and 34 indirectly related). Yet of the people who had dreams that apparently solved the problem, only seven were actually able to consciously know the solution. The rest (46 out of 53) thought they did not know the solution.\nMark Blechner conducted this experiment and obtained results similar to Dement's. He found that while trying to solve the problem, people had dreams in which the solution appeared to be obvious from the dream, but it was rare for the dreamers to realize how their dreams had solved the puzzle. Coaxing or hints did not get them to realize it, although once they heard the solution, they recognized how their dream had solved it. For example, one person in that OTTFF experiment dreamed:\nThere is a big clock. You can see the movement. The big hand of the clock was on the number six. You could see it move up, number by number, six, seven, eight, nine, ten, eleven, twelve. The dream focused on the small parts of the machinery. You could see the gears inside.\nIn the dream, the person counted out the next elements of the series –  six, seven, eight, nine, ten, eleven, twelve –  yet he did not realize that this was the solution of the problem. His sleeping mindbrain solved the problem, but his waking mindbrain was not aware how.\nAlbert Einstein believed that much problem solving goes on unconsciously, and the person must then figure out and formulate consciously what the mindbrain has already solved. He believed this was his process in formulating the theory of relativity: \"The creator of the problem possesses the solution.\" Einstein said that he did his problem-solving without words, mostly in images. \"The words or the language, as they are written or spoken, do not seem to play any role in my mechanism of thought. The psychical entities which seem to serve as elements in thought are certain signs and more or less clear images which can be 'voluntarily' reproduced and combined.\"\n\n\n== Cognitive sciences: two schools ==\nIn cognitive sciences, researchers' realization that problem-solving processes differ across knowledge domains and across levels of expertise (e.g. Sternberg, 1995) and that, consequently, findings obtained in the laboratory cannot necessarily generalize to problem-solving situations outside the laboratory, has led to an emphasis on real-world problem solving since the 1990s. This emphasis has been expressed quite differently in North America and Europe, however. Whereas North American research has typically concentrated on studying problem solving in separate, natural knowledge domains, much of the European research has focused on novel, complex problems, and has been performed with computerized scenarios (see Funke, 1991, for an overview).\n\n\n=== Europe ===\nIn Europe, two main approaches have surfaced, one initiated by Donald Broadbent (1977; see Berry & Broadbent, 1995) in the United Kingdom and the other one by Dietrich Dörner (1975, 1985; see Dörner & Wearing, 1995) in Germany. The two approaches share an emphasis on relatively complex, semantically rich, computerized laboratory tasks, constructed to resemble real-life problems. The approaches differ somewhat in their theoretical goals and methodology, however. The tradition initiated by Broadbent emphasizes the distinction between cognitive problem-solving processes that operate under awareness versus outside of awareness, and typically employs mathematically well-defined computerized systems. The tradition initiated by Dörner, on the other hand, has an interest in the interplay of the cognitive, motivational, and social components of problem solving, and utilizes very complex computerized scenarios that contain up to 2,000 highly interconnected variables (e.g., Dörner, Kreuzig, Reither & Stäudel's 1983 LOHHAUSEN project; Ringelband, Misiak & Kluwe, 1990). Buchner (1995) describes the two traditions in detail.\n\n\n=== North America ===\nIn North America, initiated by the work of Herbert A. Simon on \"learning by doing\" in semantically rich domains, researchers began to investigate problem solving separately in different natural knowledge domains – such as physics, writing, or chess playing – thus relinquishing their attempts to extract a global theory of problem solving (e.g. Sternberg & Frensch, 1991). Instead, these researchers have frequently focused on the development of problem solving within a certain domain, that is on the development of expertise; Chase & Simon, 1973; Chi, Feltovich & Glaser, 1981).Areas that have attracted rather intensive attention in North America include:\n\nReading (Stanovich & Cunningham, 1991)\nWriting (Bryson, Bereiter, Scardamalia & Joram, 1991)\nCalculation (Sokol & McCloskey, 1991)\nPolitical decision making (Voss, Wolfe, Lawrence & Engle, 1991)\nManagerial problem solving ()\nLawyers' reasoning\nMechanical problem solving (Hegarty, 1991)\nProblem solving in electronics (Lesgold & Lajoie, 1991)\nComputer skills (Kay, 1991)\nGame playing (Frensch & Sternberg, 1991)\nPersonal problem solving (Heppner & Krauskopf, 1987)\nMathematical problem solving (Pólya, 1945; Schoenfeld, 1985)\nSocial problem solving\nProblem solving for innovations and inventions: TRIZ\n\n\n== Characteristics of complex problems ==\nComplex problem solving (CPS) is distinguishable from simple problem solving (SPS). When dealing with SPS there is a singular and simple obstacle in the way. But CPS comprises one or more obstacles at a time. In a real-life example, a surgeon at work has far more complex problems than an individual deciding what shoes to wear. As elucidated by Dietrich Dörner, and later expanded upon by Joachim Funke, complex problems have some typical characteristics as follows:\nComplexity (large numbers of items, interrelations and decisions)\nenumerability\nheterogeneity\nconnectivity (hierarchy relation, communication relation, allocation relation)\nDynamics (time considerations)\ntemporal constraints\ntemporal sensitivity\nphase effects\ndynamic unpredictability\nIntransparency (lack of clarity of the situation)\ncommencement opacity\ncontinuation opacity\nPolytely (multiple goals)inexpressivenes\nopposition\ntransience\n\n\n== Collective problem solving ==\n\nProblem solving is applied on many different levels − from the individual to the civilizational. Collective problem solving refers to problem solving performed collectively.\nSocial issues and global issues can typically only be solved collectively.\nIt has been noted that the complexity of contemporary problems has exceeded the cognitive capacity of any individual and requires different but complementary expertise and collective problem solving ability.Collective intelligence is shared or group intelligence that emerges from the collaboration, collective efforts, and competition of many individuals.\nCollaborative problem solving is about people working together face-to-face or in online workspaces with a focus on solving real world problems. These groups are made up of members that share a common concern, a similar passion, and/or a commitment to their work. Members are willing to ask questions, wonder, and try to understand common issues. They share expertise, experiences, tools, and methods. These groups can be assigned by instructors, or may be student regulated based on the individual student needs. The groups, or group members, may be fluid based on need, or may only occur temporarily to finish an assigned task. They may also be more permanent in nature depending on the needs of the learners. All members of the group must have some input into the decision making process and have a role in the learning process. Group members are responsible for the thinking, teaching, and monitoring of all members in the group. Group work must be coordinated among its members so that each member makes an equal contribution to the whole work. Group members must identify and build on their individual strengths so that everyone can make a significant contribution to the task. Collaborative groups require joint intellectual efforts between the members and involve social interactions to solve problems together. The knowledge shared during these interactions is acquired during communication, negotiation, and production of materials. Members actively seek information from others by asking questions. The capacity to use questions to acquire new information increases understanding and the ability to solve problems. Collaborative group work has the ability to promote critical thinking skills, problem solving skills, social skills, and self-esteem. By using collaboration and communication, members often learn from one another and construct meaningful knowledge that often leads to better learning outcomes than individual work.In a 1962 research report, Douglas Engelbart linked collective intelligence to organizational effectiveness, and predicted that pro-actively 'augmenting human intellect' would yield a multiplier effect in group problem solving: \"Three people working together in this augmented mode [would] seem to be more than three times as effective in solving a complex problem as is one augmented person working alone\".Henry Jenkins, a key theorist of new media and media convergence draws on the theory that collective intelligence can be attributed to media convergence and participatory culture. He criticizes contemporary education for failing to incorporate online trends of collective problem solving into the classroom, stating \"whereas a collective intelligence community encourages ownership of work as a group, schools grade individuals\". Jenkins argues that interaction within a knowledge community builds vital skills for young people, and teamwork through collective intelligence communities contributes to the development of such skills.Collective impact is the commitment of a group of actors from different sectors to a common agenda for solving a specific social problem, using a structured form of collaboration.\nAfter World War II the UN, the Bretton Woods organization and the WTO were created; collective problem solving on the international level crystallized around these three types of organizations from the 1980s onward. As these global institutions remain state-like or state-centric it has been called unsurprising that these continue state-like or state-centric approaches to collective problem-solving rather than alternative ones.Crowdsourcing is a process of accumulating the ideas, thoughts or information from many independent participants, with aim to find the best solution for a given challenge. Modern information technologies allow for massive number of subjects to be involved as well as systems of managing these suggestions that provide good results. With the Internet a new capacity for collective, including planetary-scale, problem solving was created.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nCollaborative & Proactive Solutions\n\"The Collaborative Problem Solving® (CPS) Approach\". Think:Kids – Collaborative Problem Solving®. Archived from the original on June 11, 2013. Retrieved 2018-08-10. Collaborative Problem Solving approach is applicable to diverse human interactions, but especially those that can result in conflict. Our CPS model can be applied to interactions between classmates, siblings, couples, parents and teachers, and employees and supervisors. The Collaborative Problem Solving approach was originated by Dr. Ross Greene. He now refers to his model as Collaborative & Proactive Solutions, is no longer associated in any way with organizations or individuals marketing the product now called Collaborative Problem Solving, and does not endorse what they have done with his work."}