{"topic": "Biophysics", "english_title": "Biophysics", "english": "Biophysics is an interdisciplinary science that applies approaches and methods traditionally used in physics to study biological phenomena. Biophysics covers all scales of biological organization, from molecular to organismic and populations. Biophysical research shares significant overlap with biochemistry, molecular biology, physical chemistry, physiology, nanotechnology, bioengineering, computational biology, biomechanics, developmental biology and systems biology.\nThe term biophysics was originally introduced by Karl Pearson in 1892. Ambiguously, the term biophysics is also regularly used in academia to indicate the study of the physical quantities (e.g. electric current, temperature, stress, entropy) in biological systems, which is, by definition, performed by physiology. Nevertheless, other biological sciences also perform research on the biophysical properties of living organisms including molecular biology, cell biology, chemical biology, and biochemistry.\n\n\n== Overview ==\nMolecular biophysics typically addresses biological questions similar to those in biochemistry and molecular biology, seeking to find the physical underpinnings of biomolecular phenomena. Scientists in this field conduct research concerned with understanding the interactions between the various systems of a cell, including the interactions between DNA, RNA and protein biosynthesis, as well as how these interactions are regulated. A great variety of techniques are used to answer these questions.\n\nFluorescent imaging techniques, as well as electron microscopy, x-ray crystallography, NMR spectroscopy, atomic force microscopy (AFM) and small-angle scattering (SAS) both with X-rays and neutrons (SAXS/SANS) are often used to visualize structures of biological significance. Protein dynamics can be observed by neutron spin echo spectroscopy. Conformational change in structure can be measured using techniques such as dual polarisation interferometry, circular dichroism, SAXS and SANS. Direct manipulation of molecules using optical tweezers or AFM, can also be used to monitor biological events where forces and distances are at the nanoscale. Molecular biophysicists often consider complex biological events as systems of interacting entities which can be understood e.g. through statistical mechanics, thermodynamics and chemical kinetics. By drawing knowledge and experimental techniques from a wide variety of disciplines, biophysicists are often able to directly observe, model or even manipulate the structures and interactions of individual molecules or complexes of molecules.\nIn addition to traditional (i.e. molecular and cellular) biophysical topics like structural biology or enzyme kinetics, modern biophysics encompasses an extraordinarily broad range of research, from bioelectronics to quantum biology involving both experimental and theoretical tools. It is becoming increasingly common for biophysicists to apply the models and experimental techniques derived from physics, as well as mathematics and statistics, to larger systems such as tissues, organs, populations and ecosystems. Biophysical models are used extensively in the study of electrical conduction in single neurons, as well as neural circuit analysis in both tissue and whole brain.\nMedical physics, a branch of biophysics, is any application of physics to medicine or healthcare, ranging from radiology to microscopy and nanomedicine. For example, physicist Richard Feynman theorized about the future of nanomedicine. He wrote about the idea of a medical use for biological machines (see nanomachines). Feynman and Albert Hibbs suggested that certain repair machines might one day be reduced in size to the point that it would be possible to (as Feynman put it) \"swallow the doctor\". The idea was discussed in Feynman's 1959 essay There's Plenty of Room at the Bottom.\n\n\n== History ==\nSome of the earlier studies in biophysics were conducted in the 1840s by a group known as the Berlin school of physiologists. Among its members \nwere pioneers such as Hermann von Helmholtz, Ernst Heinrich Weber, Carl F. W. Ludwig, and Johannes Peter Müller. Biophysics might even be seen as dating back to the studies of Luigi Galvani.\nThe popularity of the field rose when the book What Is Life? by Erwin Schrödinger was published. Since 1957, biophysicists have organized themselves into the Biophysical Society which now has about 9,000 members over the world.Some authors such as Robert Rosen criticize biophysics on the ground that the biophysical method does not take into account the specificity of biological phenomena.\n\n\n== Focus as a subfield ==\nWhile some colleges and universities have dedicated departments of biophysics, usually at the graduate level, many do not have university-level biophysics departments, instead having groups in related departments such as biochemistry, cell biology, chemistry, computer science, engineering, mathematics, medicine, molecular biology, neuroscience, pharmacology, physics, and physiology.  Depending on the strengths of a department at a university differing emphasis will be given to fields of biophysics.  What follows is a list of examples of how each department applies its efforts toward the study of biophysics. This list is hardly all inclusive. Nor does each subject of study belong exclusively to any particular department. Each academic institution makes its own rules and there is much overlap between departments.\nBiology and molecular biology – Gene regulation, single protein dynamics, bioenergetics, patch clamping, biomechanics, virophysics.\nStructural biology – Ångstrom-resolution structures of proteins, nucleic acids, lipids, carbohydrates, and complexes thereof.\nBiochemistry and chemistry – biomolecular structure, siRNA, nucleic acid structure, structure-activity relationships.\nComputer science – Neural networks, biomolecular and drug databases.\nComputational chemistry – molecular dynamics simulation, molecular docking, quantum chemistry\nBioinformatics – sequence alignment, structural alignment, protein structure prediction\nMathematics –  graph/network theory, population modeling, dynamical systems, phylogenetics.\nMedicine –  biophysical research that emphasizes medicine. Medical biophysics is a field closely related to physiology. It explains various aspects and systems of the body from a physical and mathematical perspective. Examples are fluid dynamics of blood flow, gas physics of respiration, radiation in diagnostics/treatment and much more. Biophysics is taught as a preclinical subject in many medical schools, mainly in Europe.\nNeuroscience – studying neural networks experimentally (brain slicing) as well as theoretically (computer models), membrane permittivity, gene therapy, understanding tumors.\nPharmacology and physiology – channelomics, biomolecular interactions, cellular membranes, polyketides.\nPhysics – negentropy, stochastic processes, and the development of new physical techniques and instrumentation as well as their application.\nQuantum biology – The field of quantum biology applies quantum mechanics to biological objects and problems. Decohered isomers to yield time-dependent base substitutions. These studies imply applications in quantum computing.\nAgronomy and agricultureMany biophysical techniques are unique to this field. Research efforts in biophysics are often initiated by scientists who were biologists, chemists or physicists by training.\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Sources ===\n\n\n== External links ==\nBiophysical Society\nJournal of Physiology: 2012 virtual issue Biophysics and Beyond\nbio-physics-wiki\nLink archive of learning resources for students: biophysika.de (60% English, 40% German)"}