{"topic": "Occupational", "english_title": "Job", "english": "A job, employment, work or occupation, is a person's role in society.  More specifically, a job is an activity, often regular and often performed in exchange for payment (\"for a living\"). Many people have multiple jobs (e.g., parent, homemaker, and employee).  A person can begin a job by becoming an employee, volunteering, starting a business, or becoming a parent. The duration of a job may range from temporary (e.g., hourly odd jobs) to a lifetime (e.g., judges).\nAn activity that requires a person's mental or physical effort is work (as in \"a day's work\"). If a person is trained for a certain type of job, they may have a profession. Typically, a job would be a subset of someone's career. The two may differ in that one usually retires from their career, versus resignation or termination from a job.\n\n\n== Jobs for people ==\nMost people spend up to forty or more hours each week in paid employment.  Some exceptions are children, retirees, and people with disabilities; however, within these groups, many will work part-time, volunteer, or work as a homemaker.  From the age of 5 or so, many children's primary role in society (and therefore their \"job\") is to learn and study as a student.\n\n\n== Types of jobs ==\nJobs can be categorized by intensity (hours per week), by payment status, or by the level of experience required. The types of job stemming from intensity are categorized as full-time or part-time. They can also be classified into temporary, odd jobs, seasonal, self-employment, consulting, or contract employment. Regarding payment status, jobs are categorized as paid or unpaid.  Examples of unpaid jobs include volunteer, homemaker, mentor, student, and sometimes intern. Finally, according to the level of experience required, jobs are usually grouped as entry level, intern, and co-op.\nSome jobs require specific training or an academic degree.\nThose without paid full-time employment may be categorized as unemployed or underemployed if they are seeking a full-time paid job.\nA side job, also called a side hustle, side gig or moonlighting, is an additional job or jobs to supplement one's income. A person with a side job may have little time left for sleep or leisure activities.\nThe Office for National Statistics in the United Kingdom lists 27,966 different job titles, within a website published 2015.\n\n\n=== Day job ===\nThe expression day job is often used for a job one works in order to make ends meet rather than working in their preferred vocation. Archetypal examples of this are the actor who works as a waiter (the day job) while looking for roles, and the professional athlete who works as a laborer in the offseason because the athlete's professional or semi-professional team does not pay a full living. The term is also applied to those who maintain a steady occupation while working as a day trader.While many people do hold a full-time occupation, \"day job\" specifically refers to those who hold the position solely to pay living expenses so they can pursue the job they really want (which may also be during the day).  The phrase strongly implies that the day job would be quit, if only the real vocation paid a living wage.\nThe phrase \"don't quit your day job\" is a humorous response to a poor or mediocre performance not up to professional caliber. The phrase implies that the performer is not talented enough in that activity to be able to make a career out of it.\n\n\n=== Getting a job ===\n\nGetting a first job is an important rite of passage in many cultures. The youth may start by doing household work, odd jobs, or working for a family business. In many countries, school children get summer jobs during the longer summer vacation. Students enrolled in higher education can apply for internships or coops to further enhance the probability of securing an entry level job upon graduation.\nRésumés summarize a person's education and job experience for potential employers. Employers read job candidate résumés to decide whom to interview for an open position.\n\n\n=== Use of the word ===\nWorkers often talk of \"getting a job\", or \"having a job\". This conceptual metaphor of a \"job\" as a possession has led to its use in slogans such as \"money for jobs, not bombs\". Similar conceptions are that of \"land\" as a possession (real estate) or intellectual rights as a possession (intellectual property).\n\n\n== Occupation and life expectancy ==\nHistorically, manual work has seemed to contribute to shortening one's lifespan. High rank (a higher position at the pecking order) has a positive effect. Professions that cause anxiety have a direct negative impact on health and lifespan. Some data is more complex to interpret due to the various reasons of long life expectancy; thus skilled professionals, employees with secure jobs and low anxiety occupants may live a long life for variant reasons. The more positive characteristics one's job is, the more likely he or she will have a longer lifespan. Gender, country, and statistically confirmed danger are also notable parameters.\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\nDavis, Steven; Haltiwanger, John; Schuh, Scott (1998), Job Creation and Destruction, MIT Press, ISBN 978-0-262-54093-3\nGraeber, David (2018). Bullshit Jobs: A Theory. Simon & Schuster. ISBN 978-1501143311.\nGranovetter, Mark (1995), Getting a Job: A Study of Contacts and Careers, University of Chicago Press, ISBN 978-0-226-30581-3\nJoshel, Sandra (1992), Work, Identity, and Legal Status at Rome: A Study of the Occupational Inscriptions, University of Oklahoma Press, ISBN 978-0-8061-2444-5\nKranzberg, Melvin; Gies, Joseph (1986), By the Sweat of Thy Brow: Work in the Western World, Greenwood Press, ISBN 978-0-313-25323-2\nMiller, Ann Ratner; Treiman, Donald; Cain, Pamela; Roos, Pamela (1980), Work, Jobs, and Occupations: a critical review of the Dictionary of Occupational Titles, National Academy Press\nOrr, Julian Edgerton (1996), Talking about Machines: An Ethnography of a Modern Job, Cornell University Press, ISBN 978-0-8014-8390-5\nRobinson, Tony; Willcock, David (2005), The Worst Jobs in History: Two Thousand Years of Miserable Employment, Pan Macmillan, ISBN 978-0-330-43857-5\nRoebuck, Carl (1969), The Muses at Work: arts, crafts, and professions in ancient Greece and Rome, MIT Press\nMorse, Nancy; Weiss, Robert (1955). \"The Function and Meaning of Work and the Job\". American Sociological Review. 20 (2): 191–198. doi:10.2307/2088325. JSTOR 2088325.\n\n\n== External links ==\n Media related to Jobs at Wikimedia Commons"}