{"topic": "enforcement", "english_title": "Enforcement", "english": "Enforcement is the process of ensuring compliance with laws, regulations, rules, standards, and social norms.Governments attempt to effectuate successful implementation of policies by enforcing laws and regulations.\nEnactment refers to application of a law or regulation, or carrying out of an executive or judicial order.\n\n\n== Theories of enforcement ==\nEnforcement serves a number of functions; the enforcement of social norms can ensure conformity within insular communities, the enforcements of laws can maximize social benefits and protect the public interest, and enforcement may also serve the self-interest of the institutions that oversee enforcement. Enforcement can be effectuated by both public institutions and private, non-governmental actors. Enforcement is often accomplished through coercive means or by utilizing power disparities to constrain action. Some scholars, such as Kate Andrias, have also argued that institutions enforce rules when deciding \"when and how to apply\" laws and regulations.\n\n\n=== Delegation of enforcement powers ===\nSome governments will delegate enforcement powers to subordinate governmental entities or private parties. In the United States, for example, the federal government and state governments often delegate a range of enforcement powers to administrative agencies. There has been considerable debate in legal scholarship about the degree to which governments should oversee and supervise institutions to which enforcement powers have been delegated.\n\n\n== Selective enforcement ==\n\nInstitutions may choose to exercise discretion, thereby enforcing laws, regulations, or norms only in selective circumstances. Some scholars, such as Joseph H. Tieger, have suggested that selective enforcement is inherent component of all enforcement regimes, because it is impossible for enforcers to observe and catch every violation. Other scholars, such as Margaret H. Lemos and Alex Stein, have suggested that \"strategic\" enforcement is a cost-effective method of achieving social benefits; by focusing enforcement on the worst violators, other violators will \"downscale\" their activities so that they do not appear to be the worst offender.\n\n\n== See also ==\nLaw enforcement\nPrimary and secondary legislation\n\n\n== References ==\nThe citations in this article are written in Bluebook style. Please see the talk page for more information."}