{"topic": "Individual", "english_title": "Individual", "english": "An individual is that which exists as a distinct entity. Individuality (or self-hood) is the state or quality of being an individual; particularly of being a person unique from other people and possessing one's own needs or goals, rights and responsibilities. The concept of an individual features in diverse fields, including biology, law, and philosophy.\n\n\n== Etymology ==\nFrom the 15th century and earlier (and also today within the fields of statistics and metaphysics) individual meant \"indivisible\", typically describing any numerically singular thing, but sometimes meaning \"a person\". From the 17th century on, individual has indicated separateness, as in individualism.\n\n\n== Law ==\nAlthough individuality and individualism are commonly considered to mature with age/time and experience/wealth, a sane adult human being is usually considered by the state as an \"individual person\" in law, even if the person denies individual culpability (\"I followed instructions\").\nAn individual person is accountable for their actions/decisions/instructions, subject to prosecution in both national and international law, from the time that they have reached age of majority, often though not always more or less coinciding with the granting of voting rights, responsibility for paying tax, military duties, and the individual right to bear arms (protected only under certain constitutions).\n\n\n== Philosophy ==\n\n\n=== Buddhism ===\nIn Buddhism, the concept of the individual lies in anatman, or \"no-self.\" According to anatman, the individual is really a series of interconnected processes that, working together, give the appearance of being a single, separated whole. In this way, anatman, together with anicca, resembles a kind of bundle theory. Instead of an atomic, indivisible self distinct from reality, the individual in Buddhism is understood as an interrelated part of an ever-changing, impermanent universe (see Interdependence, Nondualism, Reciprocity).\n\n\n=== Empiricism ===\nEarly empiricists such as Ibn Tufail  in early 12th century Islamic Spain, and John Locke in late 17th century England, introduced the idea of the individual as a tabula rasa (\"blank slate\"), shaped from birth by experience and education. This ties into the idea of the liberty and rights of the individual, society as a social contract between rational individuals, and the beginnings of individualism as a doctrine.\n\n\n=== Hegel ===\nGeorg Wilhelm Friedrich Hegel regarded history as the gradual evolution of Mind as it tests its own concepts against the external world. Each time the mind applies its concepts to the world, the concept is revealed to be only partly true, within a certain context; thus the mind continually revises these incomplete concepts so as to reflect a fuller reality (commonly known as the process of thesis, antithesis, and synthesis). The individual comes to rise above their own particular viewpoint, and grasps that they are a part of a greater whole insofar as they are bound to family, a social context, and/or a political order.\n\n\n=== Existentialism ===\nWith the rise of existentialism, Søren Kierkegaard rejected Hegel's notion of the individual as subordinated to the forces of history. Instead, he elevated the individual's subjectivity and capacity to choose their own fate. Later Existentialists built upon this notion.  Friedrich Nietzsche, for example, examines the individual's need to define his/her own self and circumstances in his concept of the will to power and the heroic ideal of the Übermensch. The individual is also central to Sartre's philosophy, which emphasizes individual authenticity, responsibility, and free will. In both Sartre and Nietzsche (and in Nikolai Berdyaev), the individual is called upon to create their own values, rather than rely on external, socially imposed codes of morality.\n\n\n=== Objectivism ===\nAyn Rand's Objectivism regards every human as an independent, sovereign entity who possesses an inalienable right to their own life, a right derived from their nature as a rational being. Individualism and Objectivism hold that a civilized society, or any form of association, cooperation or peaceful coexistence among humans, can be achieved only on the basis of the recognition of individual rights — and that a group, as such, has no rights other than the individual rights of its members. The principle of individual rights is the only moral base of all groups or associations. Since only an individual man or woman can possess rights, the expression \"individual rights\" is a redundancy (which one has to use for purposes of clarification in today's intellectual chaos), but the expression \"collective rights\" is a contradiction in terms. Individual rights are not subject to a public vote; a majority has no right to vote away the rights of a minority; the political function of rights is precisely to protect minorities from oppression by majorities (and the smallest minority on earth is the individual).\n\n\n== Biology ==\nIn biology, the question of the individual is related to the definition of an organism, which is an important question in biology and philosophy of biology, despite there having been little work devoted explicitly to this question. An individual organism is not the only kind of individual that is considered as a \"unit of selection\". Genes, genomes, or groups may function as individual units.Asexual reproduction occurs in some colonial organisms so that the individuals are genetically identical. Such a colony is called a genet, and an individual in such a population is referred to as a ramet. The colony, rather than the individual, functions as a unit of selection. In other colonial organisms the individuals may be closely related to one another but differ as a result of sexual reproduction.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nGracie, Jorge J. E. (1988) Individuality: An Essay on the Foundations of Metaphysics. State University of New York Press.\nKlein, Anne Carolyn (1995) Meeting the Great Bliss Queen: Buddhists, Feminists, and the Art of the Self. ISBN 0-8070-7306-7."}