{"topic": "Sex", "english_title": "Sex", "english": "Sex is a trait that determines an individual's reproductive function, male or female, in animals and plants that propagate their species through sexual reproduction. Sexual reproduction involves the recombination of genes by meiosis followed by the formation of specialized haploid cells known as gametes.  Pairs of gametes fuse to form diploid zygotes that develop into offspring that inherit a selection of the traits of each parent. The type of gametes produced by an organism defines its sex. Commonly in plants and animals, male organisms produce smaller gametes (spermatozoa,  sperm) while female organisms produce larger gametes (ova, often called egg cells). Organisms that produce both types of gametes are called hermaphrodites.Male and female individuals of a species may be similar, or have physical differences (sexual dimorphism). The differences reflect the different reproductive pressures the sexes experience. For instance, mate choice and sexual selection can accelerate the evolution of physical differences between the sexes.\nThe terms \"male\" and \"female\" typically do not apply in sexually undifferentiated species in which the parents are isomorphic and the gametes are isogamous (indistinguishable in size and morphology), such as the green alga Ulva lactuca. If there are instead functional differences between gametes, such as with fungi, they may be referred to as mating types.Sex is determined by a variety of processes. Most mammals have the XY sex-determination system, where male mammals carry an X and a Y chromosome (XY), whereas female mammals carry two X chromosomes (XX). Other sex-determination systems in animals include the ZW system in birds, the X0 system in insects, and various environmental systems, such as those of reptiles and crustaceans.\n\n\n== Evolution ==\n\n\n=== Evolution of sex ===\n\nGametes may be externally similar (isogamy), or may differ in size and other aspects (anisogamy). An example of anisogamy is where the female gamete is non-motile and the male gamete is motile (oogamy). Anisogamy most likely evolved from isogamy, but its evolution has left no fossil evidence. An intermediate gamete is unable to persist in anisogamous species due to disruptive selection, leading to only two gamete sizes. The evolution of anisogamy is viewed as the origin of male and female sexes.However, mating types probably did not directly lead to separate sexes in plants and animals. There is also an emerging consensus that sex does not have a single evolutionary cause.\n\n\n=== Evolution of sex determination ===\nChromosomal sex determination may have evolved early in the history of eukaryotes. No genes are shared between the avian ZW and mammal XY chromosomes and the chicken Z chromosome is similar to the human autosomal chromosome 9, rather than X or Y. This suggests not that the ZW and XY sex-determination systems share an origin but that the sex chromosomes are derived from autosomal chromosomes of the common ancestor of birds and mammals. A paper from 2004 compared the chicken Z chromosome with platypus X chromosomes and suggested that the two systems are related.\n\n\n=== Evolution of sexual reproduction ===\n\nSome bacteria, including Escherichia coli, use conjugation to transfer genetic material between cells. While not the same as sexual reproduction, this also results in the mixing of genetic traits.  Sexual reproduction probably first evolved about a billion years ago in early single-celled eukaryotes or their prokaryotic ancestors. The reason for the evolution of sex, and the reason(s) it has survived to the present, are still under investigation. Some of the many hypotheses are that it produces variation among offspring, helps in the spread of advantageous traits, helps in the removal of disadvantageous traits and facilitates repair of germ-line DNA.\n\n\n== Sexual reproduction ==\n \n\nSexual reproduction in eukaryotes produces offspring that inherit a selection of the genetic traits from both parents. Chromosomes are passed on from one generation to the next in this process. Each cell in the offspring has half the chromosomes of the mother and half of the father. The codes for genetic traits are contained within the deoxyribonucleic acid (DNA) of chromosomes. By combining one of each type of chromosome from each parent, an organism is formed containing a double set of chromosomes. This double-chromosome stage is called \"diploid\" while the single-chromosome stage is \"haploid\". Diploid organisms can, in turn, form haploid cells (gametes) that randomly contain one of each of the chromosome pairs, via meiosis. Meiosis also involves a stage of chromosomal crossover in which regions of DNA are exchanged between matched types of chromosomes, to form a new pair of mixed chromosomes, each of which is a blend of parental genes. This process is followed by a mitotic division, producing haploid gametes that contain one set of chromosomes. Crossing over to make new recombinant chromosomes and fertilization (the fusion of two gametes) result in the new organism containing a different set of genetic traits from either parent.\nIn the life cycle of many multicellular organisms, there is no multicellular haploid phase and the gametes are the only haploid cells, specialized to recombine to form a diploid zygote that develops into a new multicellular diploid organism. In the life-cycle of plants and algae, diploid and haploid multicellular phases alternate. The diploid organism is called the sporophyte because it produces haploid spores by meiosis, which, on germination, undergo mitotic cell division to produce multicellular haploid organisms as gametophytes.Isogamy is very common in unicellular organisms while anisogamy is common in multicellular organisms. An individual that produces exclusively large gametes is female, and one that produces exclusively small gametes is male. An individual that produces both types of gametes is a hermaphrodite. Some hermaphrodites, particularly hermaphroditic plants, are able to self-fertilize and produce offspring on their own, without a second organism. However, some hermaphrodite animals such as Helix pomatia and Cepaea cannot self fertilize.\n\n\n=== Animals ===\n\nSexually reproducing animals are diploid, and their single-celled gametes are the only haploid cells in their life cycles. The gametes of animals have male and female forms—spermatozoa and egg cells. During fertilization, the gametes combine to form diploid zygotes that develop into embryos, which in turn develop into new organisms. Animals are usually mobile and seek out a partner of the opposite sex for mating.\nA spermatozoon (produced in vertebrates within the testes), is a small cell containing a single long flagellum which propels it. Spermatozoa are extremely reduced cells, lacking many cellular components that would be necessary for embryonic development. They are specialized for motility, seeking out and fertilizing an egg cell.\nEgg cells are produced within the ovaries. They are large, immobile cells that contain the nutrients necessary for a developing embryo. Egg cells are often associated with other cells which support the development of the embryo, forming an egg. \nAll animals that live outside of water use internal fertilization to transfer sperm directly into the female, thereby preventing the gametes from drying up. In many other terrestrial animals, males use specialized organs called intromittent organs to assist the transport of sperm.\n\n\n==== Mammals ====\nAll mammals (except Monotremes) are viviparous, where the fertilized egg develops into an embryo within the female, receiving nutrition directly from its mother. In humans and other mammals the equivalent male organ is the penis, which enters the female reproductive tract (called the vagina) to achieve insemination in a process called sexual intercourse. The penis contains a tube through which semen (a fluid containing sperm) travels. In female mammals the vagina connects with the uterus, an organ which directly supports the development of a fertilized embryo within, a process called gestation.\n\n\n==== Birds ====\nIn most birds, both excretion and reproduction are done through a single posterior opening called the cloaca. Male and female birds touch cloacae to transfer sperm, a process called \"cloacal kissing\".\n\n\n==== Aquatic animals ====\n\nMost animals that live in the water such as fish and corals mate using external fertilization, where the eggs and sperm are released into, and combine within, the surrounding water. However, some species like crustaceans use internal fertilization.  In seahorses, females use their ovipositors to deliver eggs into the males’ underside for fertilization and gestation. Pipefish and seahorses are the only species that entail male pregnancy.\n\n\n==== Insects ====\n\nMost insects reproduce through oviparity, where a female mates with a male and the females lays the egg outside of her body. A few groups of insects such as the Strepsiptera reproduce through traumatic insemination, where a male pierces a female's exoskeleton with his aedeagus. In some harvester ants, a queen needs to mate with two types of males: one to reproduce queens and another to reproduce worker ants. Some biologists say harvester ants could be deemed to have four or three sexes.\n\n\n=== Plants ===\n\nIn the green seaweed genus Ulva, there is no sexual specialization among the isomorphic individual plants, their sexual organs, or their isogamous gametes. However, the majority of plants and animals have specialized male and female gametes.The male gametes are the only cells in plants and green algae that contain flagella. They are motile, able to swim to the egg cells of female gametophyte plants in films of water. Seed plants other than Cycads and Ginkgo have lost flagella entirely. Once their pollen is delivered to the stigma of flowering plants, or the micropyle of gymnosperm ovules, their gametes are delivered to the egg cell by means of pollen tubes produced by one of the cells of the microgametophyte. Many plants, including conifers and grasses, are anemophilous producing lightweight pollen which is carried by wind to neighboring plants. Other plants, such as orchids, have heavier, sticky pollen that is specialized for zoophily, transportation by animals. Plants attract insects or larger animals such as humming birds and bats with nectar-containing flowers. These animals transport the pollen as they move to other flowers, which also contain female reproductive organs, resulting in pollination.\n\n\n==== Spermatophytes ====\nIn seed plants, male gametes are produced by extremely reduced multicellular microgametophytes known as pollen. The female gametes (egg cells) of seed plants are produced by larger megagametophytes contained within ovules. Once the egg cells are fertilized by male gametes produced by pollen, the ovules develop into seeds which, like eggs, contain the nutrients necessary for the initial development of the embryonic plant.\n\n\n==== Conifers ====\n\nIn pines and other conifers, the sex organs are contained in the cones. The female cones (seed cones) produce seeds and male cones (pollen cones) produce pollen. The female cones are longer lived and typically much larger and more durable. The ovules attached to the cone scales are not enclosed in an ovary, giving rise to the name gymnosperm meaning 'naked seed'. The smaller male cones produce pollen which is transported by wind to land in female cones. Naked seeds form after pollination, protected by the scales of the female cone.\n\n\n==== Angiosperms ====\n\nThe flowers in flowering plants contain their sexual organs. The majority of them are hermaphroditic and produce both male and female gametes on the same plant, most often from the same flowers.Monoecious flowers that contain both male and female sexual organs are said to be perfect.  Angiosperms may also have imperfect flowers that lack one or other type of sex organs. Sometimes, as in the tree of heaven, Ailanthus altissima the panicles can contain a mixture of functionally unisexual flowers and functionally bisexual flowers.The female parts in the flower, are the pistils, composed of one or more carpels. Carpels consist of an ovary, a style and a stigma. The male parts of the flower are the stamens, which consist of the filaments supporting the anthers that produce the pollen.Within the angiosperm ovary are ovules, which contain haploid megagametophytes that produce egg cells. When a pollen grain lands upon the stigma on top of a carpel's style, it germinates to produce a pollen tube that grows down through the tissues of the style into the carpel, where it delivers male gamete nuclei to fertilize the egg cell in an ovule that eventually develops into a seed. At the same time the ovary develops into a fruit. Because flowering plants are immobile, they evolved flowers to attract animals to help in fertilization.\n\n\n=== Fungi ===\n\nMost fungi are able to reproduce sexually and asexually. They can have both haploid and diploid stages in their life cycles. Many fungi are typically isogamous, lacking male and female specialization. Even fungi that are anisogamous are all hermaphroditic.Fungi may have complex allelic mating systems and many species of fungi have two mating types. However, Coprinellus disseminatus  has been estimated to have about 123 mating types, and in some species there are even thousands of mating types. For example, Schizophyllum commune has about 28,000 or more mating types.Some fungi, including those used as baker's yeast, have mating types that create a duality similar to male and female roles. Yeast with the same mating type do not fuse to form diploid cells, only with yeast carrying another mating type.Many species of higher fungi produce mushrooms as part of their sexual reproduction. Within the mushroom diploid cells are formed, later dividing into haploid spores.\n\n\n=== Protozoa ===\nSexual reproduction is common among parasitic protozoa but rare among free-living protozoa, which usually reproduce asexually unless food is scarce or the environment changes drastically. Both anisogamy and isogamy are found in free-living protoza. Ciliates are all isogamous such as Tetrahymena thermophila, which has 7 mating types.\n\n\n== Sexual systems ==\nApproximately 95% of animal species are dioecious (also referred as gonochorism). In gonochoric species, individuals are either male or female throughout their lives. Gonochorism is very common in vertebrate species, with 99%  being gonochoric; the other 1% is hermaphroditic, with almost all of them being fishes. All birds and mammals including humans are gonochoric. Since only about 6% of flowering plants are dioecious, the majority are bisexual.\n\n\n=== Mixed mating systems ===\nAndrodioecy, gynodioecy, and trioecy are sometimes called mixed mating systems. The roundworm Caenorhabditis elegans has a hermaphrodite and a male sex - a system called androdioecy. The flowering plant Salvia pratensis is gynodioecious, where a species has females and hermaphrodites. Although rare, a species can have males, females, and hermaphrodites - a system called trioecy. Trioecy occurs in about 3.6% of flowering plants, such as Opuntia robusta and Fraxinus excelsior.\n\n\n== Sex determination ==\n\nThe biological cause for an organism developing into one sex or the other is called sex determination.  The cause may be genetic, environmental,  haplodiploidy, or by multiple factors.  Within animals and other organisms that have genetic sex determination systems, the determining factor may be the presence of a sex chromosome. In plants that are sexually dimorphic, such as the liverwort Marchantia polymorpha or the dioecious species in the flowering plant genus Silene, sex may be determined by sex chromosomes. Non-genetic systems may use environmental cues, such as the temperature during early development in crocodiles, to determine the sex of the offspring.Sex determination is often distinct from sex differentiation, sex determination is the designation for the development stage towards either male or female while sex differentiation is the pathway towards the development of the phenotype.\n\n\n=== Genetic ===\n\nIn genetic sex-determination systems, an organism's sex is determined by the genome it inherits. Genetic sex determination usually depends on asymmetrically inherited sex chromosomes carrying genetic features that influence development. Sex may be determined either by the presence of a sex chromosome or by the number of sex chromosomes the organism has. Genetic sex-determination, because it is determined by chromosome assortment, usually results in a 1:1 ratio of male and female offspring.\n\n\n==== XY sex determination ====\nHumans and most other mammals have an XY sex-determination system: the Y chromosome carries factors responsible for triggering male development, making XY sex determination mostly based on the presence or absence of the Y chromosome. It is the male gamete that determines the sex of the offspring. In this system XX mammals typically are female and XY typically are male. However, individuals with XXY or XYY are males, while individuals with X and XXX are females.XY sex determination is found in other organisms, including insects like the common fruit fly, and some plants. In some cases, it is the number of X chromosomes that determines sex rather than the presence of a Y chromosome. In the fruit fly individuals with XY are male and individuals with XX are female; however, individuals with XXY or XXX can also be female, and individuals with X can be males.\n\n\n==== ZW sex determination ====\nIn birds, which have a ZW sex-determination system, the opposite is true: the W chromosome carries factors responsible for female development, and default development is male. In this case, ZZ individuals are male and ZW are female. It is the female gamete that determines the sex of the offspring. This system is used by birds, some fish, and some crustaceans.The majority of butterflies and moths also have a ZW sex-determination system. In groups like the Lepidoptera, females can have Z, ZZW, and even ZZWW.In both XY and ZW sex determination systems, the sex chromosome carrying the critical factors is often significantly smaller, carrying little more than the genes necessary for triggering the development of a given sex.\n\n\n==== XO sex determination ====\nIn the X0 sex-determination system, males have one X chromosome (X0) while females have two (XX). All other chromosomes in these diploid organisms are paired, but organisms may inherit one or two X chromosomes. This system is found in most arachnids, insects such as silverfish (Apterygota), dragonflies (Paleoptera) and grasshoppers (Exopterygota), and some nematodes, crustaceans, and gastropods.In field crickets, for example, insects with a single X chromosome develop as male, while those with two develop as female.In the nematode Caenorhabditis elegans, most worms are self-fertilizing hermaphrodites with an XX karyotype, but occasional abnormalities in chromosome inheritance can give rise to individuals with only one X chromosome—these X0 individuals are fertile males (and half their offspring are male).\n\n\n==== ZO sex determination ====\nIn the Z0 sex-determination system, males have two Z chromosomes whereas females have one. This system is found in  several species of moths.\n\n\n=== Environmental ===\n\nFor many species, sex is not determined by inherited traits, but instead by environmental factors such as temperature experienced during development or later in life. \nThe bonelliidae larvae can only develop as males when they encounter a female.In the fern Ceratopteris and other homosporous fern species, the default sex is hermaphrodite, but individuals which grow in soil that has previously supported hermaphrodites are influenced by the pheromone antheridiogen to develop as male.\n\n\n==== Sequential hermaphroditism ====\n\nSome species can change sex over the course of their lifespan, a phenomenon called sequential hermaphroditism. Teleost fishes are the only vertebrate lineage where sequential hermaphroditism occurs. In clownfish, smaller fish are male, and the dominant and largest fish in a group becomes female; when a dominant female is absent, then her partner changes sex. In many wrasses the opposite is true—the fish are initially female and become male when they reach a certain size. Sequential hermaphroditism also occurs in plants such as Arisaema triphyllum.\n\n\n==== Temperature-dependent sex determination ====\nMany reptiles, including all crocodiles and  most turtles, have temperature-dependent sex determination. In these species, the temperature experienced by the embryos during their development determines their sex. In some turtles, for example, males are produced at lower temperatures than females; but Macroclemys females are produced at temperatures lower than 22 °C or above   28 °C, while males are produced in between those temperatures.\n\n\n==== Haplodiploidy ====\nOther insects, including honey bees and ants, use a haplodiploid sex-determination system. Diploid bees and ants are generally female, and haploid individuals (which develop from unfertilized eggs) are male. This sex-determination system results in highly biased sex ratios, as the sex of offspring is determined by fertilization (arrhenotoky or pseudo-arrhenotoky resulting in males) rather than the assortment of chromosomes during meiosis.\n\n\n== Sex differences ==\nBiologists agree that gamete size is the main difference between the male and female sexes. It has even been said that all the differences between the sexes stem from the differences in the gametes.Sex differences in humans include a generally larger size and more body hair in men, while women have larger breasts, wider hips, and a higher body fat percentage. In other species, there may be differences in coloration or other features.\n\n\n=== Sex characteristics ===\nPrimary sex characteristics are structures directly involved in reproduction such as the testes or ovaries, while secondary sex characteristics in humans for example are body hair, breasts, and distribution of fat.In some species, a few individuals may have a mixture of characteristics from both sexes. This can be caused by extra sex chromosomes or by a hormonal abnormality during fetal development. The term intersex typically applies to  abnormal members of gonochoric species rather than to hermaphroditic species. Some species can have gynandromorphs.\n\n\n=== Sexual dimorphism ===\n\nIn many animals and some plants, individuals of male and female sex differ in size and appearance, a phenomenon called sexual dimorphism. Sexual dimorphism in animals is often associated with sexual selection—the mating competition between individuals of one sex vis-à-vis the opposite sex. In many cases, the male of a species is larger than the female. Mammal species with extreme sexual size dimorphism tend to have highly polygynous mating systems—presumably due to selection for success in competition with other males—such as the elephant seals. Other examples demonstrate that it is the preference of females that drives sexual dimorphism, such as in the case of the stalk-eyed fly.Females are the larger sex in a majority of animals. For instance, female southern black widow spiders are typically twice as long as the males. This size disparity may be associated with the cost of producing egg cells, which requires more nutrition than producing sperm: larger females are able to produce more eggs.Sexual dimorphism can be extreme, with males, such as some anglerfish, living parasitically on the female. Some plant species also exhibit dimorphism in which the females are significantly larger than the males, such as in the moss Dicranum and the liverwort Sphaerocarpos. There is some evidence that, in these genera, the dimorphism may be tied to a sex chromosome, or to chemical signalling from females.In birds, males often have a more colourful appearance and may have features (like the long tail of male peacocks) that would seem to put the organism at a disadvantage (e.g. bright colors would seem to make a bird more visible to predators). One proposed explanation for this is the handicap principle. This hypothesis says that, by demonstrating he can survive with such handicaps, the male is advertising his genetic fitness to females—traits that will benefit daughters as well, who will not be encumbered with such handicaps.\n\n\n== See also ==\nSex and gender distinction\nSex assignment\nMating types\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\n\nHuman Sexual Differentiation Archived 9 February 2010 at the Wayback Machine by P. C. Sizonenko"}