{"topic": "Industrialisation", "english_title": "Industrialisation", "english": "Industrialisation (or industrialization) is the period of social and economic change that transforms a human group from an agrarian society into an industrial society. This involves an extensive re-organisation of an economy for the purpose of manufacturing. Historically industrialization is associated with increase of polluting industries heavily dependent on fossil fuels;  however, with the increasing focus on sustainable development and green industrial policy practices, industrialization increasingly includes technological leapfrogging, with direct investment in more advanced, cleaner technologies.\nThe reorganization of the economy has many unintended consequences both economically and socially. As industrial workers' incomes rise, markets for consumer goods and services of all kinds tend to expand and provide a further stimulus to industrial investment and economic growth.  Moreover, family structures tend to shift as extended families tend to no longer live together in one household,location or place.\n\n\n== Background ==\n\nAfter the last stage of the Proto-industrialization, the first transformation from an agricultural to an industrial economy is known as the Industrial Revolution and took place from the mid-18th to early 19th century in certain areas in Europe and North America; starting in Great Britain, followed by Belgium, Switzerland, Germany, and France. Characteristics of this early industrialisation were technological progress, a shift from rural work to industrial labor, financial investments in new industrial structure, and early developments in class consciousness and theories related to this. Later commentators have called this the First Industrial Revolution.The \"Second Industrial Revolution\" labels the later changes that came about in the mid-19th century after the refinement of the steam engine, the invention of the internal combustion engine, the harnessing of electricity and the construction of canals, railways and electric-power lines. The invention of the assembly line gave this phase a boost.\nCoal mines, steelworks, and textile factories replaced homes as the place of work.\nBy the end of the 20th century, East Asia had become one of the most recently industrialised regions of the world. The BRICS states (Brazil, Russia, India, China and South Africa) are undergoing the process of industrialisation.There is considerable literature on the factors facilitating industrial modernisation and enterprise development.\n\n\n== Industrialization in East Asia ==\nBetween the early 1960s and 1990s, the Four Asian Tigers underwent rapid industrialization and maintained exceptionally high growth rates.\n\n\n== Social consequences ==\nThe Industrial revolution was accompanied with a great deal of changes on the social structure, the main change being a transition from farm work to factory related activities. This resulted to the creation of a class structure that differentiated the commoners from the well off and the working category.It distorted the family system as most people moved into cities and left the farm areas, consequently playing a major role in the transmission of diseases. The place of women in the society then shifted from being home cares to employed workers hence reducing the number of children per household. Furthermore industrialization contributed to increased cases of child labor and thereafter education systems.\n\n\n=== Urbanisation ===\n\nAs the Industrial Revolution was a shift from the agrarian society, people migrated from villages in search of jobs to places where factories were established. This shifting of rural people led to urbanisation and increase in the population of towns. The concentration of labour in factories has increased urbanisation and the size of settlements, to serve and house the factory workers.\n\n\n==== Exploitation ====\n\n\n==== China ====\nChina, along with many other areas of the world run by industrialization, has been affected by the world’s never ending rise of supply and demand. With the largest population in the world, China has become one of the main exporters of objects from household items to high technology appliances.\n\n\n=== Changes in family structure ===\nFamily structure changes with industrialisation. Sociologist Talcott Parsons noted that in pre-industrial societies there is an extended family structure spanning many generations who probably remained in the same location for generations. In industrialised societies the nuclear family, consisting of only parents and their growing children, predominates. Families and children reaching adulthood are more mobile and tend to relocate to where jobs exist. Extended family bonds become more tenuous.\n\n\n== Current situation ==\n\nAs of 2018 the \"international development community\" (World Bank, Organisation for Economic Co-Operation and Development (OECD), many United Nations departments, FAO WHO ILO and UNESCO, endorses development policies like water purification or primary education and co-operation amongst third world communities. Some members of the economic communities do not consider contemporary industrialisation policies as being adequate to the global south (Third World countries) or beneficial in the longer term, with the perception that they may only create inefficient local industries unable to compete in the free-trade dominated political order which industrialisation has fostered. Environmentalism and Green politics may represent more visceral reactions to industrial growth. Nevertheless, repeated examples in history of apparently successful industrialisation (Britain, Soviet Union, South Korea, China, etc.) may make conventional industrialisation seem like an attractive or even natural path forward, especially as populations grow, consumerist expectations rise and agricultural opportunities diminish.\nThe relationships among economic growth, employment, and poverty reduction are complex. Higher productivity, it is argued, may lead to lower employment (see jobless recovery).\nThere are differences across sectors, whereby manufacturing is less able than the tertiary sector to accommodate both increased productivity and employment opportunities; more than 40% of the world's employees are \"working poor\", whose incomes fail to keep themselves and their families above the $2-a-day poverty line. There is also a phenomenon of deindustrialisation, as in the former USSR countries' transition to market economies, and the agriculture sector is often the key sector in absorbing the resultant unemployment.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nChandler Jr., Alfred D. (1993). The Visible Hand: The Management Revolution in American Business. Belknap Press of Harvard University Press. ISBN 978-0674940529.\nHewitt, T., Johnson, H. and Wield, D. (Eds) (1992) industrialisation and Development, Oxford University Press: Oxford.\nHobsbawm, Eric (1962): The Age of Revolution. Abacus.\nKemp, Tom (1993) Historical Patterns of Industrialisation, Longman: London. ISBN 0-582-09547-6\nKiely, R (1998) industrialisation and Development: A comparative analysis, UCL Press:London.\nLandes, David.  S. (1969). The Unbound Prometheus: Technological Change and Industrial Development in Western Europe from 1750 to the Present. Cambridge, New York: Press Syndicate of the University of Cambridge. ISBN 0-521-09418-6.\nPomeranz, Ken (2001)The Great Divergence: China, Europe and the Making of the Modern World Economy (Princeton Economic History of the Western World) by (Princeton University Press; New Ed edition, 2001)\nTilly, Richard H.: Industrialization as an Historical Process, European History Online, Mainz: Institute of European History, 2010, retrieved: 29 February 2011."}