{"topic": "East", "english_title": "East", "english": "East is one of the four cardinal directions or points of the compass. It is the opposite direction from west.\n\n\n== Etymology ==\nAs in other languages, the word is formed from the fact that east is direction where the sun rises: east comes from Middle English est, from Old English ēast, which itself comes from the Proto-Germanic *aus-to- or *austra- \"east, toward the sunrise\", from Proto-Indo-European *aus- \"to shine,\" or \"dawn\",  cognate with Old High German *ōstar \"to the east\", Latin aurora 'dawn', and Greek ἠώς ēōs 'dawn, east'. Examples of the same formation in other languages include Latin oriens 'east, sunrise' from orior 'to rise, to originate', Greek ανατολή anatolé 'east' from ἀνατέλλω 'to rise' and Hebrew מִזְרָח mizraḥ 'east' from זָרַח zaraḥ 'to rise, to shine'. Ēostre, a Germanic goddess of dawn, might have been a personification of both dawn and the cardinal points.\n\n\n== Navigation ==\nBy convention, the right hand side of a map is east. This convention has developed from the use of a compass, which places north at the top. However, on maps of planets such as Venus and Uranus which rotate retrograde, the left hand side is east.\nTo go east using a compass for navigation, one sets a bearing or azimuth of 90°.\n\n\n== Cultural ==\nEast is the direction toward which the Earth rotates about its axis, and therefore the general direction from which the Sun appears to rise. The practice of praying towards the East is older than Christianity, but has been \nadopted by this religion as the Orient was thought of as containing mankind's original home. Hence, some Christian churches have been traditionally oriented towards the east.\nAnd, not unlikely, the churches are turned that direction because of The Word of The lord who is cited in the holy bible; \"For as lightning cometh out of the east, and appeareth even into the west: so shall the coming of the Son of man be.\" ◄ Matthew 24:27 ►\n\nThe Orient is the East, traditionally comprising anything that belongs to the Eastern world, in relation to Europe. In English, it is largely a metonym for, and referring to the same area as, the continent of Asia, divided into the Far East, Middle East, and Near East. Despite this Eurocentric origin, these regions are still located to the east of the Geographical centre of Earth.\nWithin an individual city, the east end is typically poorer due to prevailing winds blowing pollution to the east.\n\n\n== See also ==\nIntermediate Region\nEasting\nOriental\n\n\n== References ==\n\n\n== External links ==\n The dictionary definition of east at Wiktionary"}