{"topic": "Taxonomy", "english_title": "Taxonomy", "english": "Taxonomy is the practice and science of categorization or classification based on discrete sets. The word finds its roots in the Greek language τάξις, taxis (meaning 'order', 'arrangement') and νόμος, nomos ('law' or 'science').\nA taxonomy (or taxinomical classification) is a scheme of classification, especially a hierarchical classification, in which things are organized into groups or types. Among other things, a taxonomy can be used to organize and index knowledge (stored as documents, articles, videos, etc.), such as in the form of a library classification system, or a search engine taxonomy, so that users can more easily find the information they are searching for. Many taxonomies are hierarchies (and thus, have an intrinsic tree structure), but not all are.\nOriginally, taxonomy referred only to the categorisation of organisms or a particular categorisation of organisms. In a wider, more general sense, it may refer to a categorisation of things or concepts, as well as to the principles underlying such a categorisation. Taxonomy organizes taxonomic units known as \"taxa\" (singular \"taxon\").\nTaxonomy is different from meronomy, which deals with the categorisation of parts of a whole.\n\n\n== Applications ==\nWikipedia categories illustrate a taxonomy, and a full taxonomy of Wikipedia categories can be extracted by automatic means. As of 2009, it has been shown that a manually-constructed taxonomy, such as that of computational lexicons like WordNet, can be used to improve and restructure the Wikipedia category taxonomy.In a broader sense, taxonomy also applies to relationship schemes other than parent-child hierarchies, such as network structures. Taxonomies may then include a single child with multi-parents, for example, \"Car\" might appear with both parents \"Vehicle\" and \"Steel Mechanisms\"; to some however, this merely means that 'car' is a part of several different taxonomies. A taxonomy might also simply be organization of kinds of things into groups, or an alphabetical list; here, however, the term vocabulary is more appropriate. In current usage within knowledge management, taxonomies are considered narrower than ontologies since ontologies apply a larger variety of relation types.Mathematically, a hierarchical taxonomy is a tree structure of classifications for a given set of objects. It is also named containment hierarchy. At the top of this structure is a single classification, the root node, that applies to all objects. Nodes below this root are more specific classifications that apply to subsets of the total set of classified objects. The progress of reasoning proceeds from the general to the more specific.\nBy contrast, in the context of legal terminology, an open-ended contextual taxonomy is employed—a taxonomy holding only with respect to a specific context. In scenarios taken from the legal domain, a formal account of the open-texture of legal terms is modeled, which suggests varying notions of the \"core\" and \"penumbra\" of the meanings of a concept. The progress of reasoning proceeds from the specific to the more general.\n\n\n== History ==\nAnthropologists have observed that taxonomies are generally embedded in local cultural and social systems, and serve various social functions. Perhaps the most well-known and influential study of folk taxonomies is Émile Durkheim's The Elementary Forms of Religious Life. A more recent treatment of folk taxonomies (including the results of several decades of empirical research) and the discussion of their relation to the scientific taxonomy can be found in Scott Atran's Cognitive Foundations of Natural History. Folk taxonomies of organisms have been found in large part to agree with scientific classification, at least for the larger and more obvious species, which means that it is not the case that folk taxonomies are based purely on utilitarian characteristics.In the seventeenth century the German mathematician and philosopher Gottfried Leibniz, following the work of the thirteenth-century Majorcan philosopher Ramon Llull on his Ars generalis ultima, a system for procedurally generating concepts by combining a fixed set of ideas, sought to develop an alphabet of human thought. Leibniz intended his characteristica universalis to be an \"algebra\" capable of expressing all conceptual thought. The concept of creating such a \"universal language\" was frequently examined in the 17th century, also notably by the English philosopher John Wilkins in his work An Essay towards a Real Character and a Philosophical Language (1668), from which the classification scheme in Roget's Thesaurus ultimately derives.\n\n\n== Taxonomy in various disciplines ==\n\n\n=== Natural sciences ===\n\nTaxonomy in biology encompasses the description, identification, nomenclature, and classification of organisms. Uses of taxonomy include:\n\nAlpha taxonomy, the description and basic classification of new species, subspecies, and other taxa\nLinnaean taxonomy, the original classification scheme of Carl Linnaeus\nrank-based scientific classification as opposed to clade-based classification\nEvolutionary taxonomy, traditional post-Darwinian hierarchical biological classification\nNumerical taxonomy, various taxonomic methods employing numeric algorithms\nPhenetics,  system for ordering species based on overall similarity\nPhylogenetics, biological taxonomy based on putative ancestral descent of organisms\nPlant taxonomy\nVirus classification, taxonomic system for viruses\nFolk taxonomy, description and organization, by individuals or groups, of their own environments\nNosology, classification of diseases\nSoil classification, systematic categorization of soils\n\n\n=== Business and economics ===\nUses of taxonomy in business and economics include:\n\nCorporate taxonomy, the hierarchical classification of entities of interest to an enterprise, organization or administration\nEconomic taxonomy, a system of classification for economic activity\nGlobal Industry Classification Standard, an industry taxonomy developed by MSCI and Standard & Poor's (S&P)\nIndustry Classification Benchmark, an industry classification taxonomy launched by Dow Jones and FTSE\nInternational Standard Industrial Classification (ISIC), a United Nations system for classifying economic data\nNorth American Industry Classification System (NAICS), used in Canada, Mexico, and the United States of America\nPavitt's Taxonomy, classification of firms by their principal sources of innovation\nStandard Industrial Classification, a system for classifying industries by a four-digit code\nUnited Kingdom Standard Industrial Classification of Economic Activities, a Standard Industrial Classification by type of economic activity\nRecords management taxonomy, the representation of data, upon which the classification of unstructured content is based, within an organization.\nXBRL Taxonomy, eXtensible Business Reporting Language\nSRK taxonomy, in workplace user-interface design\n\n\n=== Computing ===\n\n\n==== Software engineering ====\nVegas et al. make a compelling case to advance the knowledge in the field of software engineering through the use of taxonomies. Similarly, Ore et al. provide a systematic methodology to approach taxonomy building in software engineering related topics.\nSeveral taxonomies have been proposed in software testing research to classify techniques, tools, concepts and artifacts. The following are some example taxonomies: \n\nA taxonomy of model-based testing techniques\nA taxonomy of static-code analysis toolsEngström et al. suggest and evaluate the use of a taxonomy to bridge the communication between researchers and practitioners engaged in the area of software testing. They have also developed a web-based tool to facilitate and encourage the use of the taxonomy. The tool and its source code are available for public use.\n\n\n==== Other uses of taxonomy in computing ====\nFlynn's taxonomy, a classification for instruction-level parallelism methods\nFolksonomy, classification based on user's tags\nTaxonomy for search engines, considered as a tool to improve relevance of search within a vertical domain\nACM Computing Classification System, a subject classification system for computing devised by the Association for Computing Machinery\n\n\n=== Education and academia ===\nUses of taxonomy in education include:\n\nBloom's taxonomy, a standardized categorization of learning objectives in an educational context\nClassification of Instructional Programs, a taxonomy of academic disciplines at institutions of higher education in the United States\nMathematics Subject Classification, an alphanumerical classification scheme based on the coverage of Mathematical Reviews and Zentralblatt MATH\nSOLO taxonomy, Structure of Observed Learning Outcome, proposed by Biggs and Collis Tax\n\n\n=== Safety ===\nUses of taxonomy in safety include:\n\nSafety taxonomy, a standardized set of terminologies used within the fields of safety and health care\nHuman Factors Analysis and Classification System, a system to identify the human causes of an accident\nSwiss cheese model,  a model used in risk analysis and risk management propounded by Dante Orlandella and James T. Reason\nA taxonomy of rail incidents in Confidential Incident Reporting & Analysis System (CIRAS)\n\n\n=== Other taxonomies ===\nMilitary taxonomy, a set of terms that describe various types of military operations and equipment\nMoys Classification Scheme, a subject classification for law devised by Elizabeth Moys\n\n\n=== Research publishing ===\nCiting inadequacies with current practices in listing authors of papers in medical research journals, Drummond Rennie and co-authors called in a 1997 article in JAMA, the Journal of the American Medical Association for \n\na radical conceptual and systematic change, to reflect the realities of multiple authorship and to buttress accountability. We propose dropping the outmoded notion of author in favor of the more useful and realistic one of contributor.\n\nSince 2012, several major academic and scientific publishing bodies have mounted Project CRediT to develop a controlled vocabulary of contributor roles.  Known as CRediT (Contributor Roles Taxonomy), this is an example of a flat, non-hierarchical taxonomy; however, it does include an optional, broad classification of the degree of contribution: lead, equal or supporting.  Amy Brand and co-authors summarise their intended outcome as:\n\nIdentifying specific contributions to published research will lead to appropriate credit, fewer author disputes, and fewer disincentives to collaboration and the sharing of data and code.\n\nAs of mid-2018, this taxonomy apparently restricts its scope to research outputs, specifically journal articles; however, it does rather unusually \"hope to … support identification of peer reviewers\".  (As such, it has not yet defined terms for such roles as editor or author of a chapter in a book of research results.)  Version 1, established by the first Working Group in the (northern) autumn of 2014, identifies 14 specific contributor roles using the following defined terms:\n\nConceptualization\nMethodology\nSoftware\nValidation\nFormal Analysis\nInvestigation\nResources\nData curation\nWriting – Original Draft\nWriting – Review & Editing\nVisualization\nSupervision\nProject Administration\nFunding acquisitionReception has been mixed, with several major publishers and journals planning to have implemented CRediT by the end of 2018, whilst almost as many aren't persuaded of the need or value of using it.  For example,\n\nThe National Academy of Sciences has created a TACS (Transparency in Author Contributions in Science) webpage to list the journals that commit to setting authorship standards, defining responsibilities for corresponding authors, requiring ORCID iDs, and adopting the CRediT taxonomy.\n\nThe same webpage has a table listing 21 journals (or families of journals), of which:\n\n5 have, or by end 2018 will have, implemented CRediT,\n6 require an author contribution statement and suggest using CRediT,\n8 don't use CRediT, of which 3 give reasons for not doing so, and\n2 are uninformative.The taxonomy is an open standard conforming to the OpenStand principles, and is published under a Creative Commons licence.\n\n\n=== Taxonomy for the web ===\nWebsites with a well designed taxonomy or hierarchy are easily understood by users, due to the possibility of users developing a mental model of the site structure.Guidelines for writing taxonomy for the web include:\n\nMutually exclusive categories can be beneficial. If categories appear several places, it's called cross-listing or polyhierarchical. The hierarchy will lose its value if cross-listing appears too often. Cross-listing often appears when working with ambiguous categories that fits more than one place.\nHaving a balance between breadth and depth in the taxonomy is beneficial. Too many options (breadth), will overload the users by giving them too many choices. At the same time having a too narrow structure, with more than two or three levels to click-through, will make users frustrated and might give up.\n\n\n== Is-a and has-a relationships, and hyponymy ==\n\nTwo of the predominant types of relationships in knowledge-representation systems are predication and the universally quantified conditional. Predication relationships express the notion that an individual entity is an example of a certain type (for example, John is a bachelor), while universally quantified conditionals express the notion that a type is a subtype of another type (for example, \"A dog is a mammal\", which means the same as \"All dogs are mammals\").Taxonomies are often represented as is-a hierarchies where each level is more specific (in mathematical language \"a subset of\") the level above it. For example, a basic biology taxonomy would have concepts such as mammal, which is a subset of animal, and dogs and cats, which are subsets of mammal. This kind of taxonomy is called an is-a model because the specific objects are considered as instances of a concept. For example, Fido is-an instance of the concept dog and Fluffy is-a cat.In linguistics, is-a relations are called hyponymy. Words that describe categories are called hypernyms and words that are examples of categories are hyponyms. In the simple biology example, dog is a hypernym and Fido is one of its hyponyms. A word can be both a hyponym and a hypernym. For example, dog is a hyponym of mammal and also a hypernym of Fido.\n\n\n== Research ==\n\nResearchers reported that large populations consistently develop highly similar category systems. This may be relevant to lexical aspects of large communication networks and cultures such as folksonomies and language or human communication, and sense-making in general.\n\n\n== See also ==\nAll pages with titles containing Taxonomy\n The dictionary definition of taxonomy at Wiktionary\n The dictionary definition of classification scheme at Wiktionary\nCategorization, the process of dividing things into groups\nClassification (general theory)\nCelestial Emporium of Benevolent Recognition, a fictional Chinese encyclopedia with an \"impossible\" taxonomic scheme\nConflation\nFolksonomy\nGellish English dictionary, a taxonomy in which the concepts are arranged as a subtype–supertype hierarchy\nHypernym\nKnowledge representation\nLexicon\nOntology (information science), formal representation of knowledge as a set of concepts within a domain\nPhilosophical language\nProtégé (software)\nSemantic network\nSemantic similarity network\nStructuralism\nSystematics\nTaxon, a population of organisms that a taxonomist adjudges to be a unit\nTaxonomy for search engines\nThesaurus (information retrieval)\nTypology (disambiguation)\n\n\n== Notes ==\n\n\n== References ==\nAtran, S. (1993) Cognitive Foundations of Natural History: Towards an Anthropology of Science. Cambridge: Cambridge University Press. ISBN 978-0-521-43871-1\nCarbonell, J. G. and J. Siekmann, eds. (2005). Computational Logic in Multi-Agent Systems, Vol. 3487. Berlin: Springer-Verlag.ISBN 978-3-540-28060-6\nMalone, Joseph L. (1988). The Science of Linguistics in the Art of Translation: Some Tools from Linguistics for the Analysis and Practice of Translation. Albany, New York: State University of New York Press. ISBN 978-0-887-06653-5; OCLC 15856738\n*Marcello Sorce Keller, \"The Problem of Classification in Folksong Research: a Short History\", Folklore, XCV(1984), no. 1, 100-104.\nChester D Rowe and Stephen M Davis, 'The Excellence Engine Tool Kit'; ISBN 978-0-615-24850-9\nHärlin, M.; Sundberg, P. (1998). \"Taxonomy and Philosophy of Names\". Biology and Philosophy. 13 (2): 233–244. doi:10.1023/a:1006583910214. S2CID 82878147.\nLamberts, K.; Shanks, D.R. (1997). Knowledge, Concepts, and Categories. Psychology Press. ISBN 9780863774911.\n\n\n== External links ==\n Media related to Taxonomy at Wikimedia Commons\n The dictionary definition of taxonomy at WiktionaryTaxonomy 101: The Basics and Getting Started with Taxonomies"}