{"topic": "Social", "english_title": "Social", "english": "Social organisms, including humans, live collectively in interacting populations. This interaction is considered social whether they are aware of it or not, and whether the exchange  is voluntary/involuntary.\n\n\n== Etymology ==\nThe word \"Social\" derives from the Latin word socii (\"allies\"). It is particularly derived from the Italian Socii states, historical allies of the Roman Republic (although they rebelled against Rome in the Social War of 91-88 BC).\n+201098838419\n\n\n== Social theorists ==\nIn the view of Karl Marx, human beings are intrinsically, necessarily and by definition social beings who, beyond being \"gregarious creatures\", cannot survive and meet their needs other than through social co-operation and association. Their social characteristics are therefore to a large extent an objectively given fact, stamped on them from birth and affirmed by socialization processes; and, according to Marx, in producing and reproducing their material life, people must necessarily enter into relations of production which are \"independent of their will\".\nBy contrast, the sociologist Max Weber for example defines human action as \"social\" if, by virtue of the subjective meanings attached to the action by individuals, it \"takes account of the behavior of others, and is thereby oriented in its course\".\n\n\n== In socialism ==\nThe term \"socialism\", used from the 1830s onwards in France and the United Kingdom, was directly related to what was called the social question. In essence, early socialists contended that the emergence of competitive market societies did not create \"liberty, equality and fraternity\" for all citizens, requiring the intervention of politics and social reform to tackle social problems, injustices and grievances (a topic on which Jean-Jacques Rousseau discourses at length in his classic work The Social Contract). Originally the term \"socialist\" was often used interchangeably with \"co-operative\", \"mutualist\", \"associationist\" and \"collectivist\" in reference to the organization of economic enterprise socialists advocated, in contrast to the private enterprise and corporate organizational structures inherent to capitalism.\nThe modern concept of socialism evolved in response to the development of industrial capitalism. The \"social\" in modern \"socialism\" came to refer to the specific perspective and understanding socialists had of the development of material, economic forces and determinants of human behavior in society. Specifically, it denoted the perspective that human behavior is largely determined by a person's immediate social environment, that modes of social organization were not supernatural or metaphysical constructs but products of the social system and social environment, which were in turn products of the level of technology/mode of production (the material world), and were therefore constantly changing. Social and economic systems were thus not the product of innate human nature, but of the underlying form of economic organization and level of technology in a given society, implying that human social relations and incentive-structures would also change as social relations and social organization changes in response to improvements in technology and evolving material forces (relations of production). This perspective formed the bulk of the foundation for Karl Marx's materialist conception of history.\n\n\n== Modern uses ==\nIn contemporary society, \"social\" often refers to the redistributive policies of the government which aim to apply resources in the public interest, for example, [social security]. Policy concerns then include the problems of social exclusion and social cohesion. Here, \"social\" contrasts with \"private\" and to the distinction between the public and the private (or privatised) spheres, where ownership relations define access to resources and attention.\nThe social domain is often also contrasted with that of physical nature, but in sociobiology analogies are drawn between humans and other living species in order to explain social behavior in terms of biological factors.\n\n\n== See also ==\nSocial media\nSociology\nSocial network\nSocial neuroscience\nSocial psychology\nSocial skills\nSocial support\nSocial studies\nSocial undermining\nSocial work\nSocial cue\n\n\n== References ==\n\n\n== External links ==\nDolwick, JS. 2009. The 'Social' and Beyond: Introducing Actor Network Theory, article examining different meanings of the concept 'social'"}