{"topic": "Superpowers", "english_title": "Superpower", "english": "A superpower is a state with a dominant position characterized by its extensive ability to exert influence or project power on a global scale. This is done through the combined means of economic, military, technological, political and cultural strength as well as diplomatic and soft power influence. Traditionally, superpowers are preeminent among the great powers.\nThe term was first applied in 1944 during World War II to the United States, Britain, and the Soviet Union. During the Cold War, the British Empire dissolved, leaving the United States and the Soviet Union to dominate world affairs. At the end of the Cold War and the dissolution of the Soviet Union in 1991, only the United States appeared to be a superpower.China is considered an emerging global superpower in economy, military, technology, diplomacy and soft power influence. The Lowy Institute Asia Power Index, which measures power projection in the Indo-Pacific, called both China and the US superpowers, citing their immense influence in almost all eight indices of power. Whilst China takes the lead on the parameters of economic resources, future resources, economic relationships and diplomatic influence across eight measures, it ranks second in military capacity and cultural influence, behind the United States. In recent times, China has been referred to as a rising \"second superpower\", with global power and influence just below the United States.\n\n\n== Terminology and origin ==\n\nNo agreed definition of what is a superpower exists and may differ between sources. However, a fundamental characteristic that is consistent with all definitions of a superpower is a nation or state that has mastered the seven dimensions of state power, namely geography, population, economy, resources, military, diplomacy and national identity.The term was first used to describe nations with greater than great power status as early as 1944, but only gained its specific meaning with regard to the United States and to a lesser extent, the Soviet Union after World War II. This was because the United States and the Soviet Union had proved themselves to be capable of casting great influence in global politics and military dominance. The term in its current political meaning was coined by Dutch-American geostrategist Nicholas Spykman in a series of lectures in 1943 about the potential shape of a new post-war world order. This formed the foundation for the book The Geography of the Peace, which referred primarily to the unmatched maritime global supremacy of the British Empire and United States as essential for peace and prosperity in the world.\nA year later in 1944, William T. R. Fox, an American foreign policy professor, elaborated on the concept in the book The Superpowers: The United States, Britain and the Soviet Union — Their Responsibility for Peace which spoke of the global reach of a super-empowered nation. Fox used the word superpower to identify a new category of power able to occupy the highest status in a world in which—as the war then raging demonstrated—states could challenge and fight each other on a global scale. According to him, at that moment there were three states that were superpowers, namely the United States, the Soviet Union and the United Kingdom. The British Empire was the most extensive empire in world history and considered the foremost great power, holding sway over 25% of the world's population and controlling about 25% of the Earth's total land area, while the United States and the Soviet Union grew in power before and during World War II. The UK would face serious political, financial and colonial issues after World War II that left it unable to match Soviet or American power. Ultimately, Britain's empire would gradually dissolve over the course of the 20th century, sharply reducing its global power projection.\n\nAccording to Lyman Miller, \"[t]he basic components of superpower stature may be measured along four axes of power: military, economic, political, and cultural (or what political scientist Joseph Nye has termed \"soft power\")\".In the opinion of Kim Richard Nossal of Queen's University in Canada, \"generally this term was used to signify a political community that occupied a continental-sized landmass, had a sizable population (relative at least to other major powers); a superordinate economic capacity, including ample indigenous supplies of food and natural resources; enjoyed a high degree of non-dependence on international intercourse; and, most importantly, had a well-developed nuclear capacity (eventually normally defined as second strike capability)\".In the opinion of Professor Paul Dukes, \"a superpower must be able to conduct a global strategy including the possibility of destroying the world; to command vast economic potential and influence; and to present a universal ideology\". Although \"many modifications may be made to this basic definition\". According to Professor June Teufel Dreyer, \"[a] superpower must be able to project its power, soft and hard, globally\". In his book Superpower: Three Choices for America's Role in the World, Dr. Ian Bremmer, president of the Eurasia Group, argues that a superpower is \"a country that can exert enough military, political, and economic power to persuade nations in every region of the world to take important actions they would not otherwise take\".Apart from its common denotation of the foremost post-WWII states, the term superpower has colloquially been applied by some authors retrospectively to describe various preeminent ancient great empires or medieval great powers, in works such as Channel 5 (UK)'s documentary Rome: The World's First Superpower or the reference in The New Cambridge Medieval History to \"the other superpower, Sasanian Persia\".\n\n\n== History ==\n\n\n== Cold War ==\n\nThe 1956 Suez Crisis suggested that Britain, financially weakened by two world wars, could not then pursue its foreign policy objectives on an equal footing with the new superpowers without sacrificing convertibility of its reserve currency as a central goal of policy. As the majority of World War II had been fought far from its national boundaries, the United States had not suffered the industrial destruction nor massive civilian casualties that marked the wartime situation of the countries in Europe or Asia. The war had reinforced the position of the United States as the world's largest long-term creditor nation and its principal supplier of goods; moreover it had built up a strong industrial and technological infrastructure that had greatly advanced its military strength into a primary position on the global stage. Despite attempts to create multinational coalitions or legislative bodies (such as the United Nations), it became increasingly clear that the superpowers had very different visions about what the post-war world ought to look like and after the withdrawal of British aid to Greece in 1947 the United States took the lead in containing Soviet expansion in the Cold War.The two countries opposed each other ideologically, politically, militarily, and economically. The Soviet Union promoted the ideology of Marxism–Leninism, planned economy and a one-party state whilst the United States promoted the ideologies of liberal democracy and the free market in a capitalist market economy. This was reflected in the Warsaw Pact and NATO military alliances, respectively, as most of Europe became aligned with either the United States or the Soviet Union. These alliances implied that these two nations were part of an emerging bipolar world, in contrast with a previously multipolar world.The idea that the Cold War period revolved around only two blocs, or even only two nations, has been challenged by some scholars in the post–Cold War era, who have noted that the bipolar world only exists if one ignores all of the various movements and conflicts that occurred without influence from either of the two superpowers. Additionally, much of the conflict between the superpowers was fought in proxy wars which more often than not involved issues more complex than the standard Cold War oppositions.After the Soviet Union disintegrated in the early 1990s, the term hyperpower began to be applied to the United States as the sole remaining superpower of the Cold War era. This term, popularized by French foreign minister Hubert Védrine in the late 1990s, is controversial and the validity of classifying the United States in this way is disputed. One notable opponent to this theory is Samuel P. Huntington, who rejects this theory in favor of a multipolar balance of power. Other international relations theorists such as Henry Kissinger theorize that because the threat of the Soviet Union no longer exists to formerly American-dominated regions such as Western Europe and Japan, American influence is only declining since the end of the Cold War because such regions no longer need protection or have necessarily similar foreign policies as the United States.The Soviet Union and the United States fulfilled the superpower criteria in the following ways:\n\n\n== Post–Cold War era ==\n\nAfter the dissolution of the Soviet Union in 1991 which ended the Cold War, the post–Cold War world has in the past been considered by some to be a unipolar world, with the United States as the world's sole remaining superpower. In 1999, Samuel P. Huntington wrote: \"The United States, of course, is the sole state with preeminence in every domain of power – economic, military, diplomatic, ideological, technological, and cultural – with the reach and capabilities to promote its interests in virtually every part of the world\". However, Huntington rejected the claim that the world was unipolar, arguing: \"There is now only one superpower. But that does not mean that the world is unipolar,\" describing it instead as \"a strange hybrid, a uni-multipolar system with one superpower and several major powers\". He further wrote that \"Washington is blind to the fact that it no longer enjoys the dominance it had at the end of the Cold War. It must relearn the game of international politics as a major power, not a superpower, and make compromises\".Experts argue that this older single-superpower assessment of global politics is too simplified, in part because of the difficulty in classifying the European Union at its current stage of development. Others argue that the notion of a superpower is outdated, considering complex global economic interdependencies and propose that the world is multipolar.A 2012 report by the National Intelligence Council predicted that the United States superpower status will have eroded to merely being first among equals by 2030, but that it would remain highest among the world's most powerful countries because of its influence in many different fields and global connections that the great regional powers of the time would not match. Additionally, some experts have suggested the possibility of the United States losing its superpower status completely in the future, citing speculation of its decline in power relative to the rest of the world, economic hardships, a declining dollar, Cold War allies becoming less dependent on the United States, and the emergence of future powers around the world. Others have pointed out that the US has four times the wealth of its nearest competitor China, and five to six times the military capacity, giving it a lead that will not soon be overcome.According to a RAND Corporation paper by American diplomat James Dobbins, Professor Howard J. Shatz, and policy analyst Ali Wyne, Russia in the breakdown of a disintegrating unipolar world order, whilst not a peer competitor to the United States, would still remain a player and a potential rogue state that would undermine global affairs. The West could contain Russia with methods like those employed during the cold war with the Soviet Union, though this would be tested by Russia's overt and covert efforts to destabilize Western alliances and political systems. On the other hand, China is a peer competitor to the United States that cannot be contained, and will be a far more challenging entity for the West to confront. The authors state that China's military dominance in the Asia-Pacific is already eroding American influence at a rapid pace, and the costs for  the US to defend its interests there will continue to rise. Moreover, China's economic influence has already broken out of its regional confines long ago and is on track to directly contest the US role as the center for economic trade and commerce.\n\n\n=== Potential superpowers ===\n\nThe term potential superpowers has been applied by scholars and other qualified commentators to the possibility of several political entities achieving superpower status in the 21st century. Due to their large markets, growing military strength, economic potential, and influence in international affairs, China, the European Union, India and Russia are among the political entities most cited as having the potential of achieving superpower status in the 21st century. In 2020, a new UBS survey found that 57% of global investors predicted that China would replace the U.S. as the world's biggest superpower by 2030. However, many historians, writers and critics have expressed doubts whether any of these countries would ever emerge as a new superpower. Some political scientists and other commentators have even suggested that such countries might simply be emerging powers, as opposed to potential superpowers.The record of such predictions has not been perfect. For example, in the 1980s, some commentators thought Japan would become a superpower due to its large GDP and high economic growth at the time. However, Japan's economy crashed in 1991, creating a long period of economic slump in the country which has become known as The Lost Years. As of August 2012, Japan had yet to fully recover from the 1991 crash.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Bibliography ==\nBelt, Don (2004). \"Europe's Big Gamble\". National Geographic. pp. 54–65.\nBrzezinski, Zbigniew (1997). The Grand Chessboard: American Primacy and Its Geostrategic Imperatives. New York: Basic Books. ISBN 0-465-02726-1.\nFox, William (1944). The Super-powers: the United States, Britain, and the Soviet union—their responsibility for peace. Harcourt, Brace a. Co.\nKamen, Henry (2003). Spain's Road To Empire: The Making Of A World Power, 1492–1763. Penguin640 pagesCS1 maint: postscript (link)\nKennedy, Paul (1988). The Rise and Fall of the Great Powers. ISBN 0-679-72019-7.\nMcCormick, John, John (2007). The European Superpower. Palgrave Macmillan.\nTodd, Emanuel (200X). After the Empire – The Breakdown of the American Order.\nRosefielde, Steven (2005). Russia in the 21st Century: The Prodigal Superpower (PDF). Cambridge, UK: Cambridge University Press. ISBN 0-521-83678-6. Retrieved 2007-10-07.\nErik Ringmar, \"The Recognition Game: Soviet Russia Against the West,\" Cooperation & Conflict, 37:2, 2002. pp. 115–36. – an explanation of the relations between the superpowers in the 20th century based on the notion of recognition.\nLitwin Henryk, Central European Superpower, BUM Magazine, October 2016.\n\n\n== External links ==\n\"To Paris, U.S. Looks Like a 'Hyperpower'\". The International Herald Tribune. February 5, 1999. Archived from the original on October 26, 2006. Retrieved August 20, 2006.\nLast, Jonathan (October 21, 2005). \"Rule America?\". The Weekly Standard. News America Incorporated. Archived from the original on 2007-03-11. Retrieved 2006-09-15.\nVédrine, Hubert. France in an Age of Globalization, Brookings Institution Press, 2001. ISBN 0-8157-0007-5.\n\"Word Spy - hyper-power\". Retrieved 2006-09-15..\nLi, Bo; Zheng Yin (Chinese) (2001) 5000 years of Chinese history, Inner Mongolian People's publishing corp, ISBN 7-204-04420-7.\nCHAPTER FOUR. World Hegemony, 900-300 bce."}