{"topic": "self", "english_title": "Self", "english": "The self is an individual person as the object of its own reflective consciousness. Since the self is a reference by a subject to the same subject, this reference is necessarily subjective. The sense of having a self—or self-hood—should, however, not be confused with subjectivity itself. Ostensibly, this sense is directed outward from the subject to refer inward, back to its \"self\" (or itself). Examples of psychiatric conditions where such \"sameness\" may become broken include depersonalization, which sometimes occurs in schizophrenia: the self appears different from the subject.\nThe first-person perspective distinguishes self-hood from personal identity. Whereas \"identity\" is (literally) sameness and may involve categorization and labeling,\nself-hood implies a first-person perspective and suggests potential uniqueness. Conversely, we use \"person\" as a third-person reference. Personal identity can be impaired in late-stage Alzheimer's disease and in other neurodegenerative diseases. Finally, the self is distinguishable from \"others\". Including the distinction between sameness and otherness, the self versus other is a research topic in contemporary philosophy and contemporary phenomenology (see also psychological phenomenology), psychology, psychiatry, neurology, and neuroscience.\nAlthough subjective experience is central to self-hood, the privacy of this experience is only one of many problems in the Philosophy of self and scientific study of consciousness.\n\n\n== Neuroscience ==\nTwo areas of the brain that are important in retrieving self-knowledge are the medial prefrontal cortex and the medial posterior parietal cortex.\nThe posterior cingulate cortex, the anterior cingulate cortex, and medial prefrontal cortex are thought to combine to provide humans with the ability to self-reflect. The insular cortex is also thought to be involved in the process of self-reference.\n\n\n== Psychology ==\n\nThe psychology of self is the study of either the cognitive and affective representation of one's identity or the subject of experience. The earliest formulation of the self in modern psychology forms the distinction between the self as I, the subjective knower, and the self as Me, the subject that is known.  Current views of the self in psychology position the self as playing an integral part in human motivation, cognition, affect, and social identity. Self following from John Locke has been seen as a product of episodic memory but research upon those with amnesia find they have a coherent sense of self based upon preserved conceptual autobiographical knowledge. It is increasingly possible to correlate cognitive and affective experience of self with neural processes.  A goal of this ongoing research is to provide grounding and insight into the elements of which the complex multiply situated selves of human identity are composed. The 'Disorders of the Self' have also been extensively studied by psychiatrists.For example, facial and pattern recognition take large amounts of brain processing capacity but pareidolia cannot explain many constructs of self for cases of disorder, such as schizophrenia or schizo-affective disorder.\nOne's sense of self can also be changed upon becoming part of a stigmatized group. According to Cox, Abramson, Devine, and Hollon (2012), if an individual has prejudice against a certain group, like the elderly and then later becomes part of this group this prejudice can be turned inward causing depression (i.e. deprejudice).The philosophy of a disordered self, such as in schizophrenia, is described in terms of what the psychiatrist understands are actual events in terms of neuron excitation but are delusions nonetheless, and the schizo-affective or schizophrenic person also believes are actual events in terms of essential being. PET scans have shown that auditory stimulation is processed in certain areas of the brain, and imagined similar events are processed in adjacent areas, but hallucinations are processed in the same areas as actual stimulation. In such cases, external influences may be the source of consciousness and the person may or may not be responsible for \"sharing\" in the mind's process, or the events which occur, such as visions and auditory stimuli, may persist and be repeated often over hours, days, months or years—and the afflicted person may believe themselves to be in a state of rapture or possession.\nWhat the Freudian tradition has subjectively called, \"sense of self\" is for Jungian analytic psychology, where one's identity is lodged in the persona or ego and is subject to change in maturation. Carl Jung distinguished, \"The self is not only the center, but also the whole circumference which embraces both conscious and unconscious; it is the center of this totality...\". The Self in Jungian psychology is \"the archetype of wholeness and the regulating center of the psyche ... a transpersonal power that transcends the ego.\" As a Jungian archetype, it cannot be seen directly, but by ongoing individuating maturation and analytic observation, can be experienced objectively by its cohesive wholeness making factor.\n\n\n== Sociology ==\nThe self can be redefined as a dynamic, responsive process that structures neural pathways according to past and present environments including material, social, and spiritual aspects. Self-concept is a concept or belief that an individual has of him or herself as an emotional, spiritual, and social being. Therefore, the self-concept is the idea of who I am, kind of like a self-reflection of one's well-being. For example, the self-concept is anything you say about yourself.\nA society is a group of people who share a common belief or aspect of self interacting for the maintenance or betterment of the collective. Culture consists of explicit and implicit patterns of historically derived and selected ideas and their embodiment in institutions, cognitive and social practices, and artifacts.  Cultural systems may, on the one hand, be considered as products of action, and on the other, as conditioning elements of further action. Therefore, the following sections will explore how the self and self-concept can be changed due to different cultures.\nMarkus and Kitayama's early 1990s theory hypothesized that representations of the self in human cultures would fall on a continuum from independent to interdependent. The independent self is supposed to be egoistic, unique, separated from the various contexts, critical in judgement and prone to self-expression. The interdependent self is supposed to be altruistic, similar with the others, flexible according to contexts, conformist and unlikely to express opinions that would disturb the harmony of his or her group of belonging. This theory enjoyed huge popularity despite its many problems such as being based on popular stereotypes and myths about different cultures rather than on rigorous scientific research as well as postulating a series of causal links between culture and self-construals without presenting any evidence supporting them. A large study from 2016 involving a total of 10,203 participants from 55 cultural groups found that there is no independent versus interdependent dimension of self-construal because traits supposed by Markus & Kitayama to form a coherent construct do not actually correlate, or if they correlate, they have correlations opposite to those postulated by Markus & Kitayama. There are seven separate dimension of self-construal which can be found at both the cultural level of analysis and the individual level of analysis. These dimensions are difference versus similarity (if the individual considers himself or herself to be a unique person or to be the same as everybody else), self-containment versus connection to others (feeling oneself as being separated from others versus feeling oneself as being together with the others), self-direction versus receptiveness to influence (independent thinking versus conformity),\nWesterners, Latin Americans and the Japanese are relatively likely to represent their individual self as unique and different from that of others while Arabs, South-East Asians and Africans are relatively likely to represent their self as being similar with that of others. Individuals from Uganda, Japan, Colombia, Namibia, Ghana and Belgium were most likely to represent their selves as being emotionally separated from the community while individuals from Oman, Malaysia, Thailand and central Brazil were most likely to consider themselves as emotionally connected to their communities. Japanese, Belgians, British and Americans from Colorado were most likely to value independent thinking and consider themselves as making their own decisions in life independently from others. On the other hand, respondents from rural Peru, Malaysia, Ghana, Oman and Hungary were most likely to place more value on following others rather than thinking for themselves as well as to describe themselves as being often influenced by others in their decisions. Middle Easterners from Lebanon, Turkey, Egypt and Oman were most likely to value self-reliance and consider themselves as working on their own and being economically independent from others. On the other hand, respondents from Uganda, Japan and Namibia were most likely to consider cooperation between different individuals in economical activities as being important. Chileans, Ethiopians from the highlands, Turks and people from Lebanon placed a relatively high degree of importance on maintaining a stable pattern of behavior regardless of situation or context. Individuals from Japan, Cameroon, the United Kingdom and Sweden were most likely to describe themselves as being adaptable to various contexts and to place value on this ability. Colombians, Chileans, US Hispanics, Belgians and Germans were most likely to consider self expression as being more important than maintaining harmony within a group. Respondents from Oman, Cameroon and Malaysia were most likely to say that they prefer keeping harmony within a group to engaging in self-expression. Sub-Saharan Africans from Namibia, Ghana and Uganda considered that they would follow their own interests even if this means harming the interests of those close to them. Europeans from Belgium, Italy and Sweden had the opposite preference, considering self-sacrifice for other members of the community as being more important than accomplishing selfish goals.\nContrary to the theory of Markus & Kitayama, egoism correlates negatively with individual uniqueness, independent thinking and self-expression. Self-reliance correlates strongly and negatively with emotional self-containment, which is also unexpected given Markus & Kitayama's theory. The binary classification of cultural self-construals into independent versus interdependent is deeply flawed because in reality, the traits do not correlate according to Markus & Kitayama's self construal theory, and this theory fails to take into consideration the extremely diverse and complex variety of self-construals present in various cultures across the world.The way individuals construct themselves may be different due to their culture. The self is dynamic and complex and it will change or conform to whatever social influence it is exposed to. The main reason why the self is constantly dynamic is because it always looks for reasons to not be harmed. The self in any culture looks out for its well-being and will avoid as much threat as possible. This can be explained through the evolutionary psychology concept called survival of the fittest.\n\n\n== Philosophy ==\n\nThe philosophy of self seeks to describe essential qualities that constitute a person's uniqueness or essential being. There have been various approaches to defining these qualities. The self can be considered that being which is the source of consciousness, the agent responsible for an individual's thoughts and actions, or the substantial nature of a person which endures and unifies consciousness over time.\nIn addition to Emmanuel Levinas writings on \"otherness\", the distinction between \"you\" and \"me\" has been further elaborated in Martin Buber's philosophical work: Ich und Du.\n\n\n== Religion ==\n\nReligious views on the self vary widely. The self is a complex and core subject in many forms of spirituality. Two types of self are commonly considered—the self that is the ego, also called the learned, superficial self of mind and body, an egoic creation, and the self which is sometimes called the \"True Self\", the \"Observing Self\", or the \"Witness\". In Hinduism, the Ātman (self), despite being experienced as individual, is actually a representation of the unified transcendent reality, Brahman. Our experience of reality doesn't match the nature of Brahman due to māyā.\nOne description of spirituality is the self's search for \"ultimate meaning\" through an independent comprehension of the sacred. Another definition of spiritual identity is: \"A persistent sense of self that addresses ultimate questions about the nature, purpose, and meaning of life, resulting in behaviors that are consonant with the individual’s core values. Spiritual identity appears when the symbolic religious and spiritual value of a culture is found by individuals in the setting of their own life. There can be different types of spiritual self because it is determined by one's life and experiences.\"Human beings have a self—that is, they are able to look back on themselves as both subjects and objects in the universe. Ultimately, this brings questions about who we are and the nature of our own importance. Traditions such as Buddhism see the attachment to self is an illusion that serves as the main cause of suffering and unhappiness. Christianity makes a distinction between the true self and the false self, and sees the false self negatively, distorted through sin: 'The heart is deceitful above all things, and desperately wicked; who can know it?' (Jeremiah 17:9)\nAccording to Marcia Cavell, identity comes from both political and religious views. He also identified exploration and commitment as interactive parts of identity formation, which includes religious identity. Erik Erikson compared faith with doubt and found that healthy adults take heed to their spiritual side.\n\n\n== See also ==\nAttention\nĀtman (Buddhism), Buddhist concept of self\nAnatta— \"not-self\",  there is no unchanging, permanent self, soul or essence in living beings\nĀtman (Hinduism), inner self or soul in Hindu philosophy\nConsciousness\nJīva (Jainism), or Atman, used within Jainism to identify the soul\nEgo (disambiguation)\nHumeanism § Bundle theory of the self\nI (pronoun)\nIndividual\nIndividuation\nMe (pronoun), the first-person singular pronoun, referring to the speaker\nMeditation\nMoral psychology\nOutline of self\nSelf-awareness\nSelf-knowledge (psychology)\nSelf remembering\nSocial projection\nSoul\nSources of the Self\nTrue self and false self\nWill (philosophy)\n\n\n== References ==\n\n\n== Further reading =="}