{"topic": "Construction", "english_title": "Construction", "english": "Construction is a general term meaning the art and science to form objects, systems, or organizations, and comes from Latin constructio (from com- \"together\" and struere \"to pile up\") and Old French construction. To construct is the verb: the act of building, and the noun is construction: how something is built, the nature of its structure.\nIn its most widely used context, construction covers the processes involved in delivering buildings, infrastructure and industrial facilities, and associated activities through to the end of their life. It typically starts with planning, financing, and design, and continues until the asset is built and ready for use; construction also covers repairs and maintenance work, any works to expand, extend and improve the asset, and its eventual demolition, dismantling or decommissioning.\nAs an industry, construction accounts for more than 10% of global GDP (6-9% in developed countries) and employs around 7% of the global workforce - over 273m people. The output of the global construction industry was worth an estimated $10.8 trillion in 2017.\n\n\n== History ==\n\nThe first huts and shelters were constructed by hand or with simple tools. As cities grew during the Bronze Age, a class of professional craftsmen, like bricklayers and carpenters, appeared. Occasionally, slaves were used for construction work. In the Middle Ages, the artisan craftsmen were organized into guilds. In the 19th century, steam-powered machinery appeared, and, later, diesel- and electric-powered vehicles such as cranes, excavators and bulldozers.\nFast-track construction has been increasingly popular in the 21st century. Some estimates suggest that 40% of construction projects are now fast-track construction.\n\n\n== Construction industry sectors ==\n\nBroadly, there are three sectors of construction: buildings, infrastructure and industrial:\nBuilding construction is usually further divided into residential and non-residential.\nInfrastructure, also called heavy civil or heavy engineering, includes large public works, dams, bridges, highways, railways, water or wastewater and utility distribution.\nIndustrial construction includes offshore construction (mainly of energy installations), mining and quarrying, refineries, chemical processing, power generation, mills and manufacturing plants.The industry can also be classified into sectors or markets. For example, Engineering News-Record (ENR), a US-based construction trade magazine, has compiled and reported data about the size of design and construction contractors. In 2014, it split the data into nine market segments: transportation, petroleum, buildings, power, industrial, water, manufacturing, sewer/waste, telecom, hazardous waste, and a tenth category for other projects. ENR used data on transportation, sewer, hazardous waste and water to rank firms as heavy contractors.The Standard Industrial Classification and the newer North American Industry Classification System classify companies that perform or engage in construction into three subsectors: building construction, heavy and civil engineering construction, and specialty trade contractors. There are also categories for professional services firms (e.g., engineering, architecture, surveying, project management).\n\n\n=== Building construction ===\n\nBuilding construction is the process of adding structures to areas of land, also known as real property sites. Typically, a project is instigated by or with the owner of the property (who may be an individual or an organisation); occasionally, land may be compulsorily purchased from the owner for public use.\n\n\n==== Residential construction ====\n\nResidential construction may be undertaken by individual land-owners (self-build), by specialist house-builders, by property developers, by general contractors, or by providers of public or social housing (eg: local authorities, housing associations). Where local zoning or planning policies allow, mixed-use developments may comprise both residential and non-residential construction (eg: retail, leisure, offices, public buildings, etc).\nResidential construction practices, technologies, and resources must conform to local building authority regulations and codes of practice. Materials readily available in the area generally dictate the construction materials used (eg: brick versus stone versus timber). Costs of construction on a per square meter (or per square foot) basis for houses can vary dramatically based on site conditions, access routes, local regulations, economies of scale (custom-designed homes are often more expensive to build) and the availability of skilled tradespeople.\n\n\n==== Non-residential construction ====\n\nDepending upon the type of building, non-residential building construction can be procured by a wide range of private and public organisations, including local authorities, educational and religious bodies, transport undertakings, retailers, hoteliers, property developers, financial institutions and other private companies. Most construction in these sectors is undertaken by general contractors.\n\n\n=== Infrastructure construction ===\n\nCivil engineering covers the design, construction, and maintenance of the physical and naturally built environment, including public works such as roads, bridges, canals, dams, tunnels, airports, water and sewerage systems, pipelines, and railways. Some general contractors have expertise in civil engineering; civil engineering contractors are firms dedicated to work in this sector, and may specialise in particular types of infrastructure.\n\n\n=== Industrial construction ===\n\nIndustrial construction includes offshore construction (mainly of energy installations: oil and gas platforms, wind power), mining and quarrying, refineries, breweries, distilleries and other processing plants, power stations, steel mills, warehouses and factories.\n\n\n== Construction processes ==\nSome construction projects are small renovations or repair jobs, where the owner may act as designer, paymaster and laborer for the entire project. However, more complex or ambitious projects usually require additional multi-disciplinary expertise and manpower, so the owner may commission one or more specialist businesses to undertake detailed planning, design, construction and handover of the work. Often the owner will appoint one business to oversee the project (this may be a designer, a contractor, a construction manager, or other advisor); such specialists are normally appointed for their expertise in project delivery, and will help the owner define the project brief, agree a budget and schedule, liaise with relevant public authorities, and procure the services of other specialists (the supply chain, comprising subcontractors). Contracts are agreed for the delivery of services by all businesses, alongside other detailed plans aimed at ensuring legal, timely, on-budget and safe delivery of the specified works.\nDesign, finance, and legal aspects overlap and interrelate. The design must be not only structurally sound and appropriate for the use and location, but must also be financially possible to build, and legal to use. The financial structure must be adequate to build the design provided, and must pay amounts that are legally owed. Legal structures integrate design with other activities, and enforce financial and other construction processes.\nThese processes also affect procurement strategies. Clients may, for example, appoint a business to design the project after which a competitive process is undertaken to appoint a lead contractor to construct the asset (design–bid–build); they may appoint a business to lead both design and construction (design-build); or they may directly appoint a designer, contractor and specialist subcontractors (construction management). Some forms of procurement emphasise collaborative relationships (partnering, alliancing) between the client, the contractor, and other stakeholders within a construction project, seeking to ameliorate often highly competitive and adversarial industry practices.\n\n\n=== Planning ===\n\nWhen applicable, a proposed construction project must comply with local land-use planning policies including zoning and building code requirements. A project will normally be assessed (by the 'authority having jurisdiction', AHJ, typically the municipality where the project will be located) for its potential impacts on neighbouring properties, and upon existing infrastructure (transportation, social infrastructure, and utilities including water supply, sewerage, electricity, telecommunications, etc). Data may be gathered through site analysis, site surveys and geotechnical investigations. Construction normally cannot start until planning permission has been granted, and may require preparatory work to ensure relevant infrastructure has been upgraded before building work can commence. Preparatory works will also include surveys of existing utility lines to avoid damage-causing outages and other hazardous situations.\nSome legal requirements come from malum in se considerations, or the desire to prevent indisputably bad phenomena, e.g. explosions or bridge collapses. Other legal requirements come from malum prohibitum considerations, or factors that are a matter of custom or expectation, such as isolating businesses from a business district or residences from a residential district. An attorney may seek changes or exemptions in the law that governs the land where the building will be built, either by arguing that a rule is inapplicable (the bridge design will not cause a collapse), or that the custom is no longer needed (acceptance of live-work spaces has grown in the community).During the construction of a building, a municipal building inspector usually inspects the ongoing work periodically to ensure that construction adheres to the approved plans and the local building code. Once construction is complete, any later changes made to a building or other asset that affect safety, including its use, expansion, structural integrity, and fire protection, usually require municipality approval.\n\n\n=== Finance ===\nDepending on the type of project, mortgage bankers, accountants, and cost engineers may participe in creating an overall plan for the financial management of a construction project. The presence of the mortgage banker is highly likely, even in relatively small projects since the owner's equity in the property is the most obvious source of funding for a building project. Accountants act to study the expected monetary flow over the life of the project and to monitor the payouts throughout the process. Professionals including cost engineers, estimators and quantity surveyors apply expertise to relate the work and materials involved to a proper valuation.\nFinancial planning ensures adequate safeguards and contingency plans are in place before the project is started, and ensures that the plan is properly executed over the life of the project. Construction projects can suffer from preventable financial problems. Underbids happen when builders ask for too little money to complete the project. Cash flow problems exist when the present amount of funding cannot cover the current costs for labour and materials; such problems may arise even when the overall budget is adequate, presenting a temporary issue. Cost overruns with government projects have occurred when the contractor identified change orders or project changes that increased costs, which are not subject to competition from other firms as they have already been eliminated from consideration after the initial bid. Fraud is also an occasional construction issue.Large projects can involve highly complex financial plans and often start with a conceptual estimate performed by a building estimator. As portions of a project are completed, they may be sold, supplanting one lender or owner for another, while the logistical requirements of having the right trades and materials available for each stage of the building construction project carries forward. Public–private partnerships (PPPs) or private finance initiatives (PFIs) may also be used to help delivery major projects. According to McKinsey in 2019, the \"vast majority of large construction projects go over budget and take 20% longer than expected\".\n\n\n=== Legal ===\n\nA construction project is a complex net of construction contracts and other legal obligations, each of which all parties must carefully consider. A contract is the exchange of a set of obligations between two or more parties, and provides structures to manage issues. For example, construction delays can be costly, so construction contracts set out clear expectations and clear paths to manage delays. Poorly drafted contracts can lead to confusion and costly disputes.\nAt the start of a project, legal advisors seek to identify ambiguities and other potential sources of trouble in the contract structures, and to present options for preventing problems. During projects, they work to avoid and resolve conflicts that arise. In each case, the lawyer facilitates an exchange of obligations that matches the reality of the project.\n\n\n=== Procurement ===\n\n\n==== Traditional or Design-bid-build ====\n\nDesign-bid-build is the most common and well-established method of construction procurement. In this arrangement, the architect, engineer or builder acts for the client as the project coordinator. They design the works, prepare specifications and design deliverables (models, drawings, etc), administer the contract, tender the works, and manage the works from inception to completion. In parallel, there are direct contractual links between the client and the main contractor, who, in turn, has direct contractual relationships with subcontractors. The arrangement continues until the project is ready for handover.\n\n\n==== Design-build ====\n\nDesign-build became more common from the late 20th century, and involves the client contracting a single entity to provide design and construction. In some cases, the design-build package can also include finding the site, arranging funding and applying for all necessary statutory consents. Typically, the client invites several D&B contractors to submit proposals to meet the project brief and then selects a preferred supplier. Often this will be a consortium involving a design firm and a contractor (sometimes more than one of each). In the United States, departments of transportation usually use design-build contracts as a way of progressing projects where states lack the skills or resources, particularly for very large projects.\n\n\n==== Construction management ====\n\nIn a construction management arrangement, the client enters into separate contracts with the designer (architect or engineer), a construction manager, and individual trade contractors. The client takes on the contractual role, while the construction or project manager provides the active role of managing the separate trade contracts, and ensuring that they complete all work smoothly and effectively together. This approach is often used to speed up procurement processes, to allow the client greater flexibility in design variation throughout the contract, to enable the appointment of individual work contractors, to separate contractual responsibility on each individual throughout the contract, and to provide greater client control.\n\n\n=== Design ===\nIn the industrialized world, construction usually involves the translation of designs into reality. Most commonly (ie: in a design-bid-build project), the design team is employed by (i.e. in contract with) the property owner. Depending upon the type of project, a design team may include architects, civil engineers, mechanical engineers, electrical engineers, structural engineers, fire protection engineers, planning consultants, architectural consultants, and archaeological consultants. A 'lead designer' will normally be identified to help coordinate different disciplinary inputs to the overall design. This may be aided by integration of previously separate disciplines (often undertaken by separate firms) into multi-disciplinary firms with experts from all related fields, or by firms establishing relationships to support design-build processes.\nThe increasing complexity of construction projects creates the need for design professionals trained in all phases of a project's life-cycle and develop an appreciation of the asset as an advanced technological system requiring close integration of many sub-systems and their individual components, including sustainability. For buildings, building engineering is an emerging discipline that attempts to meet this new challenge.\nTraditionally, design has involved the production of sketches, architectural and engineering drawings, and specifications. Until the late 20th century, drawings were largely hand-drafted; adoption of computer-aided design (CAD) technologies then improved design productivity, while the 21st-century introduction of building information modeling (BIM) processes has involved the use of computer-generated models that can be used in their own right or to generate drawings and other visualisations as well as capturing non-geometric data about building components and systems.\nOn some projects, work on-site will not start until design work is largely complete; on others, some design work may be undertaken concurrently with the early stages of on-site activity (for example, work on a building's foundations may commence while designers are still working on the detailed designs of the building's internal spaces). Some projects may include elements that are designed for off-site construction (see also prefabrication and modular building) and are then delivered to the site ready for erection, installation or assembly.\n\n\n=== On-site construction ===\n\nOnce contractors and other relevant professionals have been appointed and designs are sufficiently advanced, work may commence on the project site. Typically, a construction site will include a secure perimeter to restrict unauthorised access, site access control points, office and welfare accommodation for personnel from the main contractor and other firms involved in the project team, and storage areas for materials, machinery and equipment. According to the McGraw-Hill Dictionary of Architecture and Construction's definition, construction may be said to have started when the first feature of the permanent structure has been put in place, such as pile driving, or the pouring of slabs or footings.\n\n\n=== Commissioning and handover ===\n\nCommissioning is the process of verifying that all subsystems of a new building (or other asset) work as intended to achieve the owner's project requirements and as designed by the project's architects and engineers.\n\n\n=== Maintenance, repair and improvement ===\n\nMaintenance involves functional checks, servicing, repairing or replacing of necessary devices, equipment, machinery, building infrastructure, and supporting utilities in industrial, business, governmental, and residential installations.\n\n\n=== Demolition ===\n\nDemolition is the discipline of safely and efficiently tearing down buildings and other artificial structures. Demolition contrasts with deconstruction, which involves taking a building apart while carefully preserving valuable elements for reuse purposes (recycling - see also circular economy).\n\n\n== Industry scale and characteristics ==\n\n\n=== Economic activity ===\n\nThe output of the global construction industry was worth an estimated $10.8 trillion in 2017, and in 2018 was forecast to rise to $12.9 trillion by 2022. As a sector, construction accounts for more than 10% of global GDP (in developed countries, construction comprises 6-9% of GDP), and employs around 7% of the total employed workforce around the globe (accounting for over 273 million full- and part-time jobs in 2014). Since 2010, China has been the world's largest single construction market. The United States is the second largest construction market with a 2018 output of $1.581 trillion.In the United States in February 2020, around $1.4 trillion worth of construction work was in progress, according to the Census Bureau, of which just over $1.0 trillion was for the private sector (split roughly 55:45% between residential and nonresidential); the remainder was public sector, predominantly for state and local government.Construction is a major source of employment in most countries; high reliance on small businesses, and under-representation of women are common traits. For example:\n\nIn the US, construction employed around 11.4m people in 2020, with a further 1.8m employed in architectural, engineering, and related professional services - equivalent to just over 8% of the total US workforce. The construction workers were employed in over 843,000 organisations, of which 838,000 were privately held businesses. In March 2016, 60.4% of construction workers were employed by businesses with fewer than 50 staff. Women are substantially underrepresented (relative to their share of total employment), comprising 10.3% of the US construction workforce, and 25.9% of professional services workers, in 2019.\nIn the United Kingdom, construction contributed £117 billion (6%) to UK GDP in 2018, and in 2019 employed 2.4m workers (6.6% of all jobs). These worked either for 343,000 'registered' construction businesses, or for 'unregistered' businesses, typically self-employed contractors; just over one million small/medium-sized businesses, mainly self-employed individuals, worked in the sector in 2019, comprising about 18% of all UK businesses. Women comprised 12.5% of the UK construction workforce.\nIn Armenia, the construction sector experienced growth during the latter part of 2000s. Based on National Statistical Service, Armenia’s construction sector generated approximately 20% of Armenia’s GDP during the first and second quarters of 2007. In 2009, according to the World Bank, 30% of Armenia’s economy was from construction sector.According to McKinsey research, productivity growth per worker in construction has lagged behind many other industries across different countries including in the United States and in European countries. In the United States, construction productivity per worker has declined by half since the 1960s.\n\n\n=== Construction GVA by country ===\n\n\n=== Careers ===\nLarge-scale construction requires collaboration across multiple disciplines. A project manager normally manages the budget on the job, and a construction manager, design engineer, construction engineer or architect supervises it. Those involved with the design and execution must consider zoning requirements and legal issues, environmental impact of the project, scheduling, budgeting and bidding, construction site safety, availability and transportation of building materials, logistics, and inconvenience to the public, including those caused by construction delays.\n\nThere are many routes to the different careers within the construction industry. There are three main tiers based on educational background and training, which vary by country:\n\n\n==== Unskilled and semi-skilled workers ====\nUnskilled and semi-skilled workers provide general site labor, often have few or no construction qualifications, and may receive basic site training.\n\n\n==== Skilled tradespeople ====\n\nSkilled tradespeople have typically served apprenticeships (sometimes in labor unions) or received technical training; this group also includes on-site managers who possess extensive knowledge and experience in their craft or profession. Skilled manual occupations include carpenters, electricians, plumbers, ironworkers, heavy equipment operators and masons, as well as those involved in project management. In the UK these require further education qualifications, often in vocational subject areas, undertaken either directly after completing compulsory education or through \"on the job\" apprenticeships.\n\n\n==== Professional, technical or managerial personnel ====\nProfessional, technical and managerial personnel often have higher education qualifications, usually graduate degrees, and are trained to design and manage construction processes. These roles require more training as they demand greater technical knowledge, and involve more legal responsibility. Example roles (and qualification routes) include:\n\nArchitect – Will usually have studied architecture to degree level, and then undertaken further study and gained professional experience. In many countries, the title of \"architect\" is protected by law, strictly limiting its use to qualified people.\nCivil engineer – Typically holds a degree in a related subject and may only be eligible for membership of a professional institution (such as the UK's ICE) following completion of additional training and experience.  In some jurisdictions, a new university graduate must hold a master's degree to become chartered, and persons with bachelor's degrees may become Incorporated Engineers.\nBuilding services engineer – May also be referred to as an \"M&E\" or \"MEP engineer\" and typically holds a degree in mechanical or electrical engineering.\nProject manager – Typically holds a 4-year or greater higher education qualification, but are often also qualified in another field such as architecture, civil engineering or quantity surveying.\nStructural engineer – Typically holds a bachelor's or master's degree in structural engineering.\nQuantity surveyor – Typically holds a bachelor's degree in quantity surveying. UK chartered status is gained from the Royal Institution of Chartered Surveyors.\n\n\n=== Safety ===\n\nConstruction is one of the most dangerous occupations in the world, incurring more occupational fatalities than any other sector in both the United States and in the European Union. In the US in 2019, 1,061, or about 20%, of worker fatalities in private industry occurred in construction. In 2017, more than a third of US construction fatalities (366 out of 971 total fatalities) were the result of falls. Proper safety equipment such as harnesses, hard hats and guardrails and procedures such as securing ladders and inspecting scaffolding can curtail the risk of occupational injuries in the construction industry. Other major causes of fatalities in the construction industry include electrocution, transportation accidents, and trench cave-ins.\n\nOther safety risks for workers in construction include hearing loss due to high noise exposure, musculoskeletal injury, chemical exposure, and high levels of stress. Besides that, the high turnover of workers in construction industry imposes a huge challenge of accomplishing the restructuring of work practices in individual workplaces or with individual workers. Construction has been identified by the National Institute for Occupational Safety and Health (NIOSH) as a priority industry sector in the National Occupational Research Agenda (NORA) to identify and provide intervention strategies regarding occupational health and safety issues.\n\n\n=== Sustainability ===\n\nSustainability is an aspect of “green building\", defined by the United States Environmental Protection Agency (EPA) as \"the practice of creating structures and using processes that are environmentally responsible and resource-efficient throughout a building's life-cycle from siting to design, construction, operation, maintenance, renovation and deconstruction.\"\n\n\n== See also ==\nAgile construction\nIndex of construction articles\nOutline of construction\nReal estate development\nStructural robustness\nUmarell\n\n\n== References and notes =="}