{"topic": "Knowledge", "english_title": "Knowledge", "english": "Knowledge is a familiarity, awareness, or understanding of someone or something, such as facts (descriptive knowledge), skills (procedural knowledge), or objects (acquaintance knowledge). By most accounts, knowledge can be acquired in many different ways and from many sources, including but not limited to perception, reason, memory, testimony, scientific inquiry, education, and practice. The philosophical study of knowledge is called epistemology.\nThe term \"knowledge\" can refer to a theoretical or practical understanding of a subject. It can be implicit (as with practical skill or expertise) or explicit (as with the theoretical understanding of a subject); formal or informal; systematic or particular. The philosopher Plato famously pointed out the need for a distinction between knowledge and true belief in the Theaetetus, leading many to attribute to him a definition of knowledge as \"justified true belief\". The difficulties with this definition raised by the Gettier problem have been the subject of extensive debate in epistemology for more than half a century.\n\n\n== Theories of knowledge ==\n\nThe eventual demarcation of philosophy from science was made possible by the notion that philosophy's core was \"theory of knowledge,\" a theory distinct from the sciences because it was their foundation... Without this idea of a \"theory of knowledge,\" it is hard to imagine what \"philosophy\" could have been in the age of modern science.\nKnowledge is the primary subject of the field of epistemology, which studies what we know, how we come to know it, and what it means to know something. Defining knowledge is an important aspect of epistemology, because it does not suffice to have a belief; one must also have good reasons for that belief, because otherwise there would be no reason to prefer one belief over another.\nThe definition of knowledge is a matter of ongoing debate among epistemologists. The classical definition, described but not ultimately endorsed by Plato, specifies that a statement must meet three criteria in order to be considered knowledge: it must be justified, true, and believed. Epistemologists today generally agree that these conditions are not sufficient, as various Gettier cases are thought to demonstrate. There are a number of alternative definitions which have been proposed, including Robert Nozick's proposal that all instances of knowledge must 'track the truth' and Simon Blackburn's proposal that those who have a justified true belief 'through a defect, flaw, or failure' fail to have knowledge. Richard Kirkham suggests that our definition of knowledge requires that the evidence for the belief necessitates its truth.In contrast to this approach, Ludwig Wittgenstein observed, following Moore's paradox, that one can say \"He believes it, but it isn't so,\" but not \"He knows it, but it isn't so.\" He goes on to argue that these do not correspond to distinct mental states, but rather to distinct ways of talking about conviction. What is different here is not the mental state of the speaker, but the activity in which they are engaged. For example, on this account, to know that the kettle is boiling is not to be in a particular state of mind, but to perform a particular task with the statement that the kettle is boiling. Wittgenstein sought to bypass the difficulty of definition by looking to the way \"knowledge\" is used in natural languages. He saw knowledge as a case of a family resemblance. Following this idea, \"knowledge\" has been reconstructed as a cluster concept that points out relevant features but that is not adequately captured by any definition.\n\n\n== Self-knowledge ==\n“Self-knowledge” usually refers to a person's knowledge of their own sensations, thoughts, beliefs, and other mental states. A number of questions regarding self-knowledge have been the subject of extensive debates in philosophy, including whether self-knowledge differs from other types of knowledge, whether we have privileged self-knowledge compared to knowledge of other minds, and the nature of our acquaintance with ourselves. David Hume famously expressed skepticism about whether we could ever have self-knowledge over and above our immediate awareness of a \"bundle of perceptions\", which was part of his broader skepticism about personal identity.\n\n\n== The value of knowledge ==\n\nIt is generally assumed that knowledge is more valuable than mere true belief. If so, what is the explanation? A formulation of the value problem in epistemology first occurs in Plato's Meno. Socrates points out to Meno that a man who knew the way to Larissa could lead others there correctly. But so, too, could a man who had true beliefs about how to get there, even if he had not gone there or had any knowledge of Larissa. Socrates says that it seems that both knowledge and true opinion can guide action. Meno then wonders why knowledge is valued more than true belief and why knowledge and true belief are different. Socrates responds that knowledge is more valuable than mere true belief because it is tethered or justified. Justification, or working out the reason for a true belief, locks down true belief.The problem is to identify what (if anything) makes knowledge more valuable than mere true belief, or that makes knowledge more valuable than a mere minimal conjunction of its components, such as justification, safety, sensitivity, statistical likelihood, and anti-Gettier conditions, on a particular analysis of knowledge that conceives of knowledge as divided into components (to which knowledge-first epistemological theories, which posit knowledge as fundamental, are notable exceptions). The value problem re-emerged in the philosophical literature on epistemology in the twenty-first century following the rise of virtue epistemology in the 1980s, partly because of the obvious link to the concept of value in ethics.In contemporary philosophy, epistemologists including Ernest Sosa, John Greco, Jonathan Kvanvig, Linda Zagzebski, and Duncan Pritchard have defended virtue epistemology as a solution to the value problem. They argue that epistemology should also evaluate the \"properties\" of people as epistemic agents (i.e. intellectual virtues), rather than merely the properties of propositions and propositional mental attitudes.\n\n\n== Scientific knowledge ==\n\nThe development of the scientific method has made a significant contribution to how knowledge of the physical world and its phenomena is acquired. To be termed scientific, a method of inquiry must be based on gathering observable and measurable evidence subject to specific principles of reasoning and experimentation. The scientific method consists of the collection of data through observation and experimentation, and the formulation and testing of hypotheses. Science, and the nature of scientific knowledge have also become the subject of philosophy. As science itself has developed, scientific knowledge now includes a broader usage in the soft sciences such as biology and the social sciences – discussed elsewhere as meta-epistemology, or genetic epistemology, and to some extent related to \"theory of cognitive development\". Note that \"epistemology\" is the study of knowledge and how it is acquired. Science is \"the process used everyday to logically complete thoughts through inference of facts determined by calculated experiments.\" Sir Francis Bacon was critical in the historical development of the scientific method; his works established and popularized an inductive methodology for scientific inquiry. His famous aphorism, \"knowledge is power\", is found in the Meditations Sacrae (1597).Until recent times, at least in the Western tradition, it was simply taken for granted that knowledge was something possessed only by humans – and probably adult humans at that. Sometimes the notion might stretch to Society-as-such, as in (e. g.) \"the knowledge possessed by the Coptic culture\" (as opposed to its individual members), but that was not assured either. Nor was it usual to consider unconscious knowledge in any systematic way until this approach was popularized by Freud.Those who use the phrase \"scientific knowledge\" don't necessary claim to certainty, since scientists will never be absolutely certain when they are correct and when they are not. It is thus an irony of proper scientific method that one must doubt even when correct, in the hopes that this practice will lead to greater convergence on the truth in general.\n\n\n== Situated knowledge ==\n\nSituated knowledge is knowledge specific to a particular situation. It was used by Donna Haraway as an extension of the feminist approaches of \"successor science\" suggested by Sandra Harding, one which \"offers a more adequate, richer, better account of a world, in order to live in it well and in critical, reflexive relation to our own as well as others' practices of domination and the unequal parts of privilege and oppression that makes up all positions.\" This situation partially transforms science into a narrative, which Arturo Escobar explains as, \"neither fictions nor supposed facts.\" This narrative of situation is historical textures woven of fact and fiction, and as Escobar explains further, \"even the most neutral scientific domains are narratives in this sense,\" insisting that rather than a purpose dismissing science as a trivial matter of contingency, \"it is to treat (this narrative) in the most serious way, without succumbing to its mystification as 'the truth' or to the ironic skepticism common to many critiques.\"Haraway's argument stems from the limitations of the human perception, as well as the overemphasis of the sense of vision in science. According to Haraway, vision in science has been, \"used to signify a leap out of the marked body and into a conquering gaze from nowhere.\" This is the \"gaze that mythically inscribes all the marked bodies, that makes the unmarked category claim the power to see and not be seen, to represent while escaping representation.\" This causes a limitation of views in the position of science itself as a potential player in the creation of knowledge, resulting in a position of \"modest witness\". This is what Haraway terms a \"god trick\", or the aforementioned representation while escaping representation. In order to avoid this, \"Haraway perpetuates a tradition of thought which emphasizes the importance of the subject in terms of both ethical and political accountability\".Some methods of generating knowledge, such as trial and error, or learning from experience, tend to create highly situational knowledge.\nSituational knowledge is often embedded in language, culture, or traditions. This integration of situational knowledge is an allusion to the community, and its attempts at collecting subjective perspectives into an embodiment \"of views from somewhere.\" Knowledge is also said to be related to the capacity of acknowledgement in human beings.Even though Haraway's arguments are largely based on feminist studies, this idea of different worlds, as well as the skeptic stance of situated knowledge is present in the main arguments of post-structuralism. Fundamentally, both argue the contingency of knowledge on the presence of history; power, and geography, as well as the rejection of universal rules or laws or elementary structures; and the idea of power as an inherited trait of objectification.\n\n\n== Partial knowledge ==\n\nOne discipline of epistemology focuses on partial knowledge. In most cases, it is not possible to understand an information domain exhaustively; our knowledge is always incomplete or partial. Most real problems have to be solved by taking advantage of a partial understanding of the problem context and problem data, unlike the typical math problems one might solve at school, where all data is given and one is given a complete understanding of formulas necessary to solve them (False consensus effect).\nThis idea is also present in the concept of bounded rationality which assumes that in real-life situations people often have a limited amount of information and make decisions accordingly.\n\n\n== Religious concepts of knowledge ==\n\n\n=== Christianity ===\nIn many expressions of Christianity, such as Catholicism and Anglicanism, knowledge is one of the seven gifts of the Holy Spirit.\n\"The knowledge that comes from the Holy Spirit, however, is not limited to human knowledge; it is a special gift, which leads us to grasp, through creation, the greatness and love of God and his profound relationship with every creature.\" (Pope Francis, papal audience May 21, 2014)\n\n\n=== Hinduism ===\nविद्या दान (Vidya Daan) i.e. knowledge sharing is a major part of Daan, a tenet of all Dharmic Religions.Hindu Scriptures present two kinds of knowledge, Paroksh Gyan and Prataksh Gyan. Paroksh Gyan (also spelled Paroksha-Jnana) is secondhand knowledge: knowledge obtained from books, hearsay, etc. Pratyaksh Gyan (also spelled Pratyaksha-Jnana) is the knowledge borne of direct experience, i.e., knowledge that one discovers for oneself. Jnana yoga (\"path of knowledge\") is one of three main types of yoga expounded by Krishna in the Bhagavad Gita. (It is compared and contrasted with Bhakti Yoga and Karma yoga.)\n\n\n=== Islam ===\n\nIn Islam, knowledge (Arabic: علم, ʿilm) is given great significance. \"The Knowing\" (al-ʿAlīm) is one of the 99 names reflecting distinct attributes of God. The Qur'an asserts that knowledge comes from God (2:239) and various hadith encourage the acquisition of knowledge. Muhammad is reported to have said \"Seek knowledge from the cradle to the grave\" and \"Verily the men of knowledge are the inheritors of the prophets\". Islamic scholars, theologians and jurists are often given the title alim, meaning \"knowledgeble\".\n\n\n=== Judaism ===\nIn Jewish tradition, knowledge (Hebrew: דעת da'ath) is considered one of the most valuable traits a person can acquire. Observant Jews recite three times a day in the Amidah \"Favor us with knowledge, understanding and discretion that come from you. Exalted are you, Existent-One, the gracious giver of knowledge.\" The Tanakh states, \"A wise man gains power, and a man of knowledge maintains power\", and \"knowledge is chosen above gold\".\nThe Old Testament's tree of the knowledge of good and evil contained the knowledge that separated Man from God: \"And the LORD God said, Behold, the man is become as one of us, to know good and evil...\" (Genesis 3:22)\n\n\n== See also ==\nOmniscience\nOutline of knowledge – guide to the subject of knowledge presented as a tree structured list of its subtopics.\nOutline of human intelligence - list of subtopics in tree structure\nAnalytic-synthetic distinction\nDecolonization of knowledge\nDesacralization of knowledge\nDescriptive knowledge\nEpistemic modal logic\nGnosticism\nInductive inference\nInductive probability\nIntelligence\nMetaknowledge\nProcedural knowledge\nSociety for the Diffusion of Useful Knowledge\n\n\n== References ==\n\n\n== External links ==\n\nKnowledge at PhilPapers\n\"Knowledge\". Internet Encyclopedia of Philosophy.\nZalta, Edward N. (ed.). \"The Value of Knowledge\". Stanford Encyclopedia of Philosophy.\nZalta, Edward N. (ed.). \"The Analysis of Knowledge\". Stanford Encyclopedia of Philosophy.\nZalta, Edward N. (ed.). \"Knowledge by Acquaintance vs. Description\". Stanford Encyclopedia of Philosophy.\nKnowledge at the Indiana Philosophy Ontology Project"}