{"topic": "acceptance", "english_title": "Acceptance", "english": "Acceptance in human psychology is a person's assent to the reality of a situation, recognizing a process or condition (often a negative or uncomfortable situation) without attempting to change it or protest it. The concept is close in meaning to acquiescence, derived from the Latin acquiēscere (to find rest in).\n\n\n== Definition ==\nThe term acceptance is a noun with various different meanings. When the person to whom a proposal is made signifies their assent, it is an \"acceptance\" of their offer, also called an agreement. For example, if someone gives a gift and another receives it, then they have accepted the gift; therefore, having acceptance. Another definition of acceptance has to do with positive welcome and belonging, favor, and endorsement. For instance, one can like someone and accept them due to their approval of that persons. Another description is that acceptance can be an act of believing or assenting. The definition overlaps with toleration, but acceptance and tolerance are not synonyms.\nAcceptance – \"An express act or implication by conduct that manifests assent to the terms of an offer in a manner invited or required by the offer so that a binding contract is formed. The exercise of power conferred by an offer by performance of some act. The act of a person to whom something is offered of tendered by another, whereby the offered demonstrates through an act invited by the offer an intention of retaining the subject of the offer.\"Eckhart Tolle, a spiritual teacher who is alive today, defines acceptance as a \"surrender to the Now\" response to anything occurring in any moment of life. There, strength, peace and serenity are available when one stops struggling to resist, or hang on tightly to what is so in any given moment. What do I have right now? Now what am I experiencing? The point is, can one be sad when one is sad, afraid when afraid, silly when silly, happy when happy, judgmental when judgmental, overthinking when overthinking, serene when serene, etc.\nWhat Tolle teaches is to observe what is happening without telling a story about it. For example, Tolle shares in his book Stillness Speaks how easy it is to confuse a story one tells for the facts of a situation. If someone doesn’t return your call one may say “He didn’t have the decency to return my call.” That is the story one tells. On the other hand, the facts of the situation are “He did not call.” The facts don’t tell a story about the person or make a judgment about the situation. The facts are always neutral. When one observes what is happening there is an awareness brought in and then acceptance of the situation becomes an option that is available at any given moment.\nTo simplify, acceptance means allowing; allowing unwanted private experiences (thoughts, feelings and urges) to come and go without struggling with them.\n\n\n== Types ==\nBefore any breakdown to types, it should be recognized that acceptance is treating whatever happens, the actual event which is the outcome of all combined previous events, as overall the best outcome. Acceptance typically contains the concept of approval; the psycho-spiritual use of the term infers a non-judgmental mindset. Acceptance is contrasted with resistance, a term that has strong political and psychoanalytic connotations that do not apply in most contexts. Groups and individuals can show acceptance of various events and conditions in the world; individuals may accept elements of their own thoughts, feelings, and personal histories. For example, psychotherapeutic treatment of a person with depression or anxiety can involve fostering acceptance either for whatever personal circumstances may give rise to those feelings or for the feelings themselves. Psychotherapy can also involve lessening an individual's acceptance of various situations.\nNotions of acceptance are prominent in many faiths and meditation practices. For example, Buddhism's first noble truth, \"All life is suffering\", invites people to accept that suffering is a natural part of life. The term \"Kabbalah\" literally means acceptance. Minority groups in society often describe their goal as acceptance, wherein the majority will not marginalize the minority's full participation in society. A majority may be said to tolerate minorities when it confines their participation to certain aspects of society, but not accept them.\nAcceptance is the fifth stage of the Kübler-Ross model (commonly known as the \"stages of grief\").\nThe Big Book of Alcoholics Anonymous describes the importance of acceptance in the treatment of alcoholism. It states that acceptance can be used to resolve situations where a person feels disturbed by a \"person, place, thing or situation – some fact of [their] life – [which is] unacceptable to [them]\". It claims that an alcoholic person cannot find serenity until they accept that \"nothing happens in God's world by mistake\" and that the condition of alcoholism must be accepted as a given.\n\n\n=== Self-acceptance ===\n\nSelf-acceptance is being satisfied with one's current self. It is an agreement with oneself to appreciate, validate, and support the self as it is, despite deficiencies and negative past behavior. People have trouble accepting themselves because of guilt, trauma, or a perceived lack of motivation. Some people have the misconception that if one is happy with themselves, it always means that they would not change anything about who they are. Individuals do not have to be unhappy with themselves to know and can actively change things they don't like. To accept yourself means to no longer reject yourself. Being rejected is bad for your health. People who feel isolated and lonely and excluded tend to cause poor physical health on themselves, which can be derived from a lack of eating or exercise. They don’t sleep well, their immune systems sputter, and they even tend to die sooner than people who are surrounded by others who care about them. We think if we punish ourselves enough, we'll change. Accepting ourselves unconditionally is difficult because we must give up the fantasy that if we punish ourselves enough with negative thoughts, we'll change but instead we make ourselves more anxious. The frightened little child inside of us doesn't respond favorably to such a mean dictator. Instead, we need to find ways to accept the anxious part of ourselves, to hold that part by the hand and gently say, \"You're OK.\" (Nathan DeWall, 2011)\n\n\n=== Social acceptance ===\n\nSocial acceptance affects people of all social and age groups. Social acceptance can be defined as tolerating the differences and diversity in others because most people attempt to look and act like others do in order to fit in.Children and teenagers tend to desire to be accepted among friends as part of that group, and act upon that desire through peer pressure. Peer pressure sometimes determines how people style their hair and clothing to \"look cool\". A desire to be accepted by those whose friendship one values can determine their openness towards popular behavior smoking, drinking, swearing, and more. People exhibit and avoid certain behaviors out of the desire for the approval of their friends, which may include drinking or taking drugs.\nWhen it comes to mental disorders, social acceptance plays a big role in recovery. Many people don't understand mental illness, so they are unsure of how to embrace people who have a disease, leaving these people with feelings of isolation in friend groups.\n\n\n=== Conditional ===\n\nA type of acceptance that requires modification of the initial conditions before the final acceptance is made, is called conditional acceptance, or qualified acceptance. For example, a contract that needs to be accepted from two parties may be adjusted or modified so that it fits both parties' satisfactions. A person has been made an offer that they are willing to agree on as long as some changes are made in its terms or that some conditions or event occurs gives conditional acceptance. In a contract that is made from a business to the employer, both parties may change and modify the contract until both parties agree or accept the details in the business contract.\n\n\n=== Expressed ===\nExpressed acceptance involves making an overt and unambiguous acceptance of the set conditions. For example, a person clearly and explicitly agreeing to an offer. They accept the terms without any changes.\n\n\n=== Implied ===\nImplied acceptance has one's intents to consent to the presented conditions made. Acceptance is implied by demonstrating any act indicating a person's assent to the proposed bargain. If a person selects an item in a department store and pays the cashier for it, the person thereby indicates that they agree to the offer of the item for the price stated on the price tag.\n\n\n== Beliefs ==\nAcceptance is fundamental to the core beliefs of most Abrahamic religions: the word \"Islam\" can be translated as \"acceptance\", \"surrender\" or \"voluntary submission\", and Christianity is based upon the \"acceptance\" of Jesus of Nazareth as the Christ and acceptance of God's will. Religions and psychological treatments often suggest a path of acceptance when a situation is both disliked and fated, or when change may be possible only at great cost or risk. Acceptance may imply only a lack of outward, behavioral attempts at possible change, but the word is also used more specifically for a felt or hypothesized cognitive or emotional state.\nWithin Christian beliefs, acceptance is characterized as embracing the reality of a situation based on one's trust in God's perfect will and control. In the Muslim community, acceptance of Allah is similar to people that are considered Christian and how they accept God as their higher being (Bates, 2002). Jewish people accept the Commandments as a way to live and have a good and fulfilling life (McDowell and Stewart, 1983).\nBeliefs and acceptance overlap in meaning. The acceptance of one's beliefs is important to show commitment and structure of one's life. Not only is it vital for survival, but it is used in everyday relationships. Being accepted by a friend has shown to positively affect an individual's self-esteem, well-being, and emotional outlook. In fact, without acceptance, it could lead to a host of psychological issues.\n\n\n== Bibliography ==\n\"Acceptance - Types Of Acceptance.\" Law Library - American Law and Legal Information. 8 Apr. 2009.\n\"The 5 stages of grief.\" Assortment Articles: Free Online Articles on Health, Science, Education & More. 12 Apr. 2009.\n\"The Last Phase of Grief: Acceptance, Reorganization and Integration.\" Getting Past Your Past. 14 Apr. 2009.\n\"The need for social acceptance and approval --- its power.\" The Way. Art of Living. Essays. Topically arranged scripture, proverbs, precepts, quotations. Teachings of Jesus. Conservative Christian outlook emphasizing self-discipline, self-denial, integrity, principle, character, chastity, goodness, morality, virtue. 16 Apr. 2009.\n\"Self Acceptance.\" Archived 2009-04-01 at the Wayback Machine Become Who You Want To Be. 16 Apr. 2009.\nWelcome, Traveling Free. 10 Apr. 2009.\n\"What A Difference A Friend Makes: Social Acceptance Is Key to Mental Health Recovery.\" Mental illness, mental health information center. 10 Apr. 2009.\nUnderstanding Evolution. (2009). University of California Museum of Paleontology. 14 April 2009.\nMcDowell, Josh and Don Stewart. (1983) “Basic Beliefs of Judaism”, Handbook of Today's Religions. Nashville: Thomas Nelson Publishers, 1983. Twelfth printing, June 1992.\nBates, Stephen. “The Beliefs and Laws of Islam”. (2002). Islam for Today. 14 April 2009.\n\n\n== External links ==\nArt of Accepting\nAcceptance and Commitment Therapy\nThe therapeutic method of self-acceptance\n\n\n== References =="}