{"topic": "Machines", "english_title": "Machine", "english": "A machine is a human-made device that uses power to apply forces and control movement to perform an action. Machines can be driven by animals and people, by natural forces such as wind and water, and by chemical, thermal, or electrical power, and include a system of mechanisms that shape the actuator input to achieve a specific application of output forces and movement. They can also include computers and sensors that monitor performance and plan movement, often called mechanical systems.\nRenaissance natural philosophers identified six simple machines which were the elementary devices that put a load into motion, and calculated the ratio of output force to input force, known today as mechanical advantage.Modern machines are complex systems that consist of structural elements, mechanisms and control components and include interfaces for convenient use. Examples include: a wide range of vehicles, such as automobiles, boats and airplanes; appliances in the home and office, including computers, building air handling and water handling systems; as well as farm machinery, machine tools and factory automation systems and robots.\n\n\n== Etymology ==\nThe English word machine comes through Middle French from Latin machina, which in turn derives from the Greek (Doric μαχανά makhana, Ionic μηχανή mekhane \"contrivance, machine, engine\", a derivation from μῆχος mekhos \"means, expedient, remedy\"). The word mechanical (Greek: μηχανικός) comes from the same Greek roots. A wider meaning of \"fabric, structure\" is found in classical Latin, but not in Greek usage. This meaning is found in late medieval French, and is adopted from the French into English in the mid-16th century.\nIn the 17th century, the word machine could also mean a scheme or plot, a meaning now expressed by the derived machination. The modern meaning develops out of specialized application of the term to stage engines used in theater and to military siege engines, both in the late 16th and early 17th centuries. The OED traces the formal, modern meaning to John Harris' Lexicon Technicum (1704), which has:\n\nMachine, or Engine, in Mechanicks, is whatsoever hath Force sufficient either to raise or stop the Motion of a Body. Simple Machines are commonly reckoned to be Six in Number, viz. the Ballance, Leaver, Pulley, Wheel, Wedge, and Screw. Compound Machines, or Engines, are innumerable.The word engine used as a (near-) synonym both by Harris and in later language derives ultimately (via Old French) from Latin ingenium \"ingenuity, an invention\".\n\n\n== History ==\n\nThe hand axe, made by chipping flint to form a wedge, in the hands of a human transforms force and movement of the tool into a transverse splitting forces and movement of the workpiece. The hand axe is the first example of a wedge, the oldest of the six classic simple machines, from which most machines are based. The second oldest simple machine was the inclined plane (ramp), which has been used since prehistoric times to move heavy objects.The other four simple machines were invented in the ancient Near East. The wheel, along with the wheel and axle mechanism, was invented in Mesopotamia (modern Iraq) during the 5th millennium BC. The lever mechanism first appeared around 5,000 years ago in the Near East, where it was used in a simple balance scale, and to move large objects in ancient Egyptian technology. The lever was also used in the shadoof water-lifting device, the first crane machine, which appeared in Mesopotamia circa 3000 BC, and then in ancient Egyptian technology circa 2000 BC. The earliest evidence of pulleys date back to Mesopotamia in the early 2nd millennium BC, and ancient Egypt during the Twelfth Dynasty (1991-1802 BC). The screw, the last of the simple machines to be invented, first appeared in Mesopotamia during the Neo-Assyrian period (911-609) BC. The Egyptian pyramids were built using three of the six simple machines, the inclined plane, the wedge, and the lever, to create structures like the Great Pyramid of Giza.Three of the simple machines were studied and described by Greek philosopher Archimedes around the 3rd century BC: the lever, pulley and screw.  Archimedes discovered the principle of mechanical advantage in the lever.  Later Greek philosophers defined the classic five simple machines (excluding the inclined plane) and were able to roughly calculate their mechanical advantage.  Heron of Alexandria (ca. 10–75 AD) in his work Mechanics lists five mechanisms that can \"set a load in motion\"; lever, windlass, pulley, wedge, and screw, and describes their fabrication and uses.  However, the Greeks' understanding was limited to statics (the balance of forces) and did not include dynamics (the tradeoff between force and distance) or the concept of work.\n\nThe earliest practical water-powered machines, the water wheel and watermill, first appeared in the Persian Empire, in what are now Iraq and Iran, by the early 4th century BC. The earliest practical wind-powered machines, the windmill and wind pump, first appeared in the Muslim world during the Islamic Golden Age, in what are now Iran, Afghanistan, and Pakistan, by the 9th century AD. The earliest practical steam-powered machine was a steam jack driven by a steam turbine, described in 1551 by Taqi al-Din Muhammad ibn Ma'ruf in Ottoman Egypt.The cotton gin was invented in India by the 6th century AD, and the spinning wheel was invented in the Islamic world by the early 11th century, both of which were fundamental to the growth of the cotton industry. The spinning wheel was also a precursor to the spinning jenny, which was a key development during the early Industrial Revolution in the 18th century. The crankshaft and camshaft were invented by Al-Jazari in Northern Mesopotamia circa 1206, and they later became central to modern machinery such as the steam engine, internal combustion engine and automatic controls.The earliest programmable machines were developed in the Muslim world. A music sequencer, a programmable musical instrument, was the earliest type of programmable machine. The first music sequencer was an automated flute player invented by the Banu Musa brothers, described in their Book of Ingenious Devices, in the 9th century. In 1206, Al-Jazari invented programmable automata/robots. He described four automaton musicians, including drummers operated by a programmable drum machine, where they could be made to play different rhythms and different drum patterns.During the Renaissance, the dynamics of the Mechanical Powers, as the simple machines were called, began to be studied from the standpoint of how much useful work they could perform, leading eventually to the new concept of mechanical work. In 1586 Flemish engineer Simon Stevin derived the mechanical advantage of the inclined plane, and it was included with the other simple machines. The complete dynamic theory of simple machines was worked out by Italian scientist Galileo Galilei in 1600 in Le Meccaniche (\"On Mechanics\"). He was the first to understand that simple machines do not create energy, they merely transform it.The classic rules of sliding friction in machines were discovered by Leonardo da Vinci (1452–1519), but remained unpublished in his notebooks. They were rediscovered by Guillaume Amontons (1699) and were further developed by Charles-Augustin de Coulomb (1785).James Watt patented his parallel motion linkage in 1782, which made the double acting steam engine practical. The Boulton and Watt steam engine and later designs powered steam locomotives, steam ships, and factories.\nThe Industrial Revolution was a period from 1750 to 1850 where changes in agriculture, manufacturing, mining, transportation, and technology had a profound effect on the social, economic and cultural conditions of the times. It began in the United Kingdom, then subsequently spread throughout Western Europe, North America, Japan, and eventually the rest of the world.\nStarting in the later part of the 18th century, there began a transition in parts of Great Britain's previously manual labour and draft-animal-based economy towards machine-based manufacturing. It started with the mechanisation of the textile industries, the development of iron-making techniques and the increased use of refined coal.\n\n\n== Simple machines ==\n\nThe idea that a machine can be decomposed into simple movable elements led Archimedes to define the lever, pulley and screw as simple machines. By the time of the Renaissance this list increased to include the wheel and axle, wedge and inclined plane. The modern approach to characterizing machines focusses on the components that allow movement, known as joints.\nWedge (hand axe): Perhaps the first example of a device designed to manage power is the hand axe, also called biface and Olorgesailie. A hand axe is made by chipping stone, generally flint, to form a bifacial edge, or wedge. A wedge is a simple machine that transforms lateral force and movement of the tool into a transverse splitting force and movement of the workpiece. The available power is limited by the effort of the person using the tool, but because power is the product of force and movement, the wedge amplifies the force by reducing the movement. This amplification, or mechanical advantage is the ratio of the input speed to output speed.  For a wedge this is given by 1/tanα, where α is the tip angle. The faces of a wedge are modeled as straight lines to form a sliding or prismatic joint.\nLever: The lever is another important and simple device for managing power. This is a body that pivots on a fulcrum. Because the velocity of a point farther from the pivot is greater than the velocity of a point near the pivot, forces applied far from the pivot are amplified near the pivot by the associated decrease in speed. If a is the distance from the pivot to the point where the input force is applied and b is the distance to the point where the output force is applied, then a/b is the mechanical advantage of the lever. The fulcrum of a lever is modeled as a hinged or revolute joint.\nWheel: The wheel is an important early machine, such as the chariot. A wheel uses the law of the lever to reduce the force needed to overcome friction when pulling a load. To see this notice that the friction associated with pulling a load on the ground is approximately the same as the friction in a simple bearing that supports the load on the axle of a wheel. However, the wheel forms a lever that magnifies the pulling force so that it overcomes the frictional resistance in the bearing.\n\nThe classification of simple machines to provide a strategy for the design of new machines was developed by Franz Reuleaux, who collected and studied over 800 elementary machines. He recognized that the classical simple machines can be separated into the lever, pulley and wheel and axle that are formed by a body rotating about a hinge, and the inclined plane, wedge and screw that are similarly a block sliding on a flat surface.Simple machines are elementary examples of kinematic chains or linkages that are used to model mechanical systems ranging from the steam engine to robot manipulators. The bearings that form the fulcrum of a lever and that allow the wheel and axle and pulleys to rotate are examples of a kinematic pair called a hinged joint. Similarly, the flat surface of an inclined plane and wedge are examples of the kinematic pair called a sliding joint. The screw is usually identified as its own kinematic pair called a helical joint.\nThis realization shows that it is the joints, or the connections that provide movement, that are the primary elements of a machine. Starting with four types of joints, the rotary joint, sliding joint, cam joint and gear joint, and related connections such as cables and belts, it is possible to understand a machine as an assembly of solid parts that connect these joints called a mechanism .Two levers, or cranks, are combined into a planar four-bar linkage by attaching a link that connects the output of one crank to the input of another. Additional links can be attached to form a six-bar linkage or in series to form a robot.\n\n\n== Mechanical systems ==\n  \nA mechanical system manages power to accomplish a task that involves forces and movement. Modern machines are systems consisting of (i) a power source and actuators that generate forces and movement, (ii) a system of mechanisms that shape the actuator input to achieve a specific application of output forces and movement, (iii) a controller with sensors that compare the output to a performance goal and then directs the actuator input, and (iv) an interface to an operator consisting of levers, switches, and displays. This can be seen in Watt's steam engine in which the power is provided by steam expanding to drive the piston. The walking beam, coupler and crank transform the linear movement of the piston into rotation of the output pulley. Finally, the pulley rotation drives the flyball governor which controls the valve for the steam input to the piston cylinder. \nThe adjective \"mechanical\" refers to skill in the practical application of an art or science, as well as relating to or caused by movement, physical forces, properties or agents such as is dealt with by mechanics. Similarly Merriam-Webster Dictionary defines \"mechanical\" as relating to machinery or tools.\nPower flow through a machine provides a way to understand the performance of devices ranging from levers and gear trains to automobiles and robotic systems. The German mechanician Franz Reuleaux wrote, \"a machine is a combination of resistant bodies so arranged that by their means the mechanical forces of nature can be compelled to do work accompanied by certain determinate motion.\" Notice that forces and motion combine to define power.\nMore recently, Uicker et al. stated that a machine is \"a device for applying power or changing its direction.\" McCarthy and Soh describe a machine as a system that \"generally consists of a power source and a mechanism for the controlled use of this power.\"\n\n\n== Power sources ==\n\nHuman and animal effort were the original power sources for early machines.\nWaterwheel: Waterwheels appeared around the world around 300 BC to use flowing water to generate rotary motion, which was applied to milling grain, and powering lumber, machining and textile operations. Modern water turbines use water flowing through a dam to drive an electric generator.\nWindmill: Early windmills captured wind power to generate rotary motion for milling operations. Modern wind turbines also drives a generator. This electricity in turn is used to drive motors forming the actuators of mechanical systems.\nEngine: The word engine derives from \"ingenuity\" and originally referred to contrivances that may or may not be physical devices. See Merriam-Webster's definition of engine. A steam engine uses heat to boil water contained in a pressure vessel; the expanding steam drives a piston or a turbine. This principle can be seen in the aeolipile of Hero of Alexandria. This is called an external combustion engine.\nAn automobile engine is called an internal combustion engine because it burns fuel (an exothermic chemical reaction) inside a cylinder and uses the expanding gases to drive a piston. A jet engine uses a turbine to compress air which is burned with fuel so that it expands through a nozzle to provide thrust to an aircraft, and so is also an \"internal combustion engine.\"  Power plant: The heat from coal and natural gas combustion in a boiler generates steam that drives a steam turbine to rotate an electric generator. A nuclear power plant uses heat from a nuclear reactor to generate steam and electric power. This power is distributed through a network of transmission lines for industrial and individual use.\nMotors: Electric motors use either AC or DC electric current to generate rotational movement. Electric servomotors are the actuators for mechanical systems ranging from robotic systems to modern aircraft.\nFluid Power: Hydraulic and pneumatic systems use electrically driven pumps to drive water or air respectively into cylinders to power linear movement.\n\n\n== Mechanisms ==\nThe mechanism of a mechanical system is assembled from components called machine elements. These elements provide structure for the system and control its movement.\nThe structural components are, generally, the frame members, bearings, splines, springs,  seals, fasteners and covers. The shape, texture and color of covers provide a styling and operational interface between the mechanical system and its users.\nThe assemblies that control movement are also called \"mechanisms.\" Mechanisms are generally classified as gears and gear trains, which includes belt drives and chain drives, cam and follower mechanisms, and linkages, though there are other special mechanisms such as clamping linkages, indexing mechanisms, escapements and friction devices such as brakes and clutches.\nThe number of degrees of freedom of a mechanism, or its mobility, depends on the number of links and joints and the types of joints used to construct the mechanism. The general mobility of a mechanism is the difference between the unconstrained freedom of the links and the number of constraints imposed by the joints. It is described by the Chebychev-Grübler-Kutzbach criterion.\n\n\n=== Gears and gear trains ===\n\nThe transmission of rotation between contacting toothed wheels can be traced back to the Antikythera mechanism of Greece and the south-pointing chariot of China. Illustrations by the renaissance scientist Georgius Agricola show gear trains with cylindrical teeth. The implementation of the involute tooth yielded a standard gear design that provides a constant speed ratio. Some important features of gears and gear trains are:\n\nThe ratio of the pitch circles of mating gears defines the speed ratio and the mechanical advantage of the gear set.\nA planetary gear train provides high gear reduction in a compact package.\nIt is possible to design gear teeth for gears that are non-circular, yet still transmit torque smoothly.\nThe speed ratios of chain and belt drives are computed in the same way as gear ratios. See bicycle gearing.\n\n\n=== Cam and follower mechanisms ===\nA cam and follower is formed by the direct contact of two specially shaped links. The driving link is called the cam (also see cam shaft) and the link that is driven through the direct contact of their surfaces is called the follower. The shape of the contacting surfaces of the cam and follower determines the movement of the mechanism.\n\n\n=== Linkages ===\n\nA linkage is a collection of links connected by joints. Generally, the links are the structural elements and the joints allow movement. Perhaps the single most useful example is the planar four-bar linkage. However, there are many more special linkages:\n\nWatt's linkage is a four-bar linkage that generates an approximate straight line. It was critical to the operation of his design for the steam engine. This linkage also appears in vehicle suspensions to prevent side-to-side movement of the body relative to the wheels. Also see the article Parallel motion.\nThe success of Watt's linkage lead to the design of similar approximate straight-line linkages, such as Hoeken's linkage and Chebyshev's linkage.\nThe Peaucellier linkage generates a true straight-line output from a rotary input.\nThe Sarrus linkage is a spatial linkage that generates straight-line movement from a rotary input. Select this link for an animation of the Sarrus linkage\nThe Klann linkage and the Jansen linkage are recent inventions that provide interesting walking movements. They are respectively a six-bar and an eight-bar linkage.\n\n\n=== Planar mechanism ===\nA planar mechanism is a mechanical system that is constrained so the trajectories of points in all the bodies of the system lie on planes parallel to a ground plane. The rotational axes of hinged joints that connect the bodies in the system are perpendicular to this ground plane.\n\n\n=== Spherical mechanism ===\nA spherical mechanism is a mechanical system in which the bodies move in a way that the trajectories of points in the system lie on concentric spheres. The rotational axes of hinged joints that connect the bodies in the system pass through the center of these circle.\n\n\n=== Spatial mechanism ===\nA spatial mechanism is a mechanical system that has at least one body that moves in a way that its point trajectories are general space curves. The rotational axes of hinged joints that connect the bodies in the system form lines in space that do not intersect and have distinct common normals.\n\n\n=== Flexure mechanisms ===\nA flexure mechanism consists of a series of rigid bodies connected by compliant elements (also known as flexure joints) that is designed to produce a geometrically well-defined motion upon application of a force.\n\n\n== Machine elements ==\nThe elementary mechanical components of a machine are termed machine elements. These elements consist of three basic types (i) structural components such as frame members, bearings, axles, splines, fasteners, seals, and lubricants, (ii) mechanisms that control movement in various ways such as gear trains, belt or chain drives, linkages, cam and follower systems, including brakes and clutches, and (iii) control components such as buttons, switches, indicators, sensors, actuators and computer controllers. While generally not considered to be a machine element, the shape, texture and color of covers are an important part of a machine that provide a styling and operational interface between the mechanical components of a machine and its users.\n\n\n=== Structural components ===\nA number of machine elements provide important structural functions such as the frame, bearings, splines, spring and seals.\n\nThe recognition that the frame of a mechanism is an important machine element changed the name three-bar linkage into four-bar linkage. Frames are generally assembled from truss or beam elements.\nBearings are components designed to manage the interface between moving elements and are the source of friction in machines. In general, bearings are designed for pure rotation or straight line movement.\nSplines and keys are two ways to reliably mount an axle to a wheel, pulley or gear so that torque can be transferred through the connection.\nSprings provides forces that can either hold components of a machine in place or acts as a suspension to support part of a machine.\nSeals are used between mating parts of a machine to ensure fluids, such as water, hot gases, or lubricant do not leak between the mating surfaces.\nFasteners such as screws, bolts, spring clips, and rivets are critical to the assembly of components of a machine. Fasteners are generally considered to be removable. In contrast, joining methods, such as welding, soldering, crimping and the application of adhesives, usually require cutting the parts to disassemble the components\n\n\n== Controllers ==\nControllers combine sensors, logic, and actuators to maintain the performance of components of a machine. Perhaps the best known is the flyball governor for a steam engine. Examples of these devices range from a thermostat that as temperature rises opens a valve to cooling water to speed controllers such as the cruise control system in an automobile. The programmable logic controller replaced relays and specialized control mechanisms with a programmable computer. Servomotors that accurately position a shaft in response to an electrical command are the actuators that make robotic systems possible.\n\n\n== Computing machines ==\n\nCharles Babbage designed machines to tabulate logarithms and other functions in 1837. His Difference engine can be considered an advanced mechanical calculator and his Analytical Engine a forerunner of the modern computer, though none of the larger designs were completed in Babbage's lifetime.\nThe Arithmometer and the Comptometer are mechanical computers that are precursors to modern digital computers. Models used to study modern computers are termed State machine and Turing machine.\n\n\n== Molecular machines ==\n\nThe biological molecule myosin reacts to ATP and ADP to alternately engage with an actin filament and change its shape in a way that exerts a force, and then disengage to reset its shape, or conformation. This acts as the molecular drive that causes muscle contraction. Similarly the biological molecule kinesin has two sections that alternately engage and disengage with microtubules causing the molecule to move along the microtubule and transport vesicles within the cell, and dynein, which moves cargo inside cells towards the nucleus and produces the axonemal beating of motile cilia and flagella. \"In effect, the motile cilium is a nanomachine composed of perhaps over 600 proteins in molecular complexes, many of which also function independently as nanomachines. Flexible linkers allow the mobile protein domains connected by them to recruit their binding partners and induce long-range allostery via protein domain dynamics. \" Other biological machines are responsible for energy production, for example ATP synthase which harnesses energy from proton gradients across membranes to drive a turbine-like motion used to synthesise ATP, the energy currency of a cell. Still other machines are responsible for gene expression, including DNA polymerases for replicating DNA, RNA polymerases for producing mRNA, the spliceosome for removing introns, and the ribosome for synthesising proteins. These machines and their nanoscale dynamics are far more complex than any molecular machines that have yet been artificially constructed. These molecules are increasingly considered to be nanomachines.Researchers have used DNA to construct nano-dimensioned four-bar linkages.\n\n\n== Impact ==\n\n\n=== Mechanization and automation ===\n\nMechanization or mechanisation (BE) is providing human operators with machinery that assists them with the muscular requirements of work or displaces muscular work. In some fields, mechanization includes the use of hand tools. In modern usage, such as in engineering or economics, mechanization implies machinery more complex than hand tools and would not include simple devices such as an un-geared horse or donkey mill. Devices that cause speed changes or changes to or from reciprocating to rotary motion, using means such as gears, pulleys or sheaves and belts, shafts, cams and cranks, usually are considered machines. After electrification, when most small machinery was no longer hand powered, mechanization was synonymous with motorized machines.Automation is the use of control systems and information technologies to reduce the need for human work in the production of goods and services. In the scope of industrialization, automation is a step beyond mechanization. Whereas mechanization provides human operators with machinery to assist them with the muscular requirements of work, automation greatly decreases the need for human sensory and mental requirements as well. Automation plays an increasingly important role in the world economy and in daily experience.\n\n\n=== Automata ===\n\nAn automaton (plural: automata or automatons) is a self-operating machine. The word is sometimes used to describe a robot, more specifically an autonomous robot. A Toy Automaton was patented in 1863.\n\n\n== Mechanics ==\nUsher reports that Hero of Alexandria's treatise on Mechanics focussed on the study of lifting heavy weights. Today mechanics refers to the mathematical analysis of the forces and movement of a mechanical system, and consists of the study of the kinematics and dynamics of these systems.\n\n\n=== Dynamics of machines ===\nThe dynamic analysis of machines begins with a rigid-body model to determine reactions at the bearings, at which point the elasticity effects are included. The rigid-body dynamics studies the movement of systems of interconnected bodies under the action of external forces. The assumption that the bodies are rigid, which means that they do not deform under the action of applied forces, simplifies the analysis by reducing the parameters that describe the configuration of the system to the translation and rotation of reference frames attached to each body.The dynamics of a rigid body system is defined by its equations of motion, which are derived using either Newtons laws of motion or Lagrangian mechanics. The solution of these equations of motion defines how the configuration of the system of rigid bodies changes as a function of time. The formulation and solution of rigid body dynamics is an important tool in the computer simulation of mechanical systems.\n\n\n=== Kinematics of machines ===\nThe dynamic analysis of a machine requires the determination of the movement, or kinematics, of its component parts, known as kinematic analysis. The assumption that the system is an assembly of rigid components allows rotational and translational movement to be modeled mathematically as Euclidean, or rigid, transformations. This allows the position, velocity and acceleration of all points in a component to be determined from these properties for a reference point, and the angular position, angular velocity and angular acceleration of the component.\n\n\n== Machine design ==\nMachine design refers to the procedures and techniques used to address the three phases of a machine's lifecycle:\n\ninvention, which involves the identification of a need, development of requirements, concept generation, prototype development, manufacturing, and verification testing;\nperformance engineering involves enhancing manufacturing efficiency, reducing service and maintenance demands, adding features and improving effectiveness, and validation testing;\nrecycle is the decommissioning and disposal phase and includes recovery and reuse of materials and components.\n\n\n== See also ==\n\nAutomaton\nGear train\nHistory of technology\nLinkage (mechanical)\nList of mechanical, electrical and electronic equipment manufacturing companies by revenue\nMechanism (engineering)\nMechanical advantage\nOutline of automation\nOutline of machines\nPower (physics)\nSimple machines\nTechnology\nVirtual work\nWork (physics)\n\n\n== References ==\n\n\n== Further reading ==\nOberg, Erik; Franklin D. Jones; Holbrook L. Horton; Henry H. Ryffel (2000).  Christopher J. McCauley; Riccardo Heald; Muhammed Iqbal Hussain (eds.). Machinery's Handbook (26th ed.). New York: Industrial Press Inc. ISBN 978-0-8311-2635-3.\nReuleaux, Franz (1876). The Kinematics of Machinery. Trans. and annotated by A. B. W. Kennedy. New York: reprinted by Dover (1963).\nUicker, J. J.; G. R. Pennock; J. E. Shigley (2003). Theory of Machines and Mechanisms. New York: Oxford University Press.Oberg, Erik; Franklin D. Jones; Holbrook L. Horton; Henry H. Ryffel (2000).  Christopher J. McCauley; Riccardo Heald; Muhammed Iqbal Hussain (eds.). Machinery's Handbook (30th ed.). New York: Industrial Press Inc. ISBN 9780831130992.\n\n\n== External links ==\n Media related to Machines at Wikimedia Commons\n Quotations related to Machine at Wikiquote\nReuleaux Collection of Mechanisms and Machines at Cornell University"}