{"topic": "logic", "english_title": "Logic", "english": "Logic (from Greek: λογική, logikḗ, 'possessed of reason, intellectual, dialectical, argumentative') is the systematic study of valid rules of inference, i.e. the relations that lead to the acceptance of one proposition (the conclusion) on the basis of a set of other propositions (premises). More broadly, logic is the analysis and appraisal of arguments.There is no universal agreement as to the exact definition or boundaries of logic (see § Rival conceptions). However, the scope of logic (broadly construed) includes:\n\nThe classification of arguments.\nThe systematic analysis of logical forms.\nThe systematic study of the  validity of deductive inferences.\nThe strength of inductive inferences.\nThe study of faulty arguments, such as fallacies.\nThe study of logical paradoxes.\nThe study of syntax and semantics of formal languages.\nThe study of the concepts of meaning, denotation and truth.Historically, logic has been studied mainly in philosophy (since Antiquity), mathematics (since mid-19th century), and computer science (since mid-20th century).  More recently, logic has also been studied in linguistics and in cognitive science. Overall, logic remains a strongly interdisciplinary area of study. \n\n\n== Types of logic ==\n\n\n=== Philosophical logic ===\nPhilosophical logic is an area of philosophy. It's a set of methods used to solve philosophical problems and a fundamental tool for the advancement of metaphilosophy.\n\n\n=== Informal logic ===\nInformal logic is the study of natural language arguments. The study of fallacies is an important branch of informal logic. Since much informal argument is not strictly speaking deductive, on some conceptions of logic, informal logic is not logic at all. (See § Rival conceptions.)\n\n\n=== Formal logic ===\nFormal logic is the study of inference with purely formal content. An inference possesses a purely formal and explicit content (i.e. it can be expressed as a particular application of a wholly abstract rule) such as, a rule that is not about any particular thing or property. In many definitions of logic, logical consequence and inference with purely formal content are the same.\nExamples of formal logic include (1) traditional syllogistic logic (a.k.a. term logic) and (2) modern symbolic Logic:\n\nSyllogistic logic can be found in the works of Aristotle, making it the earliest known formal study and studies types of syllogism. Modern formal logic follows and expands on Aristotle.\nSymbolic logic is the study of symbolic abstractions that capture the formal features of logical inference, often divided into two main branches: propositional logic and predicate logic.\n\n\n=== Mathematical logic ===\nMathematical logic is an extension of symbolic logic into other areas, in particular to the study of model theory, proof theory, set theory, and computability theory.\n\n\n== Concepts ==\nThe concepts of logical form and argument are central to logic.\nAn argument is constructed by applying one of the forms of the different types of logical reasoning: deductive, inductive, and abductive. In deduction, the validity of an argument is determined solely by its logical form, not its content, whereas the soundness requires both validity and that all the given premises are actually true.Completeness, consistency, decidability, and expressivity, are further fundamental concepts in logic. The categorization of the logical systems and of their properties has led to the emergence of a metatheory of logic known as metalogic. However, agreement on what logic actually is has remained elusive, although the field of universal logic has studied the common structure of logics.\n\n\n=== Logical form ===\n\nLogic is generally considered formal when it analyzes and represents the form of any valid argument type. The form of an argument is displayed by representing its sentences in the formal grammar and symbolism of a logical language to make its content usable in formal inference. Simply put, to formalize simply means to translate English sentences into the language of logic.\nThis is called showing the logical form of the argument. It is necessary because indicative sentences of ordinary language show a considerable variety of form and complexity that makes their use in inference impractical. It requires, first, ignoring those grammatical features irrelevant to logic (such as gender and declension, if the argument is in Latin), replacing conjunctions irrelevant to logic (e.g. \"but\") with logical conjunctions like \"and\" and replacing ambiguous, or alternative logical expressions (\"any\", \"every\", etc.) with expressions of a standard type (e.g. \"all\", or the universal quantifier ∀).\nSecond, certain parts of the sentence must be replaced with schematic letters. Thus, for example, the expression \"all Ps are Qs\" shows the logical form common to the sentences \"all men are mortals\", \"all cats are carnivores\", \"all Greeks are philosophers\", and so on.  The schema can further be condensed into the formula A(P,Q), where the letter A indicates the judgement 'all – are –'.\nThe importance of form was recognised from ancient times. Aristotle uses variable letters to represent valid inferences in Prior Analytics, leading Jan Łukasiewicz to say that the introduction of variables was \"one of Aristotle's greatest inventions\". According to the followers of Aristotle (such as Ammonius), only the logical principles stated in schematic terms belong to logic, not those given in concrete terms. The concrete terms 'man', 'mortal', etc., are analogous to the substitution values of the schematic placeholders P, Q, R, which were called the 'matter' (Greek: ὕλη, hyle) of the inference.\nThere is a big difference between the kinds of formulas seen in traditional term logic and the predicate calculus that is the fundamental advance of modern logic. The formula A(P,Q) (all Ps are Qs) of traditional logic corresponds to the more complex formula \n  \n    \n      \n        ∀\n        x\n        (\n        P\n        (\n        x\n        )\n        →\n        Q\n        (\n        x\n        )\n        )\n      \n    \n    {\\displaystyle \\forall x(P(x)\\rightarrow Q(x))}\n   in predicate logic, involving the logical connectives for universal quantification and implication rather than just the predicate letter A and using variable arguments \n  \n    \n      \n        P\n        (\n        x\n        )\n      \n    \n    {\\displaystyle P(x)}\n   where traditional logic uses just the term letter P.  With the complexity comes power, and the advent of the predicate calculus inaugurated revolutionary growth of the subject.\n\n\n=== Semantics ===\n\nThe validity of an argument depends upon the meaning, or semantics, of the sentences that make it up.\nAristotle's six Organon, especially De Interpretatione, gives a cursory outline of semantics which the scholastic logicians, particularly in the thirteenth and fourteenth century, developed into a complex and sophisticated theory, called supposition theory. This showed how the truth of simple sentences, expressed schematically, depend on how the terms 'supposit', or stand for, certain extra-linguistic items. For example, in part II of his Summa Logicae, William of Ockham presents a comprehensive account of the necessary and sufficient conditions for the truth of simple sentences, in order to show which arguments are valid and which are not.  Thus \"every A is B' is true if and only if there is something for which 'A' stands, and there is nothing for which 'A' stands, for which 'B' does not also stand.\"Early modern logic defined semantics purely as a relation between ideas. Antoine Arnauld in the Port Royal-Logic, says that after conceiving things by our ideas, we compare these ideas, and, finding that some belong together and some do not, we unite or separate them. This is called affirming or denying, and in general judging. Thus truth and falsity are no more than the agreement or disagreement of ideas. This suggests obvious difficulties, leading Locke to distinguish between 'real' truth, when our ideas have 'real existence' and 'imaginary' or 'verbal' truth, where ideas like harpies or centaurs exist only in the mind. This view, known as psychologism, was taken to the extreme in the nineteenth century, and is generally held by modern logicians to signify a low point in the decline of logic before the twentieth century.\nModern semantics is in some ways closer to the medieval view, in rejecting such psychological truth-conditions. However, the introduction of quantification, needed to solve the problem of multiple generality, rendered impossible the kind of subject-predicate analysis that underlies medieval semantics. The main modern approach is model-theoretic semantics, based on Alfred Tarski's semantic theory of truth. The approach assumes that the meaning of the various parts of the propositions are given by the possible ways we can give a recursively specified group of interpretation functions from them to some predefined domain of discourse: an interpretation of first-order predicate logic is given by a mapping from terms to a universe of individuals, and a mapping from propositions to the truth values \"true\" and \"false\".  Model-theoretic semantics is one of the fundamental concepts of model theory. Modern semantics also admits rival approaches, such as the proof-theoretic semantics that associates the meaning of propositions with the roles that they can play in inferences, an approach that ultimately derives from the work of Gerhard Gentzen on structural proof theory and is heavily influenced by Ludwig Wittgenstein's later philosophy, especially his aphorism \"meaning is use.\"\n\n\n=== Inference ===\nInference is not to be confused with implication. An implication is a sentence of the form 'If p then q', and can be true or false. The stoic logician Philo of Megara was the first to define the truth conditions of such an implication: false only when the antecedent p is true and the consequent q is false, in all other cases true. An inference, on the other hand, consists of two separately asserted propositions of the form 'p therefore q'. An inference is not true or false, but valid or invalid. However, there is a connection between implication and inference, as follows: if the implication 'if p then q' is true, the inference 'p therefore q' is valid. This was given an apparently paradoxical formulation by Philo, who said that the implication 'if it is day, it is night' is true only at night, so the inference 'it is day, therefore it is night' is valid in the night, but not in the day.\nThe theory of inference (or 'consequences') was systematically developed in medieval times by logicians such as William of Ockham and Walter Burley. It is uniquely medieval, though it has its origins in Aristotle's Topica and Boethius' De Syllogismis hypotheticis. Many terms in logic, for this reason, are in Latin. For instance, the rule that licenses the move from the implication 'if p then q' plus the assertion of its antecedent p, to the assertion of the consequent q, is known as modus ponens ('mode of positing')—from Latin: posito antecedente ponitur consequens. The Latin formulations of many other rules such as ex falso quodlibet ('from falsehood, anything [follows]'), and reductio ad absurdum ('reduction to absurdity'; i.e. to disprove by showing the consequence as absurd), also date from this period.\nHowever, the theory of consequences, or the so-called hypothetical syllogism, was never fully integrated into the theory of the categorical syllogism. This was partly because of the resistance to reducing the categorical judgment 'every s is p' to the so-called hypothetical judgment 'if anything is s, it is p'. The first was thought to imply 'some s is p', the latter was not, and as late as 1911 in the Encyclopædia Britannica article on \"Logic\", we find the Oxford logician T. H. Case arguing against Sigwart's and Brentano's modern analysis of the universal proposition.\n\n\n=== Logical systems ===\n\nA formal system is an organization of terms used for the analysis of deduction. It consists of an alphabet, a language over the alphabet to construct sentences, and a rule for deriving sentences. Among the important properties that logical systems can have are:\n\nConsistency: no theorem of the system contradicts another.\nValidity: the system's rules of proof never allow a false inference from true premises.\nCompleteness: if a formula is true, it can be proven, i.e. is a theorem of the system.\nSoundness: if any formula is a theorem of the system, it is true. This is the converse of completeness. (Note that in a distinct philosophical use of the term, an argument is sound when it is both valid and its premises are true.)\nExpressivity: what concepts can be expressed in the system.Some logical systems do not have all these properties. As an example, Kurt Gödel's incompleteness theorems show that sufficiently complex formal systems of arithmetic cannot be consistent and complete; however, first-order predicate logics not extended by specific axioms to be arithmetic formal systems with equality can be complete and consistent.\n\n\n=== Logic and rationality ===\n\nAs the study of argument is of clear importance to the reasons that we hold things to be true, logic is of essential importance to rationality. Here we have defined logic to be \"the systematic study of the form of arguments;\" the reasoning behind argument is of several sorts, but only some of these arguments fall under the aegis of logic proper.\nDeductive reasoning concerns the logical consequence of given premises and is the form of reasoning most closely connected to logic. On a narrow conception of logic (see below) logic concerns just deductive reasoning, although such a narrow conception controversially excludes most of what is called informal logic from the discipline.\nThere are other forms of reasoning that are rational but that are generally not taken to be part of logic. These include inductive reasoning, which covers forms of inference that move from collections of particular judgements to universal judgements, and abductive reasoning, which is a form of inference that goes from observation to a hypothesis that accounts for the reliable data (observation) and seeks to explain relevant evidence. American philosopher Charles Sanders Peirce (1839–1914) first introduced the term as guessing. Peirce said that to abduce a hypothetical explanation \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n   from an observed surprising circumstance \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n   is to surmise that \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n   may be true because then \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n   would be a matter of course. Thus, to abduce \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n   from \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n   involves determining that \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n   is sufficient (or nearly sufficient), but not necessary, for \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  .While inductive and abductive inference are not part of logic proper, the methodology of logic has been applied to them with some degree of success.  For example, the notion of deductive validity (where an inference is deductively valid if and only if there is no possible situation in which all the premises are true but the conclusion false) exists in an analogy to the notion of inductive validity, or \"strength\", where an inference is inductively strong if and only if its premises give some degree of probability to its conclusion.  Whereas the notion of deductive validity can be rigorously stated for systems of formal logic in terms of the well-understood notions of semantics, inductive validity requires us to define a reliable generalization of some set of observations. The task of providing this definition may be approached in various ways, some less formal than others; some of these definitions may use logical association rule induction, while others may use mathematical models of probability such as decision trees.\n\n\n=== Rival conceptions ===\n\nLogic arose (see below) from a concern with correctness of argumentation. Modern logicians usually wish to ensure that logic studies just those arguments that arise from appropriately general forms of inference. For example, Thomas Hofweber writes in the Stanford Encyclopedia of Philosophy that logic \"does not, however, cover good reasoning as a whole. That is the job of the theory of rationality. Rather it deals with inferences whose validity can be traced back to the formal features of the representations that are involved in that inference, be they linguistic, mental, or other representations.\"The idea that logic treats special forms of argument, deductive argument, rather than argument in general, has a history in logic that dates back at least to logicism in mathematics (19th and 20th centuries) and the advent of the influence of mathematical logic on philosophy. A consequence of taking logic to treat special kinds of argument is that it leads to identification of special kinds of truth, the logical truths (with logic equivalently being the study of logical truth), and excludes many of the original objects of study of logic that are treated as informal logic. Robert Brandom has argued against the idea that logic is the study of a special kind of logical truth, arguing that instead one can talk of the logic of material inference (in the terminology of Wilfred Sellars), with logic making explicit the commitments that were originally implicit in informal inference.\n\n\n== History ==\n\nLogic comes from the Greek word logos, originally meaning \"the word\" or \"what is spoken\", but coming to mean \"thought\" or \"reason\". In the Western World, logic was first developed by Aristotle, who called the subject 'analytics'. Aristotelian logic became widely accepted in science and mathematics and remained in wide use in the West until the early 19th century. Aristotle's system of logic was responsible for the introduction of hypothetical syllogism, temporal modal logic, and inductive logic, as well as influential vocabulary such as terms, predicables, syllogisms and propositions. There was also the rival Stoic logic.\nIn Europe during the later medieval period, major efforts were made to show that Aristotle's ideas were compatible with Christian faith. During the High Middle Ages, logic became a main focus of philosophers, who would engage in critical logical analyses of philosophical arguments, often using variations of the methodology of scholasticism. In 1323, William of Ockham's influential Summa Logicae was released. By the 18th century, the structured approach to arguments had degenerated and fallen out of favour, as depicted in Holberg's satirical play Erasmus Montanus.\nThe Chinese logical philosopher Gongsun Long (c. 325–250 BCE) proposed the paradox \"One and one cannot become two, since neither becomes two.\" In China, the tradition of scholarly investigation into logic, however, was repressed by the Qin dynasty following the legalist philosophy of Han Feizi.\nIn India, the Anviksiki school of logic was founded by Medhātithi (c. 6th century BCE). Innovations in the scholastic school, called Nyaya, continued from ancient times into the early 18th century with the Navya-Nyāya school. By the 16th century, it developed theories resembling modern logic, such as Gottlob Frege's \"distinction between sense and reference of proper names\" and his \"definition of number\", as well as the theory of \"restrictive conditions for universals\" anticipating some of the developments in modern set theory. Since 1824, Indian logic attracted the attention of many Western scholars, and has had an influence on important 19th-century logicians such as Charles Babbage, Augustus De Morgan, and George Boole. In the 20th century, Western philosophers like Stanislaw Schayer and Klaus Glashoff have explored Indian logic more extensively.\nThe syllogistic logic developed by Aristotle predominated in the West until the mid-19th century, when interest in the foundations of mathematics stimulated the development of symbolic logic (now called mathematical logic). In 1854, George Boole published The Laws of Thought, introducing symbolic logic and the principles of what is now known as Boolean logic. In 1879, Gottlob Frege published Begriffsschrift, which inaugurated modern logic with the invention of quantifier notation, reconciling the Aristotelian and Stoic logics in a broader system, and solving such problems for which Aristotelian logic was impotent, such as the problem of multiple generality. From 1910 to 1913, Alfred North Whitehead and Bertrand Russell published Principia Mathematica on the foundations of mathematics, attempting to derive mathematical truths from axioms and inference rules in symbolic logic. In 1931, Gödel raised serious problems with the foundationalist program and logic ceased to focus on such issues.\nThe development of logic since Frege, Russell, and Wittgenstein had a profound influence on the practice of philosophy and the perceived nature of philosophical problems (see analytic philosophy) and philosophy of mathematics. Logic, especially sentential logic, is implemented in computer logic circuits and is fundamental to computer science. Logic is commonly taught by university philosophy, sociology, advertising and literature departments, often as a compulsory discipline.\n\n\n== Types ==\n\n\n=== Syllogistic logic ===\n\nThe Organon was Aristotle's body of work on logic, with the Prior Analytics constituting the first explicit work in formal logic, introducing the syllogistic. The parts of syllogistic logic, also known by the name term logic, are the analysis of the judgements into propositions consisting of two terms that are related by one of a fixed number of relations, and the expression of inferences by means of syllogisms that consist of two propositions sharing a common term as premise, and a conclusion that is a proposition involving the two unrelated terms from the premises.\nAristotle's work was regarded in classical times and from medieval times in Europe and the Middle East as the very picture of a fully worked out system. However, it was not alone: the Stoics proposed a system of propositional logic that was studied by medieval logicians. Also, the problem of multiple generality was recognized in medieval times. Nonetheless, problems with syllogistic logic were not seen as being in need of revolutionary solutions.\nToday, some academics claim that Aristotle's system is generally seen as having little more than historical value (though there is some current interest in extending term logics), regarded as made obsolete by the advent of propositional logic and the predicate calculus. Others use Aristotle in argumentation theory to help develop and critically question argumentation schemes that are used in artificial intelligence and legal arguments.\n\n\n=== Propositional logic ===\n\nA propositional calculus or logic (also a sentential calculus) is a formal system in which formulae representing propositions can be formed by combining atomic propositions (usually represented with p, q, etc.) using logical connectives (\n  \n    \n      \n        &\n        ,\n        →\n        ,\n        ∨\n        ,\n        ≡\n        ,\n        ∼\n        ,\n      \n    \n    {\\displaystyle \\And ,\\rightarrow ,\\lor ,\\equiv ,\\sim ,}\n   etc.); these propositions and connectives are the only elements of a standard propositional calculus.  Unlike predicate logic or syllogistic logic where individual subjects and predicates (which do not have truth values) are the smallest unit, propositional logic takes full propositions with truth values as its most basic component. Quantifiers (e.g. \n  \n    \n      \n        ∀\n      \n    \n    {\\displaystyle \\forall }\n   or \n  \n    \n      \n        ∃\n      \n    \n    {\\displaystyle \\exists }\n  ) are included in extended propositional calculus, but they only quantify over full propositions, not individual subjects or predicates.  A given propositional logic is a system of formal proof with rules that establish which well-formed formulae of a given language are \"theorems\" by proving them from axioms which are assumed without proof.\n\n\n=== Predicate logic ===\n\nPredicate logic is the generic term for symbolic formal systems such as first-order logic, second-order logic, many-sorted logic, and infinitary logic.  It provides an account of quantifiers general enough to express a wide set of arguments occurring in natural language. For example, Bertrand Russell's famous barber paradox, \"there is a man who shaves all and only men who do not shave themselves\" can be formalised by the sentence \n  \n    \n      \n        (\n        ∃\n        x\n        )\n        (\n        \n          man\n        \n        (\n        x\n        )\n        ∧\n        (\n        ∀\n        y\n        )\n        (\n        \n          man\n        \n        (\n        y\n        )\n        →\n        (\n        \n          shaves\n        \n        (\n        x\n        ,\n        y\n        )\n        ↔\n        ¬\n        \n          shaves\n        \n        (\n        y\n        ,\n        y\n        )\n        )\n        )\n        )\n      \n    \n    {\\displaystyle (\\exists x)({\\text{man}}(x)\\wedge (\\forall y)({\\text{man}}(y)\\rightarrow ({\\text{shaves}}(x,y)\\leftrightarrow \\neg {\\text{shaves}}(y,y))))}\n  , using the non-logical predicate \n  \n    \n      \n        \n          man\n        \n        (\n        x\n        )\n      \n    \n    {\\displaystyle {\\text{man}}(x)}\n   to indicate that x is a man, and the non-logical relation \n  \n    \n      \n        \n          shaves\n        \n        (\n        x\n        ,\n        y\n        )\n      \n    \n    {\\displaystyle {\\text{shaves}}(x,y)}\n   to indicate that x shaves y; all other symbols of the formulae are logical, expressing the universal and existential quantifiers, conjunction, implication, negation and biconditional.\nWhilst Aristotelian syllogistic logic specifies a small number of forms that the relevant part of the involved judgements may take, predicate logic allows sentences to be analysed into subject and argument in several additional ways—allowing predicate logic to solve the problem of multiple generality that had perplexed medieval logicians.\nThe development of predicate logic is usually attributed to Gottlob Frege, who is also credited as one of the founders of analytic philosophy, but the formulation of predicate logic most often used today is the first-order logic presented in Principles of Mathematical Logic by David Hilbert and Wilhelm Ackermann in 1928. The analytical generality of predicate logic allowed the formalization of mathematics, drove the investigation of set theory, and allowed the development of Alfred Tarski's approach to model theory. It provides the foundation of modern mathematical logic.\nFrege's original system of predicate logic was second-order, rather than first-order. Second-order logic is most prominently defended (against the criticism of Willard Van Orman Quine and others) by George Boolos and Stewart Shapiro.\n\n\n=== Modal logic ===\n\nIn languages, modality deals with the phenomenon that sub-parts of a sentence may have their semantics modified by special verbs or modal particles. For example, \"We go to the games\" can be modified to give \"We should go to the games\", and \"We can go to the games\" and perhaps \"We will go to the games\". More abstractly, we might say that modality affects the circumstances in which we take an assertion to be satisfied. Confusing modality is known as the modal fallacy.\nAristotle's logic is in large parts concerned with the theory of non-modalized logic. Although, there are passages in his work, such as the famous sea-battle argument in De Interpretatione § 9, that are now seen as anticipations of modal logic and its connection with potentiality and time, the earliest formal system of modal logic was developed by Avicenna, who ultimately developed a theory of \"temporally modalized\" syllogistic.While the study of necessity and possibility remained important to philosophers, little logical innovation happened until the landmark investigations of C. I. Lewis in 1918, who formulated a family of rival axiomatizations of the alethic modalities. His work unleashed a torrent of new work on the topic, expanding the kinds of modality treated to include deontic logic and epistemic logic.  The seminal work of Arthur Prior applied the same formal language to treat temporal logic and paved the way for the marriage of the two subjects. Saul Kripke discovered (contemporaneously with rivals) his theory of frame semantics, which revolutionized the formal technology available to modal logicians and gave a new graph-theoretic way of looking at modality that has driven many applications in computational linguistics and computer science, such as dynamic logic.\n\n\n=== Informal reasoning and dialectic ===\n\nThe motivation for the study of logic in ancient times was clear: it is so that one may learn to distinguish good arguments from bad arguments, and so become more effective in argument and oratory, and perhaps also to become a better person. Half of the works of Aristotle's Organon treat inference as it occurs in an informal setting, side by side with the development of the syllogistic, and in the Aristotelian school, these informal works on logic were seen as complementary to Aristotle's treatment of rhetoric.\nThis ancient motivation is still alive, although it no longer takes centre stage in the picture of logic; typically dialectical logic forms the heart of a course in critical thinking, a compulsory course at many universities.  Dialectic has been linked to logic since ancient times, but it has not been until recent decades that European and American logicians have attempted to provide mathematical foundations for logic and dialectic by formalising dialectical logic. Dialectical logic is also the name given to the special treatment of dialectic in Hegelian and Marxist thought.  There have been pre-formal treatises on argument and dialectic, from authors such as Stephen Toulmin (The Uses of Argument), Nicholas Rescher (Dialectics), and van Eemeren and Grootendorst (Pragma-dialectics). Theories of defeasible reasoning can provide a foundation for the formalisation of dialectical logic and dialectic itself can be formalised as moves in a game, where an advocate for the truth of a proposition and an opponent argue. Such games can provide a formal game semantics for many logics.\nArgumentation theory is the study and research of informal logic, fallacies, and critical questions as they relate to every day and practical situations. Specific types of dialogue can be analyzed and questioned to reveal premises, conclusions, and fallacies. Argumentation theory is now applied in artificial intelligence and law.\n\n\n=== Mathematical logic ===\n\nMathematical logic comprises two distinct areas of research: the first is the application of the techniques of formal logic to mathematics and mathematical reasoning, and the second, in the other direction, the application of mathematical techniques to the representation and analysis of formal logic.The earliest use of mathematics and geometry in relation to logic and philosophy goes back to the ancient Greeks such as Euclid, Plato, and Aristotle. Many other ancient and medieval philosophers applied mathematical ideas and methods to their philosophical claims.One of the boldest attempts to apply logic to mathematics was the logicism pioneered by philosopher-logicians such as Gottlob Frege and Bertrand Russell. Mathematical theories were supposed to be logical tautologies, and the programme was to show this by means of a reduction of mathematics to logic. The various attempts to carry this out met with failure, from the crippling of Frege's project in his Grundgesetze by Russell's paradox, to the defeat of Hilbert's program by Gödel's incompleteness theorems.\nBoth the statement of Hilbert's program and its refutation by Gödel depended upon their work establishing the second area of mathematical logic, the application of mathematics to logic in the form of proof theory. Despite the negative nature of the incompleteness theorems, Gödel's completeness theorem, a result in model theory and another application of mathematics to logic, can be understood as showing how close logicism came to being true: every rigorously defined mathematical theory can be exactly captured by a first-order logical theory; Frege's proof calculus is enough to describe the whole of mathematics, though not equivalent to it.\nIf proof theory and model theory have been the foundation of mathematical logic, they have been but two of the four pillars of the subject. Set theory originated in the study of the infinite by Georg Cantor, and it has been the source of many of the most challenging and important issues in mathematical logic, from Cantor's theorem, through the status of the Axiom of Choice and the question of the independence of the continuum hypothesis, to the modern debate on large cardinal axioms.\nRecursion theory captures the idea of computation in logical and arithmetic terms; its most classical achievements are the undecidability of the Entscheidungsproblem by Alan Turing, and his presentation of the Church–Turing thesis. Today recursion theory is mostly concerned with the more refined problem of complexity classes—when is a problem efficiently solvable?—and the classification of degrees of unsolvability.\n\n\n=== Philosophical logic ===\n\nPhilosophical logic deals with formal descriptions of ordinary, non-specialist (\"natural\") language, that is strictly only about the arguments within philosophy's other branches. Most philosophers assume that the bulk of everyday reasoning can be captured in logic if a method or methods to translate ordinary language into that logic can be found. Philosophical logic is essentially a continuation of the traditional discipline called \"logic\" before the invention of mathematical logic. Philosophical logic has a much greater concern with the connection between natural language and logic. As a result, philosophical logicians have contributed a great deal to the development of non-standard logics (e.g. free logics, tense logics) as well as various extensions of classical logic (e.g. modal logics) and non-standard semantics for such logics (e.g. Kripke's supervaluationism in the semantics of logic).\nLogic and the philosophy of language are closely related. Philosophy of language has to do with the study of how our language engages and interacts with our thinking. Logic has an immediate impact on other areas of study. Studying logic and the relationship between logic and ordinary speech can help a person better structure his own arguments and critique the arguments of others. Many popular arguments are filled with errors because so many people are untrained in logic and unaware of how to formulate an argument correctly.\n\n\n=== Computational logic ===\n\nLogic cut to the heart of computer science as it emerged as a discipline: Alan Turing's work on the Entscheidungsproblem followed from Kurt Gödel's work on the incompleteness theorems. The notion of the general purpose computer that came from this work was of fundamental importance to the designers of the computer machinery in the 1940s.\nIn the 1950s and 1960s, researchers predicted that when human knowledge could be expressed using logic with mathematical notation, it would be possible to create a machine that mimics the problem-solving skills of a human being. This was more difficult than expected because of the complexity of human reasoning. In the summer of 1956, John McCarthy, Marvin Minsky, Claude Shannon and Nathan Rochester organized a conference on the subject of what they called \"artificial intelligence\" (a term coined by McCarthy for the occasion). Newell and Simon proudly presented the group with the Logic Theorist and were somewhat surprised when the program received a lukewarm reception.\nIn logic programming, a program consists of a set of axioms and rules. Logic programming systems such as Prolog compute the consequences of the axioms and rules in order to answer a query.\nToday, logic is extensively applied in the field of artificial intelligence, and this field provide a rich source of problems in formal and informal logic. Argumentation theory is one good example of how logic is being applied to artificial intelligence. The ACM Computing Classification System in particular regards:\n\nSection F.3 on \"Logics and meanings of programs\" and F.4 on \"Mathematical logic and formal languages\" as part of the theory of computer science: this work covers formal semantics of programming languages, as well as work of formal methods such as Hoare logic;\nBoolean logic as fundamental to computer hardware: particularly, the system's section B.2 on \"Arithmetic and logic structures\", relating to operatives AND, NOT, and OR;\nMany fundamental logical formalisms are essential to section I.2 on artificial intelligence, for example modal logic and default logic in Knowledge representation formalisms and methods, Horn clauses in logic programming, and description logic.Furthermore, computers can be used as tools for logicians. For example, in symbolic logic and mathematical logic, proofs by humans can be computer-assisted. Using automated theorem proving, the machines can find and check proofs, as well as work with proofs too lengthy to write out by hand.\n\n\n=== Non-classical logic ===\n\nThe logics discussed above are all \"bivalent\" or \"two-valued\"; that is, they are most naturally understood as dividing propositions into true and false propositions. Non-classical logics are those systems that reject various rules of Classical logic.\nHegel developed his own dialectic logic that extended Kant's transcendental logic but also brought it back to ground by assuring us that \"neither in heaven nor in earth, neither in the world of mind nor of nature, is there anywhere such an abstract 'either–or' as the understanding maintains. Whatever exists is concrete, with difference and opposition in itself\".In 1910, Nicolai A. Vasiliev extended the law of excluded middle and the law of contradiction and proposed the law of excluded fourth and logic tolerant to contradiction. In the early 20th century Jan Łukasiewicz investigated the extension of the traditional true/false values to include a third value, \"possible\" (or an indeterminate, a hypothesis) so inventing ternary logic, the first multi-valued logic in the Western tradition. \nA minor modification of the ternary logic was later introduced in a sibling ternary logic model proposed by Stephen Cole Kleene. Kleene's system differs from the Łukasiewicz's logic with respect to an outcome of the implication. The former assumes that the operator of implication between two hypotheses produces a hypothesis.\nLogics such as fuzzy logic have since been devised with an infinite number of \"degrees of truth\", represented by a real number between 0 and 1.Intuitionistic logic was proposed by L.E.J. Brouwer as the correct logic for reasoning about mathematics, based upon his rejection of the law of the excluded middle as part of his intuitionism. Brouwer rejected formalization in mathematics, but his student Arend Heyting studied intuitionistic logic formally, as did Gerhard Gentzen. Intuitionistic logic is of great interest to computer scientists, as it is a constructive logic and sees many applications, such as extracting verified programs from proofs and influencing the design of programming languages through the formulae-as-types correspondence.\nModal logic is not truth conditional, and so it has often been proposed as a non-classical logic. However, modal logic is normally formalized with the principle of the excluded middle, and its relational semantics is bivalent, so this inclusion is disputable.\n\n\n== Controversies ==\n\n\n=== \"Is Logic Empirical?\" ===\n\nWhat is the epistemological status of the laws of logic? What sort of argument is appropriate for criticizing purported principles of logic? In an influential paper entitled \"Is Logic Empirical?\" Hilary Putnam, building on a suggestion of W. V. Quine, argued that in general the facts of propositional logic have a similar epistemological status as facts about the physical universe, for example as the laws of mechanics or of general relativity, and in particular that what physicists have learned about quantum mechanics provides a compelling case for abandoning certain familiar principles of classical logic: if we want to be realists about the physical phenomena described by quantum theory, then we should abandon the principle of distributivity, substituting for classical logic the quantum logic proposed by Garrett Birkhoff and John von Neumann.Another paper of the same name by Michael Dummett argues that Putnam's desire for realism mandates the law of distributivity. Distributivity of logic is essential for the realist's understanding of how propositions are true of the world in just the same way as he has argued the principle of bivalence is. In this way, the question, \"Is Logic Empirical?\" can be seen to lead naturally into the fundamental controversy in metaphysics on realism versus anti-realism.\n\n\n=== Implication: strict or material ===\n\nThe notion of implication formalized in classical logic does not comfortably translate into natural language by means of \"if ... then ...\", due to a number of problems called the paradoxes of material implication.\nThe first class of paradoxes involves counterfactuals, such as If the moon is made of green cheese, then 2+2=5, which are puzzling because natural language does not support the principle of explosion. Eliminating this class of paradoxes was the reason for C. I. Lewis's formulation of strict implication, which eventually led to more radically revisionist logics such as relevance logic.\nThe second class of paradoxes involves redundant premises, falsely suggesting that we know the succedent because of the antecedent: thus \"if that man gets elected, granny will die\" is materially true since granny is mortal, regardless of the man's election prospects. Such sentences violate the Gricean maxim of relevance, and can be modelled by logics that reject the principle of monotonicity of entailment, such as relevance logic.\n\n\n=== Tolerating the impossible ===\n\nGeorg Wilhelm Friedrich Hegel was deeply critical of any simplified notion of the law of non-contradiction. It was based on Gottfried Wilhelm Leibniz's idea that this law of logic also requires a sufficient ground to specify from what point of view (or time) one says that something cannot contradict itself. A building, for example, both moves and does not move; the ground for the first is our solar system and for the second the earth. In Hegelian dialectic, the law of non-contradiction, of identity, itself relies upon difference and so is not independently assertable.\nClosely related to questions arising from the paradoxes of implication comes the suggestion that logic ought to tolerate inconsistency. Relevance logic and paraconsistent logic are the most important approaches here, though the concerns are different: a key consequence of classical logic and some of its rivals, such as intuitionistic logic, is that they respect the principle of explosion, which means that the logic collapses if it is capable of deriving a contradiction. Graham Priest, the main proponent of dialetheism, has argued for paraconsistency on the grounds that there are in fact, true contradictions.\n\n\n=== Rejection of logical truth ===\nThe philosophical vein of various kinds of skepticism contains many kinds of doubt and rejection of the various bases on which logic rests, such as the idea of logical form, correct inference, or meaning, sometimes leading to the conclusion that there are no logical truths. This is in contrast with the usual views in philosophical skepticism, where logic directs skeptical enquiry to doubt received wisdoms, as in the work of Sextus Empiricus.\nFriedrich Nietzsche provides a strong example of the rejection of the usual basis of logic: his radical rejection of idealization led him to reject truth as a \"... mobile army of metaphors, metonyms, and anthropomorphisms—in short ... metaphors which are worn out and without sensuous power; coins which have lost their pictures and now matter only as metal, no longer as coins\". His rejection of truth did not lead him to reject the idea of either inference or logic completely but rather suggested that \"logic [came] into existence in man's head [out] of illogic, whose realm originally must have been immense. Innumerable beings who made inferences in a way different from ours perished\". Thus there is the idea that logical inference has a use as a tool for human survival, but that its existence does not support the existence of truth, nor does it have a reality beyond the instrumental: \"Logic, too, also rests on assumptions that do not correspond to anything in the real world\".This position held by Nietzsche however, has come under extreme scrutiny for several reasons. Some philosophers, such as Jürgen Habermas, claim his position is self-refuting—and accuse Nietzsche of not even having a coherent perspective, let alone a theory of knowledge. Georg Lukács, in his book The Destruction of Reason, asserts that, \"Were we to study Nietzsche's statements in this area from a logico-philosophical angle, we would be confronted by a dizzy chaos of the most lurid assertions, arbitrary and violently incompatible.\" Bertrand Russell described Nietzsche's irrational claims with \"He is fond of expressing himself paradoxically and with a view to shocking conventional readers\" in his book A History of Western Philosophy.\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Bibliography ===\n\n\n== External links ==\n\nLogic at PhilPapers\nLogic at the Indiana Philosophy Ontology Project\n\"Logic\". Internet Encyclopedia of Philosophy.\n\"Logical calculus\", Encyclopedia of Mathematics, EMS Press, 2001 [1994]\nAn Outline for Verbal Logic\nIntroductions and tutorials\n\"An Introduction to Philosophical Logic, by Paul Newall\". Archived from the original on 3 April 2008. aimed at beginners.\nforall x: an introduction to formal logic, by P.D. Magnus, covers sentential and quantified logic.\nLogic Self-Taught: A Workbook (originally prepared for on-line logic instruction).\nNicholas Rescher. (1964). Introduction to Logic, St. Martin's Press.\nEssays\n\"Symbolic Logic\" and \"The Game of Logic\", Lewis Carroll, 1896.\nMath & Logic: The history of formal mathematical, logical, linguistic and methodological ideas. In The Dictionary of the History of Ideas.\nOnline Tools\nInteractive Syllogistic Machine A web-based syllogistic machine for exploring fallacies, figures, terms, and modes of syllogisms.\nA Logic Calculator A web-based application for evaluating simple statements in symbolic logic.\nReference material\nTranslation Tips, by Peter Suber, for translating from English into logical notation.\nOntology and History of Logic. An Introduction with an annotated bibliography.\nReading lists\nThe London Philosophy Study Guide offers many suggestions on what to read, depending on the student's familiarity with the subject:\nLogic & Metaphysics\nSet Theory and Further Logic\nMathematical Logic\n Categories public domain audiobook at LibriVox"}