{"topic": "Technocriticism", "english_title": "Technocriticism", "english": "Technocriticism is a branch of critical theory devoted to the study of technological change.\nTechnocriticism treats technological transformation as historically specific changes in personal and social practices of research, invention, regulation, distribution, promotion, appropriation, use, and discourse, rather than as an autonomous or socially indifferent accumulation of useful inventions, or as an uncritical narrative of linear \"progress\", \"development\" or \"innovation\".\nTechnocriticism studies these personal and social practices in their changing practical and cultural significance.  It documents and analyzes both their private and public uses, and often devotes special attention to the relations among these different uses and dimensions. Recurring themes in technocritical discourse include the deconstruction of essentialist concepts such as \"health\", \"human\", \"nature\" or \"norm\".\nTechnocritical theory can be either \"descriptive\" or \"prescriptive\" in tone.  Descriptive forms of technocriticism include some scholarship in the history of technology, science and technology studies, cyberculture studies and philosophy of technology.  More prescriptive forms of technocriticism can be found in the various branches of technoethics, for example, media criticism, infoethics, bioethics, neuroethics, roboethics, nanoethics, existential risk assessment and some versions of environmental ethics and environmental design theory.\nFigures engaged in technocritical scholarship and theory include Donna Haraway and Bruno Latour (who work in the closely related field of science studies), N. Katherine Hayles (who works in the field of Literature and Science), Phil Agree and Mark Poster (who works in intellectual history), Marshall McLuhan and Friedrich Kittler (who work in the closely related field of media studies), Susan Squier and Richard Doyle (who work in the closely related field of medical sociology), and Hannah Arendt, Walter Benjamin, Martin Heidegger, and Michel Foucault (who sometimes wrote about the philosophy of technology). Technocriticism can be juxtaposed with a number of other innovative interdisciplinary areas of scholarship which have surfaced in recent years such as technoscience and technoethics.\n\n\n== External links ==\nAmerican Society for Bioethics + Humanities\nBorder Crossings: Cyborgs\nCritical Science and Technology Books and Journal Articles\nEthics and Information Technology\nThe Information Society: An International Journal\nModern Fiction Studies 43.3/Fall 1997, Special Issue: Technocriticism and Hypernarrative\nScience, Medicine and Technology in Culture Program at Penn State University\nSociety for Literature, Science, and the Arts\nTechnocultural Studies at the University of California at Davis"}