{"topic": "Techno", "english_title": "Techno", "english": "Techno is a genre of electronic dance music (EDM) that is predominantly characterized by a repetitive four on the floor beat which is generally produced for use in a continuous DJ set. The central rhythm is often in common time (4/4), while the tempo typically varies between 120 and 150 beats per minute (bpm). Artists may use electronic instruments such as drum machines, sequencers, and synthesizers, as well as digital audio workstations. Drum machines from the 1980s such as Roland's TR-808 and TR-909 are highly prized, and software emulations of such retro instruments are popular.\nUse of the term \"techno\" to refer to a type of electronic music originated in Germany in the early 1980s. In 1988, following the UK release of the compilation Techno! The New Dance Sound of Detroit, the term came to be associated with a form of electronic dance music produced in Detroit. Detroit techno resulted from the melding of synthpop by artists such as Kraftwerk, Giorgio Moroder and Yellow Magic Orchestra with African American styles such as house, electro, and funk. Added to this is the influence of futuristic and science-fiction themes relevant to life in American late capitalist society, with Alvin Toffler's book The Third Wave a notable point of reference. The music produced in the mid to late 1980s by Juan Atkins, Derrick May, and Kevin Saunderson (collectively known as the Belleville Three), along with Eddie Fowlkes, Blake Baxter, James Pennington and others is viewed as the first wave of techno from Detroit.After the success of house music in a number of European countries, techno grew in popularity in the UK, Germany, Belgium and the Netherlands. In Europe regional variants quickly evolved and by the early 1990s techno subgenres such as acid, hardcore, ambient, and dub techno had developed. Music journalists and fans of techno are generally selective in their use of the term; so a clear distinction can be made between sometimes related but often qualitatively different styles, such as tech house and trance.\n\n\n== Detroit techno ==\n\nIn exploring Detroit techno's origins writer Kodwo Eshun maintains that \"Kraftwerk are to techno what Muddy Waters is to the Rolling Stones: the authentic, the origin, the real.\" Juan Atkins has acknowledged that he had an early enthusiasm for Kraftwerk and Giorgio Moroder, particularly Moroder's work with Donna Summer and the producer's own album E=MC2. Atkins also mentions that \"around 1980 I had a tape of nothing but Kraftwerk, Telex, Devo, Giorgio Moroder and Gary Numan, and I'd ride around in my car playing it.\" Atkins has also claimed he was unaware of Kraftwerk's music prior to his collaboration with Richard \"3070\" Davis as Cybotron, which was two years after he had first started experimenting with electronic instruments. Regarding his initial impression of Kraftwerk, Atkins notes that they were \"clean and precise\" relative to the \"weird UFO sounds\" featured in his seemingly \"psychedelic\" music.Derrick May identified the influence of Kraftwerk and other European synthesizer music in commenting that \"it was just classy and clean, and to us it was beautiful, like outer space. Living around Detroit, there was so little beauty... everything is an ugly mess in Detroit, and so we were attracted to this music. It, like, ignited our imagination!\". May has commented that he considered his music a direct continuation of the European synthesizer tradition. He also identified Japanese synthpop act Yellow Magic Orchestra, particularly member Ryuichi Sakamoto, and British band Ultravox, as influences, along with Kraftwerk. YMO's song \"Technopolis\" (1979), a tribute to Tokyo as an electronic mecca, is considered an \"interesting contribution\" to the development of Detroit techno, foreshadowing concepts that Atkins and Davis would later explore with Cybotron.Kevin Saunderson has also acknowledged the influence of Europe but he claims to have been more inspired by the idea of making music with electronic equipment: \"I was more infatuated with the idea that I can do this all myself.\"These early Detroit techno artists additionally employed science fiction imagery to articulate their visions of a transformed society.\n\n\n=== School days ===\nPrior to achieving notoriety, Atkins, Saunderson, May, and Fowlkes shared common interests as budding musicians, \"mix\" tape traders, and aspiring DJs. They also found musical inspiration via the Midnight Funk Association, an eclectic five-hour late-night radio program hosted on various Detroit radio stations, including WCHB, WGPR, and WJLB-FM from 1977 through the mid-1980s by DJ Charles \"The Electrifying Mojo\" Johnson. Mojo's show featured electronic music by artists such as Giorgio Moroder, Kraftwerk, Yellow Magic Orchestra and Tangerine Dream, alongside the funk sounds of acts such as Parliament Funkadelic and dance oriented new wave music by bands like Devo and the B-52's. Atkins has noted:\n\nHe [Mojo] played all the Parliament and Funkadelic that anybody ever wanted to hear. Those two groups were really big in Detroit at the time. In fact, they were one of the main reasons why disco didn't really grab hold in Detroit in '79. Mojo used to play a lot of funk just to be different from all the other stations that had gone over to disco. When 'Knee Deep' came out, that just put the last nail in the coffin of disco music.\nDespite the short-lived disco boom in Detroit, it had the effect of inspiring many individuals to take up mixing, Juan Atkins among them. Subsequently, Atkins taught May how to mix records, and in 1981, \"Magic Juan\", Derrick \"Mayday\", in conjunction with three other DJ's, one of whom was Eddie \"Flashin\" Fowlkes, launched themselves as a party crew called Deep Space Soundworks (also referred to as Deep Space). In 1980 or 1981 they met with Mojo and proposed that they provide mixes for his show, which they did end up doing the following year.During the late 1970s-early 1980s high school clubs such as Brats, Charivari, Ciabattino, Comrades, Gables, Hardwear, Rafael, Rumours, Snobs, and Weekends allowed the young promoters to develop and nurture a local dance music scene. As the local scene grew in popularity, DJs began to band together to market their mixing skills and sound systems to clubs that were hoping to attract larger audiences. Local church activity centers, vacant warehouses, offices, and YMCA auditoriums were the early locations where the musical form was nurtured.\n\n\n=== Juan Atkins ===\n\nOf the four individuals responsible for establishing techno as a genre in its own right, Juan Atkins is widely cited as \"The Originator\". Atkins' role was likewise acknowledged in 1995 by the American music technology publication Keyboard Magazine, which honored him as one of 12 Who Count in the history of keyboard music.In the early 1980s, Atkins began recording with musical partner Richard Davis (and later with a third member, Jon-5) as Cybotron. This trio released a number of rock and electro-inspired tunes, the most successful of which were Clear (1983) and its moodier followup, \"Techno City\" (1984).Atkins used the term techno to describe Cybotron's music, taking inspiration from Futurist author Alvin Toffler, the original source for words such as cybotron and metroplex. Atkins has described earlier synthesizer based acts like Kraftwerk as techno, although many would consider both Kraftwerk's and Juan's Cybotron outputs as electro. Atkins viewed Cybotron's Cosmic Cars (1982) as unique, Germanic, synthesized funk, but he later heard Afrika Bambaataa's \"Planet Rock\" (1982) and considered it to be a superior example of the music he envisioned. Inspired, he resolved to continue experimenting, and he encouraged Saunderson and May to do likewise.Eventually, Atkins started producing his own music under the pseudonym Model 500, and in 1985 he established the record label Metroplex. The same year saw an important turning point for the Detroit scene with the release of Model 500's \"No UFO's,\" a seminal work that is generally considered the first techno production. Of this time, Atkins has said:\n\nWhen I started Metroplex around February or March of '85 and released \"No UFO's,\" I thought I was just going to make my money back on it, but I wound up selling between 10,000 and 15,000 copies. I had no idea that my record would happen in Chicago. Derrick's parents had moved there, and he was making regular trips between Detroit and Chicago. So when I came out with 'No UFO's,' he took copies out to Chicago and gave them to some DJs, and it just happened.\n\n\n=== Chicago ===\n\nThe music's producers, especially May and Saunderson, admit to having been fascinated by the Chicago club scene and influenced by house in particular. May's 1987/1989 hit \"Strings of Life\" (released under the alias Rhythim Is Rhythim) is considered a classic in both the house and techno genres.Juan Atkins also believes that the first acid house producers, seeking to distance house music from disco, emulated the techno sound. Atkins also suggests that the Chicago house sound developed as a result of Frankie Knuckles' using a drum machine he bought from Derrick May. He claims:\n\nDerrick sold Chicago DJ Frankie Knuckles a TR909 drum machine. This was back when the Powerplant was open in Chicago, but before any of the Chicago DJs were making records. They were all into playing Italian imports; 'No UFOs' was the only U.S.-based independent record that they played. So Frankie Knuckles started using the 909 at his shows at the Powerplant. Boss had just brought out their little sampling footpedal, and somebody took one along there. Somebody was on the mic, and they sampled that and played it over the drumtrack pattern. Having got the drum machine and the sampler, they could make their own tunes to play at parties. One thing just led to another, and Chip E used the 909 to make his own record, and from then on, all these DJs in Chicago borrowed that 909 to come out with their own records.\nIn the UK, a club following for house music grew steadily from 1985, with interest sustained by scenes in London, Manchester, Nottingham, and later Sheffield and Leeds. The DJs thought to be responsible for house's early UK success include Mike Pickering, Mark Moore, Colin Faver, and Graeme Park.\n\n\n=== Detroit sound ===\n\nThe early producers, enabled by the increasing affordability of sequencers and synthesizers, merged a European synthpop aesthetic with aspects of soul, funk, disco, and electro, pushing electronic dance music into uncharted terrain. They deliberately rejected the Motown legacy and traditional formulas of R&B and soul, and instead embraced technological experimentation.\nWithin the last 5 years or so, the Detroit underground has been experimenting with technology, stretching it rather than simply using it. As the price of sequencers and synthesizers has dropped, so the experimentation has become more intense. Basically, we're tired of hearing about being in love or falling out, tired of the R&B system, so a new progressive sound has emerged. We call it techno!\nThe resulting Detroit sound was interpreted by Derrick May and one journalist in 1988 as a \"post-soul\" sound with no debt to Motown, but by another journalist a decade later as \"soulful grooves\" melding the beat-centric styles of Motown with the music technology of the time. May famously described the sound of techno as something that is \"...like Detroit...a complete mistake. It's like George Clinton and Kraftwerk are stuck in an elevator with only a sequencer to keep them company.\" Juan Atkins has stated that it is \"music that sounds like technology, and not technology that sounds like music, meaning that most of the music you listen to is made with technology, whether you know it or not. But with techno music, you know it.\"One of the first Detroit productions to receive wider attention was Derrick May's \"Strings of Life\" (1987), which, together with May's previous release, \"Nude Photo\" (1987), helped raise techno's profile in Europe, especially the UK and Germany, during the 1987–1988 house music boom (see Second Summer of Love). It became May's best known track, which, according to Frankie Knuckles, \"just exploded. It was like something you can't imagine, the kind of power and energy people got off that record when it was first heard. Mike Dunn says he has no idea how people can accept a record that doesn't have a bassline.\"\n\n\n=== Acid house ===\n\nBy 1988, house music had exploded in the UK, and acid house was increasingly popular. There was also a long-established warehouse party subculture based around the sound system scene. In 1988, the music played at warehouse parties was predominantly house. That same year, the Balearic party vibe associated with Ibiza-based DJ Alfredo Fiorito was transported to London, when Danny Rampling and Paul Oakenfold opened the clubs Shoom and Spectrum, respectively. Both night spots quickly became synonymous with acid house, and it was during this period that the use of MDMA, as a party drug, started to gain prominence. Other important UK clubs at this time included Back to Basics in Leeds, Sheffield's Leadmill and Music Factory, and in Manchester The Haçienda, where Mike Pickering and Graeme Park's Friday night spot, Nude, was an important proving ground for American underground  dance music. Acid house party fever escalated in London and Manchester, and it quickly became a cultural phenomenon. MDMA-fueled club goers, faced with 2 A.M. closing hours, sought refuge in the warehouse party scene that ran all night. To escape the attention of the press and the authorities, this after-hours activity quickly went underground. Within a year, however, up to 10,000 people at a time were attending the first commercially organized mass parties, called raves, and a media storm ensued.The success of house and acid house paved the way for wider acceptance of the Detroit sound, and vice versa: techno was initially supported by a handful of house music clubs in Chicago, New York, and Northern England, with London clubs catching up later; but in 1987, it was \"Strings of Life\" which eased London club-goers into acceptance of house, according to DJ Mark Moore.\n\n\n=== The New Dance Sound of Detroit ===\n\nThe mid-1988 UK release of Techno! The New Dance Sound of Detroit, an album compiled by ex-Northern Soul DJ and Kool Kat Records boss Neil Rushton (at the time an A&R scout for Virgin's \"10 Records\" imprint) and Derrick May, introduced of the word techno to UK audiences. Although the compilation put techno into the lexicon of music journalism in the UK, the music was initially viewed as Detroit's interpretation of Chicago house rather than as a separate genre. The compilation's working title had been The House Sound of Detroit until the addition of Atkins' song \"Techno Music\" prompted reconsideration. Rushton was later quoted as saying he, Atkins, May, and Saunderson came up with the compilation's final name together, and that the Belleville Three voted down calling the music some kind of regional brand of house; they instead favored a term they were already using, techno.\nDerrick May views this as one of his busiest times and recalls that it was a period where he was working with Carl Craig, helping Kevin, helping Juan, trying to put Neil Rushton in the right position to meet everybody, trying to get Blake Baxter endorsed so that everyone liked him, trying to convince Shake (Anthony Shakir) that he should be more assertive...and keep making music as well as do the Mayday mix (for the show Street Beat on Detroit's WJLB radio station) and run Transmat records.\nCommercially, the release did not fare as well and failed to recoup, but Inner City's production \"Big Fun\" (1988), a track that was almost not included on the compilation, became a crossover hit in fall 1988. The record was also responsible for bringing industry attention to May, Atkins and Saunderson, which led to discussions with ZTT records about forming a techno supergroup called Intellex. But, when the group were on the verge of finalising their contract, May allegedly refused to agree to Top of the Pops appearances and negotiations collapsed. According to May, ZTT label boss Trevor Horn had envisaged that the trio would be marketed as a \"black Petshop Boys.\"Despite Virgin Records' disappointment with the poor sales of Rushton's compilation, the record was successful in establishing an identity for techno and was instrumental in creating a platform in Europe for both the music and its producers. Ultimately, the release served to distinguish the Detroit sound from Chicago house and other forms of underground dance music that were emerging during the rave era of the late 1980s and early 1990s, a period during which techno became more adventurous and distinct.\n\n\n=== Music Institute ===\nIn mid-1988, developments in the Detroit scene led to the opening of a nightclub called the Music Institute (MI), located at 1315 Broadway in downtown Detroit. The venue was secured by George Baker and Alton Miller with Darryl Wynn and Derrick May participating as Friday night DJs, and Baker and Chez Damier playing to a mostly gay crowd on Saturday nights.\nThe club closed on November 24, 1989, with Derrick May playing \"Strings of Life\" along with a recording of clock tower bells. May explains:\n\nIt all happened at the right time by mistake, and it didn't last because it wasn't supposed to last. Our careers took off right around the time we [the MI] had to close, and maybe it was the best thing. I think we were peaking – we were so full of energy and we didn't know who we were or [how to] realize our potential. We had no inhibitions, no standards, we just did it. That's why it came off so fresh and innovative, and that's why...we got the best of the best.\nThough short-lived, MI was known internationally for its all-night sets, its sparse white rooms, and its juice bar stocked with \"smart drinks\" (the Institute never served liquor). The MI, notes Dan Sicko, along with Detroit's early techno pioneers, \"helped give life to one of the city's important musical subcultures – one that was slowly growing into an international scene.\"\n\n\n== German techno ==\n\nIn 1982, Talla 2XLC had begun to use the term techno as a genre name for instrumental electronic dance music at Frankfurt's City Music record store, when he started to categorize certain tracks by artists such as New Order, Depeche Mode, Kraftwerk, Heaven 17 and Front 242 under the heading techno, to sum up all technologically created dance music.\nThe collection of Talla 2XLC quickly became the basis for other DJs like Sven Väth. Talla 2XLC popularized the term even more in Germany when he founded the renowned and longstanding Technoclub dance event at Frankfurt's No Name Club in 1984, which later moved to the Dorian Gray club in 1987. Talla's club spot served as the hub for the regional EBM and electronic music scene, and according to Jürgen Laarmann, of Frontpage magazine, it had historical merit in being the first club in Germany to play almost exclusively electronic dance music.\n\n\n=== Frankfurt tape scene ===\nWith the foundation for the genre laid by Talla 2XLC in 1982, in the following period several young artists from Frankfurt started to experiment on cassette tapes with electronic music coming from the Frankfurt's City Music record store, mixing the current catalogue with new electronic sounds and pitched BPM. This became known as the Frankfurt tape scene.  \nThe Frankfurt tape scene evolved around the early and experimental work done by the likes of Tobias Freund, Uwe Schmidt, Lars Müller and Martin Schopf. Some of the work done by Andreas Tomalla, Markus Nikolai and Thomas Franzmann evolved in collaborative work under the Bigod 20 collective. While this early work was strongly characterized as experimental electronic music fused with strong EBM, krautrock, synthpop and technopop influences, the later work during the mid and late 80's clearly transitioned to a clear techno sound. \n\n\n=== Influence of Chicago and Detroit ===\nGermany's engagement with American underground dance music during the 1980s paralleled that in the UK. By 1987 a German party scene based around the Chicago sound was well established. The following year (1988) saw acid house making as significant an impact on popular consciousness in Germany as it had in England. In 1989 German DJs Westbam and Dr. Motte established the Ufo club, an illegal party venue, and co-founded the Love Parade. After the Berlin Wall fell on 9 November 1989, free underground techno parties mushroomed in East Berlin, and a rave scene comparable to that in the UK was established. East German DJ Paul van Dyk has remarked that techno was a major force in reestablishing social connections between East and West Germany during the unification period.\n\n\n=== Growth of German scene ===\nIn 1991 a number of party venues closed, including Ufo, and the Berlin Techno scene centered itself around three locations close to the foundations of the Berlin Wall: Planet, E-Werk, Bunker, and the long-lived Tresor. It was in Tresor at this time that a trend in paramilitary clothing was established (amongst the techno fraternity) by DJ Tanith; possibly as an expression of a commitment to the underground aesthetic of the music, or perhaps influenced by UR's paramilitary posturing. In the same period, German DJs began intensifying the speed and abrasiveness of the sound, as an acid infused techno began transmuting into hardcore. DJ Tanith commented at the time that \"Berlin was always hardcore, hardcore hippie, hardcore punk, and now we have a very hardcore house sound.\" This emerging sound is thought to have been influenced by Dutch gabber and Belgian hardcore; styles that were in their own perverse way paying homage to Underground Resistance and Richie Hawtin's Plus 8 Records. Other influences on the development of this style were European electronic body music (EBM) groups of the mid-1980s such as DAF, Front 242, and Nitzer Ebb.Changes were also taking place in Frankfurt during the same period but it did not share the egalitarian approach found in the Berlin party scene. It was instead very much centred around discothèques and existing arrangements with various club owners. In 1988, after the Omen opened, the Frankfurt dance music scene was allegedly dominated by the club's management and they made it difficult for other promoters to get a start. By the early 1990s Sven Väth had become perhaps the first DJ in Germany to be worshipped like a rock star. He performed centre stage with his fans facing him, and as co-owner of Omen, he is believed to have been the first techno DJ to run his own club. One of the few real alternatives then was The Bruckenkopf in Mainz, underneath a Rhine bridge, a venue that offered a non-commercial alternative to Frankfurt's discothèque-based clubs. Other notable underground parties were those run by Force Inc. Music Works and Ata & Heiko from Playhouse records (Ongaku Musik). By 1992 DJ Dag & Torsten Fenslau were running a Sunday morning session at Dorian Gray, a plush discothèque near the Frankfurt airport. They initially played a mix of different styles including Belgian new beat, Deep House, Chicago House, and synthpop such as Kraftwerk and Yello and it was out of this blend of styles that the Frankfurt trance scene is believed to have emerged.In 1993-94 rave became a mainstream music phenomenon in Germany, seeing with it a return to \"melody, New Age elements, insistently kitsch harmonies and timbres\". This undermining of the German underground sound lead to the consolidation of a German \"rave establishment,\" spearheaded by the party organisation Mayday, with its record label Low Spirit, DJ Westbam, Marusha, and a music channel called VIVA. At this time the German popular music charts were riddled with Low Spirit \"pop-Tekno\" German folk music reinterpretations of tunes such as \"Somewhere Over The Rainbow\" and \"Tears Don't Lie\", many of which became hits. At the same time, in Frankfurt, a supposed alternative was a music characterised by Simon Reynolds as \"moribund, middlebrow Electro-Trance music, as represented by Frankfurt's own Sven Väth and his Harthouse label.\"\n\n\n=== Tekkno versus techno ===\nIn Germany, fans started to refer to the harder techno sound emerging in the early 1990s as Tekkno (or Brett). This alternative spelling, with varying numbers of ks, began as a tongue-in-cheek attempt to emphasize the music's hardness, but by the mid-1990s it came to be associated with a controversial point of view that the music was and perhaps always had been wholly separate from Detroit's techno, deriving instead from a 1980s EBM-oriented club scene cultivated in part by DJ/musician Talla 2XLC in Frankfurt.At some point tension over \"who defines techno\" arose between scenes in Frankfurt and Berlin. DJ Tanith has expressed that Techno as a term already existed in Germany but was to a large extent undefined. Dimitri Hegemann has stated that the Frankfurt definition of techno associated with Talla's Technoclub differed from that used in Berlin. Frankfurt's Armin Johnert viewed techno as having its roots in acts such DAF, Cabaret Voltaire, and Suicide, but a younger generation of club goers had a perception of the older EBM and Industrial as handed down and outdated. The Berlin scene offered an alternative and many began embracing an imported sound that was being referred to as Techno-House. The move away from EBM had started in Berlin when acid house became popular, thanks to Monika Dietl's radio show on SFB 4. Tanith distinguished acid-based dance music from the earlier approaches, whether it be DAF or Nitzer Ebb, because the latter was aggressive, he felt that it epitomised \"being against something,\" but of acid house he said, \"it's electronic, it's fun it's nice.\" By Spring 1990, Tanith, along with Wolle XDP, an East-Berlin party organizer responsible for the X-tasy Dance Project, were organizing the first large scale rave events in Germany. This development would lead to a permanent move away from the sound associated with Techno-House and toward a hard edged mix of music that came to define Tanith and Wolle's Tekknozid parties. According to Wolle it was an \"out and out rejection of disco values,\" instead they created a \"sound storm\" and encouraged a form of \"dance floor socialism,\" where the DJ was not placed in the middle and you \"lose yourself in light and sound.\"\n\n\n== Developments ==\nAs the techno sound evolved in the late 1980s and early 1990s, it also diverged to such an extent that a wide spectrum of stylistically distinct music was being referred to as techno. This ranged from relatively pop oriented acts such as Moby to the distinctly anti-commercial sentiments of Underground Resistance. Derrick May's experimentation on works such as Beyond the Dance (1989) and The Beginning (1990) were credited with taking techno \"in dozens of new directions at once and having the kind of expansive impact John Coltrane had on Jazz\". The Birmingham-based label Network Records label was instrumental in introducing Detroit techno to British audiences. By the early 1990s, the original techno sound had garnered a large underground following in the United Kingdom, Germany, the Netherlands and Belgium. The growth of techno's popularity in Europe between 1988 and 1992 was largely due to the emergence of the rave scene and a thriving club culture.\n\n\n=== Exodus ===\nIn America, apart from regional scenes in Detroit, New York City, Chicago and Orlando, interest was limited. Producers from Detroit, frustrated by the lack of opportunity in their home country, looked to Europe for their future livelihood. This first wave of Detroit expatriates was soon joined by a number of up-and-coming artists, the so-called \"second wave\", including Carl Craig, Octave One, Jay Denham, Kenny Larkin, and Stacey Pullen, with UR's Jeff Mills, Mike Banks, and Robert Hood pushing their own unique sound. A number of New York producers were also making an impression at this time, notably Frankie Bones, Lenny Dee, and Joey Beltram. In the same period, close to Detroit (Windsor, Ontario), Richie Hawtin, with business partner John Acquaviva, launched the influential imprint Plus 8 Records.Developments in American-produced techno between 1990 and 1992 fueled the expansion and eventual divergence of techno in Europe, particularly in Germany. In Berlin, following the closure of a free party venue called Ufo, the club Tresor opened in 1991. The venue was for a time the standard bearer for techno and played host to many of the leading Detroit producers, some of whom relocated to Berlin. By 1993, as interest in techno in the UK club scene started to wane, Berlin was considered the unofficial techno capital of Europe.Although eclipsed by Germany, Belgium was another focus of second-wave techno in this time period. The Ghent-based label R&S Records embraced harder-edged techno by \"teenage prodigies\" like Beltram and C.J. Bolland, releasing \"tough, metallic tracks...with harsh, discordant synth lines that sounded like distressed Hoovers,\" according to one music journalist.In the United Kingdom, Sub Club opening in Glasgow in 1987 and Trade which opened its doors to Londoners in 1990 were pioneering venues which helped bring techno into the country. Both clubs were praised for their late opening hours and party-focused clientele. Trade has often been referred to as the 'original all night bender'.\n\n\n==== A Techno Alliance ====\nIn 1993, the German techno label Tresor Records released the compilation album Tresor II: Berlin & Detroit – A Techno Alliance, a testament to the influence of the Detroit sound upon the German techno scene and a celebration of a \"mutual admiration pact\" between the two cities. As the mid-1990s approached, Berlin was becoming a haven for Detroit producers; Jeff Mills and Blake Baxter even resided there for a time. In the same period, with the assistance of Tresor, Underground Resistance released their X-101/X-102/X103 album series, Juan Atkins collaborated with 3MB's Thomas Fehlmann and Moritz Von Oswald and Tresor-affiliated label Basic Channel had its releases mastered by Detroit's National Sound Corporation, the main mastering house for the entire Detroit dance music scene. In a sense, popular electronic music had come full circle, returning to Germany, home of a primary influence on the electronic dance music of the 1980s: Düsseldorf's Kraftwerk. Even the dance sounds of Chicago also had a German connection, as it was in Munich that Giorgio Moroder and Pete Bellotte first produced the 1970s Eurodisco synthpop sound.\n\n\n=== Minimal techno ===\n\nAs techno continued to transmute a number of Detroit producers began to question the trajectory the music was taking. One response came in the form of so-called minimal techno (a term producer Daniel Bell found difficult to accept, finding the term minimalism, in the artistic sense of the word, too \"arty\"). It is thought that Robert Hood, a Detroit-based producer and one time member of UR, is largely responsible for ushering in the minimal strain of techno. Hood describes the situation in the early 1990s as one where techno had become too \"ravey\", with increasing tempos, the emergence of gabber, and related trends straying far from the social commentary and soul-infused sound of original Detroit techno. In response, Hood and others sought to emphasize a single element of the Detroit aesthetic, interpreting techno with \"a basic stripped down, raw sound. Just drums, basslines and funky grooves and only what's essential. Only what is essential to make people move\". Hood explains:\n\nI think Dan [Bell] and I both realized that something was missing – an element...in what we both know as techno. It sounded great from a production point of standpoint, but there was a 'jack' element in the [old] structure. People would complain that there's no funk, no feeling in techno anymore, and the easy escape is to put a vocalist and some piano on top to fill the emotional gap. I thought it was time for a return to the original underground.\n\n\n=== Jazz influences ===\n\nSome techno has also been influenced by or directly infused with elements of jazz. This led to increased sophistication in the use of both rhythm and harmony in a number of techno productions. Manchester (UK)-based techno act 808 State helped fuel this development with tracks such as \"Pacific State\" and \"Cobra Bora\" in 1989. Detroit producer Mike Banks was heavily influenced by jazz, as demonstrated on the influential Underground Resistance release Nation 2 Nation (1991). By 1993, Detroit acts such as Model 500 and UR had made explicit references to the genre, with the tracks \"Jazz Is The Teacher\" (1993) and \"Hi-Tech Jazz\" (1993), the latter being part of a larger body of work and group called Galaxy 2 Galaxy, a self-described jazz project based on Kraftwerk's \"man machine\" doctrine. This lead was followed by a number of techno producers in the UK who were influenced by both jazz and UR, Dave Angel's \"Seas of Tranquility\" EP (1994) being a case in point, Other notable artists who set about expanding upon the structure of \"classic techno\" include Dan Curtin, Morgan Geist, Titonton Duvante and Ian O'Brien.\n\n\n=== Intelligent techno ===\n\nIn 1991 UK music journalist Matthew Collin wrote that \"Europe may have the scene and the energy, but it's America which supplies the ideological direction...if Belgian techno gives us riffs, German techno the noise, British techno the breakbeats, then Detroit supplies the sheer cerebral depth.\" By 1992 a number of European producers and labels began to associate rave culture with the corruption and commercialization of the original techno ideal. Following this the notion of an intelligent or Detroit inspired pure techno aesthetic began to take hold. Detroit techno had maintained its integrity throughout the rave era and was pushing a new generation of so-called intelligent techno producers forward. Simon Reynolds suggests that this progression \"involved a full-scale retreat from the most radically posthuman and hedonistically functional aspects of rave music toward more traditional ideas about creativity, namely the auteur theory of the solitary genius who humanizes technology.\"The term intelligent techno was used to differentiate more sophisticated versions of underground techno  from rave-oriented styles such as breakbeat hardcore, Schranz, Dutch Gabber. Warp Records was among the first to capitalize upon this development with the release of the compilation album Artificial Intelligence Of this time, Warp founder and managing director Steve Beckett said\n\nthe dance scene was changing and we were hearing B-sides that weren't dance but were interesting and fitted into experimental, progressive rock, so we decided to make the compilation Artificial Intelligence, which became a milestone... it felt like we were leading the market rather than it leading us, the music was aimed at home listening rather than clubs and dance floors: people coming home, off their nuts and having the most interesting part of the night listening to totally tripped out music. The sound fed the scene.\nWarp had originally marketed Artificial Intelligence using the description electronic listening music but this was quickly replaced by intelligent techno. In the same period (1992–93) other names were also bandied about such as armchair techno, ambient techno, and electronica, but all referred to an emerging form of post-rave dance music for the \"sedentary and stay at home\". Following the commercial success of the compilation in the United States, Intelligent Dance Music eventually became the name most commonly used for much of the experimental dance music emerging during the mid-to-late 1990s.\nAlthough it is primarily Warp that has been credited with ushering the commercial growth of IDM and electronica, in the early 1990s there were many notable labels associated with the initial intelligence trend that received little, if any, wider attention. Amongst others they include: Black Dog Productions (1989), Carl Craig's Planet E (1991), Kirk Degiorgio's Applied Rhythmic Technology (1991), Eevo Lute Muzique (1991), General Production Recordings (1991), In 1993, a number of new \"intelligent techno\"/\"electronica\" record labels emerged, including New Electronica, Mille Plateaux, 100% Pure (1993) and Ferox Records (1993).\n\n\n=== Free techno ===\n\nIn the early 1990s a post-rave, DIY, free party scene had established itself in the UK. It was largely based around an alliance between warehouse party goers from various urban squat scenes and politically inspired new age travellers. The new agers offered a readymade network of countryside festivals that were hastily adopted by squatters and ravers alike. Prominent among the sound systems operating at this time were Exodus in Luton, Tonka in Brighton, Smokescreen in Sheffield, DiY in Nottingham, Bedlam, Circus Warp, LSDiesel and London's Spiral Tribe. The high point of this free party period came in May 1992 when with less than 24 hours notice and little publicity more than 35,000 gathered at the Castlemorton Common Festival for 5 days of partying.This one event was largely responsible for the introduction in 1994 of the Criminal Justice and Public Order Act; effectively leaving the British free party scene for dead. Following this many of the traveller artists moved away from Britain to Europe, the US, Goa in India, Koh Phangan in Thailand and Australia's East Coast. In the rest of Europe, due in some part to the inspiration of traveling sound systems from the UK, rave enjoyed a prolonged existence as it continued to expand across the continent.Spiral Tribe, Bedlam and other English sound systems took their cooperative techno ideas to Europe, particularly Eastern Europe where it was cheaper to live, and audiences were quick to appropriate the free party ideology. It was European Teknival free parties, such as the annual Czechtek event in the Czech Republic that gave rise to several French, German and Dutch sound systems. Many of these groups found audiences easily and were often centered around squats in cities such as Amsterdam and Berlin.\n\n\n=== Divergence ===\n\nBy 1994 there were a number of techno producers in the UK and Europe building on the Detroit sound, but a number of other underground dance music styles were by then vying for attention. Some drew upon the Detroit techno aesthetic, while others fused components of preceding dance music forms. This led to the appearance (in the UK initially) of inventive new music that sounded far-removed from techno. For instance jungle (drum and bass) demonstrated influences ranging from hip-hop, soul, and reggae to techno and house.\nWith an increasing diversification (and commercialization) of dance music, the collectivist sentiment prominent in the early rave scene diminished, each new faction having its own particular attitude and vision of how dance music (or in certain cases, non-dance music) should evolve. Some examples not already mentioned are trance, industrial techno, breakbeat hardcore, acid techno, and happy hardcore. Less well-known styles related to techno or its subgenres include the primarily Sheffield (UK)-based bleep techno, a regional variant that had some success between 1989 and 1991. \nAccording to Muzik magazine, by 1995 the UK techno scene was in decline and dedicated club nights were dwindling. The music had become \"too hard, too fast, too male, too drug-oriented, too anally retentive.\" Despite this, weekly night at clubs such as Final Frontier (London), House of God (Birmingham), Pure (Edinburgh, whose resident DJ Twitch later founded the more eclectic Optimo), and Bugged Out (Manchester) were still popular. With techno reaching a state of \"creative palsy,\" and with a disproportionate number of underground dance music enthusiasts more interested in the sounds of rave and jungle, in 1995 the future of the UK techno scene looked uncertain as the market for \"pure techno\" waned. Muzik described the sound of UK techno at this time as \"dutiful grovelling at the altar of American techno with a total unwillingness to compromise.\"By the end of the 1990s, a number of post-techno  underground styles had emerged, including ghettotech (a style that combines some of the aesthetics of techno with hip-hop and house music), nortec, glitch, digital hardcore, the so-called no-beat techno, and electroclash.In attempting to sum up the changes since the heyday of Detroit techno, Derrick May has since revised his famous quote in stating that \"Kraftwerk got off on the third floor and now George Clinton's got Napalm Death in there with him. The elevator's stalled between the pharmacy and the athletic wear store.\"\n\n\n=== Commercial exposure ===\n\nWhile techno and its derivatives only occasionally produce commercially successful mainstream acts—Underworld and Orbital being two better-known examples—the genre has significantly affected many other areas of music. In an effort to appear relevant, many established artists, for example Madonna and U2, have dabbled with dance music, yet such endeavors have rarely evidenced a genuine understanding or appreciation of techno's origins with the former proclaiming in January 1996 that \"Techno=Death\".The R&B artist, Missy Elliott, exposed the popular music audience to the Detroit techno sound when she featured material from Cybotron's Clear on her 2006 release \"Lose Control\"; this resulted in Juan Atkins' receiving a Grammy Award nomination for his writing credit. Elliott's 2001 album Miss E... So Addictive also clearly demonstrated the influence of techno inspired club culture.In recent years, the publication of relatively accurate histories by authors Simon Reynolds (Generation Ecstasy, also known as Energy Flash) and Dan Sicko (Techno Rebels), plus mainstream press coverage of the Detroit Electronic Music Festival, have helped to diffuse the genre's more dubious mythology. Even the Detroit-based company Ford Motors eventually became savvy to the mass appeal of techno, noting that \"this music was created partly by the pounding clangor of the Motor City's auto factories. It became natural for us to incorporate Detroit techno into our commercials after we discovered that young people are embracing techno.\" With a marketing campaign targeting under-35s, Ford used \"Detroit Techno\" as a print ad slogan and chose Model 500's \"No UFO's\" to underpin its November 2000 MTV television advertisement for the Ford Focus.\n\n\n== Antecedents ==\n\n\n=== Early use of the term 'Techno' ===\nIn 1977, Steve Fairnie and Bev Sage formed an electronica band called the Techno Twins in London, England. When Kraftwerk first toured Japan, their music was described as \"technopop\" by the Japanese press. The Japanese band Yellow Magic Orchestra used the word 'techno' in a number of their works such as the song \"Technopolis\" (1979), the album Technodelic (1981), and a rare flexi disc EP, \"The Spirit of Techno\" (1983). When Yellow Magic Orchestra toured the United States in 1980, they described their own music as technopop, and were written up in Rolling Stone Magazine. Around 1980, the members of YMO added synthesizer backing tracks to idol songs such as Ikue Sakakibara's \"Robot\", and these songs were classified as 'techno kayou' or 'bubblegum techno.' In 1985, Billboard reviewed the Canadian band Skinny Puppy's album, and described the genre as techno dance. Juan Atkins himself said \"In fact, there were a lot of electronic musicians around when Cybotron started, and I think maybe half of them referred to their music as 'techno.' However, the public really wasn't ready for it until about '85 or '86. It just so happened that Detroit was there when people really got into it.\"\n\n\n=== Proto-techno ===\nThe popularity of Euro disco and Italo disco—referred to as progressive in Detroit—and new romantic synthpop in the Detroit high school party scene from which techno emerged has prompted a number of commentators to try to redefine the origins of techno by incorporating musical precursors to the Detroit sound as part of a wider historical survey of the genre's development. The search for a mythical \"first techno record\" leads such commentators to consider music from long before the 1988 naming of the genre. Aside from the artists whose music was popular in the Detroit high school scene (\"progressive\" disco acts such as Giorgio Moroder, Alexander Robotnick, and Claudio Simonetti and synthpop artists such as Visage, New Order, Depeche Mode, The Human League, and Heaven 17), they point to examples such as \"Sharevari\" (1981) by A Number of Names, danceable selections from Kraftwerk (1977–83), the earliest compositions by Cybotron (1981), Donna Summer and Giorgio Moroder's \"I Feel Love\" (1977), Moroder's \"From Here to Eternity\" (1977), and Manuel Göttsching's \"proto-techno masterpiece\" E2-E4 (1981). Another example is a record entitled Love in C minor, released in 1976 by Parisian Euro disco producer Jean-Marc Cerrone; cited as the first so called \"conceptual disco\" production and the record from which house, techno, and other underground dance music styles flowed. Yet another example is Yellow Magic Orchestra's work which has been described as \"proto-techno\"Around 1983, Sheffield band Cabaret Voltaire began including funk and electronic dance music elements into their sound, and in later years, would come to be described as techno. Nitzer Ebb was an Essex band formed in 1982, which also showed funk and electronic dance music influence on their sound around this time. The Danish band Laid Back released \"White Horse\" in 1983 with a similar funky electronica sound.\n\n\n=== Prehistory ===\nCertain electro-disco and European synthpop productions share with techno a dependence on machine-generated dance rhythms, but such comparisons are not without contention. Efforts to regress further into the past, in search of earlier antecedents, entails a further regression, to the sequenced electronic music of Raymond Scott, whose \"The Rhythm Modulator,\" \"The Bass-Line Generator,\" and \"IBM Probe\" are considered early examples of techno-like music. In a review of Scott's Manhattan Research Inc. compilation album the English newspaper The Independent suggested that \"Scott's importance lies mainly in his realization of the rhythmic possibilities of electronic music, which laid the foundation for all electro-pop from disco to techno.\" In 2008, a tape from the mid-to-late 1960s by the original composer of the Doctor Who theme Delia Derbyshire, was found to contain music that sounded remarkably like contemporary electronic dance music. Commenting on the tape, Paul Hartnoll, of the dance group Orbital, described the example as \"quite amazing,\" noting that it sounded not unlike something that \"could be coming out next week on Warp Records.\"\n\n\n== Music production practice ==\n\n\n=== Stylistic considerations ===\nIn general, techno is very DJ-friendly, being mainly instrumental (commercial varieties being an exception) and is produced with the intention of its being heard in the context of a continuous DJ set, wherein the DJ progresses from one record to the next via a synchronized segue or \"mix.\" Much of the instrumentation in techno emphasizes the role of rhythm over other musical parameters, but the design of synthetic timbres, and the creative use of music production technology in general, are important aspects of the overall aesthetic practice.\nUnlike other forms of electronic dance music that tend to be produced with synthesizer keyboards, techno does not always strictly adhere to the harmonic practice of Western music and such strictures are often ignored in favor of timbral manipulation alone. Thus techno inherits from the modernist tradition of the so-called Klangfarbenmelodie, or timbral serialism. The use of motivic development (though relatively limited) and the employment of conventional musical frameworks is more widely found in commercial techno styles, for example euro-trance, where the template is often an AABA song structure.The main drum part is almost universally in common time (4/4); meaning 4 quarter note pulses per bar. In its simplest form, time is marked with kicks (bass drum beats) on each quarter-note pulse, a snare or clap on the second and fourth pulse of the bar, with an open hi-hat sound every second eighth note. This is essentially a disco (or even polka) drum pattern and is common throughout house and trance music as well. The tempo tends to vary between approximately 120 bpm (quarter note equals 120 pulses per minute) and 150 bpm, depending on the style of techno.\nSome of the drum programming employed in the original Detroit-based techno made use of syncopation and polyrhythm, yet in many cases the basic disco-type pattern was used as a foundation, with polyrhythmic elaborations added using other drum machine voices. This syncopated-feel (funkiness) distinguishes the Detroit strain of techno from other variants. It is a feature that many DJs and producers still use to differentiate their music from commercial forms of techno, the majority of which tend to be devoid of syncopation. Derrick May has summed up the sound as 'Hi-tech Tribalism': something \"very spiritual, very bass oriented, and very drum oriented, very percussive. The original techno music was very hi-tech with a very percussive feel... it was extremely, extremely Tribal. It feels like you're in some sort of hi-tech village.\"\n\n\n=== Compositional techniques ===\n\nThere are many ways to create techno, but the majority will depend upon the use of loop-based step sequencing as a compositional method. Techno musicians, or producers, rather than employing traditional compositional techniques, may work in an improvisatory fashion, often treating the electronic music studio as one large instrument. The collection of devices found in a typical studio will include units that are capable of producing many different sounds and effects. Studio production equipment is generally synchronized using a hardware- or computer-based MIDI sequencer, enabling the producer to combine in one arrangement the sequenced output of many devices. A typical approach to using this type of technology compositionally is to overdub successive layers of material while continuously looping a single measure or sequence of measures. This process will usually continue until a suitable multi-track arrangement has been produced.Once a single loop-based arrangement has been generated, a producer may then focus on developing how the summing of the overdubbed parts will unfold in time, and what the final structure of the piece will be. Some producers achieve this by adding or removing layers of material at appropriate points in the mix. Quite often, this is achieved by physically manipulating a mixer, sequencer, effects, dynamic processing, equalization, and filtering while recording to a multi-track device. Other producers achieve similar results by using the automation features of computer-based digital audio workstations. Techno can consist of little more than cleverly programmed rhythmic sequences and looped motifs combined with signal processing of one variety or another, frequency filtering being a commonly used process. A more idiosyncratic approach to production is evident in the music of artists such as Twerk and Autechre, where aspects of algorithmic composition are employed in the generation of material.\n\n\n=== Retro technology ===\n\nInstruments used by the original techno producers based in Detroit, many of which are now highly sought after on the retro music technology market, include classic drum machines like the Roland TR-808 and TR-909, devices such as the Roland TB-303 bass line generator, and synthesizers such as the Roland SH-101, Kawai KC10, Yamaha DX7, and Yamaha DX100 (as heard on Derrick May's seminal 1987 techno release Nude Photo). Much of the early music sequencing was executed via MIDI (but neither the TR-808 nor the TB-303 had MIDI, only DIN sync) using hardware sequencers such as the Korg SQD1 and Roland MC-50, and the limited amount of sampling that was featured in this early style was accomplished using an Akai S900.The TR-808 and TR-909 drum machines have since achieved legendary status, a fact that is now reflected in the prices sought for used devices. During the 1980s, the 808 became the staple beat machine in Hip hop production while the 909 found its home in House music and techno. It was \"the pioneers of Detroit techno [who] were making the 909 the rhythmic basis of their sound, and setting the stage for the rise of Roland's vintage Rhythm Composer.\" In November 1995 the UK music technology magazine Sound on Sound noted:\nThere can be few hi-tech instruments which still command a second-hand price only slightly lower than their original selling price 10 years after their launch. Roland's now near-legendary TR-909 is such an example—released in 1984 with a retail price of £999, they now fetch up to £900 on the second-hand market! The irony of the situation is that barely a year after its launch, the 909 was being 'chopped out' by hi-tech dealers for around £375, to make way for the then-new TR-707 and TR-727. Prices hit a new low around 1988, when you could often pick up a second-user 909 for under £200—and occasionally even under £100. Musicians all over the country are now garrotting themselves with MIDI leads as they remember that 909 they sneered at for £100—or worse, the one they sold for £50 (did you ever hear the one about the guy who gave away his TB-303 Bassline—now worth anything up to £900 from true loony collectors—because he couldn't sell it?)\n\nBy May 1996, Sound on Sound was reporting that the popularity of the 808 had started to decline, with the rarer TR-909 taking its place as \"the dance floor drum machine to use.\" This is thought to have arisen for a number of reasons: the 909 gives more control over the drum sounds, has better programming and includes MIDI as standard. Sound on Sound reported that the 909 was selling for between £900 and £1100 and noted that the 808 was still collectible, but maximum prices had peaked at about £700 to £800. Such prices have held in the 12 years since the article was published, this can be evidenced by a quick search on eBay. Despite this fascination with retro music technology, according to Derrick May \"there is no recipe, there is no keyboard or drum machine which makes the best techno, or whatever you want to call it. There never has been. It was down to the preferences of a few guys. The 808 was our preference. We were using Yamaha drum machines, different percussion machines, whatever.\"\n\n\n==== Emulation ====\nIn the latter half of the 1990s the demand for vintage drum machines and synthesizers motivated a number of software companies to produce computer-based emulators. One of the most notable was the ReBirth RB-338, produced by the Swedish company Propellerhead and originally released in May 1997. Version one of the software featured two TB-303s and a TR-808 only, but the release of version two saw the inclusion of a TR-909. A Sound on Sound review of the RB-338 V2 in November 1998 noted that Rebirth had been called \"the ultimate techno software package\" and mentions that it was \"a considerable software success story of 1997\". In America Keyboard Magazine asserted that ReBirth had \"opened up a whole new paradigm: modeled analog synthesizer tones, percussion synthesis, pattern-based sequencing, all integrated in one piece of software\". Despite the success of ReBirth RB-338, it was officially taken out of production in September 2005. Propellerhead then made it freely available for download from a website called the \"ReBirth Museum\". The site also features extensive information about the software's history and development.In March 2001, with the release of Reason V1, Propellerhead upped the ante in providing a £300 software-based electronic music studio, comprising a 14-input automated digital mixer, 99-note polyphonic 'analogue' synth, classic Roland-style drum machine, sample-playback unit, analogue-style step sequencer, loop player, multitrack sequencer, eight effects processors, and over 500 MB of synthesizer patches and samples. With this release Propellerhead were credited with \"creating a buzz that only happens when a product has really tapped into the zeitgeist, and may just be the one that many [were] waiting for.\" Reason has since achieved popular appeal and is as of 2018 at version 10.\n\n\n=== Technological advances ===\nAs computer technology became more accessible and music software advanced, interacting with music production technology was possible using means that bore little relationship to traditional musical performance practices: for instance, laptop performance (laptronica) and live coding.\nBy the mid 2000s a number of software-based virtual studio environments had emerged, with products such as Propellerhead's Reason and Ableton Live finding popular appeal. These software-based music production tools offer viable and cost-effective alternatives to typical hardware-based production studios, and thanks to advances in microprocessor technology, can create high quality music using little more than a single laptop computer. Such advances democratized music creation, and lead to a massive increase in the amount of home-produced music available to the general public via the internet. Artists can now also individuate their sound by creating personalized software synthesizers, effects modules, and various composition environments. Devices that once existed exclusively in the hardware domain can easily have virtual counterparts. Some of the more popular software tools for achieving such ends are commercial releases such as Max/Msp and Reaktor and freeware packages such as Pure Data, SuperCollider, and ChucK. In some sense, as a result of technological innovation, the DIY mentality that was once a core part of dance music culture is seeing a resurgence.\n\n\n== Notable techno venues ==\n\nIn Germany, the most renowned pure techno clubs of the 1990s include Tresor, E-Werk and Bunker in Berlin, Omen and Dorian Gray in Frankfurt, Ultraschall and KW – Das Heizkraftwerk in Munich as well as Stammheim in Kassel. In the late 2000s, Berghain, which has been referred to as the possible \"current world capital of techno\", became Berlin's most renowned techno club next to the second incarnation of the Tresor club. In the 2010s, Germany continues to have a lively techno scene with many notable techno clubs also outside of Berlin including Gewölbe in Cologne, Institut für Zukunft in Leipzig, MMA Club and Blitz Club in Munich, Die Rakete in Nuremberg, Robert Johnson in Offenbach am Main and White Noise in Stuttgart. In the United Kingdom Glasgow's Sub Club has been associated with techno since the early 1990s and clubs such as London's Fabric and Egg London have gained notoriety for supporting techno. In the 2010s, a techno scene also emerged in Georgia, with the Bassiani in Tbilisi being the most notable venue.\n\n\n== See also ==\nDetroit Electronic Music Archive\n\n\n== Bibliography ==\n\n\n== Filmography ==\n\n\n== References ==\n\n\n== External links ==\nTechno Live Sets - The #1 resource for Techno sets\n\"From the Autobahn to I-94: The Origins of Detroit Techno and Chicago House\" – reminiscences in 2005 by techno and house innovators\nSounds Like Techno – online historical documentary produced by the Australian Broadcasting Corporation (ABC)\nTechno from past years – Oldie but goldie classic techno sets"}