{"topic": "Protohistory", "english_title": "Protohistory", "english": "Protohistory is a period between prehistory and history during which a culture or civilization has not yet developed writing, but other cultures have already noted the existence of those pre-literate groups in their own writings. For example, in Europe, the Celts and the Germanic tribes are considered to have been protohistoric when they began appearing in Greek and Roman sources.\nProtohistoric may also refer to the transition period between the advent of literacy in a society and the writings of the first historians. The preservation of oral traditions may complicate matters, as they can provide a secondary historical source for even earlier events. Colonial sites involving a literate group and a nonliterate group are also studied as protohistoric situations.\nThe term can also refer to a period in which fragmentary or external historical documents, not necessarily including a developed writing system, have been found. For instance, the Proto–Three Kingdoms of Korea, the Yayoi and the Mississippian groups, recorded by early European explorers, are protohistoric.\n\n\n== Use of term ==\nIn The Oxford Illustrated History of Prehistoric Europe, an article by Timothy Taylor stated:\n\nBecause of the existence in some but not all societies of historical writing during the first millennium BC, the period has often been termed 'protohistoric' instead of prehistoric. Of course, the understanding of the past gained through archaeology is broadly different in nature to understanding derived from historical texts. Having both sorts of evidence is a boon and a challenge. \nIn the abstract of a later paper on \"slavery in the first millennium Aegean, Carpatho-Balkan and Pontic regions\", Taylor, primarily an archaeologist, stated,\n\nI have taken the rather unusual step of trusting what the classical authors tell us they knew. \nFor other examples, see also the writings of Brian M. Fagan on the protohistory of North America and the work of Muhammed Abdul Nayeem on that of the Arabian Peninsula\n\n\n== Chronology ==\nAs with prehistory, determining when a culture may be considered prehistoric or protohistoric is sometimes difficult for anthropologists. Data vary considerably from culture to culture, region to region, and even from one system of reckoning dates to another.\nIn its simplest form, protohistory follows the same chronology as prehistory and is based on the technological advancement of a particular people with regard to metallurgy:\n\nCopper Age, or Chalcolithic\nThe Bronze Age\nThe Iron Age\n\n\n== Civilizations and peoples ==\nThe best known protohistoric civilizations and ethnic groups are those for whom the term was originally coined, the barbarian tribes mentioned by European and Asian writers. Many of those peoples of course also experienced periods of prehistory and history:\n\n\n== See also ==\nAncient history\n\n\n== References =="}