{"chinese_title": "sociology ", "chinese": "Sociology (English: Sociology) originated in the late 19th century, is a discipline of a research society [1]. Sociology uses various research methods to conduct an empirical survey [2] [3] and critical analysis [4], with the development and improvement of knowledge systems related to human social structure and activities, and use these knowledge to seek or improve social welfare Target. Sociology has a wide range of research, including institutions or interpersonal interactions of micro sociological levels, social system or structures in macro sociological levels [3], sociology's body has social individuals, social structures, social changes, Social issues, and social control, so sociology usually follow economics, political science, anthropology, psychology, etc., and the field of social sciences. Sociology has considerable extensiveness on research on the subject or research law, and its traditional research objects include social stratification, social class, social flow, social religion, social law, cross-track behavior, etc., including qualitative And quantitative research methods. Since all areas of human activities are shaped under the influence of social structures and individual institutions, with social development, sociology further expand its research focus to other relevant subjects, such as medical, nursing, military or criminal systems, internet Internet, etc., such as, for example, the role of scientific knowledge in social activities. On the other hand, the scope of social science methods is also more extensive. Since the language of the 20th century, cultural transformation also has more more interpretative, philosophical social research model. However, the wave of technology in the end of the 20th century, also brought new mathematical calculation analysis techniques for sociology, such as the individual as this model and social network [5] [6]. Because of its historical background, the center of gravity of sociology research is placed in various life of modern society, or how the contemporary society forms evolution and today's process, not only pays attention to the status, nor to ignore society change. Sociological research objects are wide, small to several people face-to-face, and the social trend and trend of globalization. Family, all kinds of organizations, corporate factories, etc., city, market, political parties, national, cultural, media, etc. are all objects of sociological research, and the common point of these research objects is some social social facts. . Although the definition of \"social\" is still dispatched between different schools, social facts are personal and have an impact on individual behaviors, which is generally accepted by socialists.\n\nIn the early 19th century, Kongde believed that the society of the pastology and advocating force will slowly disappear, with rationality, science, and industrial age is looking up, the conflict between the two is the source of social turmoil. This transitional conflict and conflict is unavoidable during the transition of social institutions. Before the old system disappears, people cannot experience the new system, often need multiple social transformations to change the society [7]. Sociology is developing a social science for social reorganization issues (modernity). The sociologist of the Tulkhe School not only wants to understand what makes social groups aggregate, but also want to understand the development process of social tiles, making \"correction\". Correcting concepts do not suggest that sociologists prepare a \"correct society\" template. Tulkhe people do not think there is an ultimate and perfect society. Simply put, when a group of people interactively form a stable reference architecture, running for a long time, it is \"normal\" for them. When the social system problem has accumulated, this steady state is broken, forming a chaotic, that is, the so-called \"tile\", it forms a pathological state. Therefore, Tulkan believes that sociologists are to identify \"daily normality\" of a society, so that the \"pathological state\" is determined. Sociologists need to continue to observe and analyze, not to find templates, and claim that the ultimate fact is over.\n\nConversely, the sociologist of the Frankfurt School does not explore the method of correcting the society. Because they believe that the correction plan for social illness is often imposed on the vast majority of people with a small group, this will not only solve the problem, but also increase the problem. At the beginning of the 20th century, such as Hawkheimer and Adorno and others, he was influenced by the previous generation of Weber and Qimeier, and the reference Marx's theory, the pessimistic view of the modern society and the capitalism system, especially the society, although height Division, but also produces the splitting of life. Especially in the field of art culture, a large number of replication technologies have caused the loss of artistic spirit. Frankfurt second-generation Habermas inherits the above view, and refers to the American structuralism and symbolic interaction, the continental phenomenology, etc. Society is the way in pessimistic and modernity. The above, similar social conflictism, well-known people such as Darum Dolph, also Marx's class analysis, think that society has the class of resources, and the class of dominance, but not, Marx believes assets The class has a production tool, and the proletariat is bound by the zone because there is no tool. It needs to resist the revolution. It is more political economics, but the conflictists, combined with Weber to the class - join the social status, and believe that society is inequality, from Many aspects, not only economic inequality.\n\nToday, sociologists have a series of research from macro-structured to microscopic behavior, including research on race, ethnic, class and genders, to the individual social relationship model of home structure. The sociology department is divided into more detailed research directions, including crime and divorce, in micro aspects, such as people with people. Some sociologists use quantitative research [Note 1] to describe a social overall structure from quantity to study the predictive social changes and the quantitative model of people's social change reactions. This research method advocated by Razzfeld is now one of the two main methodologies in sociological research. Another major genre of sociological research methods is a qualitative study [Note 2], including historical sociology, participation in observation, depth interview, special group discussions, etc., and analyzed based on qualitative data such as root theory, content analysis and Internal method. Sociologists engaged in qualitative analysis believe that this is a better way, because this can strengthen humanities that understand the \"discrete\" sex society and unique. This approach does not seek consistent views, but can appreciate each other and learn from each other. Mainstream views believe that quantitative and qualitative these two research methods are complementary, not contradictory. Turkan and Weber emphasize the importance of both - the subjective (quality) and objective (quantitative) staggered research, to the later symbolism, the interactive master Bruce is quite emphasized.\n\nThe perspective of sociology is to let us know the society through the way of learning things. Two of these more famous sociological perspectives are \"Sociological Imagination\" and \"Debunking\".\n\"The Ideas of Sociology\" is created by Wright Mills, which means that we can understand the society through \"social imagination\". [8]\n\nAs for the \"cracking puzzle think\" is the concept of Peter Pla. He pointed out that \"there is a motive that there is a truth and cracking puzzle thinking.\" [9] This sentence pointed out that sociologists are concerned with all human activities, but they are not concerned with the fact that the general people are concerned with the facts of the facts, but to think about and crack the puzzle thinking about a questioned mind. .\n\nThe overall study of human changes in social change is long, and the logic and philosophy of sociology have already appeared before they form a discipline. The analysis and research of society is basically stem from Western culture, and philosophical thinking for long-year accumulation, and at least be produced before the Berram era. The origin of more formal social statistics is more dted back to \"End Day Trial\" at least in 1086 [10] [11]. On the other hand, in the medieval Islamic society, there is a trace of early sociology. Many studies have pointed out the first sociologist in history. It is a Arab scholar from North Africa from North Africa - Iben Helestown, Its most famous book \"Historical Introduction\" introduced social science theory of social cohesion and social conflict [12] [13] [14] [15] [16] [17]. In the seventeenth century, the rationalists represented by Cartesi have noticed the ability of science to discover truth, and start to try to use scientific methods to study social phenomena [18].\n\nEnglish \"Sociology\" (or \"Sociologie\") of sociology, is from Latin \"Socius\", \"- OLOGY\", and Greek \"όγος\" (ie \"lógos\", merit The word, knowledge) is combined, and this name was earliered by French essay, Emahahae, Joseph West (1748-1836) creating [19] [20] in an unapproved manuscript at the time. [19] [20]. By 1838, the French scientific philosopher August Confudent (1798-1857) officially established the term \"sociology\" [1]. Confield has used the term \"social physics\" in the early days, but later was misappropriated by others, including the famous Belgian statistical Jacques Kate. Kongde is hoped to form a historical, psychology and economics throughout the social field, and the social development is organized.\n\nSociology as an independent discipline in the nineteenth century in the nineteenth century, it has a close relationship with accidents, but there is a close relationship with the disorders of social operations caused by intense social changes. Since the end of the 18th century, the revolution from Europe has occurred, the first time is the political ideology of the French Revolution in 1789, and the other is beginning to the European and the United States, which has been expanded from the UK. Two major events have enabled Western societies fundamentally transition. After the establishment of capitalism, on the one hand, the productivity has developed a sharp-flying development, making the social economic foundation, ideological concepts and political systems have changed; on the other hand, social operation has also exposed many uncoordinated factors, such as periodic economic crisis, unemployment, Crime, etc. For these issues, traditional methods and original scientific systems cannot make satisfactory explanations and answer, so sociology is born as an independent new discipline that is different from other social sciences.\n\nIn the age of the French Revolution, the Confucian revolution continued to turn, he believes that all kinds of illnesses and issues in society can be eliminated through sociology, this is an introduction to the \"empirical philosophical tutorial\", \" A General View of Positivism clearly proposed an epistemological model. He believes in the \"three-phase law\" in human knowledge, after the phase of the secondary stage and shape, the empirical phase will occupy the final position, and the part of his most important [1 ] [18]. Kongde believes that the society of the pastology and advocating force will slowly disappear, with rationality, science, and industrial age is looking up. The conflict between the two is the source of social turmoil. This transitional conflict and conflict is unavoidable during the transition of social system. Before the old system disappears, people cannot experience the new system, often need multiple social transformations to change the society. [21] Sociology is a social science for social reorganization issues (modernity), which is generated in social transformation to address the uncoordinated factors in social operation and development to seek social and benign operations and coordinated laws. For the content, and this main line runs through the history of the entire sociology.\n\nOverall, the 1830s to the 19th century, the leaves are generally regarded as the foundation period of Western sociology. The sociology characteristics of this period are: (1) Closely related to philosophical relationship; (2) The impact of emphasized thoughts is great; (3) The purpose of establishing sociology is to maintain coordinated social relations. At this time, Kongde and British philosopher Herbert Spino were mainly represented. Kongde believes that sociology is science in studying social order and social progress [22]. The entire society and nature are based on the coordination, this is the social order; the old social order in the society has been replaced by the new social order, becoming social progress. Spencer uses social changes to sociology research. He believes that society is a body, social evolution and biological evolution to follow the same rules, with human society equivalent, and therefore, his theory is called social organic s. In 1874, Spencer prepared a book in history - \"The Study of Sociology\".\n\nAt that time, Kongde and Marx proposed that after industrialization and secularization in Europe, the development of a scientific and reasonable social system was developed, but in the same time, Marx denied the sociological exclusualism headed by Koid. At the same time as Kongde proposed sociology, Marx has formed a new materialistic view in the \"1844 Economics Philosophy\". Marx believes that the relationship between people and nature is based on labor, and he analyzes the performance of human labor in the private system of production materials. It will mark the human return and society. User-friendly, so that the economics of capitalism is criticized to the criticism of the status defined in sociology [23]. Marx's historical concept of social learning, so that sociology is essentially critical, revolutionary science, and Kongde emphasizes order, balance, and the purpose of maintaining and improving the exclusive existing institutional empirical social formation of distinctive opposition. This is also the basic reasons why Marx himself have been refused to call their social theory as \"sociology\", until the early 20th century, Lenin clearly called Marx's social theory, so that it is an important in early socialology. One of the pillars. The famous philosopher in the twentieth century also believes that Marx can be seen as \"true modern sociology of the father\" [24].\n\nAt the end of the 19th century, sociology began to flourish, attributable to French sociologist Emier Tulkhe to publish a large number of sociological research monographs, lay a solid foundation for the standardization and scientificization of sociology, and to establish sociology discipline The status makes a significant contribution. He is committed to promoting social development in his life, and will be the foundation of Physicalistism into the actual social research. In 1895, Tulkan founded the first sociology department in France, France, and published an important copy of the subsequent book \"Rules for sociological methods\" [26], establishing an independent study of other social science disciplines for sociology Objects, namely social facts. Tucan believes that all society has invisible forces, shaping people's awareness. Most intentions in humans are not generated by their own, but is formed under the outside of the outside world, influence and oppression. Social facts cannot be explained by methods of physiology, psychology or other research, but must be used The method of sociology, explanation explanation [27]. By 1896, Tulkan founded the \"L'Année SociologiQue\" journal, in public, spread his research results and student research results [26]. In the \"Suicide\" published in 1897, he took the difference between Roman Catholic and new teachers' human human suicide rate, citation of sociology and psychology, philosophical perspective in analyzing social facts, and further this work is further Development Structural Functionalism Theory. For Tucan, sociology can be described as:\n\nIn the 20th century, the academic status of sociology rapidly increased, and universities across Europe have established a sociology department. The first sociology in the United Kingdom was founded in the London Institute of Political and Economics in 1904, which is also a British Sociological Magazine [29]. From 1907, the first sociological professor of the United Kingdom Lennad Tri Laissi Hopehaus began to serve as a sociological lecturer in London [30]. In 1909, German sociologist FEIN Sinnis and Max Weibo jointly established a German Sociology Association (English: German Sociologic Association), and then Weber has established Germany's first sociology department in 1919 in Munich, Germany. And the first time, the concept of anti-Validism [31]. Florian Znaczki (English: Florian Znaniecki) founded Poland's first sociology department in Pozna, Poland, Poland, Pozna, Pozna, 1920. In 1923, Frankfurt University has established a Society Institute (Institut Für Sozialforschung) [32].\n\nAt the same time, the United States has a growing development in sociology. American sociologist William Graham Samner (William Graham Sumner) has begun to teach \"sociology\" in Yale University in 1875 [33]. In February 1890, Frank Wilson Blackmar (Frank Wilson Blackmar) established a \"Elements of Sociology\" in Kansas, Kansas, and continued to date [34]. In 1892, the representative of Chicago School-Albion Woodbury Small, founded a sociology department in the University of Chicago [35]. George He Bit Made, one of the beginning of the social psychology, and the University of Michigan met Charles Horton Cuuli and John Dewey; Mid and Dewey transferred to Chicago University in 1894. TECHNICAL [36], this makes social psychology, symbolic interactions (Symbolic Interactionism, or symbolic interaction theory) [37]. In 1895, Albi W. Mo Mo was founded the first sociological journal in the United States - American Journal of Sociology. In 1905, the American Sociological Association, ASA was established [35] and became the world's largest sociologists in the world. Talcot Passen, which is deeply affected by Tucardan and Max Weber Thoughts [38], and a life is committed to promoting the professionalization of sociology and the development of the United States. Affected by geographic and historical factors, the development of European sociology is less affected by Marxism in history, and this cultural tradition has been continuing to present, and the American sociology has more significant research methods [ 39].\n\nIn China, Shanghai Hujiang University founded the first sociology department of China in 1913 (the Department In 1952, Shanghai Hujiang Normal University) opened, including anthropology, theory and application sociology, social investigation and social issues and citizens. There are many courses, which later established in 1917 is the first university sociology experimental base in China, which is regarded as the predecessor of China 's social work service.\n\nThe first international cooperation on sociology occurred in 1893. The French government Congress audience Master Reline Walmus (English: René Worms) Journal of International Sociology and the editor of its editor, then established \"Bibliothèque SociologiQue International) \"Société de Sociologie de Paris,\" Institute Institute \", of which the Institute of International Sociology was later combined with the 1949 International Sociology Association [40] .\n\nIn general, the growth period of academic scale in the 19th century is in the late 1930s. The development of sociology can be seen as a positive response to modern sexual problems such as industrialization, urbanization, and secularization, or the understanding of social rationalization [41]. During the initial period of sociology, the field of sociology dominated the European continent and followed the developing trajectory with the British anthropology and statistics, and put it into the 20th century. More and more sociologists are active in the so-called \"Anglosphere\", namely English-based areas. At the same time, sociology establishes its own research scope and method, the independent discipline system is basically formed, and the scope of research is increasingly specific and specialized. Few early sociologists will be limited to specific, narrow research themes, such as economics, law, psychology, philosophy, etc. are also its concerns. Since the foundation of the Sociology in the 18th century, the epistemology of sociology has been experiencing expansion and disagreement, forming hundreds of contending [42].\n\nDuring this period, an empirical route represented by Emir Turgan was formed by Max Weber, a traditional sociological research on a social survey represented by the Chicago School of Chicago. The sociological theory of Tucan is launched by social relationships and social unity as the main line, adhering to social realism and social overall governing, and advocates empirical research in the overall level of society. At the same time, he also interested in social abnormalities and social deviations. Weber is a tendency to interpret individualism, that is, an explanation of personal motivation and hidden secrets behind a particular social action and social phenomenon. He tried to verify that there is an invisible, spiritual power behind any social phenomenon.\n\nThe development period of contemporary sociology is roughly from the 1940s. This is characterized by:\n\nAfter more than a hundred years of development, although there is a lack of complete theoretical architecture and a lot of contradictions, it has become a theoretical system with a clear riche, and many of them have a distinctive practice pointing and in reality. A useful role in life. There are also many theories that are still very abstract, but they are not lacking. According to the degree of development and time order, the sociological theory is generally divided into classical sociological theory, modern sociological theory and contemporary sociological theory.\n\nClassical sociological theory is largely the theory of some famous sociologists. That is to say, the sociological theory of this period has lacks complete theoretical geography, and the theory of single sociologists can represent the characteristics of this. Therefore, when people explain the theory of this stage, most of them introduce a few sociologists' theoretical results. However, such a disadvantage is also obvious, and the theoretical outcome of a single sociologist is too reluctant to the entire theoretical system. Therefore, by the classification and summary of its characteristics, it is summarized as the following four theoretical frameworks. As a result, there is a more clear understanding of the theory of this period, and it can be connected to the genre classification with the next stage. But you have to have an in-depth understanding of each theory, or return to these sociologists.\n\n\n\nAfter the accumulation of the classical stage, sociological theory got rid of the dependence on philosophy and other social sciences, and truly embarked on the path of distinctive disciplines. At the same time that modern sociological theory has achieved significant development, the theory of classical sociology is still clear, this also shows the continuity and inheritance of both. In fact, the classification of modern and classical phases is not bounded, and there are many intersections in addition to representative characters and theoretical geography. Sociological theory in the four theoretical frameworks in classical period, there is constant rich and developed, with the difference in characteristics, these genres have been constantly differentiated, forming a new framework system.\n\nSocial Theory often uses some abstractions and even complex theory frameworks to explain and analyze social styles and macro social structures. Sociological Theory is a uncomfortable relationship with the classic discipline, which is most important sociologists as university duties. Today's social theory is considered to be sociological branches, involving multiple scientific areas such as anthropology, economics, theology, history, etc. The first social theory is almost born with sociology. The Parent of Sociology - CENE Established the First Social Theory - Social Evolution Theory. In the 19th century, the three major social theories were social evolution, social cycle theory and Marxism historical materialism. Although they are now considered to be outdated, they have new theories, like social accumulation, new evolution, modernized social biology, and post-industrialized social theory and multilateral theory. Unlike experimental natural sciences, social theorists rarely use natural scientific methods and other evidence. Instead, they use some hypothesis when they face very large social trends. However, these hypothesis take a long time to prove. This is the focus of opponents. For deconsive and postmons, they have questioned all research and methods, and many times, social theory is identified as unconpected. In fact, social practice is the only standard for inspection sociology. Sociology said in social practice, inspected in social practice and developed in social practice.\n\nIn ancient Greek society, the social transformation of the ancient Greek society has prompted the thinkers at the time to think about the problem of people and some groups, and the proposal of the golden age is such an example. At that time, the thinker was also very indignant for the darkness of the slavery, but it was hard to alternative, and the development trend of human fate was difficult to grasp, so they recruited to go back to slavery, and recovered people Dignity in society.\n\nTwo of these philosophers' social ideas can especially explain the problem. The human society in Plato's eyes is organic unity. The various components of the country have formulated the country's functions, and they are also distributed in the whole, and society is a division of labor and unbalanced unity. The sages (philosophy king) is the best candidate in the top top of the country. Because he has enough experience and knowledge, it is able to transcend the interests of the specific part and achieve the greatest well-being of the whole society. In Plato's view, private property and families are scattered and independent factors should play their role for the development of society. Aristotle is the opposite. In the \"Political Science\", although the views of human society and the country are still chaotic, the sociological thoughts are obvious, and he believes that the independent elements of each part of the society can maintain the whole society. Each independence. He pointed out that society originated from human social nature, that is, people have a collection of instincts, but complex, and unusually differentiated society are not composed of individuals, it is based on a group, so there is corresponding function The community of the property finally formed a society. [43]\n\nEnlightenment thinking about the influence of Western civilization, many social sciences were born in the emancipation and breakthrough in the ideological liberation and breakthrough, and the social development of social transformation also promoted the development of the entire enlightenment.\n\nSocial contract is the most important social idea in this period, born in the struggle with tollus and Wang Quan, the worldview of a contractual obligation and social relational structure, has become one of the direct motivations of sociology origin. The trend of \"Talent Human Rights\" is logical, thereby promoting the development of social development, is a continuous evolution from the natural state, and people formulate contracts and establish a country to protect their own talent, and this is developed to private property. The awareness of freedom, equality and enjoyment rights. At the same time, many of the many ideas have many important impact on the human society's insights.\n\nMendesan's discussion of natural geographical conditions on social, national mentality, and the historical evolution theory of this development, the contractual three-power discrete is jointly constitutes his social integrity. Voltaire's natural legislation is looking for social legislative principles that meet people's natural nature. Didero's well-off society thought, let - Jacques Roussea on the idea of ​​social development stage, Hume's view of authority's influence on social development, Adam Smith's proposition in commercial society, Fogoson about citizens Social research, the study of industrial society and the use of empiricalism, etc., are an important contribution to the development of social ideas during this period. [43]\n\nSocial research mainly has two major categories: \"qualitative research\" and \"quantitative research\". Experience empirics, including questionnaires, interviews, participants observations and statistical research. Historical sociology research is a qualitative social research method. Similarly, the blend of sociology and anthropology has spawned more and more sociologists to use ethnic methods to study modern society.\n\nThe difficulties faced by different methods are to explain and understand the society based on the theoretical basis adopted by the researchers. As a functionalist, IMi Tucan likes to explain anything in a large-scale structure of society. If he is a symbolic interactive, he focuses on how people understand others. Marxists or new Marxists put what they all chemically battles. The phenomenon is just thinking about how the public has established its own meaning. When all parties face the real social problem, they often argue who is wrong, and actually combine different methods.\n\nGeneral views divide the sociology zone into two categories of macro or micro, and believe that analyzing units such as national development, belong to the former; analyzing personal spirit and household, etc. This is a fairly rigid solution. In fact, the so-called microscopic is not based on the scale of the study unit, and the microcompanies are more likely to address the basic prototype of sociology, and the interaction between different units is more observed. In fact, between the enterprises, even between the country, and can also It is considered to be an individual to study the interaction between them, with micro-mode 之如, such as using symbolic interactions, phenomenon methods, etc.\n\n\nThe Internet is the interest of sociologists. Chen Dwei\n\n\nGeneral Europe and the United States pay attention to the Internet problem, which is more inclined from the median angle. It is not only a communication tool, but also to change people's interaction mode. For the 20th century, the modernity of the currency in the currency will live in the modernity; or as Turntao printing is flourishing after Europe, for European knowledge and Education or so on.\n\nThe sociologist often analyzes groups, such as social classes, social organizations, religious organizations, political organizations and commercial organizations. They studied the interaction between social groups, tracking the source and development process, analyzing the impact of group activities on various members. Sociologists care about the characteristics of social groups, interactions between groups or members, and social features (eg gender, age, class, race) to daily life. These social research results can assist educators, legislators, administrative staff, social workers, etc. to solve social problems and formulate public policies. Most sociologists have a number of expertise, such as social organization, social layering and social flow, racial relations, education, family, social psychology, city, rural, political and comparative sociology, gender role and relationship, and Learning, old age, criminal psychology and sociological application. In recent years, many sociologists have also begun to study all kinds of social inequality issues in gender, class and race. [44].\n\nToday, social research methods of human organizations, social groups, social interactions, etc. use a large number of comparative methods. The development of sociology provides additional demand for other science, which is important to study modern industrial society. In recent years, the enlightenment of anthropology has accelerated research on multivariate culture and multi-national nationals.\n\nOn the other hand, sociology develops towards micro-social structure, such as race, social class, gender and family. Because there are many criminals, family problems have produced a lot of social pressures, and they need sociology to find solutions.\n\nSociologists study social relationships through qualitative research and quantitative research to predict social changes. They hope to study through quality research, such as interviews and group discussions, and have a more in-depth understanding of social operations. Some sociologists are debating the gap between the two. For example, quantitative research describes large social phenomena, and qualitative research describes how individuals understand large social phenomena. In the early 20th century, sociologists and psychologists have made research on industrial society and contribute to anthropology. It is important to note that humanologists have studied industrial society. Today, sociology and anthropology are mainly studying different theories and methods rather than objects.\n\nSocial biology is a new science in integrated sociology and biology. Although it will receive acceptance, there are still many disputes to explain social behaviors and structures because it tries to use evolutionary and biological processes. Social biologists are often criticized by sociologists' influence of excessive relying on gene on behavior. Social biologists have a complex relationship between nature and nurture. Therefore, this social biology has a close relationship with anthropology, zoology, and evolutionary psychology. This is still unacceptable to other science. Some social biologists are like Richard Machalek asking to use sociology to study non-human society.\n\nSociology has a relationship with social psychology, the former cares about social structure, the latter cares about social behavior. "}