{"chinese_title": "Biological Engineering ", "chinese": "Biological Engineering or BioEngineering is a method of comprehensive utilization of mathematics, physics, chemistry, biological knowledge, and engineering itself, to address various issues such as biology and pharmaceutics. Means have an engineering that needs to be needed in biological products. It uses, but is not limited to, molecular biology, biochemistry, microbiology, pharmacology, protein chemistry, cytology, immunology, neuroscopics, etc., and the partial and even overall life of artificial reproduction of organisms. Finally achieve the expected role of producing biological products or medical care. As a study, biological engineering also includes biomedical engineering and related biotechnology. Biological system engineering is also a category of biological engineering. This discipline has improved the biological system through the design, sustainable development and analysis of finished products.\n\nUnder normal circumstances, attempts of the biological engineer (or biologist) are in the form of a product or modification and control biological system that mimic biomarre creation so that they can be replaced, increased, maintained, or predict chemical and mechanical processes. [1] Biological engineers can use other application projects and biotechnology of their expertise, including gene-modified plants and microorganisms, bioengineering and biocatalysis. Work and doctors, clinicians and researchers, biologists use traditional engineering principles And technology, and use them in real-world biological and medical issues [2].\n\nAt present, the hotspots of biological engineering can be generally divided into the following three categories in terms of different main purposes:\n\nOn the eve of the Second World War, the bioengineering has just begun to be a separate engineering branch, a new concept. After World War II, it began to develop rapidly, which is the basic reason for the term \"bioengineering\" being created. At that time, the frontier researchers of the Bioengineering were the British Scientist Heinz * Wolf, and he was in the National Institute in 1954. The electrical engineering was considered to be an engineering branch produced by medical equipment. But in subsequent period [3], when engineers and life scientists start working together, they realize that there is a new and independent discipline to solve the problem of biological product production. To solve these problems, they hope that the biologists and pharmacists have invested more time and research details and procedures into the field, such as biology, psychology and medicine [4]. Later biological engineering can also be applied The environment is modified, such as surface soil protection, stabilization of slopes, water and coastal protection, wind surrender, vegetation barrier (such as three-north protective forest), including noise barrier and view barrier. Because other engineering areas also handle living organisms, bioengineering can also apply more broadly including agricultural engineering and environmental engineering. "}