{"chinese_title": "legal ", "chinese": "Law (English: LAW) is a system consisting of rules, which guarantees national power to implement [1] to standardize personal behavior. The law is a series of rules, usually need to be implemented via a set of systems [2]. However, in different places, the legal system will explain people's legal rights and obligations in different ways. One of the distinction is divided into two kinds in the European law and the United Kingdom law. Some countries will be based on their religious rules.\n\nScholars have studied law from many different perspectives, including discussing from legal history and philosophy, or aspects such as social sciences such as economics and sociology. Legal research comes from what is issues such as equality, justice and justice, is not always simple.\n\nIn a typical three-power discrete country, creating and interpreting the core institutions of the law for the three major departments of the government: fairly non-leaving judicial, democratic legislation and administration. The bureaucracy, military and police force is the law, and the law is equivalent to the people. In addition, to support the operation of the entire legal system, driving the progress of the law, the independent legal professionals and the angry-filled civil society are also indispensable.\n\nAncient Greek philosophers wrote in the first 350 days before Xiyuan: \"The rule of law is better than the rule of anyone.\" [Note 1]\n\nGeneralized fingering method and non-formulation method, narrow single referring to the method. The distinction between formulation and non-formulation is whether there is a constitution, laws and orders that have established agencies, such as legislative or administrative organs, and non-formulation, including legal, legal principles, jurisprudence, customary law, and the like.\n\nThe law initially refers to domestic law, which is limited to one country's sovereignty. As the country exchanges frequently, international law has also received more and more people. In today's economic globalization, international laws and domestic laws often have conflicts, as well as gradually coordinated with each other.\n\nAlthough all legal system treated issues are usually similar or even, different countries will usually differ from all kinds of legal classification and naming. The most general distraction is \"public law\" (including Constitution, Administrative Law and Criminal Law), which is closely related to the country, \"private law\" (including contract, infringement and property law) [Note 2]. In the mainland legal system, the contract law and infringement method belong to a part of the debt law, and the trust law operates under the law system or the legal application of trust and its acknowledgment. International law, constitution, administrative law, sea commercial law, criminal law, contract law, infringement method, property rights law and trust law are considered \"Traditional Core Project\" [Note 3]. In addition, there are other possible topics that may be more important.\n\nThe law is also the same global in the global economy. International law can refer to three things: international public law, international private law and super national organization.\n\nConstitutional and administrative law manages national affairs. The Constitution focuses on the relationship between administration, legislation and judicial, as well as the freedom of citizens of human rights or in the country. Most countries, such as those such as the United States and France, have only one text constitution and amend the right bill. The Constitution of the Republic of China regulates the basic power of the people in the Constitution. But few countries such as British laws have no such provisions; in these countries, the Constitution is made up of law, juris and conventions. In a case where the Entick v. Kolinton case (English: Entick V Carrington) is described, a constitutional principle of a common law is described. Entick's house is searched by Carlington Sheriff and took a thing. When Ntick complained in court, the Sheriff said that he had the authorization of the government's head. However, there is no provision or court authorization of a letter. The main judge Charles Pratt said:\n\nA basic constitutional principle proposed by John Rock is [8]: Individuals can do anything, unless the law is prohibited; and the government can't do anything unless the law is permitted. The administrative law is the main method of the people's supervision and regime. The people can propose judicial reviews to local parliaments, public services, or government departments to determine if they have obliged laws. After that, the first special administrative court - the French Executive Yuan Parliament was established in 1799, and when the positive value of Napoleon took the power. [9]\n\nThe criminal law is a law for regulating the content of crime and penalty [10]. The implementation of arrest, prosecution, trial, and punishment is specified by the Criminal Procedure Law [11]. Whether a behavior constitutes a crime of criminal law, in the country of the mainland legal system, according to the third-order theory of criminal law, it is generally believed that the following three elements: First, constitute a component, that is, the act of this behavior Whether it is in line with the criminal acts defined in the criminal law, and the so-called causal relationship usually judges in this component, and if the behavior has a causal relationship between the behavior, the behavior cannot be evaluated as a crime. Second, there must be illegal, usually the crime constitutes the need, that is, it has illegal, only when the behavior has a barrel, the exception is considered to be unspeakable. There are many kinds of illegal things, generally common defense and emergency avoidance, such as the Queen of the 19th century, the Queen v. Dudelley, and Stephen case [12], the concept of emergency refuge, the case, one The sailing ship from Magitton, sailing to Sydney, is difficult to have a ship in about 1600 miles from the good angle. At that time, four crew took a lifeboat, but it was still not rescued in the sea. At this time, the three crew members were only 17 years old, and Richard Parker, who has been dying, was killed. And eat it. These passengers have been saved, but they are prosecuted by killing. They claim that Richard Parker is necessary to maintain their lives. John Colluzhi expressed its extremely disapproval of this, ruling: \"The maintenance life can be said to be an obligation, but sacrifice may be the most clear and highest obligation.\" These people were sentenced to spend, but the public opinion, especially It is anger in the crew, and it is impressed by this judgment and supports these people to maintain their own lives. In the end, the king mitigated their penalties until six months. Third, you must have a profit, that is, whether it should be non-difficult for this illegal act. If the actor is problematic, it is impossible to expect people to make legitimate behaviors in this state because of age, and it is not necessary to be guilty of responsibility.\n\nCrime is not only considered harm to a single victim, and may also hurt the whole society, so some of the crime of serious social hazards, although the parties do not want to prosecute, the state will still be accepted by the police, the prosecutor. Prosecute. For example, in the Republic of China, \"public prosecutor: a certain prosecutor prosecutor\", in the UK, there will be \"Wang Shang ...\", it is \"American v. ...\" case. In addition, certain countries will also use the jury to determine whether the defendant is guilty, but the jury usually only works in the work of the facts, the applicable law remains on the author of the judge. Some development countries have retained death penalty and corporal punishment, in addition to this, general penalties should be in prison, fine, and community services. Modern criminal law has deeply influenced by social sciences, especially in terms of judgment, legal research, legislation and criminals. [10]. In terms of international law, 104 countries have signed the Treaty of the International Criminal Court, responsible for trial crimes that endanger human crimes [13].\n\nThe concept of \"contract\" is from \"there is a must-keep\" legal term [14]. The contract can be a simple daily sale, or a complex multi-party agreement. The contract can be exposed to an oral agreement (such as buying a newspaper) or in writing (such as a contractual contract). Sometimes some official procedures (such as written conventions or witnesses guarantees) whether the contract is effective (such as buying a house) [Note 5].\n\nIn the mainland legal system, the contract is an important approximately about two elements. For example, in France, Germany [Note 6], the general contract can be established simply in \"consistent\" (consisting of offer and commitment). In addition to the approximately, there is still a so-called quotation of this concept, which means that it is enough to evoke to the meaning of others, and must be established after their own commitment. However, the behavior of the parties is to date or have an intrusion, and it is often difficult to judge. For example, in Taiwan's well-known Dell computer standard misappropriation, Dell Computer is set by internal system, thus causing its online shopping website error discount of 7,000 yuan, and makes the original price of 8700 yuan display at 1,700 yuan. Sold, however, the Dell computer is not willing to ship orders, but only the consumer subscribed by the vouchers, and consumers file a lawsuit to Taipei and Tainan local courts, respectively. In this case, the Taipei Local Court believes that the Dell computer is priced on the website of the sale of goods, which is only about the truce [15]. However, the same cases are contracted by different people in the lawsuits filed in Tainan Local Court, but the Dell Computer should be restored by the offer, but should ship [16].\n\nIn Germany (including some countries affected by Germany), the general contract is divided into two parts of the creditor contract and the property rights contract (for example, buy a newspaper, will set up a creditor contract and two property contracts. ) For some part of the property rights contract in addition to the property law. Based on the so-called inexperity of the ABSTraktionsprinzip, the property contract is independent of the credit contract, when the creditor contract is invalid because of some reasons, such as a car buyer expresses the contract to the contract of the contract [Note 7] The property contract that the car ownership is transferred is not yet. At this time, the improperry will replace the contract law to return the improper wealth changes to the original state [17].\n\nIn the British and American legal system, in addition to the offer and commitment, the agreement is one of the elements of another contract, and the \"agreement\" means some of the exchanges worthy of the contract. For example, in the Cali Europe's complaint carbon smoke company case [18], a pharmaceutical company advertisement says their new drug - smoke pills can be cured in three months, and if they can't, consumers will Get 100 pounds of money [19]. Many people pay $ 100 to the drugs when the drug is invalid. Fear of the bankruptcy carbon smart company claims that their advertisements cannot be considered a formal, legal offer, but only a contract, boasting or trick. However, the undertaking courts have said that rational carbon smart pills have proposed a formal offer. People get a good thing in this advertisement, so that they must withstand \"obvious inconvenience\" due to the use of defectivements. \"Read and say how you will be able to, and twisted into you how you really will.\" Linderegor said: \"This is a promise that it is directly expressing in the language and it is impossible to be misunderstood.\" [19] However, not all the British and American legal countries believe that it is an indispensable element of the contract, such as Australia, etc. In the country, the agreement is one of the elements of the contract. The concept of counterfeiting and the applicability of the negligence of the contract can form certain obligations in the Contracting Stage [20].\n\nThe infringement is a civil law, it is a violation of the obligation to violate someone, or violates the act of some existing legal rights. For a simple example, a palette accidentally hit someone, ie constituting infringement [21].\n\nThe establishment of infringement, with the principle of fault responsibility (including deliberate, negligence), but in some special circumstances, like atomic energy facilities, the law can be required: the law may require: the behavior has no negligence, It is also necessary to damage the liability of compensation, and even if the behavior needs a so-called \"no loss responsibility\", Germany is called \"Gefährdungshaftung\", in British and American, \"strict Liability\" [22]. On the British and American law, the discussion of the principle of negligence (NEGLIGENCE), you can see the Donoho's St. Stevesen, the United Kingdom [23]. In the case, Mrs. Donojo booked a bottle of ginger beer with opaque bottled in Pesley. After half of the left, she left the left into the glass, but he saw that some of the somath of the dead snail was floating on the wine. Mrs. Doloho is very disgusting, so I complain the manufacturer and ask the manufacturer's negative damages responsibility. The British House resolutions must be uncomfortable for Mrs. Dolno. A Jin Bun is cut by moral view, said:\n\nFrom this case, four elements of the NEGLIGENCE infringement behavior can be obtained: [23]\n\nIn addition, deliberate behavior will certainly constitute an infringement, but intentional behavior, it may not only constitute civil infringement, but also may constitute criminal responsibility. For example, damage or illegal invasion, it is likely to invade residences due to injuries constituting criminal laws.\n\nThe infringement method has recently been received by the countries concerned, and it is the area of ​​\"personality\". When the People's Republic of China is drafted, even the personality rights will be listed separately as a series, which has changed from the human rights. importance. The so-called infringement of personality rights, that is, how to give relief when the individual's life, body, health, reputation, freedom, name, credit, chastity, privacy, etc. should be relieved. For example, in terms of reputation, if a newspaper or magazine has published an unspecified report, it hurts the reputation of a political person, the political figures can report to the newspaper or magazine according to the concept of infringement. Social requirements damage compensation. This is the most famous case in Taiwan, which is the case of Lu Xiulian's vice president to accuse the new news magazine. [26].\n\nOther more unknown infringement, such as economic infringement, which constitutes the basis of the labor law in some countries, so that the trade union is responsible for the strike (27] [28].\n\nThe property law regulates all things called \"their\". Real estate refers to ownership of land and grounds [29]. Moving property refers to things other than real estate; movable items such as computers and sandwiches, or invisible rights such as stocks. \"Realism\" is the right to have a particular matter. If one person got his computer, and another person gave it and sold it to the third party, the holder has this right to get this computer by the third party. \"\" Human Rights \"is the author of something that is owned by a particular person. If one person got his computer and sold to the third party, the human rights allowed this person to ask the price to claim the computer price compensation (instead of the real computer, when it may have belonging to others). The concept of property rights in the traditional continental law is made by Friedrich Carl von Savi, which is good to the world. The obligations such as property rights and contracts or infringement are different, and it is a good right to people and people [30]. For the British and American legal system, the concept of property rights is more than an obligation; the owner of this property is the best statement of other competitors. The concept of property rights has produced many important philosophical and political issues. Many people know that John Locke Talking about our \"life, freedom and identity\" are our property, because we have our own body and combine labor and the environment [32]. The concept of private property is still controversial. The French philosopher Pierre Joseph Procant has written a very famous word, \"property is theft!\" [33]\n\nLand law constitutes the basis of most types of property law, and is the most complex. It contains mortgage, real estate leasing, license, cover contract, decretal rights, and land registration decrees. The norms of moving property fall in laws such as intellectual property, company law, trust law and commercial law.\n\nHefei method is a set of rules that are independently developed in the \"General Law\" in the UK. The common law is performed by ordinary judges, while the judge as a guardian of the king, can deny the method of regulating the normal law judgment, if he thinks it is just [34]. This means that the balance is compared to strict rules, and it is more in principle. For example, whether it is a British and American legal or mainland legal system to separate ownership and a part of the management right of it, it is allowed to be separated by a convention called \"trust\". \"Trustee\" manages the property, the \"beneficiary\" of the trust property is \"beneficiary\". The trustee is responsible for the beneficiary of the beneficiary, and [35]. In the early case - \"Kiqi v. Sang Dufu case\" [36], a child inherited the rental of a market in London Roofu Town. Mr. Sandford is supported before the child adult. But before this, the lease expired. The landlord (very clearly) told Mr. Sandfu that he didn't want to rent to this child again. But the landlord is happy (obviously) transfer to Mr. Sandford. Mr. Sandford has accepted. When the child (not Kiqi Mr.) grew up, he asked Mr. Sandford to the interests of his market in the market. Mr. Sandford is originally trusted, but he put himself under the situation of conflicts of interest. The Dafa officer Lav Las decided to order Mr. Sandford to spit out the interests he got. He wrote,\n\n\"I am very clear, the trustee can renew some trust property that can rented a renewal under the renewal ... This seems to be blamed, and the trustee is the only one who can't rent in all mankind. This matter is concerned; however, this rule will inevitably be strict and uncomfortable. \"[36]\nOf course, the Dafa Judge Lafras here is fear that the trustee will use the property of the property, instead of managing it. In modern times, speculators use trusts to lead to South China Sea bubble events. The absolute obligation of the trustee is written in the company law and is applied between the directors and executives. Another obligation to trustees is to invest in assets or sell it. [37] This is especially true for the annuity fund (the most important type of trust), the investor here is the beneficiary of people's savings, and they have been retired. But there is also a trust-based trust, more famous examples with British Museum and the Rockefeller Foundation.\n\nIn addition to the core topics, the law is more widely distributed in various fields that can be seen in life. Here is three categories, but in fact, each subject is related to each other and overlap.\n\nTypically, the legal system can be divided into two European law and the United Kingdom law. There is also a third legal system (still existing in some countries or the entire area) - Religion Law is a basic law that is based on boutonies and its interpretation. The system used by a country is usually related to its history, its association between the foreign countries, and its attachment to international standards. The principal source of the judicial system should follow the clear characteristics of its legal system. Therefore, the difference in different systems is different from the model, and not the content, and each judicial system can usually find similar flats.\n\nThe Continental Law is the legal system used in most countries today. In the Continental Department, the source of the law mainly must be the \"texture method\" developed by the legislature via certain legislative procedures, followed by the habitual \"customary law\". [39] The history of the texture can be traced back to thousands of years ago, one of the examples of the Hanmu Code of Cuban Babi, but most of the European legal system is carried out by the law practice of the Roman Empire, and the provisions are in Century Europe was once again discovered, and the legal system of today's Continental Law is developed (mainly civil law). The Roman law at the Roman Republic and the Roman Empire pays attention to the procedures, and there is no special judge [40], but is a general person to decide. The judgment will not be publicized, so any cases occurring the judgment law and hardly recognized. [41] Each case is a referee, which reflects in today's continental legal system, and the judgment does not produce certain constraints. The worship of the Xiyuan 6th century, Chandaten's Emperor became a law and merged the law that was previously present in Rome, and turned its length to more than 1. One of the previous provisions. [42] This is called \"Civil Law Daquan\". A legal historian wrote: \"Chastate is consciously looked at the golden period of the Roman law, and attempted to reply to the peak before it was the three century.\" [43] At the same time, Western Europe is gradually slipping into the dark age And before the 11th century, the University of Bologna revisited these provisions and used them to explain the laws they used themselves. [44] Liji, the continental formation of the Roman law continued to expand to the entire European, until the Enlightenment; then, in the 19th century, the French Civil Code and the German Civil Code have entered the modernization of their respective legal provisions. These two codes not only influenced European countries (such as Greece), but also affect the legal theory of East Asia, South Korea and the Republic of China. [45] Today's countries that use the continental law from Russia and China to most of China and Latin America. [46]\n\nThe most special difference between the British and American legal system and other legal systems is the judgment method, which follows the precedent principle (STARE DECISIS). In addition to \"judges\", the British and American legal system will have government agencies through new laws and provisions, but will not be compiled. The British American law is from the UK and is inherited by most countries or regions that have belonged to the British Empire (except Malda, Scotland, United States Louisi Xi'an and Canada Quebec Province). The British and American legislane originated in the Middle Ages, the UK at the time consumed a lot of money due to the French war. Ying John was forced to sign a treaty that restricted its legislative permissions by aristocrats. The 1215th charter also requested the judges of the king to judges only in the \"specific place\", and cannot exercise their own judgments in uncertain places. [47] Under this system, the judge plays an important role in the process of law. Moreover, relative to other countries in Europe, the UK's justice system becomes highly concentrated. For example, in the year of 1297, France's Supreme Court made 51 judgments, while the UK's appeal court had only 5. [48] ​​This powerful and close judicial system has produced a harsh and no elasticity system. [49] Therefore, over time, more and more people ask the king to overthrow the ordinary law, and the representative of the king - the judgment of the judgment of the case. Since Timas Moore is appointed as the first Dafa official, a weapon-based system has grown around the rigid ordinary fading and develops its own Balance court. At first, Balance method was often criticized to say that there was no law, \"\" changed the feet of the Judge \". But over time evolved, it gradually developed a strong debut criterion, especially in Lord John Stevete Elden. [50] When the 19th generation, the two systems began to combine with each other. In the development of the United Kingdom and American legal system and weighing law, scholars always play a very important role. William Blackns starts to describe and teach these two systems around 1760, and he is the first scholar in this field. [51] However, in addition to the description, scholars are also looking for interpretation and infrastructure, slowly change the way the law actually operates. [52]\n\nThe religion method refers to the concept of \"God's Words\", such as Jewish Haraka and Islamic Sharia Regulations, both refers to \"Obey\". The Christian Church Code also exists in some of some church communities. The religious meaning in the law is not easy, because God's discourse cannot be revised or developed by a judge or government. However, religion must never provide a comprehensive and detailed legal system. For example, although there are some flaps in the Qur'an, it is only the root cause of the most further legal. [53] This is mainly included in the law of teaching law. Another example is Moses Five Classics, the first five classics in the Old Testament. These include the basic provisions of the Jewish law and is selected by some Israeli society. Haraka is a Jewish French Code that summarizes some Tamade annotations. However, Israeli law allows the subject matter to use the religion law only under their choice. The Church Code is only used in the Roman Catholic Church, Oriental Orthodoxism and Universal Personnel of the Universal Shengshi.\n\nUntil the 18th century, some elements of Sharia regulations can still be discovered in the legal system in Islamic countries, such as the Mayala Code of Ottoman Empire. However, in the mid-1940s, the laws of countries have begun to bring many modern concepts. Now, Sharia regulations are just a large number of national civil law and customary law, although the entire legal system of Sandy Arabia and Iran is based on Sharia Regulations. From the 1970s, Islamic Renaissance, which is very important to reply to Sharia regulations, which has produced a lot of literature and affects the entire world politics. [54]\n\nAlthough the above legal tradition has produced several identical features in judicial power, each sovereign entity can also have its unique view.\n\nThere is a very close connection between the history of the law and the development of civilization. Ancient Egypt's law - can be traced to the Western Yuan 3000, there is a Civil Code of Civil Code that can be divided into twelve articles. This civil code is based on Mart's concept, tradition, rhetoric syntax, and social equity [55]. At about 1760 days before Xiyuan, under the rule of Hammurabi, Babon Law appeared, and the stone tablets written on the code were placed in the market; this one is called the Hammarabi Code . But with Egyptians, the historians are speaking from the status of the litigation. The Hampbi Code also has only a little dear residue, and most of them have passed over time. These early laws have a small influence on the human civilization. [56]\n\nThe Old Testament is probably the oldest legal system that is still related to today's legal system, which can be traced back to 1280 BC. It takes a mode of moral responsibility as a suggestion for good society. The ancient Athens (ancient Greece's small city) is the first society composed of the majority of citizens outside the woman and slaves, and time is approximately 8th century BC. Athens at the time did not have legal science, and the ancient Greece did not have the word \"law\" to make an abstract concept referred to [57]. But the ancient Greek law contains innovation in the political system of Athens Democracy [58].\n\nRoman law is largely affected by Greek [59]. It has formed a bridge between the contemporary legal world, in the era between the Roman Empire [Note 8]. The Roman law conducted the main texture process in Chaser Dieni, compiled \"Civil Law Daquan\". This code lost in the dark age until the 11th century was resembled. The medieval legal scholar begins to study the Roman regulations and use the concepts. In the Middle Ages, the judgment of the King of King began to develop into a precedent system, which became the British and American law. At the same time, in Europe, the \"Business Law\" formed, making merchants can trade with similar norms, rather than zero-fragmented. As a \"businessman law\" as a contemporary business method, the \"Merchant Law\" emphasizes the freedom and property of the contract [60]. When the 18th, 19th centuries, the \"Business Law\" has been incorporated into the national new civil law. The French French Civil Code and Germany's German Code are the most influential civil-Chemistry. Compared to the general law in the UK full of a large number of jurisprudence, it is easier to output in small books and is used for judges. However, the current continental legal system and the United Kingdom and American legal system have the same trend. The EU Law is as its composition of the Code, but has developed its judgment by the European Court.\n\nAncient India and ancient China have different legal traditions, and there are also different legalists and practices in history. \"Policy\" (approximately 100 years of AD, although there are some earlier materials) and \"Mono Code\" (AD 100-300) is the basic treaty of India, and it is considered to be trusted legal guidance [ 61]. The central philosophy of Monacino is tolerant and diverse, and is circulated throughout South Asia [62]. The Hindu Tradition and Islamic Law have been taken from the General Act when India has become a part of the British Empire [63]. Malaysia, Wen Rui, Singapore and Hong Kong have also accepted the general law. The legal tradition of East Asia reflects a unique mixed blood in the secular and religious impact [64]. Japan is the first country that started its legal system in Western world modernization, introducing a little French and a large number of German Code [65]. This also reflects the strength of the German Civil Code gradually rise at the end of the 19th century. Similarly, traditional Chinese law has also begun to westernization in the late Qing Dynasty. In the development of the Civil Code, refer to the Japanese Civil Code, introducing the German Civil Code, and has formulated the Chinese contemporary Civil Code [66]. The Code is still suitable for Today's Taiwan. However, after the establishment of the People's Republic of China, the six laws and books established during the Republic of China have abolished the Six-laws in the Republic of China. The legal structure of the People's Republic of China is largely affected by the Sovietary socialist law. It is mainly due to sacrifice private law and expands administration. Field of the law [67]. However, with the acceleration of industrialization, China's legal architecture has begun to change, at least in economic (if it is not in social and political words). The new contract law in 1999 shows its steering from administrative priority [68]. What's more, I have joined the World Trade Organization in 2001 after 15 years of negotiation. China has joined the World Trade Organization [69]. With the formulation of laws such as contract law, property rights law, the development of the People's Republic of China will be terminated by the day.\n\nThe philosophy of law is also known as law. In college, the philosophy is \"legal philosophy\", and the school is the name of \"law\". It is actually political philosophy and asks what the law should be? \" On the other hand, the analysis law is another different field of \"What is the law?\". John Austin is a famous philosopher in the early stage. He is a student of Jerryi Baby, and has begun to serve in the new London University in 1829. Austin has a utilitarian answer, saying that \"the fear of punishment is based on the command of the people who have the people who have habit of suits.\" [71] This view is deeply accepted, especially as a natural law theory. Selection. Natural jurists such as letting Jacob Rousseau believe that the human method is truly reactive with morality and non-variable natural law. For example, Imanuel Kant believes that a moral specification requires law \"As if they should also be established in the universal natural law\". \" [72] Austin and Bang Yan recruited David Hume, think this is confused, what should be. They believe that the law is an empirical, the actual law is complete and \"moral\" separation. [73] Friedrich Nietzsche also criticized Kant, and he believed that the law was generated by the power will not be classified into \"morality\" or \"unethical\". [74] Therefore, Nietzsche criticized the principle of equality, he believed that the law should be delivered to freedom, so that power will succeed. [75]\n\nIn 1934, the Austrian philosopher Hans Kelns continued to maintain an empirical tradition in his work \"Pure Journal\" [76]. Kelsen believes although law and morality are separated, it is given \"normative\", and we should follow it. Each legal system can assume that there is a basic specification tells us that we should obey the law. Carl Schmit is a major and smart opponent in Kelsen, his opposition concept, because he does not agree that the abstract normative principle can exceed the specific political position and decision. [77] Therefore, Schmit's law promotes an exception (emergency state), denying the statutory specifications can contain all political experience. [78]\n\nAt the end of the 20th century, H · L · A Hart slammed the simplification of Osding and Kyle's fiction in the \"Legal Concept\". [79] When Oxford University is a law, Hart advocates the law to be a \"rule system\". Hart believes that the rules can be divided into primary rules (behavioral rules) and secondary rules (to manage primary rules to be added to official rules). The secondary rules can be divided into referee rules (in order to solve legal disputes), change the rules (allowing legal changes) and recognition rules (confirming that the primary rules have legal identity and impart legality). Since then, the two students of Hart continue to argue. Ronald Derkin is the successor of Hart in the faculty of cattle, is also his largest criticism. In the \"Legal Imperial\" books in Daujin, he criticized Hart and empirists refused to regard legal as an attitude of moral issues. Devolk claims that the law is a \"interpretative concept\" [80], which requires the judge to find the most appropriate and fair answer from a legal dispute, from their constitutional tradition. On the other hand, Joseph Ratz maintains the idea of ​​psychthism, even in the \"legal authority\", \"Flexible Method\" claims. [81] Raz advocated that the law was an authority, purely via social recognition, without having to have moral reasons. As an authority for dispute mediation, any of its classification is best to stay in sociology, not in law. [82]\n\nLegal economic analysis is a direction in studying legislation, which introduces and applies economic methods and concepts. The rise in this area is due to the criticism of the union and the US anti-Tsi Law. Among them, the most famous advocates such as the Richard A. Bosna and Oliver Williamson, as well as the Chicago economics in economics and law, such as Milton Funiman and Garry Baker, they usually relax. Supporting and privatization support, and think that the freedom market should not be added. [84]\n\nAmong them, the most famous legal economic analystists are the winners of the Nobel Economics Award in 1991. In the \"Enterprise Nature\", he advocates the reason for the existence of the company because there is a transaction cost. [85] The economy is in the open market, with a peer-to-peer contract, until the transaction cost is high to use the organization to produce something, it is relatively inexpensive. In his second book \"Social Cost Issues\", he advocates that if we live in a world without transaction costs, people will trade with another person who produce the same resources, regardless of how the court specifies the legal rights. [86] Gauss raised an example of \"Sitgis v. Leican case\", the noisy dessert businessman and a quiet doctor two are neighbors, and to the court to see who must retreat. [87] Gauss said that no matter whether the judge is to determine the dessert businessman, you must stop using his machine, or do you want to endure noise. They can reach an agreement with the same revenue as the past, except for the existence of transaction costs. Thing. [88] So the law should be expected to be \"can\" happen, and guide the most economical answer. The concept is that laws and regulations help people go, and is not as important as lawyers and policy plankers believe. [89] Gauss others want to have a different direction, to demonstrate the cost of analytical behavior before interfering to the market. [90]\n\nLegal Sociology is a branch discipline interacting between laws and society. Legal sociology and law, legal economic analysis and more specialized disciplines such as criminals have some connection. [91] Legal system and legal topics and system social construction are two interrelated research areas. At first, juristers questioned this discipline. Kelsen slammed a founder O'Epee Eliich. Elii hopes to emphasize the lawyers to learn and apply the formulation and other \"laws\" or social norms of the daily life, the latter makes large parties will not arrive at lawyers and courts. [92] Around 1900, Max Weber defined his \"scientific\" approach to his legal, \"legally rational form\" as a dominant, not in people, but abstract specification. [93] Rational legal authority is Weber to refer to a set of coordinated and trustworthy laws. This law is a prerequisite for modern political development and modern bureaucratic countries and is developed in parallel with capitalism. [91] Another sociologist Amil Tuli wrote the book \"Social Division\", and the book mentioned that when the society became more and more, the people in the civil law related to the original and compensation Will be greater under the cost of criminal law and penalty. [94] Other early well-known legal sociologists also have Hugo, Jindu Hai Mu, Todor Gaigal, George Gulvic, Leon Peter Raseki and William Glaham · Samner et al. [95]\n\nIn the development of countries, the main legal system has an independent court, the representation of the Parliament, the responsibility cabinet, the army and the police, bureaucracy, legal professional and civil society itself. John Locke in his \"Government Theory\", and the subsequent Mendes Doves advocated all political influence in the system in its \"spirit\" of its \"The spirit of the discipline\". [96] Their principles should not have anyone to master all the powers of the country, and the dictatorship in Thomas Hobbes \"Levitan\". [97] More modern, Max Weber et al. To reshape models related to countries under administrative control. Modern military, political and bureaucrats have shown many special problems in the daily life of the general people, which are unforeseen, such as Rock and Mendes. Legal professional practices and examples are an important part of the people to expose fairness and just; and civil society is a social organization, community and partners, to refer to the formation of laws.\n\nJudicial is usually composed of several judges, responsible for solving disputes and determines its last results. Most of the judicial systems contain an appeal court that is unssential from the second level, as well as the final assessment court to explain the final review and unified decree. United States's Federal Supreme Court [98], Australia High Court, British House [99], Germany's Federal Constitutional Court [100], France's Abandoned Court [101], the Supreme Court of the Republic of China [102] and China The Supreme People's Court of the People's Republic of China [103] is all the final review courts in the country. In addition, most of the European countries have a European Court on the Court of Final Appeal, when the country's judgment or law violates EU law, you can appeal to the European Court of Luxembourg. In addition, the European Rights Court allows people of all European Commission to prosecute to the court on the topic of human rights. [104]\n\nSome countries may even allow their judicial organs to conduct a violation of the laws established by their legislagans. In the case of Luo Wei De case, the US Federal Supreme Court announced that the laws of Texas prohibited pregnant women from abortion. [105] After the Justice of the Republic of China, the Justice of the Republic of China was also a famous three-nine shooting incident, and after the discipline of the three-nine shooting incidents, the Truth Survey of the Three-North Shooting Events in the Legislative Council conducted a discontinuation, some of the provisions of the Interpretation No. 585 Violation, and the provisions of all violations have lost their effectiveness after the explanation.\n\nLike the legislature, the judiciary is theoretically restricted by the Constitution. In most countries, judges can only explain the Constitution and law. However, in the ordinary French family, in the law, the law is not specified in the law, it can create law through the precedent principle (STARE DECISIS). In Britain, Finland and New Zealand, there is a so-called \"parliamentary lovereignty\", so the judges selected by the election have no right to overthrow the law through the Democratic Parliament. [106] In the Communist Country, as the People's Republic of China, the courts often believe that it is not completely objective and neutral, or more or less flexion in administrative or legislature, the government's decision-making often affects the court's judgment. [107] In Islamic countries, courts often see if the law violates Islamic law. In Egypt, the Supreme Constitutional Court of Egypt will make these violations of the legal law. [108]\n\nThe well-known example of the legislative departments has a London's Xitmin Palace, Washington, US Congress, Berlin's German Federal House, Moscow, Russia National Parliament, and Paris. According to the legal rules of the appreciation, the people choose a politician that can achieve \"they\" wishes. Many countries are made of two hospitals, ie they have two independent legislative departments, but they also have a formulation of countries such as Israel, Greece, Denmark and the Republic of China. The politician \"The House\" is selected to represent a smaller constituency; and \"Houses\" is usually selected in the federal countries (such as Australia, Germany and the United States, etc.), or in a single country (eg France) as another vote. In the UK, the House of House is assigned by the government. A criticism for the two hospitals may only be simply mapped to the other party; and the traditional defense of its traditional hospital can reduce the discussion and unfairness of government administration. [109]\n\nTo pass legislation, a certain number of Congress members must exercise voting rights in each hospital. Typically, a bill will be read and revised by different political groups. If a country has a hard constitution, the revision of the Constitution will need to have a certain proportion of Membership to adopt, so that the constitution has become difficult. The government usually leads this process of congress members (such as British and Germany, etc.). However, in the presidential country, the executive head will appoint his own cabinet to lead its political partners, whether they are elected (such as the United States or Brazil), and the role of the legislation department will be reduced to only approval or veto. that power.\n\nThe \"Administrative Department\" in the legal system refers to the core of political power. In most democratic countries such as the United Kingdom, Germany, India and Japan, the administrative department is selected by the legislative departments, and is generally called the cabinet; and the state state is usually lacking general political power, but can only symbolically The issuance decree. This kind of headage is sometimes assigned (German Federal President), sometimes hereditary (British monarch), sometimes voted by the public (President Austria). Another important form of administration can be found in countries such as France, the United States and Russia. Because administrative agencies are assigned with unlimited power, the most inter-independent rule can be legally corrected [110], so in the presidential system, the administrative department and the legislation department are separated, and there is no obligation to the legislature [111] .\n\nThe role of the administrative department is different due to different countries. Typically, it will contribute to the main legislative draft and take charge of the country's diplomatic relations. The army and police force usually under the control of the administrative department, bureaucrats are also. The Minister of the Government conducted a general public service such as the Department of Health, and the Department of Legal.\n\nThe army and police force sometimes be described as \"strong and powerful backing\". [112] Unlike the history of military organizations and the national history of the country, the history of the standing police institutions is relatively short. Medieval Britain uses a system called a tour, using public plenary and open offices to make fear deep into people's hearts and keep people under control. The first modern police is probably in Paris in the 17th century, in Louis XIV in the position [113], but the Paris local police claimed that they were the first uniform police in the world. [114] After 1829, the French revolution and Napoleon's dictatorship have produced the first uniform police in Paris and other French cities, and French is called Sergents de Ville. In the UK, in 1829, under the leadership of the Minister of the Interior, the Parliament passed the London Police Affairs, established a London Police Department.\n\nSocios Weber claims that the country is the only existence that is allowed to use violence. [115] The army and police exercise force according to the requirements of the government or the court. The word decline country is used to refer to a country's army and police force no longer maintain domestic security and order, and the whole society caught in anarchy.\n\nAs with the army and police, the administrative department also rely on political officials and systems under the legal system to implement their philosophy. One of the earliest refers to this concept is the German writer of the Germans in France. In 1765, he wrote:\n\n\"The true spirit of French law lies in the bureaucratic system of Gur to Major, the deployment, staff, secretarial, patrol officer and\" supervisor \"are not assigned to increase public interest, but in fact public interest seems to be Established, so these deployments must exist. \"[116]\nThe criticism of \"bureaucrat\" is still very common, and the work of civil servants is basically relative to private companies that act for profits. [117] But in fact, private companies (especially larger companies) will have some bureaucratic systems. [118] A negative view of \"Bishopenia\" in the bureaucratic system, public services such as education, health, police, and mass transportation, etc. are important countries that have been achieved by the government via bureaucracy. [118] Written in the early 20th century, Max Weber believes that a decisive feature of developing countries is bureaucrats in their internal. [119] Weber wrote that the basic characteristics of today's officials are: officials have developed objectives, and the scope of work is composed of regulatory regulations, and the department consists of specialists and management, via communication, and civil servants according to law. [120]\n\nLaw firms provide their customers about their legal rights and obligations, and represent them in court. The European Human Rights Court has stated that the law should be Everyone is easy to accept, and people should be able to foresee how the law affects them. [121] In order to maintain the law, legal practice is generally supervised by government or independent management organizations such as the Law Firm, Lawyers' Council or Law. Want to be a lawyer to practice after the management organization is certified. It is usually necessary to read the legal system or law school for four years, and will pass the certification after obtaining the legal degree. In some countries, we also need to learn through a lawyer and obtain a lawyer certificate.\n\nOnce become a lawyer, lawyers usually join or have their own legal offices, or as a legal consultation in the government or private institution. In addition, lawyers may also become legal researchers, providing customers' needs of customer needs through business services or freedom. Many legally trained people will use the skills they have learned outside of the legal field. In the tradition of the British and American legal system, legal research is important for law practices, which can be used to determine the current state of the law. This is usually obtained by research on legal reports, law journals and legal provisions. The practice of law also includes documents such as a complaint, litigation, contract, will or trust or trust. Techniques for consultation and mediation are also important for legal practice.\n\nThe word \"civil society\" can be traced back to John Locke, he refers to the civil society is a group of people, and has \"jointly developed laws, as well as the judiciary of disputes between them,\" [122 The German philosopher Hegel is also distinguishing between \"National\" and \"Civil Society\" in \"The Principles\" of French. [123] Hegel believes that civil society and the country are the existence of the poles, in his structure of historical dialectics. [124] Civil society needs to be the source of the law, from people to what they believe in the basis of the opinions and lobbying. Australian lawyers and writers Jeffli Robertson wrote to the national law:\n\n\"One of its currently major sources is to see the response after violation of human rights in the TV in the living room, as well as many of them therefore found in non-governmental organizations.\" [125]\nFreedom of speech, freedom of association and allowing people to meet, discuss, criticize and allow the government to be responsible for people, under the basis of consideration of democracy. The more people are included, paying attention to and can change political power to work in their lives, the more people satisfy people and have legality. Mature political parties and trade unions, as well as just media, industrial and charity, are part of the civil society. "}