{"chinese_title": "astronomy ", "chinese": "Astronomy (English: AstronomY) is a natural science. It uses methods such as mathematics, physics and chemistry to explain the celestial body between the universe, including planets, satellites, comets, stars, galaxies, etc., and various phenomena, such as supernock explosions, gamma Radial, universe microwave background radiation, etc. In general, any phenomenon from the earth atmospheric layer is a research range of astronomy.\n\nPhysical cosmology is closely related to astronomy, but it depends on the universe as an overall study. [1]\n\nAstronomy has an ancient history. Self-text records, Babylon, Ancient Greece, Indian astronomy, ancient Egyptian astronomy, Nubia, Iran, China, Mayan, and many ancient American civilizations have a detailed observation record on night sky.\n\nAstronomy has also involved in the history of celestial measurement, astronomical navigation, observing astronomy and calendar, today, is generally synonymous with the geometric physics. [2]\n\nIn the 20th century, astronomy gradually divided into two branches of observations astronomy and theoretical astronomy. Observing astronomy is mainly analyzed by the observation data of the celestial body, and then analyzes the basic physical principles; theoretical astronomy is developed to analyze the computer model and analysis model for analytical day. The two complement each other, theory can explain the observation results, and observations can be confirmed.\n\nUnlike many modern science categories, astronomy still has a more active amateur community. Amateur astronomers have an important role in the development of astronomy, especially in discovering and observing a short astronomical astronomy of comets.\n\nThe term \"astronomy\" in Chinese appeared in \"Yi Chuan\". \"Yijing · 卦 · 彖彖\": \"Just soft, astronomy; civilization, humanities, observation, time change; watching humanities, 化 成 天下.\" \"\" \" The phenomenon or the shape, \"astronomy\" refers to nature. [3] [4]\n\nEarly day literature can only predict the beef eye visible. Some ancient cultural buildings may have a huge building that may have an astronomical observations, in addition to the ceremony, it can also be used to judge the date of the season, farming and the length of the year. [5]\n\nPrior to the inventions of telescopes, people can only use the naked eye to observe the night sky. In Meso Namia, ancient Greece, Persia, India, China, Ancient Egypt and Central America, people began to build an observatory and think of the essence of the universe. Early day literature is mainly based on record stars and planets in the heavens, today this category is called celestial measurement. On the basis of these observations, the philosophical idea of ​​the movement of the planet is started, the status of the sun and the moon in the universe. Many cultures regard the earth as the center of the universe, and the sun and the moon are rotated around the ground. [6]\n\nBabylon is the earliest cultural and scientific methods of researching the cultures of the sky, which focuses on the astronomical research of other cultures in the future. [7] For example, Babylon discovered that the monsters will occur periodically, and they call it sassa. [8]\n\nThe Babylonian research sky is then ancient Greek culture. Ancient Greek astronomy is characterized by rationality, reality-based approaches to explain astronomy. [9] The first century BC, Alisaks estimated to estimate the size and distance of the sun and the moon, published \"The Size of Sun Month\" (Ancient Greek: πεὶὶ μἀἀστῶῶῶ ωωὶὶἀἀστημὶὶωωωἡἡλίο ὶ σελήηη))) One, and the first time Propose the sun of the sun. [10] In the first 2nd century BC, Xipchas found the difference in the year, and estimated the size and distance of the moon, invented the world's earliest astronomical instrument - stars, [11] also compiled 1020 stars Detail of a star table. [12] Antique Tella Mechanical (about 150 to 80 years) is an analog computer that can calculate the exact position of Sun Moon Planet on a certain day. Such a complex astronomical instrument, waiting until the 14th century European invented the mechanical astronomical clock, it appeared again. [13]\n\nDuring the medieval period (until the 13th century), European astronomy was stagnant. At the same time, astronomical astronomical in Islamic world and other cultures flourish (see Islamic Astronomy in Activities). At the beginning of the 9th century, the earliest observatory in Islamic world. [14] [16] In 1994, Persian Tianxians' A Zuo Fei found the largest cluster of the star in this star group and recorded in the \"Book of Stars\". [17] The supernova Sn 1006, 1006 years, is a history of the highest celestial event, such as the high-asterity of the Star, Egypt, Arabian, Ali Ibre, Rid, English: Ali IBN Ridwan, and Chinese astronomers have recorded. There is also a big contribution to astronomy in the Islamic world: Batani, Thabit (English: THābit Ibn Qurra), Abu Mashar, Buni, Al - Sauerry (English: Abū ishāq ibrāhīm Al- Zarqālī, Al-Birjandi, and Malaga Observatory (English: Maragheh Observatory) and the Rusbeck Observatory (English: UluGH BEG), and more. The Islamic astronomers are naming stars during this period, there are still many universal in Western. [18] [19] Archaeologists believe that the building remains found in the Dajin Babwe and Tingbucku [20] are likely to be an observatory. [twenty one]\n\nDuring the Renaissance, Nikola, Nikola, proposed the sun. Galileo Galilele and Johannes Cape will further improve the daily heart on the basis of Copernico. Galileo saw the heavenly body by the telescope, found that the moon surface was covered with irregular mountains, not a smooth. In 1610, Galileo found four satellites of Jupiter, which is a major blow to the ground. [twenty two]\n\nJohannes Cape is the earliest discontinuation of scientific laws that correctly explain the day heart, but he can't explain the scientific principle behind these laws. [23] After that, Izak Newton made the law of physical strength and extravaratory law, and founded the operation of the planet. The reflected telescope is also invented by Newton. [twenty two]\n\nBritish astronomers John Flemstad compilation compilation compilation of more than 3,000 stars. [24] With the increase in the size and quality of the telescope, astronomers have discovered more utensils and astronomical phenomena. French astronomers Nikla Loui Lakay's star table contains nearly 10,000 Nantian stars. William Herch compiled the nebula, the star group star Table, and found the seventh planet Tianwangxing in 1781. This is the first new planet that has been discovered since ancient times. [25] In 1838, Friedrich William Besell used the principle of parallax to measure Tianjin's distance, which was the distance between the first successful measurement. [26]\n\nIn the 18th to 19th centuries, Li Anner Ou La, Alexys Claude Claude, let Sherang Daren Bell study the three-body problems, making more accurate predictions on the operation of moon and planets. Joseph Lagranda and Piehr - Simon Lapus On this basis, the quality of their quality is calculated from the orbital disturbance of satellite and planets. [27]\n\nAfter new technologies such as spectrometers and astronomical photography, astronomy has a fast development. From 1814 to 15 years, Joseph Fake and the spectra of the sun were observed by about 600 spectries. Gustav Kirhof explained in 1859 that these lines were produced by different chemical elements. People find that the star is actually similar to the sun, but there is only different temperatures, quality and size. [18]\n\nIn the 20th century, scientists realized that the Galaxy in the Earth is a separate galaxy, and there are other galaxies in the Galaxy. These galasses are far from the Galaxy, and scientists find that the universe is expanding. [28] The singularity of the singular star is discovered, such as a gear, pulse star, a flaw and electric wavestorming. Theoretical astronomers provide black holes, neutrons and other celestial bodies to explain these observations. Physical cosmology is also booming in the 20th century, and the big explosive theory has been fully supported by universe microwave background radiation, Hubble Law and the abundance of cosmic chemical element. The launch of space telescope means that scientists can observe the universe by a portion that is generally covered by the atmosphere. In 2016, the Lei Dienity Gravity Wave Observatory announced the first time to directly detect gravitational waves from the black hole collision, launched an era of gravity wave as an astronomical observation.\n\nLight, or even electromagnetic radiation is the main observation pathway of humanity to the sky. [29] Observation Astronomical in different fields can be divided according to the region of electromagnetic spectrum, and some wavelengths can be observed from the surface of the Earth, and some of them must be effectively observed outside the high altitude or even in the Earth atmosphere.\n\nThe radio astronomy is observed using electromagnetic radiation having a wavelength of about 1 mm. [30] and other types of observation astronomy areas are different, and radio waves observed by radio astronomy can be considered wave, rather than individual photons, so relatively short wavelength radiation is more easily determined to determine the velocity and phase. [30]\n\nAlthough the thermal radiation of the celestial self also emits radio waves, most of the radio waves are synchronous radiation, that is, the radiation that is emitted when moving in the magnetic field. Further, some lines generated by the interstellar gases are also within the wavelength range of radio waves, especially hydrogen 21cm lines. [31] [30]\n\nThe celestial bodies that can observe through radio waves include superflow stars, intersecting stars, and active galaxies. [31] [30]\n\nInfrared astronomy conducts an astronomical observation through infrared radiation, such radiation has a longer wavelength than red light, located outside the observation range of human naked eye. Infrared astronomy can be the most effective observation temperature, and it is impossible to issue a visible light, such as the planet, the star surrounding plate, and the light-shaped nebula. The wavelength of infrared radiation is more visible, so it can penetrate the dust cloud that can penetrate the visible light, which helps to study the young stars and galaxies in the depth of the molecular cloud. For example, the WAN-Dome Infrared Tour Detection Satellite (Wise) has successfully observed the original star in multiple galays and the stars in the stars. [33] [34] In addition to the infrared light of visible light, most of the infrared radiation will be absorbed by the earth atmospheric layer; the atmosphere itself also produces strong infrared radiation, further affecting observations. Therefore, the infrared observatory must be built in a low sea level, low humidity, even as a satellite to space. [35] Certain molecules have strong lines in the infrared radiation range, which helps to study the chemical composition of the celestial body, such as the water contained in the comet. [36]\n\nSelf arrive, human beings are visible to visible light astronomical observations with meat eyes. The earliest observations are recorded in drawing. At the end of the 19th century, people began photography of the sky. Modern astronomical photography techniques generally use digital detectors, particularly photosensitive coupling elements (CCDs). Although the wavelength range of visible light is about 4000 å to 7000 å (i.e., 400 nm to 700 nm), [37] However, the visible light photographic apparatus can also be used to observe a portion of the near-UV and near-infrared rays.\n\nUV astronomy is observed using ultraviolet radiation between 100 to 3200 å (10 to 320 nm). Such radiation will be absorbed by the earth atmospheric layer, so observations can only be carried out in the atmosphere or space. Ultraviolet Astronomy is best suited for the study of high-temperature blue stars (OB) that launches ultraviolet rays, including blue stars other than the Galaxy system, as well as planetary nebula, super new star sites, etc. However, ultraviolet rays will be absorbed by Starcraft, so the data taken must be calibrated by other methods. [30]\n\nX-ray astronomy observes the beam in X-ray. The X-rays in the universe come from synchronous radiation (radiation emitted by electrons around the magnetic field line), the temperature of the thermal radiation emitted by the temperature above 1 million Kelvin (see the radiation) and the temperature above 1 million Kelvin Heat radiation emitted by dense gas (see black body radiation). The celestial body of the X-ray is: X-ray joint, pulse star, supernova remains, elliptical stars, galaxies and active galaxy. Since the X-ray is absorbed by the Earth atmosphere, X-ray observations must be carried out with high altitude balloons (English: high-altitude balloon, rockets or X-ray astronomical satellites. [30]\n\nGamma ray astronomy observed is the shortest radiation in the electromagnetic spectrum. Gamma rays can be observed by a satellite or atmospheric Chekenkov telescope such as the Comptton Gamma rays (English: Iact). [30] The Chekenkov telescope does not directly detect gamma rays, but the visible light generated when the atmospheric absorption gamma rays are observed. [38]\n\nGamma ray violent is suddenly emitting gamma rays, and duration is not equal from several milliseconds to several thousand seconds, and most gamma ray sources belong to this class. Only one formed gamma ray source is a persistent source, including pulse stars, neutron stars and active galaxies, etc. may be black holes. [30]\n\nIn addition to electromagnetic radiation, it is also possible to study the heaven by some other methods.\n\nMedium-beam astronomy utilizes the implantation of microme detectors to measure the flow of microme. Such facilities include Russian gallium experiments (English: Sage (Russian American Gallium Experiment) (Sage) (Sage) (Sage) (Sage) (Sage) (Sage) (SAGEX, Super Garanga Detector, etc. The majority of the large number of neutralizes from the Earth are from the sun, but they have also detected 24 medium inertis from the Sn 1987A supernova. [30] Cosmic rays consist of extremely high energy particles (nucleus), which decay or absorbed during entering the Earth atmosphere, producing a series of derivative particles. Today's Observatory can study the cosmic rays by detecting such particles. [39] The future of neutron detector capabilities will increase, which is expected to detect particles from cosmic rays impact atmosphere. [30]\n\nGravitational Wave Astronomy Research Through Observing Gravity Rod to study the distant massive celestial body, it is an emerging astronomical field. The Lei Dienity Level Availability Wave Observatory is a running gravitational wave detector, which detected the first gravitational wave in history on September 14, 2015, and the signal originates from double black holes. [40] In 2017, LIGO and room interferometers co-explored the first gravitational wave from double neutrons (GW170817). [41]\n\nScientists can study the same celestial body with different methods such as electromagnetic radiation, neutron and gravity waves, and this approach is called multi-message astronomy (English: Multi-Messenger Astronomy). [42] [43]\n\nAstronomy and all the oldest areas in all sciences are measurements for each celestial position. In history, the location of the day, the moon, the planet, the star, and there is an astronomical navigation and formula.\n\nIn the 18th century, astronomers developed a perfect gravitational perturbation theory with a precisely measured planetary location, it can exceed the past and future planetary positions extremely accurately. This discipline is called an astriodynamics. Today, scientists have a large-scale tracking of near-place, and the purpose is to predict when these celestities will slightly skirt and assess the risk of collision with Earth. [44]\n\nThe parallax of stars around the solar system is Yu The starting point of the universe scale. After the distance from the perspective of the parallax, the various properties of the remote star can be speculated by alignment. By measuring the radial speed and self-contrast of the star, astronomers can plot the running trajectory of the gloom in the galaxy, thereby calculating the distribution of the Silver River Dark Substance. [45]\n\nIn 1990, astronomers began to use Doppler spectroscopy to observe the swing of stars around the solar system. This approach can be used to find some larger lines (see the outer planet detection method). [46]\n\nThe research methods of theoretical astronomers include mathematical models and numerical simulations with computers, namely physics. Mathematical models generally reveal the deeper principle behind astronomical phenomena, and numerical simulations can demonstrate the phenomenon in reality. [47] [48]\n\nThe sun is approximately 8 light, or the astronomical unit is the most concerned star, which is the most attention from the earth. The sun is a typical body dwarf, belongs to the G2V class, with aged 4.6 billion years. [49] Although the sun is not a star star, the number of sun particles will fluctuate up and down, and every 11 years is a solar cycle. Solar particles are regions with average temperature in the sun, generally have strong magnetic field activities. [50]\n\nSince the main sequence, the brightness of the sun has increased by 40%, and its brightness has a periodic fluctuation, which has great influence on the climate on the earth. [51] For example, Mondi is likely to lead to a small ice stage during the medieval period. [52]\n\nIn structure, the solar surface that people can see is called light balls, [53] The light ball is a thin color ball, [54] there is a thin transition layer other than the color ball, and the temperature is drastically rising, until The outermost ultra-high temperature sundes. [55] The center of the sun has extremely high temperatures and pressure, enough to produce continuous nuclear fusion. The center is a radiation layer, where the plasma here transmits energy in the form of radiation. In addition to the radiation layer, the gas is transmitted to the outer layer in the form of convection. [56] Scientists believe that the magnetic field activity generated by the rollover movement of the flow-layer gas has led to the formation of sun particles. [57]\n\nThe sun sprayed a large amount of plasma particles from the surface, which is the so-called solar wind. The solar wind will reach the edge of the solar system - the top of the solar layer. The solar wind will interact with the geomagnetic field (magnetic layer) when passing through the Earth, and some will be trapped in the Van Allen radiation strip surrounding the earth. When the solar wind particles enter the large gas layer of the Earth in the magnetic field, a very light is generated. [58]\n\nPlanetary science research objects, in addition to planets in the sun, satellite, short planets, comets, asterities, etc., but also include sun system. The scientists first observe the celestial body in the solar system through the telescope, and then through the spacecraft, there is a good understanding of the formation and evolution of the solar system itself. [59]\n\nFrom the inward, the solar system can be divided into internal planets, asteroids and external planets. The inner planet includes Mercury, Venus, Earth and Mars, all of which are planets; the worships include Jupitar, Saturn, Dynasty Stars and Neptune, all gaseous giant planets. [60] In addition to the eight planets, there is a Cibibo and Alt Clouds that may continue 1 light year.\n\nThe solar planet was born in the original star discharged from 46 billion years ago. After mutual attraction, collision and reconciliation, the original line of appearance gradually accumulates large blocks, and these substances slowly evolved into original planets. Most of the discrete substances of the solar wind \"blow away\", only the planets with a large quality are to retain their atmosphere. During the next subsequent bombing period, the planet continued to be severely collissed by the surplus of the solar system. The historical sites of these collisions have traces in many impact pits on the moon. Some of these original planets also collide with each other. Scientists believe that the moon is likely to be formed in such collisions. [61]\n\nWhen the planet reaches a certain quality, the internal substance is separated according to different densities, which is called planetary differentiation. The result of differentiation is that the center of the planet is a stone or metal core, which can be divided into solid and liquid core, and the outer layer is a mantle and a housing. Some planetary cores can generate magnetic fields to avoid the atmosphere being peeled off from the solarish. [62]\n\nThe reasons for the internal temperature of the planet and satellites include: the residual heat of the planet collision, the decay of radioactive materials (uranium,, aluminum-26, etc.) and the tidal force caused by other celestities. Some of the internal heat of planets and satellites are sufficient to promote geological activities such as volcanic roles, and planets and satellites with atmospheric layers are also subject to surface erosion. If the smaller celestial body is not affected by the tide force, it will cool down faster than the big celestial body. In addition to the impact of the meteorite, the geological activity of the small corners will be based on the temperature reduction. [63]\n\nStudying stars and stars evolution will have an important significance to understand the universe. Scientists' understanding of stars comes from observation, theory, and computer simulation on the internal interior of stars. [64] The star is formed in a high density dust and gas called a dark star cloud. When the stability of the nebula is destroyed, the dust and gas will collapse under its own gravitation to form the original star. When the density and temperature of the original star core reaches a certain degree, the nuclear fusion is activated, and the star is formed. [65]\n\nAlmost all of the chemical elements greater than hydrogen and helium are formed in the center of the star. [64]\n\nThe attribute of the star depends primarily on the quality of the start: the larger the quality, the higher the brightness, the faster the process of hydrogen in its core gathering into helium. Over time, hydrogen is completely converted to, at which time the star will enter the next stage of the evolution process. The star requires a higher temperature to make the helium. The core temperature is high enough to expand the outer layer, while increasing the core density, forming a red superstar. The red superstar will quickly use the fuel, so the life is not long. A larger quality star will gradually fracture with a heavier element, and then pass through a series of evolutionary phases. [66]\n\nThe quality of the star determines its final destination: the star above 8 solar quality will collapse, become a supernova, [67], and the eight solar quality, the stars below the outer layer will spray the outer layer, form the planetary nebula. [68] The wreckage after the supernova explosion is a high density of neutron stars; if the star quality exceeds 3 solar quality, the ultra-new star will be a black hole. [69] The mutual revolution will have a more complex evolutionary process, for example, the white dwarf will continue to absorb the substance from its accompanying star, and ultimately can lead to a supernova explosion. [70] Planetary nebula and supernova contribute to the \"metal elements\" generated in the internal fusion of the star (all elements in astronomy, all elements other than helium) into the interstellar medium. Standing all by both, the planet system, including the solar system, is composed of a variety of elements other than hydrogen and helium. [71]\n\nThe Milky Way, where the solar system is located is a rod, and it is a member of this star group. The Milky Way is composed of gas, dust, stars, etc., these celestial celestial circulation around the center of the silver river and is bound by mutual gravity. The solar system is located on the outer side of a spiral arm of the Milky Way, so the Milky Way has a large part of the dust, and it is not easy to observe.\n\nThe Milky Way is a rod-shaped toner called nuclear ball. Scientists believe that there is a large-quality black hole in the top of the nuclear ball. From the nuclear balls, four main spiral arms are radiated outwards to the outer end, and the stars here are very active, including more first star stars. These structures are basically on the same plane, and there is a flat spherical silver, which mainly contains a larger second star star, containing hundreds of spherical clusters. [72]\n\nThe space between the stars and the stars is full of low-density substances called Star Intercoin. The molecular cloud composed of hydrogen is a region where the star is born, the density is relatively high. High-density star core or dark star clouds (critical point of collapse or not, determined by the Kings length), forming the original star. [65]\n\nAfter the large mass stars appear, the molecular cloud is changed to an ionized hydrogen region formed by a light-emitting gas and plasma. These stars generated stellar winds and supernova explosions eventually evacuate the clouds, often leaving a number of young evacuation stars. These stars slowly dispersed, and the stars integrate into many stars in the Milky Way. [73]\n\nAfter studying the movement of the Milky Way and other galaxies, scientists found that ordinary visible substances were only a small part of the total quality of the galaxies. Most of the galaxy in the dark matter of the galaxy, but the essence of the dark matter is still an unsolved mystery. [74]\n\nResearch branches of celestial ascensities outside the Galaxy system include: the formation and evolution of galaxies, galaxy classification, survey of active galaxy and galaxies and galaxies. Observations for galaxies and galaxies are important to understand the large-scale structure of the universe.\n\nMost of the galaxies can be divided into screw stars, elliptical stars and irregular galaxies depending on the shape. [75]\n\nAs the name suggests, the cross section of the elliptical star is elliptical. The stars in the galaxies are run along the random track, not a special direction. In the elliptical star, the interstellar dust has little or completely, and the area where the star is born, the stars are generally older. The elliptical star is often seen in the center of the galaxies, which is probably the product of the big star collision.\n\nThe spiral galax is flat, rotated in one direction, has a raised spherical or a rod, extending a plurality of spiral arms, radioson. The spiral arm is lit, filled with dust, is the area where the stars birth, of which young quality stars are blue. The periphery of the spiral galaxy is generally halo consisting of old stars. The galaxy and neighboring fairy sears are a spiral galaxy.\n\nThe irregular galaxies are chaos in appearance and cannot be classified as spiral or elliptical galaxy. There are quarter galaxies in the universe belong to this class. The shape of the confusion is likely to be the result of gravitational disturbance.\n\nThe active galaxy will make huge energy, but these energy does not come from its stars, dust or gases, but from its dense core. Scientists believe that the oversized mass black hole in the galaxy center issues a large amount of radiation after the inhalation material, forming a active galaxy. The electric wave star is a large number of radio waves and exudes a huge gas structure of a feather or leaf shape. Other active galaxies will make a short wavelength of high energy radiation, such as the West Frax, class, and a torch. The class is a horizontal sky that is observed in the universe. [76]\n\nThe universe consists of the structure of the galaxies and galaxies. The largest galaxies are collectively called a super star group. The material in the universe forms a fibrous structure and the Great Wall in the maximum scale, and it is a huge void. [77]\n\nThe study of cosmology is the entire universe. The physical cosmologist has a deep understanding of the opening and evolution of the universe by observing the large-scale structure of the universe. The core idea of ​​modern cosmology is the big explosive theory: the universe was born 138 billion years ago, since it continues to expand it so far. [78] [79] In 1965, scientists found that the universe microwave background radiation has laid a large explosion observation basis. [79]\n\nThe universe has experienced multiple development phases during expansion. Cosmists guess that the universe has initially had a fast universe, making the initial conditions of fluctuations to homogenize. Then the nuclear syndrome has produced various nuclear nucleus of the early universe (see the nuclear universe year of the year). [79]\n\nAt this time, the universe is filled with ions, and the photons cannot penetrate. Until the neutral atom formation, space becomes \"transparent\". For the first time, it is not blocked to penetrate the space, so far, it is still free in the universe to form a universe microwave background. It is quite a period of time, because the stars have not yet been formed, the universe is a dark. [80]\n\nThe material mass density of different regions has a minor difference, and the substance thus began to polymerize, forming a class structure in each scale. A substance with high density becomes a gas cloud and the earliest star - the third star star. These high-quality stars have stimulated re-ionization processes and manufactured many heavy elements in the early universe. Heavy elements become light elements after the decay, allowing the nuclear synthesis cycle to continue. [81]\n\nUnder the action of gravity, the substance forms a large-scale fibrous structure and huge void. Gas and dust gradually gathered to form an early galaxy. These galaxies have continuously incorporated more substances and forms a galaxies and galaxies to form a super star group. [82]\n\nThe presence of dark matter and dark energy has a decisive role in the structure of the universe. The two grouped, accounting for 96% of the quality of the universe. Therefore, scientists are trying to explore the physical principles behind them. [83]\n\nAstronomical and Tianshi physics have close interdisciplinary relationships with other scientific fields. Archaeological Astronomy uses archeology and human evidence to study the roles and status of ancient or traditional astronomy in culture. [84] The origin, evolution, and distribution of the biological system in the universe, and special attention to the existence of the export organisms, how people can detect these lives. [85] Mechanism Statistics (English: Astrostatistics) uses statistical methods to analyze an unbeatable astronomical observation data. [86]\n\nThe Formation and Reaction of Chemical Substances in the Universe. [87] Cosmic Chemistry specializes in studying the distribution, sources of chemical substances in the solar system, and changes in isotope ratios. [88]\n\nAstronomical Identification Science (English: Forensic AstronomY) Uses astronomical knowledge, answer law, history, such as verifying the date of shooting photos or confirming the creative time of astronomical artwork.\n\nAstronomy is in many scientific fields, among universal participation areas. [89]\n\nAmateur astronomers can observe a variety of celestial and astronomy, and some will even build observations themselves. The most popular observations include: day, month, major planets, asteroids, comets, meteor shots, stars and stars, galaxics, nebula, etc. Amateur Astronomy Club is distributed around the world, and some will provide members with a variety of help, from the construction of equipment and even 110 in the Messien Table (a total of 400) or the Herchur directory (total of 400).\n\nAstronomical photography is a branch of amateur day literature. Many amateur astronomers will choose to observe a certain type of celestial or a certain astronomical phenomenon. [90] [91]\n\nMost of the amateur astronomers are observed within visible light, but there are also a small portion of the wavelength other than visible light, including an infrared filter on a conventional astronomical telescope, or using a radio telescope. Carl Caski began to observe the wavelength of radio in the 1930s, and created amateur radio astronomy. Amateur astronomers can not only use their own equipment, but also the professional radio astronomical telescope that is open to amateur. [92] [93]\n\nUnlike most modern sciences, amateur is still a major contribution to astronomy. For example, they increase the measurement accuracy of the asteroid track through the mask method, discover new comets, and do regular observations on the star. With the improvement of digital technology, amatessine photography has also made great progress. [94] [95] [96]\n\nDespite the amazing development of astronomy, humans have changed the earth-shaped changes to the universe cognition, but there is still some important astronomical unsolved mystery today. To answer these puzzles, it is possible to need new ground or space observation instruments, and even new developments in theory and experimentation. "}