{"chinese_title": "season ", "chinese": "The season is a few time segments that have a relatively large geographical landscape phase difference. Different areas, other seasons division are also different. For temperate regions, a year is divided into four seasons, namely spring, summer, autumn, winter; tropical areas only have dry seasons and rainy seasons, or unique points. In the polar, it is not only winter, but the spring is not obvious. In the case of the north, May to September is summer, October to four months in winter, that is, there is no spring and autumn.\n\n\nSchematic of the season in December. No matter what time, the Arctic is extremely night, and the Antarctic is extremely.\nThe sun is smaller for the light of the Northern Hemisphere and is refraid.\n\n\nWhen the earth is running on the mutual track, the season of the north and south hemisphere is reversed.\n\nThe root cause of season varies is that the spinning axis of the earth is not perpendicular to its unveiled rail plane (yellow road), and the vertical line of the mound track plane forms the inclinement of the angle 23 degrees 26 points (Huang Dicheng), if it is assumed that the northern hemisphere is the head of the earth The earth is from the beginning to the foot. It is 23.26 degrees around the sun to turn (this angle will have a slow slightly change), and the skew direction is unchanged, so that the Arctic will gradually move toward the sun or gradually toward the sun. Space, the arrogant is a large area of ​​the northern hemisphere to the sun, and the Arctic cold air is reduced to form a northern hemisphere. In the winter of the Northern Hemisphere, the Earth is gradually moving toward the sun to the sun, the Northern is not a long photo. The sun, the cold air increases to form a northern hemisphere in winter. The Southern Hemisphere season is contrary to the Northern Hemisphere. Because of the summer of the north, there is a large area of ​​the sun, but the southern hemisphere is heading towards the space, and it does not take the sun temperature until the sun temperature will become a winter. In the spring and autumn, it is a transition season. When the sun direct point is close to the equator, although the northern hemisphere south hemisphere is gradually oriented from the sun, the earth is like a \"side\", the sun is the same, so the climate is not cold. not hot.\n\nThere are many ways to divide the four seasons. The following four are the most common (as an example of the northern hemisphere):\n\nSummer - a continuous period of temperature over 22 ° C.\nWinter - a continuous period of temperature below 10 ° C.\nSpring and autumn - during the period between 10 to 22 ° C.\n\nAccording to the above point of view, there are 6 seasonal combinations in the world:\n\nThat is, from March 2nd to May 31, the spring, June 1st to August 30, in the summer, from August 31 to November 29, for the fall, on February 28, 2021, on February 28, this is winter.\n\nThe residents in the ancient Central Plains are divided into four seasons, 12th, 12th gas, seventy-two, and collectively referred to as \"seasonal climate.\"\n\nIn different latitude bands, seasonal changes have different features. The relative climate with the north and south hemisphere, the season is also relatively: autumn to spring, summer.\n\nFour seasons clear.\n\nThe cold belt is cold in the past year, but it is still very obvious in the summer and winter temperature.\nIn summer and winter, there will be extremely bright and night.\n\nThe phenomenon of sun direct shooting in season changes, the temperature difference between the various seasons is not large, and the weather is mainly caused by dry wet and the monsoon changes.\n\nThe Chinese believes that there are different features in the four seasons, namely \"Chunsheng\", \"Summer\", \"Autumn Collection\" and \"Winter Tibet\"; that is, everything is born in spring, growing in the summer, hiding in the winter (Animal hibernation, plant deciduous). For farming, it is spring plowing, summer, autumn harvest, winter hidden.\n\nChina has a lot of calls since ancient times [1]: "}