{"chinese_title": "society ", "chinese": "The term society is not too official to define, which generally refers to the group constructed of self-propagation, occupying a certain space, with its unique cultural and custom habits. Since society is often considered to be human, society and human society generally have the same meaning, but in scientific research or science fiction novels, there may be \"ant society\", \"alien society\".\n\nThe narrow sense of society is also called \"community\", which can only refer to population human activities and gatherings, such as rural, villages, towns, cities, gatherings, etc.; generalized society can refer to a country, a wide range Regions or a cultural circle, such as Chinese society, British society, East Asian society, Southeast Asia or Western world, can be used as a broad interpretation of society or can also be deduced to their cultural customs. Sociology is known as the subject of human society.\n\nHumans have learned a group life from 10,000 years ago, and gradually forming the original tribe; in this original tribe, they will move or settled because of the environment of the surrounding environment, and slowly cultivate lifestyle habits, and evolve into unique Culture. When this culture becomes more advanced or powerful than adjacent tribes, it has formed a cultural circle. When this tribody becomes strong or numerous, they will settle in a place and build a gathering point, become civilized and urban civilization.\n\nSociety in English is from Latin Societas, Latin is the association, conclusion, and alliance. [1] From the original Indian stem * SEKW- (follow) development.\n\nIn ancient times, in ancient times, it refers to the old meeting, the holiday meeting, such as Tang Liuzhu \"Ansy Yang Shangshu\" poem: \"Not to Yan Tai, the happy gift, Hazheng, Song Dynasty,\" Tokyo Menghua recorded, autumn, \"\" August Autumn Agency ... Mr. City, Mr. City, pre-confess the money to make a society. \" The state in the country in the country, all kinds of society, and the law. \"[2]\n\nFu Zao's \"Social\" new words in the \"Social\" in the \"Social\" of the \"Social\" in the new \"Social\" in the new \"Social\" in the new \"Social\". Yan Fu believes that this Japanese translation is improper, and social translations are \"group\" [3], but it is not promoted, but the final Chinese is uniformly adopted \"society\".\n\nHuman society is often classified in accordance with its primary production. Sociologists are also divided into situations: hunting to collect social, animal husbandry and society, horticultural plants or low-level agricultural society, and senior agricultural society (also known as civilization). Some people think that industrial and post-industrial society is inherently different from traditional agricultural society.\n\nModern anthropologists and social scientists strongly oppose the strict phase of this civilized development. In fact, more anthropology research data has proven complexity (civilization, population growth and density, specialization, etc.) do not always take a level or sequential organizational form.\n\nIn addition, cultural relativity as a popular route / ethics has extensive replacement of the original concept of civilization, \"better / poor, or development process\" (including material civilization, technology and social organization).\n\nMorris Gudel (English: Maurice GodElier) believes that a key to human society is in the male default father role than human biological close relatives (other primate animals). In human beings, male pursuit is not certain. [4] [5]\n\nAmerican sociologist Gehad Lenski (English: Gerhard Lenski) is classified into social classification in accordance with science and technology, information exchange and economy [6]:\n\nThis classification is similar to the early classification of humanologists Morton Fried (English: Morton Fried) and Comprehensive Theoretists in Elman Sevis. Sevis created a social classification system for human civilization and universal social classification system in accordance with the status of social inequality and the status of national systems. This classification system is divided into the following categories:\n\nFurthermore:\n\nOver time, some civilizations are developed in the form of more complex composition. The development of this civilization has a profound impact on the group's model. The hunting and collection-based tribe settled to become a farmhouse town, and the rural towns will gradually develop into a city, and the city will eventually become a cityplace, or a country. [7]\n\nSociety will classify in accordance with its survival strategy (English: List of subscess techniques) (human use technology to meet its own needs). Humans have established many types of society in history, but anthropologists will classify social classifications to obtain advantages (such as resources, reputation or power) in society. In essence, there will be some level of inequality, through social layering, divide people in society into different groups of different wealth, reputation or power. Sociologists will use wider categories: pre-industrialization (English: pre-industrial), industrialization (English: Industrial Society) and post-industrial society.\n\nIn the former industrialization society (English: pre-industrial society), the production of food is the main economic activity, and the process is accompanied by human and animal investment. The former industrialization society can be classified according to its technical standards and the production of food: hunting collection society, livestock society (English: Pastoral Society), Horticultural Society, agricultural society, and feudal society.\n\nThe main food source of hunting is the collection of wild plants and hunting wild animals every day. The hunting collection society will continue to migrate due to collecting food. Therefore, a permanent village will not form a smaller group, such as a hunter (English: BAND Society) or tribe, which is composed of relatives, which is not more than a variety of archaeological relics. However, some hunting collection society is a region where there is a rich resource (such as the Trin Giite, North America), which forms a larger group, and also forms a grade social structure (such as the Ai Aihua). Hunting Collecting the needs of social migration will also limit the growth of this society. The number of hunting collected society will generally be less than 60, even if it exceeds, it will rarely exceed one hundred. Compared with other society, the social status in hunting collection is relatively equal, and the decision-making is generally the consent of everyone. The combination of tribes is very personal than leadership, and only use because of specific reasons in tribal society. The hunting collection society does not have the political organization of entity, the emirate is just an influential person, some kind of consultant, the tribe of the collection does not mean that there is a so-called government, the family is the main social unit ( English: Social Unit), most of the members have established their relationships with blood or marriage. This social form requires a family to perform most of its social functions, including item manufacturing and education.\n\nNon-producing (English: Pastoralism) is a more efficient lifestyle. People with livestock society (English: Pastoral Society do not need to find food required daily, but rely on domestic animals to meet their food needs. People in the nomad society will also migrate, moving from a grassland to another, and its food source will be more stable than hunting, so it can form a larger society, and its food supply has surplus, so no need for everyone It is responsible for manufacturing food. And its division will be more complicated, for example, some people may be craftsmen, manufacturing tools, weapons and jewels. The manufacture of these items will also encourage transactions between society. Once the transactions may have some family more items more than other families, and they will bring inequality, and these families will begin to obtain power because of their cost of wealth. The process of passing from generation to the next generation will also make wealth and power concentration. Over time, the hereditary chief will appear, which is also a typical government form of livestock and societies.\n\nAgricultural society uses advanced agricultural technology to cultivate crops on a large area of ​​agricultural land. Sociologists use the word Xinshi Revolution to describe the emergence of 8,500 years ago, let people start farming crops and livestock technology changes. The improvement of food production makes the population in society more than before. More food remaining, let people don't have to worry about the problem of food, but also make the town to support the rulers, educators, handmade artists, businessmen and religious leaders.\n\nSocial layers in agricultural society are more obvious than ever. For example, in the past society, women's labor is quite equal to men. In collecting society, women can even collect more food, so women have a high social status. But when the food is not problematic, women have gradually become subordinates for men.\n\nWhen the town gradually expands to other towns nearby, conflicts between different ethnic groups will occur. Therefore, farmers provide food to the warrior, exchange soldiers to protect them from outside the survival. The social system with higher rulers has gradually emerged, and the aristocratic warrior, the protection of society is not invaded by outsiders, and the nobles will provide food to the nobility, warrior and others.\n\nThe gardening society (English: Horticulturalist Society) The food acquisition is to make a region in the forest or jungle as a garden, with a desired fruit and vegetables as the main source of food. This kind of social technology is similar to the social complexity. Some horticultural society are planted with slash-and-burn method: first cut the wild plants, and then use plants as a nativeness of new seeds. Gardening society will use human resources and some simple tools, in a season of farming or more than a season. If the land becomes poor, they will be clear from the adjacent place, the original abandonment, let it slowly restore the original appearance. They are also likely to return to the original place after a few years, and re-cut cultivation and plant crops. Because of turning use of its garden, horticultural society can live a long period of time in a region, or to build a half-permanent or permanent village. The size of the village can grow the size of the crop area, the population is at least 30, and there are up to 2,000 people.\n\nIn the gardening society, sufficient food supply makes people have more fine division of labor, and the specialization roles of gardening society include handicrafts, Wu Wei (religious leaders) and traders. The differentiation of roles also allows people to create a wide variety of utensils. Horticultural society is similar to livestock society, because excess food will cause wealth and inequality of power, and because of the characteristics of gardening social settlement, it is more likely to appear unequal.\n\nThe feudal system is a social type based on land ownership. Farmers and today's farmers under the feudal system, the land of farmers in the feudal system is the land of their lord. Farmers farm provide food, handicrafts and other services to the Lord, exchange military protection provided by the Lord. The grade of the feudal society is often cross-alive, and the descendants of the farmers will grow up for their leaders, and their lord may also be the future generations of the previous Lord.\n\nIn the fifteenth centuries and sixteenth centuries, the new economic system began to produce, replacing feudalism. The capitalism is characterized by the open competition in the free market, and production equipment tools are private. European continental exploration is the driving force for capitalist development. Cause foreign metal, silk and fragrance rise to large business activities in Europe.\n\nThe industrialized society has greatly dependent on the manufacture of fuel as a power machine in the manufacture. This has a substantial increase in efficiency, and the production efficiency increase in the industrial revolution has produced greater remaining than previous. Moreover, the remaining is not just agricultural products, including industrial products.\n\nWhen industrialized society, the population has increased again. The improved productivity makes more goods can be manufactured and sold to all people need. However, inequality is more serious than before. The feudal society of agricultural foundation has ended, so many people have to leave their original cultivation, to the city. This causes the overcaps of labor, but also allows capitalists to employ workers with very low salary.\n\nThe post-industrial society is not based on manufacturing commodities, but is based on information, services and high-tech society. Advanced industrial society has begun to increase their services in its service industry, which will be higher than the manufacturing industry. The United States is the world's first service industry population of more than half of the total employment population. The service industry includes governments, research, education, medical, business, laws and banks.\n\nThe word \"society\" has now included some political and scientific connotations, and there are also some relevance to each other.\n\nThe development of Western world has also brought Western culture, political science and its concept, which is generally called \"Western Society\". In terms of geography, the Western world includes at least Western Europe, North America, Australia, New Zealand, sometimes including Eastern Europe, South America and Israel.\n\nThe cultural and lifestyle of the Western world comes from Western Europe. In general, these countries have strong economic and stable governments, fully allowed religious freedom, choose democratic government governance methods, advocating capitalism and international trade, and Jewish - Christian Values ​​(English: Judeo-Christian Values) affects some degree of political and military alliances or cooperation [8].\n\nThe concept of information society has been put forward in the 1930s, but the definition of information society is currently more emphasis on the impact of social and cultural. Therefore, the impact of computers and telecommunications equipment for families, workplaces, schools, governments, and many communities and organizations also include new social forms formed by computer and telecommunications equipment [9].\n\nOne of the fields of the European Union is information society. The policy is to promote open and competitive digital economy (English: Digital Economy), for information and communication technologies, and related applications to enhance social inclusive, public service (English: public service) and quality of life [10 ].\n\nInternational Telecom Alliance Information Society Global Conference (English: World Summit On The Information Society) was held in Geneva in 2003. In 2005, in Tunisia City, many policies and applications where action can be taken [11].\n\nWith the beginning of the 21st century, more and more convenient contacts for electronic information resources, some focus have been extended by the information society to knowledge society (English: Knowledge Society). Among Ireland's analysis, it is mentioned that \"the ability to deal with price, storage, and transfer of large amounts of data is in recent years, in a few agers, the number of information and the growth of the network will be more effective, and knowledge application and economic activities will be used. In combination, even these leading factors producing wealth. Dangeries currently from 70% to 80% of economic growth It may be from newer and better knowledge. \"[12]  The 2nd Knowledge Social Global Conference (World Summit On The Knowledge Society) held in Crete, September 2009, specially focusing on the following topics [13]: "}