{"chinese_title": "Journalism ", "chinese": "Journalism, or translated into a report (daily translation) or remarks (translation), is a discipline containing collection, writing, and reporting news. In a broad sense, it also includes the process of editing and demo the news. Journalism has an important role in various communication media such as newspaper, TV, radio and network media. Most media institutions hope \"first-proceeds\", to issue information, and under this pressure, media institutions usually edit and school on the news to make their content comply with the agency in accuracy, quality and model. standard. Many media institutions claim that they are monitors of government agencies and officials, which will supervise the Government to be responsible for the people and proud of this tradition. But at the same time, critics have questioned whether the media itself can be questioned to the public. [1]\n\nIn the early 1920s, traditional journalists were employed by professionals who were employed by the relevant bachelor's degree. However, in the 1990s, with the increasing popularity of news production and the popularity of the Internet, the traditional and professional news culture is challenging. The concept of folk reporters came into being, and the reporters on the Internet will distribute their own news through different channels, not only to professional media channels.\n\nFormer Washington Post Editor Phil Greham (English: Phil Graham) Describes the news-oriented news writing is \"History Preliminary\" [2], because every serious historical event occurs, journalists record them. Then, the special report is made in a short period of time, and this is not different from the preliminary discipline of writing history.\n\nIn the United States, news is made by media organizations or individuals. Hundreds of passengers are also a reporter (but there are exceptions). If the Federal Trade Commission requested the Ministry, if the Ministry of Trade has been introduced in front of the product, it has received a free promotion product. It is necessary to tell the reader's product to give the manufacturer free, the purpose is to avoid conflicts of interest and protect consumers [3].\n\nFake news is known unreal, but it is also a message to the public, or a message made by an unreliable organization. Fake news is easy to spread on social media (such as fake news websites (English: fake news website)). The reader can assess whether it is a fake news based on the news of the news from the news. The US reliable news organization will have a editorial committee, and its editorial department and advertising departments will be clearly divided. Reliable news organizations or their employees will belong to one or more professional organizations, such as the US News Editor Association (English: American Society of News Editors, professional reporter association (English: Society of Professional Journalists), survey reporters and editing associations ( English: Investigative Reporters & Editors or Online News Association (English: Online News Association). These associations have their members necessary to comply with professional ethics guidelines. Many news organizations also have their professional ethics guidelines to standardize the professional behavior of reporters. I recognize the standard and ethical norms of the New York Times [4] are quite rigorous.\n\nIn the case of the reporter, there will be an objective and prejudice. Some reports are deliberately expressing the author's own point of view, some reports are deliberately neutral and objective. In the printing version of the newspaper, there is its own layout, which can be described by the author's own view or more neutral description according to the layout of the layout. If in the newspaper of the Internet, the boundaries of the above layout do not necessarily exist. Readers need to carefully according to their title or its design elements, to learn about the author's intention to communicate personal views, or to convey neutral views. Author's personal opinion generally is written by the authors or in the chapter of the editorial page. News close-up (English: feature stories), cover news and information entertainment news will not be the author's own point of view.\n\nAccording to Robert W. McChesney, the health of democratic national health needs to provide the opinion of the authority, but also provide the opinions of the governors, need to have all aspects, consider Demand for all people [5].\n\nMany controversial focus is whether the reporter should be \"objective\" or \"neutral\". The reporter is a person who produces news in a particular social background, and it is also part of its social background. The reporter complies with its professional morality and try to present all legal views.\n\n\"John Carolus\" All worthy of respect and memorable news (German: RELATION Aller fürnemmen und gedenckwürdigen historien \"published in Strasbourg in 1605. This is considered to be the first newspaper. The first successful English newspaper was published from 1702 to 1735. [6] The reform of \"Diário Carioca\" in the 1950s of the Brazil is often called the birth of the modern Journal of Brazil. [7]\n\nIn the 1920s, modern news began to start [8]. Writers Walter LiPman and American philosophers John Dewey have put forward different ideas for the role of news playing in democratic society. Different philosophy still affects In the society and the country, the role played by the news.\n\nLiPman believes that journalists play a medium (translation) between mass and policy order. LiPman believes that the public cannot assess the increasingly complex affairs in modern society, so it is necessary to filter the news, and journalists are this middleman, record the news transmitted between the policy, and provide the extracted essence to the public. The public can affect the government through the election, the government will continue to operate the government's power. LiPman's philosophy is to put the public in the bottom of the power chain, inheriting the information provided from the upper ruler.\n\nDuwei's ideas, Dewey believes that the public can understand the information provided by policy-making, or respond, and policies need to discuss the discussion in public discussion before decisions. When the problem is completely discussed, the best decision will naturally emerge. Dewey believes that the reporter cannot just pass information, but also need to weigh the results of various policies, informing the policy to settlers and the public. Dewey's ideas have more or less implementation, that is, Community Journalism (English: Community Journalism).\n\nLi Puan's concept of journalists is close to the government's position. Dewey's argument is similar to modern reporters to their own roles, and how many of them are also the foot of the society expecting journalists to play. For example, Americans will criticize some excessive behaviors of reporters, but still expect journalists to use the public to supervise the government, enterprises, and strong persons, informing the public, in order to make decisions.\n\nBill Kovach (English: Bill Kovach) and Tom Rosenstiel Propose have listed some news reporters in their works \"The Elements of Japan\" [9]. Because the journalist is to be loyal to the public, the journalists need to tell the community, and independent supervisions have power and organizational. The most important news reporter is based on the principle of verification, providing information about reliable social public.\n\nThe process of news writing is 5W1H analysis method, which is the case where the WHEN, where, why (WHO), what is (why) and how to (how), and the event or trend Straight and effects. Newspapers, TV, radio and magazine, and media such as the Internet, all recently involved news writing.\nThe reporter writes and reports a wide and diverse theme, including:\n\nThere are many different forms, corresponding to different audiences. News is the fourth right, and it is a door dog to supervise the government's governance. A newspaper may include many different forms. The newspapers, magazines or websites may also be for different audiences [10] [11]\n\nHere are some of the forms:\n\nRecently, the rise of social media has also attracted the discussion of news, that is, re-seminating news reports as a process, rather than paying them in specific news products. From this point of view, news reports are interactive, and they are involved in many authors, reporters, and social media masses [14].\n\nGovernments have different policies and management methods for news and reporters. The relevant policy meeting determines that the reporter can study or write the content of the report, and which media organizations can make news. Some governments guarantee the freedom of press, while some countries strictly restrict reporters can study or write a report.\n\nIn many countries, the reporter has the privilege of general public, including more easy to exposure to public incidents, criminal scenes, and press conferences, can also interview with government officials, social celebrities, and public attention.\n\nReporters mainly based on the war (may be a national and national war, or domestic riots), often will not be protected by the government. A journalist who was captured or detained in the war would be considered a civilian and sent back to the country. Since the content reported by the reporter is sometimes the government does not want to disclose, many governments around the world will give reporters intimidation, harassment and violence. [16].\n\nThe reporter's behavior for the message source is protected by law. Even if the police or prosecutor requires, the identity of the intelligence provider is also confidential.\n\nThe US Court provides different levels of protection for news sources, but reporters have no right to protected from the US Federal Court. In general, the federal court will not force reporters to disclose a source of sources. Only the information sought by the court is highly related cases, and there is no other way to get the reporter will be forced to disclose a message source. The reporter refused to testify or imprisoned by the sin of the court.\n\nWith a reporter's perspective, there is a risk of confidential sources, because the message cannot be confirmed whether the message is true, if the last message is not true, it may result in destroying the credibility of the reporter. "}