{"chinese_title": "material science ", "chinese": "Material science, the nature of matter and its integrated application in the fields of various science and engineering, is a cross-section discipline of the preparation or processing technology of research materials, microstructure of material and three of the material macroscopic performance. The theory involved includes solid physics, material chemistry, application physics and chemistry, and chemical engineering, mechanical engineering, civil engineering and motor engineering. In combination with electronic engineering, the electron material is derived from the mechanical binding, derived structure materials, and is derived from biological binding, and is derived. As the media in recent years, the media will focus on nanoscience, and materials science have become more and more widely known in the field of science and engineering. It is also an important part of the identification science and destruction analysis. In the latter, it is the key to analyzing various flight accidents. Many technologies in many technologies today are limited by the limits that the material can allow, and therefore, breakthroughs in this area have indexic effects in future technology. Material science has a wide range of application prospects.\n\nThe choice of materials on each era often determines the development of the era, like stone era, bronze era, iron era and industrial revolution are obvious examples. Materials Science is one of the oldest application sciences and engineering, initially guided from the process of processing and metallurgy of metallurgy. Modern Materials Science Events from Metallurgy. In the early 19th century, an American scientist Josia Gibbus found that the thermodynamic properties between materials in different phases have made great breakthroughs in the nature of the materials. Materials Science and other fields of cooperation development revolutionary technology, like plastic, semiconductor and biological materials (English: biomaterial).\n\nIn the 1960s, many materials sciences were known as a mineral system. After 1960, the US Higher Gradunel (Advanced Research Projects Agency), is now the National Program, for the basic research and training of materials science (\"To Expand The National Program of Basic) \"\") Forms a series of university laboratories in the 1960s and established materials science. This area includes ceramics, polymers, semiconductors, magnetic materials, biomaterials (English: BiomaTerial), nanometric materials.\n\n110 mathematics\n120 Information Science and System Science\n130 mechanics\n140 physics\n150 chemistry\n160 days\n170 Earth Science\n180 biology\n190 psychology\n\n210 Agricultural University\n220 forest\n230 animal husbandry, veterinary science\n240 aquatic studies\n\n310 basic medicine\n320 clinical medicine\n330 Preventive Medicine and Public Health\n340 military medicine and special medicine\n350 pharmacy\n360 Chinese Medicine and Chinese Medicine\n\n410 Engineering and Technology Science Foundation\n413 Information and System Science related Engineering and Technology\n416 Natural Science related engineering and technology\n420 Surveying Science Technology\n430 Materials Science\n440 mine engineering technology\n450 metallurgical engineering technology\n460 Mechanical Engineering\n470 power and electrical engineering\n480 energy science technology\n490 nuclear science technology\n510 Electronics and Communication Technology\n520 Computer Science Technology\n530 chemical engineering\n535 product application related engineering and technology\n540 Textile Science and Technology\n550 food science technology\n560 civil engineering project\n570 water conservancy project\n580 Transportation Engineering\n590 aviation, aerospace science technology\n610 Environmental Science and Technology and Resource Science and Technology\n620 Safety Science and Technology\n630 management\n\n710 Marxism\n720 philosophy\n730 religious\n740 language\n750 literature\n760 art\n770 historical\n780 archeology\n790 economics\nPolitics\n820 law\n830 military school\n840 sociology\n850 nationalology and culture\n860 Journalism and Communication\n870 Library, Intelligence and Document\n880 Education\n890 Sports Science\n910 statistics "}