{"chinese_title": "Chinese history ", "chinese": "Diet - Apparel - Architecture - Cultural Relics - Festival - Folk - Education\nScience - Five-Trim (Medical - Surgery) - Wushu\n\nIf China History, there is approximately 3,300 years from the middle of China's first-rate (the first 1300 years) in the middle of China 's text history; from the archaeological and urban positioning representative two-head cultural sites (before 1920 The calculation is about 3,700; from the legendary summer, the legendary summer 2070) counts about 4,100; from Confucius, the legendary era of the three emperors of the three emperors is about 4,700 years (the first 2698 count); It is about 5,300 years from the earliest city of Liangzhu Culture, and it is about \"five thousand years\" from the uncertain myths such as God, Pangu, and female, etc. (this is also a traditional folk cognition. Length); about 10,000 years from the magnetic mountain culture from the Neolithic Age; about 68-100 million years in the period of the Beijing Sutra and Lantian in the old stone era. [2]\n\nChina's legend has Fuxi to make a gossip, the Yellow Emperor's era, the modern archeology, found 3,300 years ago (first 1300 years), 4,500 years ago Tao Wen, about 5,000 years ago, there is a turtle with text in the top 5,000 years ago Bone symbol.\n\nFrom political and social forms, China's history is distinguished. According to archaeological materials, it is gradually transitioned from maternal clan society from maternal classes in the early days of Li Gang culture or Yangshao Culture. At the same time, the primitive social equality is broken. According to the history of writing, Xia Dynasty has begun to attack the king of the king, and the establishment of a complete gift system in Zhou Dynasty, to the East Zhou graduate, the Qin Dynasty unified the political and many folk disagreements of the text and measurement system, and establish a centralized democratic monarchy rule. Since the Han Dynasty, the Dynasty is in the Qing Dynasty. Late Qing Dynasty, from the Western World East biography of scientificism, democracy, capitalism, communism, socialism, etc., various new trends, etc. At the beginning of the 20th century, the people's rise of the revolution in the past few thousand years of Chinese emperor and feudal society, and established the first Republican system in early 1912 - \"Republic of China\". On October 1, 1949, the Chinese Communist Party established the \"People's Republic of China\" in the mainland, and the Chinese Government of the People's Republic of China moved to the Golden Malaysia area due to the national civil warfare, and the two sides of the rules and war were maintained in 71 years. The Peaceful Pattern is now.\n\nFrom economic form, the ancient Chinese population is mainly composed of freelancers, private ownership, and commercial activities. When Zhou Dynasty, the business was mainly composed of official trade and 构. After Qin Han, the construction of central calls, scholars, agriculture, workers, orders, etc., of which were the main body of the agriculture, and the land-based bureaucratic is more freely commercial economy society, some Important industries such as oil and salt rice are monopolized by bureaucrats and businessmen. There is also a great development in addition to agriculture, handicrafts, and commercial trade. As early as the opening of the Han Dynasty Silk Road, when the land transport in East Asia and Central Asia, international trade had already started; the opening of the large canal in the Sui and Tang Dynasties promoted Nort-North Trade; the opening of the Tang Dynasty and diplomacy, the construction of transportation, Make all the cultures and materials in the Tang Dynasty, there is a flying money similar to exchange securities, and there is a banknote in the Song Dynasty; when the Yuan Dynasty, due to the comprehensive opening of the business brigade, it is very prosperous with Central Asian business exchange; Ming and Qing Dynasties It is affected by Western countries, and international trade in maritime Silk Road is rapid. In the early 20th century, the Republic of China implemented the \"People, Minzhi, People Enjoy\", and implemented free economic society; and at the beginning of the founding of the People's Republic of China, the first-grade economic society, which was first-owned, adjusted to reform and opening up, and gradually The transformation of the market economy and society, the form is called the socialist market economy under macro-control, and the industrialization and urbanization have developed rapidly, and hundreds of millions of people will transfer from farmers into urban industrial and commercial employment in just 20 years. [a]. At the beginning of the 21st century, China's economy became the second largest economy in the world.\n\nWith the accompanying person, it is possible to know the land that happen to the matter; with others, it is possible to know the home of the people [3]. History history, and must be geographical and nation; in Chinese history, the national relationship is simple, and the region's scope is very large, so the history of China, the geographical knowledge is more needed [3]. Cove with the past, there is a political system, social background, economic activity, academic faction, thought, religious beliefs, art creation, this is related to history, and it also accounts for an important position in history, and the nature is more special. More complex content [3].\n\nThe earliest higher primate, which has been found so far, lived in China's Jiangnan in 45 million years ago. Archaeological evidence showed 2240,000 years to 22,200,000 years ago, China has an upright person living. At present, the earlier primitive human traces of archaeological discovery have Wushan people, Yuanzi, Lantian, Nanjing Jutong, Beijing Elite people, etc.\n\nThe various cultures in the prehistoric era of China have passed the following stages: the old stone era mainly in the old stone (about 50 to more than 4 million years ago), then enter the old stone era, representing the mountains and the mountains, Today is about 20 to more than 20 million years ago.\n\nThe representative culture of the early Neolithic era is Li Gang culture. This period is a maternal community, and the society has no obvious layering. Then, in the middle of the Neolithic Culture represented by Yangshao culture, during this period, the social nature transitioned from the maternal clan society to the father's class, and the poor and poor division gradually deepened. At the same time, the productivity level has a significant improvement. In the late Times of the Neolithic Times represented by Longshan Culture (4,900 to 4,100 years ago, I have found in the Yangtze River, the Yellow River Basin, such as the Central Plains, Jianghan City Group, Haisheng City Group. This may be shown in the Longshan era, and the social organization has a large change.\n\nAccording to the current archaeological research, China's Neolithic Age presents a diverse constant: from the southern part of Henan Province, the southern part of Hebei Province, the southern part of Hebei Province, and the southern Shanxi Province has red pottery, Color Tao and the characteristics of edible coy and animal farststation. At the same time, there was still a cultural in Zhimudu culture in the east of Zhejiang Province, and the cultural cultization of Liangzhu culture in the north side of Zhejiang Province.\n\nThe Chinese civilization truly has the first year of the year of the year, the first year of the Western Zhou, the first year of the Western Zhou, the previous historical era, and therefore the earliest origin of Chinese civilization still has not been finalized. Although there are many records in the traditional literature, because of the late books, there has been no evidence that the recognized Xia Dynasty and its previous history have been discovered so far. Therefore, there have been people in the modern history of Xia Dynasty. Sex. In the western part of Henan Province, the Erlim site found in the southern Shanxi Province has the basic conditions of the ages and geographic conditions of summer culture, but since the absence of text records in the same time similar to the oracle residence in Yin Ruins, the existence of Xia Dynasty is always Unable to be confirmed. Many Sino-foreign historians believe that the full or first, second phase of the Silitan Site in Henan Province, may be the remains of Xia Chao Tudi, but it is still looking for a conclusive basis to clarify [Part 1].\n\nIn the myth of the phase, there is a statement of the ancient world and the female man. The legendary three emperors is the representative of the outstanding leaders of Xia Dynasty before, and there is a different statement. Three emperors generally refer to Xuanyuan Huangdi, Fuxi, Shennong and the three people in the blessings. The five emperors generally refers to Shao Wei, 颛顼, emperor, 尧,. Taken from: (\"Shang Shu · Preface\", \"Baihu Tong\"), from the three emperors to five emperors, there is no nuance, for a few thousand years. Written \"Hua, Rong\" in \"Wen Wen · Text\". \"Zhou Shu, Wu Cheng\": \"Summer, Da. Therefore, the big country is in summer.\" Huaxia said China. \"The ancients believe that China is in the center of the world, so it is called\" China \"(Central Country).\n\nAccording to the legend of today, the leader of the Yellow Emperor Yan Emperor Triba, after powerful, beat Yan Emperor in the battle of Hanquan, becoming the leader of the new tribe, and then conflicts with the especially in the southeast, in the deer It is completely defeated the opponent and established its own dominance. The legendary guide car is invented by the Yellow Emperor: \"Datiff Guide, Huang Emperor and Yu Yu Wars in the wilderness of the deer. 蚩 especially big fog, the soldiers are all fascinating, so they are guided the car, and they are 蚩, ie Emperor. \", After this, the Chinese generation recorded the application of magnets. Later, the grandson of the Yellow Emperor and Xuan Sun Emperor continued to serve as the leader of the tribal alliance. The son of the emperor, the success, he is a Qijun, create a Zen, and the transmission is given. In the period, the flood is flooding, and the method of clogging is used. As a result, the flood is even more powerful, and he is executed. His son's use of the way, successfully governing the flood, therefore is initiated as the leader.\n\nThe son of 启 启 破 方式 方式 方式 方式 生 生 生 把 位 位 位 到 位 到 到 到 位 到 位 到 位 到 到 到 到 到 到 到 到 到 到 没有 到 到 没有 没有 没有 没有 权 没有 没有 死 死 权 没有After the benefit led the East Yi League. After a few years of struggle, he established his leader in the tribal alliance. In the suburbs of Qida, there is a glimpse of the troops, leading the tribal alliance to the Quandu, and the Enshi Truna in Gan.\n\nAfter killing, his child is too Kang inherits the back. Taikang ignores political affairs, during the period, the authority of Xia Jiao is weakened, and Dongyi Tani and Shaozhao Tribute. Dongyi family is a leader of good shot.羿羿 羿 军 地 地 属 地 地 地 地 地 地 地 地 地 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人 人He won Xia Zheng under the support of Xiamen. It is too Kang to run the 鄩 鄩. After winning the power, I didn't say king, but the king of Taikang's brother. But in fact, China is all coming to govern. This move causes dissatisfaction with many tribes. Among them, the peace of the heaven is open to the Heishi. I said that they were invisible when they were abolished, and they were brought to the fish and two, and the war swearing before the war, winning in the war.\n\nAfter the death of China, his subsequences. Then I went to the sip of the surname of Xia Tung, Ironed Two. Since then, it is unique to the throne.羿羿 猎 hunting, not good governance. He was abandoned with the loyal minister such as Bolo, Board, and Dragon, and reused the unfilient of the Birming's expense. When the winter is less than the rumor, it has been adopted by the Birming's monarch, and after being adopted by the poor, it becomes a member of the poor, it is reused. The coldness is increasingly powerful, and later, the opportunity to hunt hunting will kill the family, hegemony, to win his wife, gave birth to the two sons. The cold, gave his son, and put it over the other son of him. Putting the parent's life led the troops to remove the parents of the parents, and kill the phases of the somewhere. The wife of the phase had a son who had been in the same time, she escaped from the wall to her mother and she was still refuge, soon he will soon.\n\nAfter a long time, it is still still herd. After the casting, he sent people to chasing there was still still, and Shao Kang helplessly went to the 氏 (behind him), and later recovered Xiaokang after the summer. Then, then the less Kang was destroyed and sent his son to the Ge. At this point, the Dongyi family of the Central Plains has been in the past 100 years, and the \"Non-King\" period has been completed. Summer is the country, and later, \"Huang Kangzhong\". Through Taikang lost interest, this narrative, the history of the Summer, a fixed Central Plains tribe (especially Dongyi tribes). The child of Changkang is inherited. He learned that the dissatisfaction of Dongyi on the summer room, in order to consolidate the forces in the East, he moved the capital from the original east to the old Hill. He attaches importance to developing weapons and making troops. There is often a statement of \"杼 杼\" and \"杼 杼\" in the literature. He also sent people to the southeast coastal area (now southern Shandong, east of Anhui, and Jiangsu). The layout of Xia Dynasty expanded to the River of the East China Sea (now Huanghai).杼 During the position, it was the most prosperous period in Xia Cha Da Chao. Summer people respect the \"Reporting\".\n\nWhen the child is in place, Dongyi and Xia have started peacefully. Among them, the nine tribes (i.e., Jiuyi), nine tribes (i.e., Jiuyi), nine tribes (i.e., Jiuyi), in the Huaihe River. After the disappearance, his slam is in succession. After the Mang, his sub-discharge occasion. The sons do not drop the rest. He has repeatedly led the soldiers to discuss the Western Jiuyuan. When you don't have a year, I'm in my brother. Distorting, his child is relaxed. After the junction, I will die soon, and the brothers don't fall. He changed the tradition of sacrificing the ancestors in Xiari, and he began to sacrifice Tian Di. Many Fanggang tribe began to dissatisfaction with summer, but the relationship between Xia Dynasty and Dongyi is still friendly.\n\nSummer, the bore has begun to decline. Confucius passed away, his sonus. Damn, his child is in place. During this period, the relationship between the country and the summer room was deteriorated, and the disputes inside the clan were also intensified. After the death, his submerged succeeds. During the period, the relationship between the summer room and the country tribe has been broken.桀 桀 乐 不 民 民 民 民 民 民 民 民At the end of the 17th century, the leader of the business family was the first of the union, and the Union's tribe was crusade. Oblue the petrics, Gu, Gu, Kunwu, and 桀. The soup is very powerful, and the resistance is not, and the battle is fled, and finally defeated the old site. Escaped to the sound strip, the soup chased, and launched a war. I was defeated again, and I was in the past 16th century in the first 16th century in the first 16th century.\n\nCentral Asian origin says that China's civilization and ancient Egyptian civilization are from the same source, but not think that Chinese civilization is a branch of ancient Egyptian civilization, but invested that Chinese civilization and ancient Egyptian civilization are also from a further ancient ancient times. Central Asian civilization, the civilization entered China 1600 BC, and Chinese historia's description of Xia Dynasty is the history of this more distant Central Asian civilization. This hypothesis also pointing out that Gujing Civilization is also originated from Central Asia, homology with Chinese civilization.\n\nIn 1921, Swedish archaeologists were found in Yangshao Cultural Site and discovered many color pottery locally. After comparing the local colorful pottery and the Terryo colors of Ukraine, Ukraine's Terryo Column Culture, as well as the color of Gansu, and Ant student proposed in the article \"Culture of China\". Since Central Asia, the finished product age is gradually approaching contemporary, indicating that China's pottery production technology is introduced from Central Asia, so Chinese culture may also be introduced from Central Asia. However, in 1931, Chinese scholar Liang Siyong discovered the three-stamping layer of Henan Anyang, proved that Yangshao culture, Longshan culture and cultural culture of Longshan, did not affected by the fundamental fundamental, and Antges also admitted this. In 1945, Xia Tan passed the archaeological discovery in Gansu, pointing that Antisson was incorrect with local cultural cultures. Qijia culture is actually not earlier than Yangshao culture, so Antisson's hypothesis lost empirical support. Since then, Ante students don't adhere to this hypothesis.\n\nAt the end of the Qing Dynasty, French scholar Lak Bury proposed China Civilization from Cubarbien, and he issued a papers \"Ancient Chinese Culture West\" in 1894. In the text, in the text, in the text, through the nearly 100 kinds of ancient Chinese civilization and Cuba Babien civilization, Rak Bien's civilization, proposed hypothesis, saying that the Yellow Emperor is about 2282 to lead the Ministry of the Bucks (ancient Schit Mi) One of the leaders, Babien, called it. With many ancient fossils Following China, it has become a favorable argument of Liu Yizheng, Liang Qichao and others refuting Lak Bury, and Fenglin clearly pointed out in accordance with the evidence of fossil in the \"Chinese National Western\". \"\" Someone in East Asia, \" \". Later, under the adoption of scholars, many cousiens were based on the classical codes as the post-class, Zhu Xian pointed out: \"The late arrival of the Han nationality, mostly evacted to the latitude myth of the Han Wei.\" (\" Words Learning Chinese People's Observation \") Finally, for the similarities between the two civilizations, Chen Jiazhi pointed out:\" There is a similar civilization from each other because the geographical climate is equal (\"Oriental Culture and the big letters\" ), It is impossible to infer Chinese culture. After the May Fourth Movement, the falsehood of Rockbury gradually lost support and was denied by the academic circle.\n\nIn Shang Dynasty, China began to have bronze civilization for the first time. About 1600 BC, the Shang Deco is destroyed by Xia Dynasty. According to the literature, the soup has three sons, Tid Ding, and Zeng, Zhong Yan. Tamding is a long son of the soup, and is standing as a prince, but Tid Ding is united. In the twenty-nine year of the soup, Tang Wang passed away. Thereafter, the eldest son Tamding was died early, the second of the son, the three sons were ignited, but the total time was only in just six years. Yi Yin Fuzu Taijia Regent, Tajia is the beginning, \"tyrannical, do not comply with the soup, chaos\", so Yin Anti is palace in Tong Palace in Tongfei. Taijia in Tong Pass, realized that his fault, Yi Yin saw this will meet Tai A, and also politically in Taijia. After the government, Yi Yin also made \"Tai A\" three education Taifes. \"Taijia compulsory, Yin Zenxing\", \"the princes to return ... The people are Ning\", created the first ZTE of the Shang Dynasty. Since then, the small armor, too pentarn, and the three sons are king, and there is a chaos of the brothers in the throne inheritance system.\n\nLittle A is the son of Tai Geng, and the first king. During the small age, the Shang dynasty fell for the first time. Large collaps in the seventeen years. According to the passing literature, the 雍 继 继 王. After the balance, Taisu has Middle Ding, and the three sons of the river are royal. Zhong Ding was objected by other rule forces inside the Dynasty. In the first year, the princes infringe in Gyeonggi, and Zhong Ding was forced to give up the capital of more than a hundred years, and the East moved to the class, thereby saving the throne. The blue-territor of the Eastern Earth is taking the opportunity to make a chaos. China Ding is in a nine or eleven years to collapse, and his own brother is in the end, and it is true. Its throne is a smooth inheritance or competing, because the lack of records is not clear, but the foreign year is in the first year, the people, the people rebellion, this may indicate that the throne is coming. The outside is in place for five years or ten years, and the river, the river is called the king, and moved to the phase. The defenders have led to the internal division of the regime of the merchants, the drama of the national strength, the vassal violation, the third decline of the Shang dynasty. He Han armor has been disconnected from the princes in the year. Zhu Yai, also the class party, the 侁 侁 联 班 方, He Hanjia combined with Peng Bo, Weberk, fuel delivery, 侁 侁 臣. The river armor is the first king, collapsed in the nine years. Zhong Dingzhi, Zu Yi is in place. At the beginning of the place, it is in Xing, and his throne may come. Zu Yi as the grandchildren of Taisu, may be supported by the old aristocratic power of the dynasty, and the son of the son of the Qiqian is the phase, manage the political affairs. Such a regime is gradually stable and building a new capital. Life is high, consolidating the rule of the West Tower. The Commercial Dynasty quenched secondary revival. Zu Yi was in the face of the people's respect and soup. Zu Yi collapsed in the 19th year of the temple, \"Zhongzong\". Zu Zun Zu Xin is in place, the regime is smooth. Zu Xin collapsed in 14 or sixteen years or sixteen years. Warrides made \"Armor\" in Bu Zao, because his son Nan Geng continued to be the king, so the first is straight, but because Nanyang has become a king, the Huang Zums in the later period is sacrificed. . Warrides were in place for five years, their priests relaxed. Antine is the son of Zuchen, there is Yang A, Pan Geng, Xiaoxin, and the small Party B four sons will become a king. The four children of the four children have made the four spouses of the ancestrality into the weekly sacrificial spectrum, which is the leader in the first prince. In the nine years, the brother is in the end. Nanyang is the son of Wo A, that is, it moved in three years, it was in the south, so the king was named \"Nant Geng.\" Nan Geng was in place for only six years, and the son of the ancestrality is in place. Since this, \"Zu Xin - Zu Ding-Yang A\" has replaced \"Wo A-Nanying\" is straight, Nant Geng is in a short bit time, maybe it is located in Yang A, or Yangjia. The disputes in the inheritance of the throne have weakened the power of political governance, the national power is reduced, and the border princes have invaded. Brought the fourth big fading of the Shang Dynasty. Yang A for three years, Xizhan Danhan, Dan Mountain. Yang A collapses in the four years, and its bread is orthodox. Tageng Sanzi Xiaojia, Taisu, Yong Double Successful King, destroyed the long-term heritage system, then the disciples have been completed, compete for the throne, and they have moved the Duqi, so that the national strength is dead, the princes are invaded. It is \"more than nine disorder\" in the middle of the business.\n\nPan Geng made \"Phase Geng\" in the division. When the Shang Dynasty, he moved many times. When Shang Dynasty, he was built in Zheng Yu (the place is still controversial). When you go to Pan Geng, it is about 1300 yuan in Yin (now Henan Anyang), and fixed down Since then, the Commerce is also called Yin Dynasty. After Pan Geng moved, the Commercial Dynasty's social economy further developed. Until the martial arts, the business is crusade, conquering many small countries around, expanding the territory, and the business hall reaches the heyday. After Wu Ding, the Shang Dynasty gradually declined. The last life of the Shang Dynasty (Shangyi Wang) has great promotion of the development of economic and cultural exchanges in China, the Huaihe River Basin and the Yangtze River Basin; but due to the year launching war and large-scale construction QionGong Yao Tai, it is expensive Human and assessment, promote social contradictions, Zhou Wuwang Union, 髳, 髳 部 部, sharing, has been hitting the song (now Qi County, Hebi City, Henan Province). People are reluctant to sell their life for the ridiculous kings, and they have turned into the battle, and the kings are self-immolated, and the Shang Dynasty is destroyed. Zhou Dynasty was established.\n\nZhou Dynasty was the dynasty of China 's history, and the last hered Dynasty, which was the last feudal system, which can be divided into Western Zhou (about 1100 years - 771) and East Week (the first 770 - 256) two Period. Westerly from Zhou Wuwang Dai Yin Shang Jianguo, I didn't have to start from Beijing (Zong Zhou), and Zhou Gui Wang Dehi is one of the Chinese civilizations. The material civilization and spiritual civilization in this period have deeply influence the later generations [4]. Dong Zhou Datin City is Luo Yi (now Henan Luoyang), and its era can be divided into Spring and Autumn Period (the first 770 - 476) and the Warring States Period (the first 476 [5] - 121 years). In the first 256th, the king of Qin Zhaozhen was scrapped in Wang Zhao, and the East and the death was destroyed.\n\nAfter about 1046 BC, after Wu Wang destroyed, implement the feudal system, the big king family and the hero, such as the sea preaching, the public is in Yan, and the seal is affected by Xin Zhi Wu Geng's song (now Henan Qi County) ), Also sealing uncle (prison), uncle (Cai Hou), uncle (Huang) is \"three supervisors\" to monitor Wu Geng's actions, the first 1043, Zhou Wu Wang, 即, is For Zhou Chengwang, Zhou Gong Dynasty is auxiliary government, the first 1041. Three-year (Shudu, Uncle, Huo, Huo, Huo Shusai) I don't usually have a co-Dand DC government, and Uncle is more resentful, Zhou Xu Dynasty is more than her own years, but I am in charge of auxiliary power, so I combined with Wu Geng rebellion, history called \"three The chaos of the supervisory, Zhou Gong Dynasty is not good, spent three years of fixed chaos, Wu Geng and Puhuang were killed, Cai Shuxu was exiled, Huo Shu was scrapped as a people. Zhou Gong Dynasty hit these Shang Dynasty to build a residential building (now near Luoyang City, Henan Province). Ten 337, Dai Yu was completed. Zhou Cheng Wang Wei, Zi Zi is in place, is Zhou Kang, Zhou Kang Wang Wei. Between forty-six years, the world is peaceful, the penalty is more than 40 years, and the history is called \"Chengkang's treatment.\" Become a model of China's treatment in the future.\n\nAfter the death of Zhou Kang, the child's success is Zhou Zhawang. Zhou Zhawang is in the 16th year, Zhaowan pro-Qi Chu until Jianghan region. A total of 3 years ago, Zhou Zhao Wang also died in the Hanshui, and the whole army was covered. Its child is full, it is Zhou Mu Wang, the continuation of the fifty time. Mu Wang is very happy, still wants to develop in the Quartet. Also a good parade, to deepen the political affairs. The East Xu Guo's rate is nine. Mu Wangnan, Lian Chu is flat, winning. After the Zhaoyu era, the Zhou Dynasty began to reduce the strength. During this period, northwest Di Xingxing. Zhou Yuwang, Yu Di, violation of China. Zhou people are deeply bitter.\n\nDuring the period of the tribut, the people were in the past, the people were unheastered. At the same time, Li Wang takes Ronglong Gong Dynasty, monopolizing social wealth and resources. In order to suppress the dissatisfaction of the Chinese, Zhou Li Wang gave the witch to monitor, and the king of killing. As a result, everyone is self-dangerous, and finally produces a national riot. In the first 841, Li Wang was run to the 彘 (now Shanxi Huo County). The DPRK is called the Mu Huihu, Zhou Ding's two ministers, and the number of the Republic (one said by the princes and the best in the law). For 14 years (the first 828), Li Wang died in the martial arts, the prince is static, it is Zhou Xuanwang, forty-six years. Xuanwang Zengjing Zhizhi, political people, and princes come to Zeng Zhou. Xuan Wang, in his later years, Zhou Dynasty re-emerged. Xuanwang interfereled Lu Guojun in succession, with force to strengthen Lu Xiaolong, causing the princes. Thirty-six years, hindrance, Run, defeat. Thirty-nine years, with the west ginger, ginger, the battle in thousands of acres (now Shanxi Hounan), and then defeated. In the first 781, Zhou Qingwang continued, apprentice and political corruption, the national complaints, the national people complained; the King of the Three years (the first 779), the six-hearted fails; at the same time, the sky is still frequent, Zhou Dynasty rule . After the Wuwang was scrapped, Shen Hou's female and Yihi prince, changed the beauty of the beauty, and his son is a prince. Yipo fled to the state, Shenhou Joint National and Dogs attacked the king. The Queen and Board were killed by dogs (now in Shaanxi Linyi East). In the first 771, the West Week was desired, and the country was about 251 years.\n\nAfter the king of Zhou You was killed, Shen and other princes met the purpose, and at this time, Zheng, Wei, Jin and the princes led the Qin Wang's teacher has also arrived, so the Shenhou and Yan Hou and the outside of Zheng, Wei, Jin et al. The princes should be embarrassed, defeated the dog, and the dog is retired. Shen, 缯, Wei, Jin, Zheng and other princes Li Zhou Wang prince Yiyi is king, is Zhou Pingwang. At the same time, the Dynasty, the Dynasty, the Dynasty, Li Ji Yu Ji was king, and the history called \"joined the king\", there was a situation in the two kings. However, most of the country in the country only admit Zhou Ping, not to recognize the king of our weeks. Zhou Ping Wang 21 years (750 BC), Jin Wen Hao kicked Zhou with the king, ending the situation of \"two kings.\"\n\nZhou Ping's first year (770 BC), due to the destruction of the war, although the dog is withdrawn, it is still nearby. So Zhou Ping Wang was in the escaper (Cheng Zhou) of Qin, Jin, Zheng and other princes. East Week started. Since the historia in the later generations often divide the East Zhou period into two periods of Spring and Autumn and Warring States, this period is also called the Spring and Autumn Warring States Period.\n\nBecause Zhou Wanghou gave up the Guanzhong area, the strength is not as good as before, it is not only unable to control the princes, but also rely on the supply of princes, mainly Zheng, Wei Guohe Jinguo, and the Warring States Period is Wei Guo and South Korea. The position of the week is thousands of foots, only the virtual name of \"the world's common\". During the Spring and Autumn Period, Zhou Wanghou also had a little call. During the Warring States Period, there was no appeal.\n\nThe interior of the week, and the criminals are occupied by the tribes such as dogs. When the King of Zhou Qings, Qin Yong was fighting from Qin, and he fought and retired dogs, but he did not rescue Zhou Qings. However, Qin Yong's heroic and loyalty got the affirmation of Zhou Ping Wang, so as a prize for the Qin people's work, Zhou Pingzhi gave the Qin Yong, and the vassal of Qin Zhou Wang Room was the prince, Qin official Be a vassal country. After Qin Yong, Qin Wen's father and son's team, basically, basically recovered. After the East Week, Zheng Guofang, Zheng Zhuang Gongzi took the Dynasty. They use the favorable conditions of the Dynasty Dynasty, often borrowed the king of life, so that Zheng Guo became a strong country in the early years of Spring and Autumn, known as Xiaoba. Because Zheng Zhuang Gonggong is too great, and often busy with his private matter in Zheng Guo, rarely enters the law, even if it is entered, it is only a mount, or does your own private life. This caused dissatisfaction with Zhou Pingwang. So Zhou Ping gradually tried to differentiate the power of Zheng Zhuanggong, which caused Zheng Zhuanggong's strong dissatisfaction. Zhou Ping Wang must rely on Zheng Zhuanggong in many things, so I have to explain to Zheng Zhuanggong, so I have happened to Zhou Zheng's incident. \"Zuo Zhuan\" has made strong criticisms in this incident, \"letter is not in the middle, the quality is not good.\" The \"unbelievable\" in the explanation; and believes that Zhou Wanghou and the princes are interchangeably, it is from itself. Explain the \"rude\" essence of communication. Therefore, this event is considered to be the epitome of \"league.\"\n\nIn the first 720, Zhou Ping Wang Wei, Zhou Dynasty preparations to the committee, replaced Zheng Zhuanggong. Zheng Guo has harvested Wheat and Cheng Zhou, and Zhou Zheng is further deteriorated. In the first 717, Zheng Zhuang was in the DPRK, Zhou Yang Wang took Wang Yan's wheat because Zheng Guo arbitrarily led the army, and he did not accept Zheng Zhuanggong. Zheng Zhuanggong is not full of Zhou Wang's practice. Two years later (the first 716) without taking the Times Wang and Luo Guo exchange territory (the agreement was implemented before the first 711), but in the same year, it was in the same year.\n\nIn the first 706th, Zhou Yang took back Zheng Zhuanggong's power in Zhou Dynasty, Zheng Zhuanggong did not see Zhou Yang, so Zhou Yang organized the coalition to attack Zheng Guo, but was defeated by Zheng Guo. It is for the battle of Zhao. Since then, Zheng Zhuang Gong and Zhou Wang have no longer have a large-scale contact.\n\nIn the first 770 years, due to the invasion of the northern nomadic tribe dog, Zhou Ping Wang Dong moved to the middle of the Yellow River (now Henan Luoyang), East Week began. Since then, the influence of Zhou Dynasty gradually weakened, replaced by a large and small and less than one hundred small countries (the vassal states and affiliated countries), and the history called spring and autumn. There are more than a dozen countries in the Spring and Autumn Period, including Jin, Qin, Zheng, Qi and Chu, etc. During this period, the war was constantly, there were five countries to dominate, chi, Song, Jin, Qin, Qin (another said it was Qi, Jin, Chu, Wu, Yue), and known as spring and autumn five.\n\nThe first dominating Gui Qi Qi's public use Quan Zhong, in China to implement reform, and make the class contradictions and fierce Qi Qi, and gradually be strong, many princes are in worship. Qi Guo led the nine allies to attack the Zhou Dynasty's Chu, Chu Chengwang was forced to be. After Qi Gong's father died, his five sons were fighting for national monarchs and lost their hegemony. Song Yugong once tried to dominate, and then defeated the Chu army.\n\nJin Guo son is on a chaos, and it is the Jin Wengong. Jin Wengong implemented reforms, so that the power of Jin State has developed to the Central Plains, producing friction with the Southern National Chu State. After the Chu Chu Guo, the soldiers were squatting, and Jin Weigong was divided into Qin, Qi and Song Sanyi, and became the Sino Planer. The Qin Qin Qin Mu Gong, who has been in Jin, who has gone ambition in Jin Wen, and has repeatedly waited in Jin Dynasty, and finally the victory of Jin Dynasty, so on the west, some of the west Extinguish, make Qin Mu Gong become the hegemon of Xiqi.\n\nAfter Chu Chengwang's Sun Zizhuang king, he once again competed with Jin Guo, Chu State siege to Song, Zheng, Jin State sent a few times to save, and defeated. Many Central Plains countries are powered to Chu Chu. Chuzhuang King became the Sinopeter of the Central Plains. After the death of Zhuang Wang, the king of Chu, the two generations of Pingwang were gradually weak. Wu Guofei in the southeasfang is very popular, and defeated the Chu army, captured Chu Guodu, Shouchun, and the king of the Lang Zhaowang League Qin Qi, Wu, Wu Bing withdrew from Chujing. Dingguo (now Zhejiang Shaoxing) crossed Wu Jun Yuanzheng, he attacked Wu Guo, defeated Wu Jun, Wu Wang Yan was shot, and the child of the post-hunting and the avengement, the victory, the winner, the prisoner of the prison. Wu Guo also sent troops to the country. Union with Lu Guo will defeat Qi Guo, but also attack the country, but In Huang Chi, the Jin army was defeated, and the Yue Wang got was hit by Wu Guo. After nine years, he gave himself to Wu Guo. Then, in the north, Qi Qi, Jin and other princes. After the death of the got, the Vietnamian weak, the Warring States is destroyed by Chu Wei.\n\nDuring the Spring and Autumn Period, the twenty-eighth cums were determined;\n\nThe people in the Spring and Autumn Period will create a well-fired chariot and cavalry equipment. At this time, China's metallurgical is also very developed. It can create a fine iron. There are various irrigation machinery in agriculture, which greatly improves production efficiency, thus lays the foundation for future population. . There is a history of Spring and Autumn (Zuo Chuan), Mandarin, and War and National Defense.\n\nThe academic thinking of the Spring and Autumn Warring States is relatively free, and the history is called a hundred family constant. There are many thinkers who have a far-reaching influence afterwards (including hundreds of people), such as Laozi, Confucius, Mozi, Zhuangzi, Mencius, Xunzi, Han Fei and others. There are many academic genres, more than ten people, namely, homes (nature), Confucian (ethics), yin and yang (star icon dreamer), Fajia (rule of law), famous (rhetoric debate), ink home (love non-attack), hunter (With the director of each family), farmhouse (Junmin Tonggong), the novelist (Taoist said), etc.\n\nIn the Spring and Autumn Period, the earliest poem episode (also known as \"poetry\" or \"three hundred\") in culture. The outstanding military fellows in the history of war have Sun Wu (with \"Sun Tzu\"), Sima Hao (with \"Sima Fa\"), Sun Hao (with \"Sun Wei Fan\"), Wu Qi (with \"Wu Ziying Law\") , ((With \"子\") and so on.\n\nAround the first 546 years, the battlefield of the Yellow River Basin is basically over, Jin, and Chu's two countries.\n\nIn the first 403, Jin State was divided by three door valve Juyi, became Han, Zhao, Wei Sanzhu, and Shi called \"three partial Science\". In addition, Qi Guo, who ginger, was replaced by Tianshi, and Yan Tian Qi.\n\nHan, Zhao, Wei, Qi, Qin, Chu and Yan, called the Warring States Qixiong, the Warring States Period officially begins. Most Marxist historians start the Warring States to feudal society, but most of the West and Taiwanese scholars will also have the collapse of feudal society, which is caused by different definitions.\n\nIn the early years of the Warring States, countries have begun to change the movement, among them, the Wei Guo, who is in Li Wei, first rise in Wei Wenhou, Northern Korea, Zhao, Zhongshan, Dongzhi, Song, Nanda Cota, Xiqiao, became a strong country. Qi Dang has risen in Qi Wei, two attacking Wei Guo wins, and long-term tenure. The Chu State of the south is strong after Wu Qi changed, destroyed Chen, Cai, Yue, and expand the territory. Zhao Guo passed the Zhao Wuling Wang to take a strong army, and Qin, Qi, and Chu. South Korea, Han Zhaohou, appreciates the Master of the Fas, and gradually emerged.\n\nIn the first 356, Qin Xiaogong, Qin Xiaogong, who used the Fa's business, and the Qin State power has greatly enhanced, so that other six countries fear, the famous Sushu Qin tour all over the six countries, convince the six countries and monarch jointly with Qin, Qin State but With Zhang Yi as the phase, the six countries succeed in Qin, destroyed. Song and Lu and other small countries were destroyed in the late Warring States. After the inquiry is destroyed, Qi State is the strongest country in Shandong Six countries. It has begun to be self-satisfied. It almost destroys Yan Guo, claiming to be the Emperor, and attracting the behavior of the Song Dynasty to make the princes, and under the leadership of Yan Guolong Leyi. , Yan, Han, Zhao, Wei, Qin five major army returned to Qi, the attack is the city Linyi, and after the country, I used the fire to drive away Yan Guo, and I was the country. Decline, Qin State basically forms an overwhelming advantage in Shandong Six countries.\n\nDuring the Qin Zhaoyu, Qin State began to launch a large-scale battle for the six countries, using Fan Yu's far-signed approach, appointed the generals to launch a battle, through the battle of Yizhen, the battle, Huayang Battle, Changping Four The big warfare sweeped Shandong six countries, laying the foundation of Qin Guo's unified world, Qin State finally under the rule of Qin Shihuang, in the first 221st, in the first two countries, completed the unified, China's history entered a new era.\n\nIn the history of science and technology, Mozi, there is Luban in the history of architecture, first inventive Wames, laying the basis of China Building Technology.\n\nThere is a poet who has appeared in the history of Chinese literature in the history of Chinese literature, and he has a literary work such as \"Chu\", \"Lai Sao\".\n\nThe Qin Dynasty was from the Qin State of the Zhou Dynasty. In the first 770 years, Qin Yong is active in the East Zhou Zhou Wangdong, which is blocked in the Guanzhong Plain and established Qin State. The Qin State gradually became stronger during the Warring States Period, and the Qin Wang Zheng was once again attacked six countries (the first 230 years to the first 221) and the world will establish the Qin Dynasty, end the Warring States Period, China has entered the unified era.\n\nQin Wang Zheng established the Qin Dynasty to claim \"the Emperor\" (ie Qin Shihuang), since then China has the title of the emperor, and launched a series of reforms to consolidate the empire. Then, Nanzheng Email, the Northern Expedition Hun. The territory is from the east of Liaodong, west to Linyi, North to the Great Wall, South Dagong County (north of Vietnam). Although Qin Dynasty's appearance is very strong, because Qin Shihuang is collecting power, excessive development, serious labor of the people, the rule of Qin Dynasty will not have a harsh, violent characteristics, so that the people will suffer from harsh bustics. The last thing I left in Qin Shihuang is an empire that has a foreign country. In order to consolidate the vastness but cultural empire, the Qin Dynasty, in terms of political, military, economy, transportation, all implement policies and reforms. The political system is the central centralization system based on the Emperor system, the three gumsteps and the county and county. The emperor of the monarch has the highest power, and the prime minister is just assistance, and the law basically continues the Qin State law. In order to reduce the differences in various regions, Qin Shihuang pursue the book in the same kind of book (in small as a text), the car is the same rail, the unified currency (Qin half) and the measurement. Military, building the Great Wall to consolidate the North, destroy the four-day Great Wall and Chengtun, etc., confiscate the world people weapons, cast into two golden people, and have five east pactions to strately in the region. In terms of transportation, construction of transportation facilities such as Chonda and Spirit can make the army to travel to all localities, and also have transportation materials in various regions. The Policy of the Economic Aspects, the Continuity of Commercial Changes. Improve heavy agricultural compressors, encourage farmers to increase food, and even have the opportunity to win. In terms of industry and commerce, salt iron monopoly is implemented, but it is not completely banned, and it is also encouraged businessmen who have worked as a widow of the Banda of Dan Sand in the operation of animal husbandry. Political ideology is based on the Magistra for the respect, implement the integration \"method, the operation, the law is fundamental, combined with fool as a means, the spectacular trend) three-in-one monarchic autocracy, and the five morality of the yin-yang family is always Say to the emperor of the emperor. Religion is the traditional worship of the ancestors, the sky, the gods, the gods, and the witchcraft, divination and horoscope, and the gods of the gods are superstitious by the Qin Shihuang. In order to clamp the people's thoughts to avoid rebellion, and retaliating the Qin Shihuang's squares, the Bench of the Emperor, this is a great hunger of the pre-Qin culture and the hundreds of people.\n\nAfter the death of Qin Shihuang, Zhao Gao, Zhao Gao and Li Schi did not fill, and took the power. Zhao Gao is the master of Hu Hai, and the brother of Qin Shihuang is not satisfied with the brother of the Mongolian, and Li Si is dissatisfied with the Montessor. They support Hu Hai for the prince, assume that the order is given to the Susu of the Jiuyuan Director, and the history is called the dunes. They waited until the East Tour army returned to Xianyang, Hu Hai was also in the emperor, that is, Qin I. Qin Erchart was placed by Zhao Gao, he gave a dead brother and killed hundreds of brothers and sisters. The Jiujun army of the Mengyi also took over the king. Qin II indulge in the sound dog horses, raising countless dog horses and animals; recruiting criminals and people, and continued to build Afang Palace and Qin Shihuang Mausoleum. The Qin Dynasty politically chaos, Zhao Gao took the court, blinded the emperor, control the monketeers, and said that the deer is horses. In the first 208, Li S was framed by Zhao Gao, in Xianyang waist, and the three tribes. In addition, the people had passed, and 300 times in the ancient times were in ancient times. The old six countries do not want to be strictly tormed and countless labor torture and countless labor in the same year. In the first 207th, Liu Bang and Zhang Liang will take the East of Luoyang and then won Nanyang, Dingwuguan, and enter the customs. At this time, Zhao Gao took the prime minister, because of fear Liu Bang, life and killing Qin II, changing the child for Qin Wang. At the same time, Liu Bangjun defeated Qin Jun in Lantian, and the army was hegemon. Qin Wangzi's baby killed Zhao Gao, and surrendered with Liu Bang in the sorrow, Qin Dynasty. After Liu Bang entered the main relationship, the abolition of the stringent Qin method, and the three chapters of the people's approximate law were heard from the Qin people. The first 206 to the first 202, Liu Bang and Xiang Yu broke out the war for the world, and the history called \"Chu and Han Zhan\", and finally Liu Bang wins.\n\nThe Han Dynasty was the first era of China's first in Wenzhi and the international reputation, and it was also the first dynasty of the Chinese history to go to the middle of the ancient times. It has an important key position and representation of the ensemble. Due to the short interrupt process of Wang Hao Temple, it is divided into Western Han (also known as the former \"and Eastern Han Dynasty (also known as Huan).\n\nIn the first 202, the Han Gaozu Liu Bang was officially called the emperor, and the country \"Han\", the Western Han Dynasty. After the Han Gaozu Liu Bangguan, the advice of Shu Sun Tong was adopted, restored the gift, and set up three gongs and Jiuqing. Appreciate Xiao He Zhen Xiang, take Huang Laozhi with the people, and encourages production and lightness. After the emperor, the except of the princes of the princes, so the Hanyi has been eloquent, and the death of the surnamed Wang has been removed. After Liu Bang and the hero, the white horse is also swept: \"Non-Liu's king, the world is hit\", the history is called \"Horse Oath\". The government officials in Han Early are basically served by the big ministers, thus forming the political landscape of Hanjie \"Boxing\". At this time, due to the moon for many years since the end of the Qin Dynasty, the national strength was weak, leading to the Han Gaozu Liu Bang when he recovered the river set area occupied by the Huns of Qin, and was homoked in Bai Dend, which was covered by Bai Deng, since then, Han Using and pro-policy. After Liu Bang and Liu Ying died, Lu was honored, Zhu Lu, and wanted to Wang Zhu Lu. With Chen Ping, Zhou Bi is also prepared, and is also united with Liu Royal. After the death of Lu, the hero and the royal family immediately sent a man, launching the coup, and heaving the grandmother of the Shandu Liu Hong, and the fourth child of the Han Gaozu Liu Bang Liu Heng is for Han Di.\n\nDuring the period of Han Wenmi and his son, he continued to take Huang Lao's means of impunity, pursue the policy of \"nothing\", and implemented light thin, and struggled and the people's rest policies, Enshi, to make up for the Dinner Civil Change of Qin The enormous damage caused by the many years of turmoil of the Chu and Han war, which has greatly reduced the people's burden. When Han Wenmi is in place, there are problems such as the princes of the princes of the princes and the invasion of the Huns. Han Wenmi takes these problems to take unusual and effective techniques. During the second year of Wen Dynasty (178) and twelve years (the first 168 years), the \"half of the rental tax\" is half-rented, that is, the lease rate is ultimately reduced to thirty tax. Wen Emperor is thirteen years, but also all-in-day rent. At the same time, it is not easy to send troops, peacekeeping to the surrounding hostilities, so as not to consume national forces. This is the policies of light and thin. Emperor's life is also very frugal, and the indoor car riding clothes did not add, and the clothes did not smear, and the accounts were not embroidered, and the county was banned from contributing the singularity. Therefore, the national expenditure is controlled, and the aristocratic bureaucrats don't dare to be extravagant, thus reducing the people's burden. This is the policy of recupping.\n\nShortly, the Si Di was so long, and he adopted a wrong suggestion, he cut the seal of Zhu Fusheng, triggered the concerns of all the countries, and burst the \"Seven Kingdoms of the 1944 BC\", Han Jing Emperor Kill it wrong, to send the purpose of saving the rebellion. However, the chaos of the seven countries did not ease, Jing Emperor appointed Zhou Virk to betray, and in March, the power of each vassal country was greatly weakened. After the chaos of the seven countries, Jing Emperor began to take care of the political affairs, and said that Jing Emperor is very simple and benevolent. In addition to the chaos of the seven countries, there has never been used in large-scale soldiers, and the War of the Huns has always been controlled within a certain scale, and it is still adopting the Huns and pro. While maintaining peace with the Huns and South China (South Guangdong), it is also actively prepared for the national strength, through the measures such as Ma Fu orders; this period is called \"the rule of a scene\", which is China has become a big Empire era, A period of praise by traditional historians.\n\nAfter the Jing Di drued to drive, his son Liu Che is like the Han Dynasty. During the position of Wu Emperor (in the first 141 years - 87 years), it takes a series of reform measures, and forces enterprising, making the Western Chinese politics, economy and military integration. In terms of politics, Emperor Wu has strengthened the emphasis on the Emperor of the Emperor, and the year \"Jianyuan\" was established in 140 years ago. The year is called \"Jianyuan First Year\", and opened China's annual number of years old, adopted the advice of the master. , Implement the force, weaken the power of the princes, since then, the power of the princes will no longer make a threat to the Central Chart; then, the golden color of the princes is not purely, and there will be more than 100 Jobs. \"That is,\" 酎 金 失 \"in the history book. After this secondary event, the central focal power is greatly strengthened. Culture, before the abolition, \"Huang Laoxue said, nothing to rule\", and adopted Dong Zhongshu, \"Suscitation, Supreme Confucianism\", so that Confucian thinking has gradually become China's \"mainstream thinking\" in China . On the external relationship, actively deal with the largest kid of the Western Han Dynasty. During this time, there was an outstanding name of Weiqing and Huo to go to the disease. After decades of military, Zhao Emperor, Xuan Emperor three Dynasties, finally defeated the Hun of Hun, so that he \"indifferent no Wang Ting\"; also swallowed the South Vietnam, discussing North Korea, Make the Han Dynasty became the East Asian Overlord at the time. In the diplomacy, two factions of Zhang Wei made the western region, opened the Silk Road, and met with two princess Liu Qijun, Liu Xinxiang and the west of the western region, and then the purpose of the Western Region and the purpose of the Western Region. The Emperor Wu of the Han Dynasty religious witchcraft in his later years, listening to Jiangfu words, leading to a famous \"scorpion of the witch\", and the prince Liu is forced to kill Jiang Chong, and the result is dead, the Queen's guard is therefore suicide. Afterwards, Wu Di also regretted, and built a look to mourn the Prince.\n\nAfter years of foreign war, Western Han Dynasty war, the accumulation of the treatment of Jingjing, the economy suffered huge impact, and the national strength also had a recession. To this end, after the disaster of the witch, Han Dynasty published a famous \"Wheel\" with the expeditionary army's loss, no longer pursued the policies of poor soldiers. In order to boost the economy, Wu Emperor will cast a coin, salt and iron, strengthen agricultural production, implement and discipline, cut white channels, and create allocated, horizontal policies, unparalleled sales, intervene, and strengthen the country in the economy The role, this series of policies makes the Han Dynasty to avoid entering the decline.\n\nAfter the death of the Emperor Wu of the Han Dynasty, the child of the hook, Liu Fusing, only eight-year-old Liu Fuling, is for Han Zha. At the beginning of Han Zhaodi, the three people were jointly academified by Shangguan, Jin Ji and Huo Guang. But in Yuan Fengyuan (the first 80 years), the fire is killed, and Shangguan is killed, Huo Guang has been exclusively. Huo Guang continues the policies of Wu Emperor in his later years, to rest in the inner, relax the salt iron monopoly system, and improve the status of Confucianism. After the death of Zhao Emperor, Wu Ji Sun Changyi Wang Liu Xi is in place. His behavior is indulgence, plotting to eliminate Huo Guang, but it is abolished by Huo Guang. After that, Huo Guangye has allocated Liu's disease, it is for Han Xuan. In the first year of this year (the first 73 years), Huo Guang also politiced to Xuan Emperor. Two years (first 68 years), Huo Guang died. Since then, Xuan Emperor will take the Hob Group. However, Xuan Emperor continued to pursue Huo Guang's governance route, vigorously rectify the rule of law, persuade the people, inhibition, and reduce the role of the country in the economy. During this period, the Han Dynasty was not only the internal affairs in the Ming Dynasty, but also for the Huns to continue to maintain strong, set up Western Regions in the two years (the first 60 years) to strengthen the contact and control of the regional area of ​​the Western Region. After the recuperation of Zha Xuan Emperor, the national economy was distinguished from the difficulties of recession in the mid-Division of Emperor, called \"Zhao Xuanzhong\".\n\nAfter the death of Han Xuan, the Han Yuan Emperor Liu Wei is in place, and the Western Han is beginning to fading. Yuan Emperor \"Jou Ren, Confucianism\", for social order Take a indulgent attitude, often ordered a big pardon, leading to the thief, the land is increasingly serious, but also causes the imperial power to rush to the mutual power. After he died, Han Cheng Di Liu Wei was in place, and he got a good woman. He won the love queen, and his sister (Zhao Feiyan, Zhao Heide). Zhao's sister could not give birth, and thus hated other people who can give birth to their children. The children of Cheng Emperor and other 嫔 嫔 为 死 死 死 死 死. 死 死. 死 害 害.. 死....... Due to \"wine color invasion\", Yumi finally died in \"gentle\". Because of the rise of the Emperor Hui Zhengzheng, the rise of the exterior Wang's group, the family power of the Empress Dowager Wang Zhengjun expanded. After the death of the Emperor, Liu Xin, from the son of Ding Tao Wang, was \"broken emperor\", and the Dong Xian, who is a petition, and the power of the foreign king's power is once compressed. At this point, the country is already a final image, and the folks \"reappear\" statement. Yuanshou is two years (1 year) August, the emperor died. Taihuang Queen Wang Zhengjun sent Wang Hao to take Dong Xiancheng to become a big Sima, and greet Zhongshan Wang Liu Wei, which is the beginning of Han Ping, reformed the element. However, Liu Wei has become Wang Hao's embarrassment. Five years later, Wang Hao was only 14-year-old, and greeted the prince Liu Ying, \"孺子\", as \"fake emperor\", January 9, January, Wang Hao force forced the baby to retreat, tamper the end.\n\nAfter Wang Hao (foreign wealth), we announced a series of reforms and changed the country. However, these reforms are often unrealistic. In 23 years, the new dynasty was overthrown by Liu Xuan, Liu Xuan became more, but his incompetent corruption, plus the confusion of the green forest army and the Red Red Red Red army, so that the Han Dynasty Room Liu Xiu was taken. In 25 years, Liu Xiu Fu is Han Dynasty, Dingdu, a history called East Han, and he is called Hanguang Wudi.\n\nXinyu Tianfeng five years (17 years) green forest uprising broke out, 23 years, Wang Huan's political power has finally destroyed in red and green forest. In February of the same year, the Green forest army supported the Hanzong Room Liu Xuan as an emperor, restored the national number of Han, and the annual number is more. In the 25th year, the red dragonfly Liuhua was the emperor, and then defeated the Green Lin Army, and the Emperor Liu Xuan surrendered to the red army. Usually Liu Xuan is considered to be the last emperor in the Western Han Dynasty. In June for three years (25 years) June, Liu Xiu, who was originally observed, and the south of Ji County (now the southeast of Hebei Gaochun), is the Emperor of Guangwu, destroyed Liu San, still along the Han The national number, in this year, the first year of Jianwu, Ding Du Yanyang, Shi Yanyan. After that, after 37 years, it is finalized by the red eyebrows, 隗 隗, 公孙, and the whole country.\n\nHiguang Emperor Walescent Affairs, Jianwu for two years (26 years), Guangwu Di ordered the rectification of the rule, and set up six people in the country, further weakened the power of three male (Taiwanese, Siki, Sik) and strengthening the centralization; At the same time, the land, new tax system, revitalize agriculture, so that people's life is gradually stabilizing; in addition to Confucianism, establishing too learning, setup five-class doctors, is a commendation, so the scholars are fighting for the name of the name, For the beautiful political and religion, lay the foundation; the strategy of the defense of the Huns and other external forces, it is controversial to abandon the western region, and the foreign worry is restricted, and the history is called Guangwu ZTE. However, due to the sealing land, it also caused the land to be increasingly serious, and the local prosthesis is rising, and the end of the Eastern Han Dynasty buried hidden dangers.\n\nDuring the period, the Han Ming Emperor and Hanzhang were in the period, and the Eastern Han Dynasty entered the whole day, and the history called \"the rule of the chapter\". During the period, Dou Gu took the class to make the western region, the class super in the Western region, not only good at using the force to use the force to determine all countries, but also to use diplomatic means to contact the country. However, the Huns also launched similar actions to overthrow the political power of all countries, and alliance with new regimes. The two sides constantly repeatedly attacked and defensive, and after 20 years later, the class of class Chao was completely controlled the Western Region. Chapters and two years (88 years) October, the car ride Douxian leaders out of the army, broke the North Xiongnu, Deng Yan Ran, to let the class work together, history is called Yanyran. Two years later, Yongyuan three years (91 years) Dou Xian sent a soldier again, and five thousand miles to attack Jin Weishan, the big breaks the North Hung Shu, the next five thousand people, the prisoner is in the north, the emperor, The Northern Single was finally refused to end, and since then, he went to the threat of the Huns on the border of the Han Dynasty in hundreds of years, and the Han Dynasty was once again arrived at the Han Dynasty; Buddhism also passed into China at this time. However, in the late chapter, the foreign abroad is increasing, uncovering the sequence songs of the two majors of the Eastern Han Dynasties and the eunuchs, and the Eastern Han Dynasty will last more than 60 years.\n\nIn 88 years, only 31 years old Hanzhang suddenly drunk, when only ten-year-old Prince Liu Zha is, for the Han Han, he is in the beginning, and in fact, the political affairs is manipulated by Dou Que, and the national politic is increasingly corrupted. Dou 's 扈 和, shortly, only 14-year-old and emperor will capture the downside, the weaken of the weaken, and the Emperor's credit, from this Eastern Han's politicity is a battle for the two majors of the Eastern. However, the emperor is still very diligent in political incident, and it is not the master of implied. In the middle of the year of the Yuanxing, he was only a seven-year-old and emperor who had been seven years old. Little Mon Liu Long, who was born only 100 days, was for the emperor. The Emperor is only driving in 8 months. Insignate, it is the son of Qinghe Wang Liu Qing, An Emperor Liu Wei. He is the early Deng Yi, a charm. Dressed after Diligence and saving, appreciates Xianliang, and the power of his family is constrained, but it also condenses the 宦 宦. In the first year of the Guangdong (121), Deng Jia was dying, An Emperor's pro-government, killing Deng's family. An Emperor relies on the strength of the eunuch and the 阎 宦. Listening to the traitor, there is no joy, and the political governance is stunned, the Eastern Han is fast to declap. In the past four years in March, Hanan Emperor died in Ye City in the South Tour. The foreign mini is not mourning, and the Han Zhang Emperor Sun Ji North Wang Liu Shouzi Liu Wei, Shi is called Han Yong Emperor, and it is sick in the position of only more than 200 days. After the young emperor died, the family was conspired to make a jade, and he was hit by the Chinese and sages, and the family was killed. Sun Chengye Ying Ji Yin Wang Liu Bao is for Hanshun Emperor. In the early days of the Emperor, the martial art power expansion, but triggered rebound from all walks of life. Yang Jia first year (132 years), the noble Liang Li was the queen, from now on the rise, Liang Wei's brothers Liang Si were appointed as the general army. Hanan Second Years (143) August, Shun Emperor Due to death, the Prince Liu Bing is in the emperor, it is only 2 years old, which is just 2 years old, and Liang Taishi is ruling. Yongjia's first year (145 years) June 6, Liu Bing took the year, only three years old. On the 5th of the first month, Liang Yu surrounded Liu Wei, it was the emperor. The Emperor is very intelligent, saying that Liang Si is \"扈 扈\", as a result, the emperor is killed by poisoning.\n\nOn the seventh day of the first year of the first year, the generals of the generals Liang Weizhi Lu Zhi, the chapter of the emperor, is for Han Di. The emperor is less, so it will continue to be governed by Liang Eastward. At the beginning of the Emperor, Liang Si's forces had a border, and he was dismantled, and it was full of private pins. The Emperor was also very dissatisfied with him, and Yan Di sent a soldier in the early August. The Shan Di soldiers surrounded by Liang Zhai, Liang Yi and his wife double suicide, Liang Shi's 土 土 解. The Emperor became a new power center. Super, Xu Wei, Tong, Zuo, Zuo, Tang Heng five people were sealed as the county; single overspeaking 20,000 households, and then sealed as a car ride, thousands of other four thousand households, the world . Five-story greed, ending in the nine years (166), the first party. Yongkang's December 28th (168), Han Di drued to drive. The emperor did not leave the child, and Zeng Sun, who was opened by the river, was a place for Hindi. At the beginning of the Lingdi to the beginning, the extension of the Dou Too, Dou Wu is the fierce power of the martial arts that is headed by Cao Festival and Wang Hao. Yongkang's second year, the eunuch launched the coup, killing sinus martial arts, Dougai's loss was placed, and the external thoughts were weakened. The officials in the second year of Yongkang (164) were manufactured in the second party. And the Emperor I arrived, and I fill the fiscal public seller and polished.\n\nDecade of politics and the people's livelihood of the Han Dynasty, and finally burst into the chaos of the yellow towel, the Huang Towa army, which broke out by the Cape Taiping Road, \"Heaven, the Huang Tian; Heaven\" The call called 10,000 people participated, although the rebellion told that the Eastern Han Dynasty was strongly reduced. The key is that in order to betray and put military political power to the state animal husbandry in order to betray. All over the world have begun to slowly support the soldiers, and their original has been strong and economic strength, and eventually evolve into one party in the end of the Eastern Han Dynasty, and the top of the group. After the death of the Han Dynasty, the generals of the foreign nephew He Jin and the officials were ferrous and dead, and finally ended the argument. However, after Dong Zhuolia, the Wastey Emperor Liu defeated Hongnong Wang, re-entered the Chen Shu Wang Liu Xie, and burned Luoyang, Capital. After the death of Lu Bu, Dong Zhuo was killed, after a few years of war, there was a chairman of Cao Cao, Yuan Shao, located in Hebei, is located in Huainan, Yuan Shu, located in Jiangdong, is located in Jingzhou Liu Tang, located in Yizhou Liu Yan and other forces. Among them, Cao Cao's \"天子\", overhead Han Room power, destroyed all roads, and destroy the main force of the most powerful enemy in the battle of Guandu, basically unified the northern China.\n\nHan Xi Emperor Jian'an thirteen years, the third government official, reset the prime minister, Cao Cao Xiang Xiang, monopolism. Cao Cao played in the south, but was defeated by Sun Quan, Liu Beijun army in the battle of Chibi, and Cao Cao returned to the north. Soon Liu Bei's fundamental, in Yugang, Cao Liu, three points, began to form. During this period, Han Di is just a embarrassment of emperor, the court is in the hands of Cao Cao. Cao Cao first was Jinzheng as Wei Gong, soon Jin Zhan Wei Wang, violation of Hao Gaozu's \"non-Liu Shi, king, and the world to hit the white horse\". Liu Bei also promoted the Hanzhong Wang and the Eastern Han Dynasty arrived in the name.\n\nJian'an 25 years (220 years), the spring is the month, Wei Wu Emperor Cao Cao died, and the world Cao Yu followed the Han Xiangxiang, attacked Wei Wang. In November of the same year, Cao Yuzhen, forced the Han Dynasty \"Zen to let\" the Emperor, the Eastern Han Dynasty, the Han Dynasty in more than four hundred years also officially ended, the three era officially began. After Wei Wenyi, Cao Yu, Han Zhaili, the Emperor Liu Bei, announced that inheriting the Han Dynasty, established a regime that used Han State number, and called Shuhan. Although Jiangdong Sun Quan is autonomous, it is independent, and after a few years, Wu Damei Sun Quan also called the emperor.\n\nIn 220, Cao Cao's illness, his son Cao Yu, forced Han Dynasty, Zen to let the emperor are emperor, Shi called Cao Wei (220 - 266), to this Eastern Han Die, China History officially entered the three countries. Liu Bei, who is the main year, is also known as the identity of the Han Room, and the country is renewed to the Han, and Shi is called Han (221 - 263). Liu Bei and Sun Quan have expanded forces after the war of Chibi. In order to have a dispute between the two sides of Jingzhou, the last Liu Bei failed in the 222nd Yiling battle, Sun Quan won the vast majority of Jingzhou. Liu Bei was sick in 223, and Zhuge Liang, who was supported by Liu Zen, recovered the alliance with Sun Quan in the same year. According to Yang Quan to 229 years in Yangzhou, Jingzhou and Jiaodang, called the emperor, National No. Wu (229 - 280 years), Shi called Sun Wu or East Wu. Since then, the situation in the Three Kingdoms is mainly against Cao Wei, and the territories of all countries have changed. Although Gongshu Yuan's Ownership (237 - 238), it is just a flower. Cao Wei Chao Tin was completely controlled by Sima's hand after Gaopingling incident. In 263, Sima Zhao was preparing for the military and play, and the Wei Yan was killed, and he died. In 265 years, Sima Zha is dead, his son Sima Yu is scrapped Wei Yuan Di Shui, the national number Jin, the history called West Jin, Cao Wei died. West Diluted in 280, I launched the battle of Wuzhi, destroying Sun Wu, unified China. At the end of the three countries, enter the Jin Dynasty.\n\nSimma's period of the Three Kingdoms was Cao Wei Shi, and the Siming Malaysia had mastered Wei Guo's regime. In 265, Sima Yan was forced to Wei Yuanmi, Cao Xi Zen, the country, Jin, Tu Di. In 280, the West Jin destroyed Sun Wu and united the world, but the peace and stability situation only maintained a short more than ten years. After the success of Jin Hui, the court has been chaoting, and the princes of the military are struggling, and the history is called the chaos of the eight kings. After the Gong Dynasty is a big injury, the people of the people will take the opportunity to raise the soldiers, causing the situation of the five hustle, and the people started from the World. In 316, the West Jin Diped, the north has entered the period of Wuhu Baiki.\n\nIn 317, the Mission of the Jin Dynasty, Sima Rui, said that the Emperor Eastern Jin, according to the territory of China. The Central Plains and civilians have been sank of south to form a situation in China's northern nationals and indigenous indigenous. At the beginning of the Eastern Jin Dynasty, Wang Gui and others took the town to static and stabilize the situation. The power of the imperial power, the great power of the court was mainly mastered by the world. Due to the internal light of the military, the court has weak control, and many people were in the heart, and there was a chaos of Wang Dynasty, Su Jun. Although some of the people's authorities have the heart of the restoration, they have launched a few times before and after, but the court worried that the wild heart took this to expand forces, most of the negative support. In 383, the former Qin was dispatched to the national division, intention of exploiting death. In the face of the disaster of the dead country, the Eastern Jin Junchen will launch a victory in the battle of the Water. Xie Xuan and other generals will win the chasing, successful recovering a large number of vestigers, causing the former Qin to disintegrate, and triggered the changes in the northern military and political patterns. However, the Eastern Jin Dynasty also took place to fight against friends and Xuan Xuan. The civilian burden is heavy, and Sun En, Lu Caica. The draft is also standing by it. Finally, Liu Yu is rising, stagnant, and with military power to win the emperor, enter the north and south dynasties.\n\nIn terms of economic, the proportion of Eastern Jin Manor is more than the West Jin. Due to the factors such as agricultural technology, under the intensive development of the Quan Quanyi Nationality and Wu surnamed, Jiangnan has been prosperous and prosperous, and China's economic center has gradually moved. Later, there is a large canal. In addition, there is also a great progress in handicrafts and business. Although Jin Dynasty has been in the end of Han Dynasty, there is a new development in philosophy, literature, art, history, technology and so on. Before the Han Dynasty, political sovereignty was completely in Huaxia, while other people were assimilated as a ruler; after the Han Dynasty, political sovereignty was not fully in Huaxia, and family or to conquer Huaxians, the grassland nomad brought by the frontier nation Culture is also integrated into Central Plains. At that time, the world was chaotic, and the East Hao's literati did not focus on morality, so that the Confucian declined. Some of the people who have witnessed that the digestion is not willing to open, and they will begin to make a lot of things, such as tutoring, and even gradually become a social atmosphere. At the same time, metaphysics began widely spread. Metaphysics and the Buddhist exchange of Buddhism in India have gradually been integrated into the Confucianism of Chinese culture.\n\n46 years later, the Eastern Han Dynasty often moved in the northern family of the frontiers in the way, and to monitor each group or increase the military source and labor. At the West Jin, the northern part of China, the eastern and western, especially in the state and the Guanzhong, a large number of Hu people and Han people. These Hu is gradually become a compilation of Han people, because they need to pay taxes, and when they are pressed against Hanguan or are discriminated against Han people, they have dissatisfied with the people. The outbreak of the Eight Kings, so that Jin Ting lost its influence in the place, Hu Tang was still rebellious. In 304, Li Ji Li Xiong was defeated by Luo Yishang and called Chengdu King, and also called the emperor in 306, \"Cheng\", 338, retrieving the country \"Han\", and the history is called Cheng Han. Liu Yuan, the Hun Yuan, who tried five Xiongnu, Wangshi Ma Ying, Chengdu. In 304, Sima Ying was sly sly singed, and Liu Yuan returned to the state. He took the opportunity to announce independence, called Hanwang, claiming to inherited the orthodox of Han Dynasty. In 308, Liu Yuan said that the emperor and moved to Pingyang, the national number \"Han\", said the former Zhao. In 304, it was established in Han and Han Dynasties to open the \"Five Hu Zhixiu period\". The range roughly covers North China, Land, Liaodong, the farthest can reach the North, Jianghuai and Western Regions. In the case of many nationalities in the home, many countries have been established in this range, and traditional historia believes that these foreign countries are mainly based on the Huns, Huabu, Xianbei, and 氐 氐, collectively referred to as Wuhu, will refer to Huawei.\n\nAfter the Western Jin Dynasty, the war in North China is flying, plundering and massacre. In this period, including the southwest of Chenghan, successively established 16 countries, the history called the 16th National Countries. The northern economy is seriously destroyed, affecting the development of China's social, economic, ethnic, cultural, political, military, etc. In the 311, Yongjia is gifted to the people, making people escape to Liangzhou, Liaodong, and Jiangnan, so that the economic culture in these areas is gradually prosperous, and the economic center begins to move. During the period of the crosses, the Queen of Qinchen was unified in North China, but in Nanzheng Dongchun, the battle of the water was defeated. After that, the various families in the Guanandong and the voids, plus the Eastern Jinbei Exotic, Qi Qin's comprehensive collapse, the north is again confusing. After the Northern Wei Dynasty, after the operation of Tuo Gui, Tuo Tuo and Tuoba, in the final 439, I entered the Northern and South Dynasties.\n\nFrom 420 Liu Yu Dongjin, Liu Song began, until the 589th, the Nanyan Chen, listed in Dongjin, Wuhu 16, under the Sui Dynasty. Because the north and south two trend have been opposed, it is called the north and south director. Nan Dynasty (420-1589) included Song, Qi, Liang, Chen and other four Dynasties; North Dynasty (439 - 589) included the North Wei, East Wei, Western Wei, North Qi and North Zhou and other five Dynasties.\n\nThe Southern Dynasty royal is mainly a cold door or a mission, because the military power is gradually mastered by the cold door or the mission, so it can make the throne. The initial economy gradually recovered, and the military power was strong. Due to the strategic error and the North Dynasty military power, the border is successively moved. The emperor and the room were often bloody for the throne. The Nanliang is improved by Liang Wu Emperor, so that the national strength is strong. In the old age, the country is unusually reduced by the Southern Dynasties, and the four-fold five cracked, the Oversteen of the Sudden Bund is completely collapsed. Although Nan Chen's Chen Wenmi is unified, the national strength has declined, and it can only be resistant to the North Dynasty. The Northern Dynasty was invested in the Wuhu Baiki and the emerging dynasty. The Northern Wei Royal Hue is the Xianbei, the Han officials are affected by the five Hu culture, and they are more married with the Men, and the Xianzhuang Royal Royal Royal Royal Royal Han has also been carried out by Chinese culture. The Northern Wei was taurse by the north, until the friendly Turkicon and then accepted the South Dynasty. In the late stage, the strength is caused after the chaos and farmers' riots. The Northern Wei Split is the Western Wei, the Western Wei, the Wen Wei, the Wen Wei, the West Wei, which is also replaced by Gaoshi North Qi and Yu Wenquan. North Qi is mainly composed of Liuzhen Group, and the early military power is strong. North Zhou Xiang Shuangjun is less than that, the political status is not as good as Chen Chen. Finally, the Guanyan Group pioneered by Yu Wentai, annexing the political increasing northern Qi. After the death of the Emperor North Zhou, Han people Yang Jian grasped the court. After the establishment of the Sui Dynasty, he was established for eight years later, he sold troops to China.\n\nCompared to the situation of the North Dynasty, the situation of all class opposes, the south chair of the economy continues to grow is relatively stable, and Yuan Jiazhi's treatment and the treatment of Yongming. The Central Plains population has continued to south from the chaos of the yellow towel and Yongjia's chaos, bringing labor and production technology. The prosperity of Jiangnan made China's economic and South to establish the Sui Tang Dynasty during the emperor. In terms of culture, the chaos of the world provides the freedom of thought to provide fertilizers, and puts forward pragmatic joining and no instructions. Create a unique opinion and theory of literature, art, and technology. Metaphysics, Buddhism and Taoism are very prosperous. Among them, Buddhism has driven the development of the grottoes, Dunhuang Mogao Grottoes, Maiji Mountain Grottoes, and Yungang Grottoes and Longmen Grottoes in Later. The foreign exchange is also very prosperous, east to Japan and North Korea Peninsula, west to Western Regions, Central Asia, Western Asia (Eran Hull), South to Southeast Asia and India.\n\nIn the early days of the North and South Dynasties are still the political situation of the world, and the social class is divided into the World, Qi people compiled households, indiscriminate people and slaves. The World has a large number of indiscriminate people who do not need to pay taxes to produce and combat, affecting the taxation of the court. Although the Emperor of the South Dynasties still needs the support of the mainstream, but also supports the Hanmen to balance the political force, and shoot in the imperial examination system in the south. The South Dynasty is gradually recession because of long-term comfort, and it completely collapsed after Hou Jing. The North Dynasty Hu is lacks political experience, so reusing the Han people, causing the cultural seeds of the two sides, and has formed a cultural mix, and the Hanhua Movement of Wei Xiaowen is the most in the might of the north of Wei Xiaowen. The mixed process produces a fierce ideological conflict, political struggle or racial conflict, such as six towns and civil changes, north Qi's haunt sports. The North Zhou established the policy of China, the integration of Xianbei and Chinese culture to eliminate Hu Han. After the unified day of the Sui Dynasty, he combined with the southern part of the Jiangnan and formed a new Han nationality, creating an open and inclusive Sui and Tang Dynasties.\n\nIn 581, Yang Jian rejected Beizhou established Sui Dynasty and Dingdu Chang'an (now near Xi'an, Shaanxi Province), Yang Jian became the Emperor Wen. In the 589th, the south chapter is united, and the world is unified. The Sui Dynasty was a five-haired Han nationality to re-establish the Dynasty Dynasty in the north, ending from the split situation of nearly three hundred years since Jin Yongjia. The Sui Dynasty is one of the greatest elements in history. The Sui Dynasty established an important system in politics - three provinces, creating far-reaching imperial examination systems, reforming the law; continued to implement and reform the preparation and reform of the government; In the economy, on the one hand, the security system and the rental modulation are implemented. On the other hand, it takes \"big rope appearance\" and \"ignitation samples\" and other measures to increase government revenue, plus the thrift of Sui Wen, which makes the national festival . Saving a lot of food in food, is the richest, national number, number of mouths and cultivated land in China, and has reached the level of the Tang Dynasty, and is statistically available. Five or sixty years. The Emperor Wen Dynasty was an emperor, and the history of this period called \"the rule of the emperor\". In the 610nd Daily Canal system, the Sui Dynasty was completed, consolidating the central government, strengthening the links between the north and south economies, culture, and the economic and political big one Dynasty dynasty. However, the Emperor Emperor has just been used in his later years, aggravating the penalty, laying the foundation for the destruction of the Sui Dynasty. After the death of the Emperor, his son of the Emperor mobilized a large amount of labor forces, on the one hand, there was a lot of work, on the one hand, and the poor and luxurious, in the year, the peasants were overwhelmed, which caused the Sui and Dynasties to demise. There were only 38 years in the Sui Dynasty, and it was another powerful and short-lived dynasty dynasty.\n\nThe Sui Dynasty was in the large year, so that the people of all parts of the country changed. Li Yuan saw chaos in the world, and the Taiyuan was tired in 617. Soon, I occupied the Daxing City. Li Yuan has an emperor for the emperor. In May, I forced Tang Dynasty in the same year, Jiang Dynasty, Tang Dynasty, Tang Gaozu. Dusheng Daxing was renamed for Changan. Li Yuan established the Tang Dynasty, the Tang Dynasty, the Tang Ganjun Li Mi, the Xue Yu, Xue Ren, Wuwei, Li Rail, Xue Renxi, Wuwei, and Luoyang Wang Shiqi, and Hebei Xia Duan Jiande. In the 623th, the Secretary of the Secret of Duaven, Duaven, Danyang, Tang Dynasty, was captured by Tang Jun, and the Jiangnan is flat. In the 624th, the Tang Dynasty was basically unified. In 628, Chai Shao led the army to eliminate the Turki, and the Tang Dynasty unified war ended.\n\nIn 626, Li Shimin launched the change of Xuanwumen. Li Yuanzen made the emperor and became the Emperor. Li Shimin has relaxed, that is, Tang Taizong. Tang Taizong Zhiji Zhi, Nash, gradually recovering the national strength of the Tang Dynasty. In the interior, Tang Taizong promoted the formation of all-in-law and rental and enhancing agriculture. In the system system, the system of retrofitting the Sui Dynasty has formed three provinces and the imperialism, restricting the development of the imperial power and the aristocratic attack. In addition, Tang Taizong adopted a positive defense, strategic with war war, and appealing the quartet. In the 627th, the Eastern Eastern Tongyu is Xue Yantuo, returning to the ancient, with the contrast part because of the decree and reform of the Khan Khan, have been separated, and the Xue Yantuo is sweaty, and the troops are also returned to Tang. towards. According to Liang Luoiren, Liang Luore, 628, was returned to Tang Dynasty. In 629, Li Jing rate the cavalry surprise attacked the East Turk, and the northern people in the northern part of the northern tribute, Zhimin people respect Tang Taizong as Tiankan. In the 635th, Li Jing took Zhujing Valley. In the 637th, the Southern Sudang West is captured under the west, 641 Wencheng Princess and Tuboz Puson praised the wedding wedding. These all stabilize the relationship between the Tang Dynasty and the Quartet. The national stability during the chaout period, the economy is restored and developed, and the history is called \"the treatment of chaise\".\n\nIn the case of Xi Xi Ziyu, the West Expansion of Xihai and the Aumi River is destroyed in 659, and the Ashu Guardu is set up in the huge guscal city (now Kyrgystoke Mark). And on the Western Sishling west, let the vomiting rolls, the kings of the Navaro, etc. Central Asian monarch and serve. In the East, with Xinluo, we will destroy the Northeast Strong National Gogi and Baekje, and defeated Japanese assistants. In the Korean Peninsula, the Tang Dynasty established Antong Guardu Guardian, and also indirectly promoted the New Year of the North Korean Peninsula. North Korea became the most important country in China after 1,300 years.\n\nSince 660, Gao Zong is due to health reasons, many political affairs have gradually handed over to Wu Zetian, and Wu Zetian has become one of the highest rulers, with Gao Zong and called \"two holy\". After the death of Gao Zong, the Prince Li Xian is in Tang Zhongzong. Wu Zetian soon will be the Chinese waste into the king, and the four sons Li Dan is the emperor, which is Tang Ruizong. Wu Zetian in 690 waste, that is, the emperor, changing the country, is Zhou, ie Wu Zhou, Duodu Ronang, and re-emperor. Wu Zetian became the only female emperor in Chinese history. During the power of Wu Zetian, the country has a greater development during the chance. Wu Zetin's later years, with an abstament of 705, the history called Shenlong Revolution.\n\n712 Li Longji is in place, that is, Tang Xuanzong. Tang Xuanzong period can be divided into two parts: Kaiyuan and Tianbao, which is clear about the political relatively clear period in the first thirty years. Tang Xuanzong put forward the military, Wei as a quite, and as a role model, as a role of ruling. He once again approve Yao Chong, Song Wei, Lu Huai Shen, Zhang Jiu Ling and Han Hu, and Guangyan said. For example, the advice of Zhang Jiubi is adopted, and the guidelines in the Beijing officials have been admitted to all supervisions and training administrative capabilities, and there will be a criticism of the capital. Enhance the communication, understanding and trust of the central and local. Cutting the exterior officials of the staff of Wu Zhou Zhongzong, streamline the organization to save money and enhance administrative capabilities. Strictly implement the law, inhibit weight, even if the royal family is crime, it also rope. A good impact on stabilizing social order. Strengthen the implementation of average field system and hit the might. Develop agricultural production, intensive water conservancy, expand the area of ​​cultivated land, greatly enhance agricultural productivity. In addition, improve the relationship between Tubo, East Turki, Qi Dan and 奚, implement and pro-policy. Listening to Yao Chong and Song Yu's suggestion, enrich the border defense military affairs, and avoid war with foreign countries. These measures of Tang Xuanzong have enabled Tang Dynasty to enter the whole day, and the population has grown a lot, the property is abundant, and the history is called Kaiyuan.\n\nTang Xuanzong changed to Yuanbao in 742. Tang Xuanzong is full of old age, indulge in enjoyment, handing the political affairs to Li Linyi, Yang Guozhong handled, and fosted Yang Guifei. In November 755, An Lushan was in the launch of Yang Guozhong, and his historical is called the chaos of the Sistance. Tang Xuanzong's emergency South escape, Chengdu, and the change of Ma Yu, Yang Guozhong and Yang Guifei were killed under the request of anger soldier. Prince Li Heng went to Lingwu Ferry. An Lushan occupied the Chang'an after Changan. In July, after Li Heng arrived in Lingwu, he was awarded the emperor in Li Fufang, namely Tang Suzong, and Xuanzong, Xuanzong as the Emperor.\n\nIn the 762, the Emperor Tang Xuanzong and Tang Suzong have passed the world, and the prince Li Yu (the original name Li Wei) is in the Tang Dynasty. The Tang Dynasty Zongmen Qi Ji Yue will receive the will, the servant Huai En is the deputy, and the Tang Jun and the return army are overcome Luoyang. Shi Chaoyi North Walking Fan Yang, the servant Huaihe Yuezhao, the Hebei rebellion will also surrender the Tang army, and pursue it together. In the first year of the first year, Shi Danyi was in the stone (now the Northeast of Hebei Tangshan), and the eight-year war is scheduled. The chaos of An Shi became a turning point in the history of the Tang Dynasty. The town is deployed, the foreign invasion, the officials are privileged with the cattle and the party, and become the internal affair of the Tang Dynasty. In the 779, Tang Dynasty was died in these chaos, and the eldest son Li was successfully located, that is, Tang Dezong.\n\nTang Dezong is quite fluent to rule in the early days, resolutely cutting the town, and the town is more awesome. He used Yang Yan to promote the two tax laws, with Liu Wei's reform, and modify salt law, and normalize the fiscal. But he is just a man, no one is clear. Tang Dezong once appointed the stunning, and the relatives of the official, the government day decline. In 805, Downten died, Prince Li Yu Ji, that is, Tang Shuzong. The problems left by the Tang Dynasty were getting more serious, and Tang Shuzong and Tang Xianzong did an attempt to solve it, including Tang Xianzhong's success, realizing Yuanhe ZTE. Most of the political power of the Tang Dynasty, most of the political power was controlled by the emperor and the prime minister, but after Tianbao, it turned into the union of the emperor and the inner court, and the exterior prime minister became political second-stream role. During Tang Xianzong to Tang Xuanzong, a longer party struggle was called the Bun Li Party.\n\nIn the death of Tang Dynasty, Tang Wu Zong died, and his officials had a power struggle. The uncle Li was in the support of the official Mashang, that is, Tang Xuanzong. Due to the Power of Li Party, Li Deyu was delegated to Yazhou (now Hainan Qiongshan), and the 60-year-old Cattle party ended. Although Tang Xuanzong is a monarch, it is the same as the rule of Jun, and the empowerment is to strengthen the power of the empress, and inhibit the power of the official. It is a short revival scene in the Tang Dynasty and the history of the history. However, Tang Xuanzong is more suspicious, making it unproved in the past; he has won the teachings, and he has always hope that it is not elder to take Dan medicine. In 859, Tang Xuanzong died of excessive medication. Tang Xuanzong has been chaos in the end of the year. Shortly after his death, he broke out.\n\nAfter the death of Tang Xuanzong, Tang Yongzong and Tang Yuzong, who have also been famous for the emperor, have a famous nonaptious fainting, so that the national trend of the Tang Dynasty has been going downhill. Political corruption, social rich gap is too large, many rebels have occurred, and the Jiangnan region of the Tang Dynasty economy is also destroyed, completely shakes this regime, and also produces Li Guochang, Zhu Quanzhong and other new swings. In 904, Zhu Quanzhong killed Cui Wei, forced Tang Zhao Zong, Duoyang, Chang'an City was destroyed. In August of the same year, Zhu Quanzhong, the Emperor, and Li Wei, Zhaozi, Li Wei, that is, Tang Mi. In the past, Zhu Quanzhong gave the official, and all killed in the white horse, devastating the corpse in the Yellow River, and the history of Human Horse. Zhu Quanzhong would wait for the unity and then seize the emperor, but because of the loss of Huainan, I was forced to let Tang Mei Di Zen as a year earlier, and the Tang Dynasty, the Dynasty, and the country of 2009. After the Tang Dynasty was performed, the five generations of ten countries began.\n\n907 years of war valve Zhu Wengtai Tang, established after Liang, Dingdu, Jingjing (now Kaifeng, Henan). Wang Jian, Jin Wang Li Cun, Yan Wang Liu Rengong and others waited forces. In 908, Wang Jian said that the emperor, the country, and the history called the former. In 923, Li Cun kill Liu Wenguang, and entered the soldiers (now Kaifeng, Henan), Zhu Wenzi Zhu Youzhen suicide, after the beam destroyed, Li Cunyi Duo Yang, Dingguo Tang, history, Shi Tang.\n\nIn 936, the warlord stone and after the Tang emperor were turned over, and the Ji Dan attacked Luoyang. After the Tang Dynasty, Shi Jingtang was successfully promoted, and Shi Jingtang was cut into Qi Dan in order to win the support of Khitan. Threat. After Shi Jingtang died, the Qidan immediately invaded the Central Plains. After the captive, he promoted the north.\n\nIn 950, Guo Wei launched a military change, won the emperor, and established the last week. After 960, after the death of Zhou Shizong, Zhao Wei launched a military change, won the emperor, and established the Song Dynasty and the five generations ended.\n\nIn 1997, Song Taizong destroyed the North Han, unified in the Central Plains, and ended from the end of the five generations.\n\nThe Song Dynasty was another three hundred years after the Tang Dynasty, divided into the Northern Song Dynasty and South Song. In 960, the generals, Zhao Wei, launched a military to establish a North Song Dynasty, which is for Song Taizu, Dingdu 汴 汴 (now Kaifeng City, Henan Province), also known as Tokyo.\n\nTempete in China during the Northern Song Dynasty. At that time, China's economy developed, China's sea trade was very prosperous, and Fujian Quanzhou City became a bustling port, fiscal income exceeded 100 million silver, the capital Kaifeng and Hangzhou population reached 1 million and 1.2 million people, and the businessmen gathered, and culture was also very prosperous. There is Cheng Hao, Zhu Xi and other primary students, advocating three from the four Germany. Song poetry, there is Su Shi, Ouyang Xiu, Huang Tingjian, Li Gang, Xin Qiqi, Chen and Yi, Lu Tong, Wen Tianxiang and other words, there is a famous female word in Chinese history, Li Qingzhao, social culture, and white snake pass, Liang Zhu and other romantic love legends.\n\nWhen the Song Shenzong, because of Wang Anshi change, the new and old party struggled to Wang Anshi, Sima Guang, increased the uneasiness of society, the new and old party for more than 30 years, the influence is far-reaching, and the reform will fail. Yan Yun's 16th state was built in the Liao Dynasty in the northern Dan (the second generation of the high school \"Emperor\", the Emperor \"Shi Jingyi, which is covered by the Summer Central Plains established by the Party Art. Although the Northern Song Dynasty has repeatedly trails the lavage and Western Summer, they have ended the end of the failure, and they have to pay the increasingly shared Liaohexia to maintain peace.\n\nIn the 1115, the golden domain established by the Female River Basin has gradually strong, 1125, Jin Guo Yan. After the golden country began to attack the weak Northern Song Dynasty, 1127 (Jingkang First Year) Jin Guo broke through the Northern Song Dynasty, the capital of the capital (Kaifeng), captured more than 3,000 royal people, including the emperor Song Qinzong and Too Huang Emperor Song Huizong, because When Qinzong's year is Jing Kang, the history is called Jingkang, and the Northern Song Dynasty is desirable. In 1127, the brother of Song Qinzong Zhao Zhao was in Nanjing, and the emperor of the Tianfu (now Henan Shangqiu City) is for Song Gaozong, Duku Lin'an (now Hangzhou, Zhejiang Province), Shiji Nan Song. The Southern Song Dynasty sent a soldiers and gold battles, tried to achieve Shaoxing, and Song Jin 1142, leading to the situation of Song Jinnan. Since then, Song Jin also has a war, but Song Jun can't recover the homeland of the Northern Song Dynasty. The Jinjun has not led the Yangtze River and Huaihe River, and the Song Jin did not have breakthrough, and the Qinling Huaihe line confrontation. In 1234, Mongolia and South Song Dynasty were all given. Immediately in Mongolia and South Song, experienced a large-scale bloody war (such as Xiangfan Battle, Fishing City Battle). In 1271, Lou Bust established a Yuan Dynasty and set a big capital (now Beijing). In 1276, Mongolia broke Linan and occupied most of the territory of Southern Song. In 1279, the Yuan Jun and the South Song Cliffs, the 8-year-old Little Emperor Zhao Wei was carried out in the country. The Yashan Harmony ended the victory of the Yuan Dynasty, and the South Song Dynasty was destroyed by the South Song Dynasty.\n\nLiao Yutan is established. Dan and Qin and Han Dynasty Donghu, Wei Jin, the Wei, Jin, Jin Dynasties, and Xiangzheng, Xiang, in the rumor, nomadic in the Liaohe River Basin. After the chaos of An Shi, the Tang Dynasty ruled the decline, and the Turk has been replaced by the return, and the Dan took the opportunity to develop, and the late 9th century is growing. The Khitan military leader Yelua is overthrew the leader of the League of the League, the Jixtan tribe league leader in 907 AD.\n\nIn 1991, Yelua Bao was established a Khitan, called Emperor Jianyuan, ie Liao Tai Zu, Danglu House (now Inner Mongolian Bahrain Zuoqi), became the greatest threat of Central Plains. The NAC is in the middle of the South China, 946, Kaifeng, Jin, Tao Jin, retrieving the country in 1994. In the 1005th, the Liao Dynasty signed the union of the Alliance from the Northern Song Dynasty. Since then, the peaceful situation in Song Liao has been more than 100 years.\n\nLiao and late political corruption, and more than one bone built gold anti-Liao. Liaodian's emperor led the troops, in the Guaji Gang (now Western Heilongjiang Western City), Jin Chao Lianlian, Zhongjing Dingfu, Xijing Datong, Nanjing (Yanjing) NG Taizong captive in 1125 AD, Liao Tian, ​​the emperor, and Estate in the 219th year. The remaining department under the Lead of Yessa, insightpting in Northern Central Asia, establishing a West Liao, and finally died in the big Mongolia.\n\nThe party has blended the two nations of Xianbei and the Qiang. It was originally resident in the Yellow River Vuliu of the southeast of Qinghai Province, and the Sui Tang and Five-Generation Ten Ten countries expanded, migrated, migrated to Xiazhou (now Hengshan County, Shaanxi, Shaanxi). Tuoba's Ministry of Tang Dynasty, is he surnamed Li. After the establishment of the Song Dynasty, the forces gradually became married, and the Liao Dynasty was asked, Liaoyu Lu Jijun was the Summer King, and he was in the scorpion of the horn, and plagued the Song Dynasty. After Li Diming (Li Jiqian), Li Yuanyi continued to open up the territory, called the Emperor, National Summer, Shi Zi Xixia, Du Zhongxingfu, unified Hexi, and forced Song Liao and its questions in the war. Since then, Xixia took the policy of Liao and Song, exchanged for decades of peace. In Xia Chongzong period, Jin Guo, the rise of Liao Qi, the Northern Song Dynasty, and the Xixia in the Summer were destroyed to the golden country, and took the opportunity to dramatically expand the territory. At the end of the Western Summer, the royal event has repeatedly changing the throne, and under the threat of the Mongolian empire, they rushed. In 1226 AD, Genghis Khan Rate the big army to surrounded Zhongxingfu for half a year, and the end of the Western Treatment was in June 1227 to surrend with Mongolia, and the West is dead. Chamber 1901 years.\n\nThe woman is really black water in the Sui and Tang Dynasties. The five generations of time sustains in the Qidan. One of the parts of the Department, settled in the boseway of Heilongjiang in the beginning of the 11th century, and the forces were gradually strong. After the death of the leader, Wucha is dead, each tribal is divided into the analysis, the battle is constant, the Yan Yan League has long been Yan Ying song, the country is complete, and the 骨 阿 重 重 统 统,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, After the completion of the OAC, I learned that the weak news of the internal weakness of the Liao State was, in 1114, she was anti-Liao, successively captured Ningjiang State, go out of the river shop, Binzhou, Xianzhou and other places. Liao Tianqing fifth year (AD 1115) Complete Yan ana, I founded the Emperor, the founding of the country, and the Ningfu (now Nanba City, Harbin City, Heilongjiang Province). The AD was destroyed in 1125. After Yan Lan, the Golden Kingdom poise contradictions to the Northern Song Dynasty. Xuanhe seven years (AD 1125) November Jinjun south, in December, Yanjing, the next year's first month of the next month. Jingkang is again in the South, in the second year of Jingkang (AD 1127), the captive in the north of the north of the north of Huiqin, the Northern Song Dynasty. After the establishment of the Southern Song Dynasty, Jin Guo stepped up unified foot, but in the battle of Huang Tianzhan, the battle of Yucheng, after the Song Jin did not break through, Jin Shizong is no longer launching war, and the woman is gradually corrupt. The fighting power is declining, Xuanzong, there is a chaos of the blessing, the thief is full. After Mongolia went to the West, the spear headed the golden country, and the public was biased from the 1211 year. It was close to Zhongdu Yanjing (now Beijing). Although the Jinjun has a \"Zhen Tianlei\", \"Flying Fire Gun\", but the political Corruption, the generals have no fighting, the battle of the wild foxling, the battle of the Shuhe Fort, the defeat in the battle of the mountain, the main force is being completed, forced to sum.\n\nIn 1214 AD, Jin Xuanzong is to avoid the enemy, from Zhongdu, Nanjing (now Kaifeng City). In 1215 AD, Cheng Ge Si Khan occupied the capital (now Beijing), the north of the Yellow River is all in Mongolia. After the wreath of the neckline, the north and south two roads were opened, and Jin Jin fled to Guide, Caizhou. Song Zongzong's ending year, the golden emperor Tianxing three years (AD 1234) Zhengmine, Caizhou City broke, gold died. One hundred and twenty years of landing.\n\nIn 1206, he became the north of Genghis Khan, and established a big Mongolian country in Yuqihe (now Hubeihe). At that time, Mongolia's primary country was Jin Dynasty. Because Jin Dynasty and its allied in Western Summer went to decline, Mongolia attacked Xixia and Jinchao, and attacked the West Summer in August 1227. March 1234 attacked Jin Dynasty, completely collected North China. In the West, Mongolia launched three times, making the Mongolian empire dominated the European continent.\n\nAfter the death of the Constitution of the Song Dynasty, the Constitution of the Song Dynasty was died in the death of the Song Dynasty. On May 5th, 1260, Dubei was in the establishment of some of the Zongwang and the Montan Han Dynasty. He was self-found for the emperor of Mongolia, . Shortly after Kublai Lie, Ali did not honor the Sakura Congress in Hara and Lin, the Mongolian Empire Capital, and was selected by Zongwang and Minister of Akai and the Minister. Support for Broad Katdom.\n\nSully Sweating In order to become Chinese emperor, the main content has a reflection number. In 1267, he will be willing to sweat in Yanjing (now Beijing), and Liu Bingzhong is built in Damu. In 1272, it was changed to most (Turkic-looking Khanli, the meaning of the Emperor), will be accompanying each other. On December 18, 1271, Kublai Slim announced the \"Building Guo Yu\", take the \"Easy Classic\" meaning, change the national number from the big Mongolian country to the big yuan, Jianguan Yuan Dynasty, Dubei That is, in 1260, the establishment of the province, setting up a pivot court in 1263, establishing a national institution in Royal Shitai in 1268; setting up a large agriculture and promoting agriculture; Zun Kong Chongru and vigorously developing the policy of promoting Confucianism. However, in order to retain the original Mongolian system, it finally formed Montan two yuan politics. Although Yuan Shizu won the sweat of Mongolian sweat, finally became an emperor, but because the sweat was not legal and advocated, the Mongolian room did not recognize the Kimgun's sweat, four sweat people have three countries Do not deliberately, the Mongolian empire completely disintegrates. In the end, the sea from the Taiwan Taiwan is from the troops to compete for the sweat, causing turmoil in the north, and the history called the sea.\n\nIn March 1279, Zhang Hongfan attacked the South Song and the Emperor Song, who took the 8-year-old small emperor Song and Yan Zhao Zhao Shi, and the south of the Song Dynasty. The Yuan Dynasty unified China and ended more than 300 years of splitting in the splitting of Yan Yun's 16th state. The Yuan Dynasty is surrounded by some countries or regions (including Gaoli, Annan, Zhancheng, Myanmar), joining the tribute relationship between the Yuan Dynasty.\n\nIn 1294, Yuan Zu was driving, Yuan Chengchong succession. Yuan Chengchong mainly abides by the constitutional constitutional period in the Yuanbu, appoints his niece (the child of Ma Ba, the son of the Aquarium), and the forests in the parity of the Northwest China, and the order will stop discussing Japanese and Annan. In the interior of rectifying domestic politics and reducing the tax of Jiangnan. However, due to the excessive reward of Yuan Chengzong, it is not enough to make the lack of national library. In the first month of 1307, Yuan Chengzong rushed, and the brother of Hai Mountain, Li Yu Li, Octob, and the right-handed Harbin launched a majority of coup. Yuan Wu Zong was actually actually actually in love, and the book seal him as an emperor (ie the future Yuanren), and the Wu Zong system and the benevolence department were alternately called the emperor, that is, Wu Renzhi. During Yuan Wuzong period, Haifeng Confucius was \"Dacheng to Saint Wen Xuan Wang\" and gave Confucius's family and some title. In order to solve the fiscal crisis during Yuan Chengchong, Yuan Wuzong sets often in the flat coalis price, order to print to big silver banknotes, but in turn depreciate silver banknotes. In addition, he will give the Submission provincial and human rights to the province. 1311 Yuan Wuzong lost, by the Emperor Yutian Li Pulling Baota, which is Yuan Ren Zong, this time the Yuan Dynasty was inherited in the Yuan Dynasty.\n\nYuan Renzong is chasing the fiscal depletion caused by Yuan Wuzong, and the political chaos of the political and chaotic, he promoted the \"Confucianism\" policy, and the redundant staff, and strengthened the centralized centralization to rectify the government. Its Siyuan Yingzong continued to implement the policy of Confucianism, strengthening the central centralization and bureaucratic system, and ordered the compilation and promulgation of the official code of the official code. In the 1323, Yingzong was assassinated in the south of the south of the capital, and the history called Nanpo change. The calm and forests of the town and the forests of the Tiemutum are sold in the south, killing the rocky minister of the rut hike, called the emperor, that is, Thai Di Di.\n\nTaiddi collapsed in July 1328, the seven-year-old A Siji eight is the emperor, it is Tian Shun Emperor. The swing of the swordsman, and the Bo Yan, who established Zhou Wang and the world in the mobei, Huai Wang map, Siergang, the same year's map, gay first to most, is Yuan Wenzong. Yan Yinmu led the army to go to the capital, Tian Shun Emperor did not know the final. In the past few years, the world is in the north and the forest, that is, Yuan Mingzong. Yuan Wenzong gave up the emperor, sent Yan Yumu to the Yuanyuan, and was established as an emperor. However, Yan Yinmu poisoned Yuan Mingzong, resetting Yuan Wenzong, reformed the emilings, and the history of the historical calendar.\n\nAfter the death of Wen Zong in 1333, the seven-year-old Mingzi's mutual ceremony is the emperor, which is Yuanning Zong. However, Yuan Ningzong only died in two months, soon, Hua Ter was also dead. Yuan Mingzong's eldest son carefully sticked to Wen Zong Queen's Remnant from Jingjiang (Guangxi Guilin), it was an emperor, which is Yuan Huizong. Yuan Dynasty is in the long-term inheritance issue, corruption, power, and abroad, make politics can't be able to go to track. This unstable court will often lead to the coverage of the country. In the late Yuan Dynasty, especially in the middle of the 1940s to the 1940s, during the drought, the plague and the water were often occurred, and the water affected in the Yellow River is particularly serious. In the 1351, the incident of the Red Cowm, unveiled the dying of the militarity.\n\nThe Yuan Ting sent a soldiers to suppress the red towel army, and the prime minister took off personally led the army to attack Xuzhou Sesia Li Jun, and once pressed the people. However, in the middle of 1354, the departure of Zhang Shijun, who was killed by the minister of the Yuan Ting. Xu Shouhui finally split into two lakes of Chen Youzhi and Ming Yuzhen in Sichuan. The Minhuai Guo Zixing's department Zhu Yuanzhang began to expand the site for the basis of Nanjing in 1356; in 1363, there were two lakes, and finally won the victory in Poyang Lake; in 1365, the two lakes were taken after the same year's winter East offensive. Zhang Shi Cheng, along the sea; after the flatness of Zhang Shicheng in 1367, he continued to suppress Zhejiang's Fang Guozhen in the south. So, there was no one in Jiangnan against Zhu Yuanzhang. In addition, Fujian had a columns in the 1357 to 1366, and the history said that the history is also a chaos. At the same time, the Yuan Dynasty took the Yuan army against the Northern Red Towel Army in the Champion, and the Northern Red Towel Army in the Northern Red Towel Army was defeated to Zhang Shicheng after the Yuan Dynasty. Liu Fangtong was dead, Han Liner south Going to Zhu Yuanzhang and then killed. After the unification of Jiangnan, Zhu Yuanzhang ordered the Northern Expedition in 1367. He sent Xu Da. He often attacked Shandong and Henan, and blocked the Shaoguan to prevent the Central Plains of China. The Ming army captured in the August 1368, Yuan Huinzong North Eshan, the history book called this as the end of the Yuan Dynasty. However, the Yuan Ting is still on, and the history book is called the North. And the Ming Ting believes that Yuan Huizong is Shuntian Ming, and the number is Yuan Shun Emperor.\n\nIn the end of the Yuan Dynasty, officials were corrupted and polished. In order to eliminate the deficit, the Yuan Ting is added to the tax, a lot of print the new bank \"to the Bao Bao\", and the inflation arising from the inflation, the flood of the Yellow River, so that the people will not talk. In 1351, Yuan Shunji Jaru govern the Yellow River and tested more than 200,000 people. In May, Bai Lian, Han Mountain, and Liu Fangtong incited the people who were suffering from natural disasters and supervisors. Establishing a red towel army. According to Henan and Anhui and other places. The Red Towel Army has a matter of one after another, and the power is expanding to China, South China. In the past, the Guo Zixing of the Red Scarf Army gathered the public, captured Zhuzhou (now Anhui Fengyang). Soon, Zhu Yuanzhang shouted to Guo Zixing, repeatedly served, and got Guo Zixing's weight and trust. After that, Zhu Yuanzhang left the state and develop his forces. In 1356, Zhu Yuanzhang led the soldiers to occupy the celebration (now Nanjing, Jiangsu Province), renamed as the Tianfu, and attacked some of the military to get a foothold. After several years of hard work, its military and economic strength quickly grown. In 1363, through the Poyang Lake Water War, Chen Youmei was eliminated. In 1367, Zhu Yuanzhang claimed to Wu Wang, led the army to attack the Pingjiang (now Suzhou City, Jiangsu Province), destroy Zhang Shicheng, and destroyed the Shengguo Zhen from the coast of Zhejiang.\n\nIn the first month of 1368, Zhu Yuanzhang called the emperor in Nanjing, namely Ming Taizu, the year, Hongwu, and established. In the same year, I captured a large number of yuan, and the Yuan dynasty was withdrawn from the Central Plains and the end of the country. After 1371, the Sichuan Ming Yuzhen forces were destroyed. In the 1381, the Yuan Dynasty, the Yuan Dynasty, the Yuan Dynasty, who was guarded in Yunnan. Finally, in 13 In the 88 years, it deeply enters the North.\n\nOn the other hand, Ming Taizuhong might relieves the burden on the farmers, restores the economic production of society, the bad rule of the reform, and punish the bureaucrats of corruption, the social economy is restored and developed, and the history of Hongwu is. Ming Taizu strengthens the empowerment through a series of slaughter and specialist surveillance and other ways, and seals the sons as the king to strengthen the border defense, and the royal royal family. In the king, the king of the north is strong, and the power of Yan Wang Zhu Xi is the greatest. In 1398, Hong Wu Emperor drove, because the Prince Zhu Biao died early, by the Empress Taishun Zhu Yunzhen, the annual construction, that is, Jianwen. In order to consolidate the power of the empowerment, and the secretary of the minister, Qi Tai, Huang Zicheng and others. As a result, Yan Wang Zhu Xi took the \"Qingjun side, Jing Net difficult\" in Yao Guangxiao, and finally wandered back to south, and occupied the capital of Jing. Zhu Xi is like, that is, Ming Cheng ancestors, Yongle. Jian Wenmili lost in the hall of Miyagi.\n\nIn the treatment of flourishing, Ming Chengzu, Ming Renzong and Ming Xuan Zong have once again risen to Yongle Shengshi and Renxuan, which is one of the prosperity of the Ming Dynasty. Yongle Emperor attacked Annan, incorporating Annan into the Ming Dynasty layout, set up an intersection to rendering the politics. After the Ming Chengzu, I personally fifthally, I was in the north to attack the Northern element division. Ming Chengzu is a safe place in the Northeast Women's Real (located in the upstream of Songhua River) and Jianzhou Female Real (located between Songhua River, between Songhua River, Mudanjiang), and sent a martial arts, and the wilderness in the downstream of Heilongjiang. . In 1407, there was also a joy of the east bank from the lower reaches of Heilongjiang (the old land of the East Marshal House). Since 1405, I will send the official Zheng He Xia to the West, interacting to countries, declaring Weide and establishing a tribute system, Zheng He's western and seven times, the fleet footprint is covered with Southeast Asia, South Asia, Arabia and East Africa. The scale is unprecedented, expanding the influence of the Ming Dynasty to Nanyang and Western China. In terms of cultivation, Ming Chengu has a large-scale book \"Yongle Code\". In 1405, the ancestor will be renamed Beiping Beijing, 1421. Because of the world of the world, and vigorously develop overseas exchange, some scholars will call this period as Yongle Shengshi. However, Ming Chengzu also killed the opposition, such as Huang Zicheng, Qi Tai and other Ming Hui Zong, the old minister, etc. were killed.\n\nAfter the ancestral driving, his long Mingren, the year, Hong Xi. Hong Xi is 47 years old, the age has been high, and it is only a year. Its rule is biased towards the conservative, appoints \"San Yang\" (Yang Shiqi, Yang Rong, Yang Wei) and other Xianchen assistant, stop Zheng He, the western and foreign war, and encourages production, and the province, and strive. Ming Renzong's driving, the eldest son Zhu Zhanji is in place, which is for Ming Xuanzong, and the annual number. Xuan Dempasically inherited the father's route, and implemented German political countries and let Zheng He under the western ocean. Ming Xuanzong also loves art, there is painting. However, there is no disadvantage during its ruling period. Since Ming Xuanzong is hurts (the ancient name \"to promote\"), many bureaucrats have ranted to shoot horses, known as \"woven sky\". At the same time, Xuan Demper broke the rules left by Hongwu Emperor, and some eunuchs were governed by Wang Zhen and others, and the eunuchs were dedicated to the Mingzhong Ye. In 1435, Xuanzong died, and the nine-year-old Zhu Xi Town is in place, namely Ming Zong, the annual owner.\n\nAfter 1440 years, the wattle of the western Mongolia is gradually strong, often in the Ming Dynasty border. In 1449, Ming Yingzong Zhu Xi Town was defeated in the civil fort, although the Vajun army was defeated when the Vauguan defeated the war in Beijing, but the Ming Dynasty was no longer like Yongle, Hong Xi, Xuande's prosperous, started to decline, and territorial No longer expand, and strengthen the border defense and build the Great Wall.\n\nMing Yingzong was captured, the throne is out of stock, and the emperor of the meat ticket in the hand is constantly going to the Ming Dynasty. The Wei Chen is in the midnight of the Uri Yingzong, and the Tzochi is resistant to the tile. The English in the hand has become a valuable Tai Shang, so I promised the requirements of U.S.\n\nAfter Britain returned to Beijing, he was strictly monitored by the brother, but he was in the 1457-year-old hunting, and he became the only emperor who used the two Years of the Ming Dynasty.\n\nAfter the British, the Qing Dynasty was diligent in the early years, and the pets were pets to believe in Guifei and the official Wang Dynasty. After the War, the national trend was still. After the death of the Emperor, his Zi Zhizhi is diligent in political affairs, and creates Hongzhizhong. After death, it will succeed in the end of the virtue, and the German is indulgent in the sound of the dog, it is ignorant, causing the rebellion.正 德 帝 无, after death, after death, the Casino Jiajing Emperor, Jiajing Emperor Qi Dynasty, the late superstition of Huashang, politics, increasingly corruption. Between Zhengde and Jiajing two emperors, the official Liu Wei, the main couple of the cabinet, between Yang Ting and, Xia Yan, Yan Yan, Xu step, the political struggle between the cabinet and the official, the Ming Dynasty gradually became down, and the social contradictions were sent.\n\nIn 1556, there were approximately 8-level earthquake in Huaxian, Shaanxi Province. It is one of the famous historical earthquakes in the dense population in China. This earthquake leads to a large-scale mountain collapse, river reform, and the personnel death is extremely heavy. (830,000 deaths). At the same time, it also leads to a deficiencies in the Ming Dynasty, and the natural disasters and plagues caused by the earthquake have caused tax reduction in the Ming Dynasty. The national strength and financial situation of the Ming Dynasty also have different degrees of impact.\n\nLong Qing Emperor and Wanli Emperor, in the courtesy of the cabinet, the first revitalization and Zhang Junzheng, the official Feng Bao, Zeng Zhongxing, the nationality is prosperous, at this time, the money flows into China through international trade, and the economy has reached the whole. During the Wanli New Year, Japan Tai Wai Ji Ji Ji launched the DPRK, making the Ming Dynasty into a large number of troops and military expenses to clear the Japanese army, and the national power consumes very small, but the North Korean is re-in the Control of Ming Dynasty. Later, Ming Zongzong did not undergo reluctance, and politically increasingly corrupt.\n\nMing Guangzong took the throne of the emperor's hand, but suddenly drove in a month, he was inherited by his son. Tianqi Emperor Qi Zong likes carpenter to work, apprentice Wei Zhongxian to share the business of the court, Wei Zhongxian has held the political affairs, causing Donglin Party, and has more political, and more faded in the country.\n\nIn 1626, Wang Gongfeng, Wang Gongfeng, Wang Gongfeng, Wang Gongfeng, in the southwest of Beijing, killed more than 20,000 deaths [6]. In the same year, Qi Zong accidentally lost water while playing in Xiyuan. After the literary brother of Qong Zong, she destroyed the party, and strive to vain, but due to the serious natural disasters such as the Ming and Qing Dynasties, the Ming and the Ming Dynasties were finally built. In 1644, the prince of the uprising led Li Zicheng, and the Ming Si Zong was killed, and the Ming Dynasty was destroyed in the Ming Dynasty in 277.\n\nIn the late Ming Dynasty, the female real people living in the Northeast region (that,, the later Manchu) began to rise under the leadership of Nurhachi and the Empress Dynasty. Chen Chengzong, Yuan Chonghuan, Zhenning Direction, resisting the female real person, winning the battle of Ningyuan, the victory of Ning Jin, and hit the female real horse who attacked Beijing. In 1630, after the Ming Dynasty, the Liaodong's power declined, Guanning Jinliang line began to disintegrate, and the female real person broke through the Great Wall five times. In 1633, Shanxi broke out the \"Ming Dynasty and the mural\" and sent to Beijing, causing a large number of people to die and accelerated the death of the Ming Dynasty. The female real person finally launched Li Zicheng shortly after 1644, I expelled Li Zicheng, entered Beijing, and established the Qing Dynasty.\n\nSouthern Minister successively supported Fu Wang Zhu Yu (Hongguang), Tang Wang Zhu Yu (Longwu), Gui Wang Zhu Bei (Yongli) for the emperor, Shi Zi Nanming, ultimately destroyed by the Qing army due to lack of strength and politics.\n\nThe Ming Dynasty, the old minister Zheng Chenggong took Taiwan from Xiamen and Jinmen, and the Dutch colonists were expelled. After Zheng Chengmin, his grandson Zheng Kezhen surrendered the Qing army, and the Daqing Dynasty will enter Taiwan into the Chinese map.\n\nWhen the Ming Dynasty, the Yellow River was 143 times, such as the 1410 Yellow River flooding incident. In the first year of Chongzhen to fourteen (1628-1641), there were 11 years of Huanghe, a history of history.\n\nIn the early years of the Ming Dynasty, the descendants of Dongshan Shengchang An and Qi Tak Shi Tong Ming Dynasty Liaodong General Li Chengliang, with the Cushure State, the right health king, is from the attack and killing Wang Wei and his son, but Shengchang Qingfang Also died in the melee. In 1586, Ming Ting attacked Tak Shi Nurhachi to command as compensation.\n\nNurha is the ancestor, the father's thirteenth perspective rises, and the women in Jianzhou will be swallowed and swallowed and swallowed with a friendly friendship with indifferent Mongolia. 1616 Nurhaza is now known as the northeastern China, China, established a post-gold, Dingdu Hercha (ie Xingjing, today Liaoning New Bing). Jianzhou women really Guo Li Sheng, 1616 Nurja barel, in the establishment of the eight flag system, he called Khan Li. Two years later he refined by the \"seven hate\". Nurhachi defeated the Ming army, North Korea and Ye Her in 1619, North Korea and Ye Her; connected to Liaodong City, such as Shenyang, Liaoyang, Fushun, and then waved in the Liaoning area. Nurhachi finally defeated the red cannon of Yuan Chonghuan in the Ningyuan Battle in 1626.\n\nThe Empress Emperor of the Emphasis on the Struggle after the Struggle. After the emperor is in place, the social contradiction in Nurhat period has made a series of reforms, and the history called \"Tian Cong Xinzheng\". Continue to improve and expand Mongolian eight flags, Hanjun Baqi, set up a business of Mongolia and other places. Winning the city Shenyang Yi Shengjing, change the name of the female real nun, in 1636, said in Shengjing, the year is Chongde, the national number is big. Subsequently, it successfully despised the Westside Mongolian Chahar, and the South Mongolia was attached to the Qing Dynasty. In addition, the emperor is close to North Korea and make North Korea become a great definiteness. Then, the Huang Taiji Erhar detours invaded the Ming Dynasty capital Beijing. In 1643, the emperor was sick, after its eldest son, and after a political struggle of Dora衮, it was the Ji Di.\n\nIn 1644, Wu Sangui took the clerk to enter the customs, and the Qing Dynasty moved the capital to Beijing, and the Qing Dynasty entered the main Central Plains. From the time of the time to go to the subsequent period, the Ming and Qing War has eliminated the peasant army, Nanming and Ming Zheng and other forces. Later, the Qing court implemented the policy of rewarding and reducing taxes. And officially open the Kaixi, chasing Chongzhen Emperor and Ming Dynasty Zhongchen.\n\nIn 1661, the Emperor of the Emperor, and the 8-year-old Kangxi Emperor was in 1669. San Francissed in 1681, it was over, the same year, Zheng Jingzi Zheng Ku, through Dongning, and constantly changing a lot of collars. The Qing Dynasty was dedicated to Zhengfei to lead Square to attack Taiwan. Shi Yan occupied Wuhu, approaching Dongning (Today, Taiwan, Taiwan), Zheng Kezhen led the minister to clear the minister.\n\nAfter the Qing Dynasty, the Qing Dynasty entered the Kang Die period. During this period, it was a peak period of the Qing Dynasty. It is called Kangmong Dry. Kangxi Emperor is a political width, paying attention to folk suffering. After his pro-government, we announced the stop of the duty-free period. He also launched the rule of law, restoration of Jingbo, large-scale examination system. The \"breeding people, never fiscar\" policies and the introduction of foreign crops have greatly improved. He has once again appointed the Yellow River and the Grand Canal. After the medium term of Kangxi, the handicrafts that were seriously damaged were gradually recovered and developed due to the war. In order to stabilize social order, he issued a 16th sacred, and the local people must follow the villagers. He also sent a heart abdomen (that is, the slaves, such as Cao Yu, Li Wei and others to explore the local price, people's income and official gensighas, and play the newspaper. This is the germination of the texture system, and it tends to be perfect during the Yongzheng period. Kangxi emphasizes the experience of Han Si Dafu. He has held many Bank of Confuciary, creating a South Shuoxuan, and to learn Western Science and Culture.\n\nDuring the 1690 to 1697, the Warm Tong's battle and the Sanjun Dan made Guldan to death, and founded the Torn of the Tororance to protect the Carkate Mongolia. The Tibet Khan National Assistance in the Qinghai-Tibet area assists the Dalai Wu of the Yellow Tibet, defeating the Red Temple, and then splits into Qinghai and Tibet and Shuoti. When Dalai Liu, the Tibetan region was managed by the Pakistan (Director) Sang Jie Chi, and he was jointly against Tibet and Shuoti Raise, Zhaji first kills the sullen noodles and abolished Dalai Sixth. In 1717, the nephew of Galdan strategic Albudan invaded Tibet, attacked Raise, and occupied Lhasa. The Qing army has been defeated by the army, and in the last 1720, the Dingyi was successfully removed from the army, helping Dalai VII into the Tibetan area.\n\nIn 1722, the Emperor Kangxi was transmitted in the emperor. In the 13th year, Yongzheng Emperor took remedial measures against the shortcomings of the Kangxi period to continue the prosperity of Kangmong. He set up the military aircraft to strengthen the empress of the empress, and the killing of the king and weakened the energetic force. Emperor Emperor pays attention to the emperor education, adopting a secret tank system to prevent the situation of the emperors of Kangxi from the end of the year. Ding silver into the ground, reducing the burden of unified poor. In order to solve the problem of local corruption, the fire consumes the public, and the expenses will be changed from the central government; set up lying and silver to improve the salaries of local officials. Yongzheng's first year of Qinghai Prince Luo Tienjin intentively revived and Muke Thaki and chaos, apart years old, and Yue Zhongqi and others were set. Listening to the implementation of the development of the Ertai to implement a minority in local officials. It was officially incorporated into the Qing Dynasty in Kah Mongolia; and signed the \"Chak Chart Treaty\" in Sajus in 1727, establishing the Chinese and Russia in China. In 1732, Garnzzzhong East, Eastern Qi Qi Ka Mong, soldiers to Hang Aishan, beatted by the king of the Carkate. In 1734, the peace talks were clear, and the Northwest is roughly peace in the northwest. In 1735, the Emperor Emperor was died during the work, and his son Hongli's success, that is, Emperor Qianlong.\n\nThe Emperor Emperor is in the Qing Dynasty. During the period, the population continued to increase the last year of Qianlong, 300 million, about one-third of the world population. The silk weaving industry and cotton fabric industry in Jiangnan and Guangdong are very developed, and the porcelain in Jingdezhen has reached the peak of historical peaks. At the same time, the silver number has begun to appear in Shanxi. Emperor Qianlong, the public, there are many books in this time. In 1773, the \"four library books\" were compiled, and \"the ancient book integration\" became the largest book in the world, which became a cultural marker of the world.\n\nIn addition, Qianlong seventeen years (1752) Winter, Dawawi hit the Khan Khan, Apier Salina was defeated in the subsequent inner fight. Emperor Qianlong passed the second year of Qianlong (1755) to guide it, and the first rate of the military union in North China was subject to Yili. Emperor Qianlong sent Zhao Hui Zi Zi Zi Zi Zi Zi, Apier Sanna defeated Kazakh Khan, after Kazakh Khan returned to Qianlong, and escaped the capital of Caure, Apier Danna was dead in Qianlong (1757), Tianshan North The road will be scheduled. However, in Tianshan South Road, the leader of the return and the Zhuo brothers will be anti-clear, called the size and Zhuo Zhuo. In the 23rd year of Qianlong (1758), the Emperor Qianlong was once again a Zhaoyi, and the Zhao Hui and Fort finally attacked the size and Zhuo, and made the Pamir Plateau as the West China. At the end of Qianlong, Nepal's Holka kingdom invaded Tibet. In 1793, Camato Pean Kang'an and the Halan Chapels were hidden, hit retreat and Zhekki (now Sikin) was also the country, strengthen the power of the ministers stationed. Southwest, the early years of Qianlong sent Zhang Guanggui, the chaos of Miao people in Guizhou, and then the Qing army went to the battle of the fixed size. During the period, the Burmese Tongbang Dynasty and China broke out the Critic War. In 1769, the Emperor Qianlong sent Fu He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He He was unique, and the two sides ended. In 1784, Siam has made the tribute, and 1788 Myanmar is also sent to the siamese threat. In the 1789, Xishan Dynasty was unified after Annan, Zheng Lord and Guangnan. The Qing army defeated Xishan Dynasty, escorted Li Di Li's reset, Xishan Army's ambush, the history called the Qing War. Xishan Dynasty Huihui made a confrontation of the Qing court, and the Qing court seated as the King of Annan.\n\nDuring the Qianlong, the Qing Dynasty, the Qing Dynasty, was more than 13 million square kilometers. The North Korean North Korea has long been one of the people of the country. Only Japan, which is only the river is in the lock of the country, and there is little in the Qing Dynasty. Qianlong Emperor has since reputated with the ten exquisite martial arts, he is fixed to the Retor of Retor, and the introduction of Xinjiang into the Chinese layout, Sichuan, Guizhou, etc., but the rest of the war is a small question of the country to cause serious damage to the country. Let the Qing Dynasty recession. The household in the Qianlong period is up to 80 million, and the year is maintained at about 6,000-7,000 million. It is enough to cope with the government's daily expenses, major projects, war, and although the Qing Dynasty is relatively light, and in the Kang Dynasty Many foreign soldiers, Daxing all projects, but every year, there will be, and the reserve of the State will rise year by year. At that time, the population contrast and the rural land were serious, so many farmers lost their land; plus corrupt officials and 珅 官 官 官, in the late Qianlong period, the Civil changes will be built. Bai Lian teaching in the 1770s, later, after 1796, Sichuan Chu Chu Chu Chu Chu Chu Chu Chu Chu Chu Chu, and was suppressed by Qingjun, and the leader Wang Sanzhen was killed. Taiwan Tiandi Association leader Lin Shuangwen launched Lin Shuangwen incident in 1787, lasted more than a year. During the Qianlong years, the fixed size of Jinchuan is chaotic, eliminating the threat of Junggar Khan, officially re-incorporating Xinjiang into the Chinese layout, and promulgated the most powerful evidence of Tibet as China's territory \"Twenty-nine\" Article, strengthen the central government's governance to Tibet, affecting modern China's layout [7].\n\nIn 1796, Qianlong Emperor Zen was located in Jiaqing Emperor. Although the Emperor Qianlong is the Emperor, but still \"training\" to 1799, it is handed over to 64 years. Jiaqing died in the three days of January 3rd, eighty-nine years old. Jiaqing Emperor is a pro-government. However, Jiaqing Emperor did not solve the drawback, after the Emperor Qianlong, the Qing Dynasty continued to recession.\n\nAt the beginning of the 19th century, the Qing Dynasty has moved to decline. In the Jiaqing year, Sichuan Chu Chu Chu Chu, at the same time, the Netherlands, the Netherlands and Portugal, began to force trade with China. In 1787, British businessmen began to enter opium to China, which led to China's international trade by huge surplus to huge deficit. In 1815, Qing Tin was issued to search for the Ocean Opium, but he did not want to smuggle a large number of opium, and Dao Guang Emperor sent Lin Xu to Guangzhou to smoke in 1838. In June 1839, more than 237 million pounds of opium will be destroyed in the Humen, and the history is called Tiger Door. The British government has launched an opium war in June 1840. In 1842, the British army entered the Yangtze River and cut off Jiangnan's supplies to Beijing, so the Qing court asked, \"Nanjing Treaty\" signed, in addition to five trade ports such as Shanghai, the Southeast Coast, also cut Hong Kong Island, China's sovereignty Undermine. Generally, the history of China's historiography believes this is the beginning of China's modern history.\n\nAt the same time, the struggle against China's domestic rebellion is once again raised. In 1851, Xiucai, which was affected by Christianity, established a worship of God, and launched Jintian uprising and created Taiping Heaven. Taiping Heavenly Kingdom makes China's largest peasant uprising in the history of Chinese history. The Taiping Heavenly Republic of Taiping once occupied some provinces in the south, and it was in Nanjing (renamed \"Tianjing\") and established a central government of political education. In July 1864, Zeng Guofan Zeng Guozhen rate the Xiang Army to capture Tianjing, and the innocent people launched the massacre and looting, Taiping Tianshi officially ended. Nanjing City was burned, the people were injured and injured, Nanjing people hated the Xiang army, saying that Zeng Guofan and Zeng Guofu were shaved, Zeng Houhan [8] [9].\n\nOther sports in the same period also have a heaven and earth meeting, the army, the Shanghai knife, the peony, Gansu Tongzhi's chaos.\n\nIn the late 19th century, the British, Law, Russia, Japan and other invade China, forcing China and signed an unequal treaty. In 1860, the British and French coalition defeated the Qing army in the battle of Bali Bridge, then broke the Beijing City, and the fire was burned to the Yuanmingyuan, and Xianfeng fled to Chengde. From October to November, the Qing Dynasty and the British and French Russia signed a \"Beijing Treaty\" in the ceremony, the Beijing Treaty, the newly opened the Yangtze River and the North Coast of the North Coast. Russia passed the \"Treaty\", the Sino-Russian Treaty and the \"Sino-Russian Slim Summary of the Northwest\", cutting the territory of China's northeast and northwest of more than 14 million square kilometers. In 1894, the DPRK was defended to the Korean sovereign and Japan. During the Japanese army, the Lushun massacre was implemented, and the robbery, slaughter and rape of 4 days and 3 nights were carried out. More than 20,000 people were killed. In the end, the Qing Dynasty was defeated, signed the \"Treaty\" in Japan, compensated Japan's 200 million two silver, and cutting the Taiwan, Penghu Ring Island to Japan.\n\nIn order to enhance the national strength and consolidate the defense, the Qing Dynasty began to promote the foreign service in the 1960s, and the national strength has resumed, and the situation of ZTE is once. In 1877, the Qing army recovered Xinjiang. In 1881, he passed the \"Yili Treaty\" Qing army to recover Yili who occupied many years by Saudo. After the Chinese and French War, the Qing Dynasty also established the modern naval fleet of the eighth year of Asia, the eighth year of the world. In the 1895, the failure of the Sino-Japanese War, exposed to the weakness of the government. Since then, the powers have strongly rent the land, and the Italium is divided into China. In 1898, the Emperor Guangxu agreed to Kang Youwei, Liang Qichao and others made a variety of reforms from June 11 to September 21, known as 100 days of 103 days, but eventually launched in Cixi. The failed after the coup.\n\nIn 1899, the righteous group movement broke out, with the purpose of \"Fu Qing and the Ocean\", and in the Cixi Mother, the killing of the killing and killing Beijing and the acquisition began to besieged foreign embassies in Beijing. At the same time, the rights of the soldiers fall into the pro-hand. As a result, countries were attacked into Beijing, and the Historic is called the Eight-Less Forces. In 1901, the Qing government was forced to sign a Xinxin Treaty with countries, and the compensation of 450 million two silver, and it was also clear in 39 years (398 million), and later all returned, and from Beijing to Mountain Customs Railway along. Station, open Beijing Dongxin Lane as an Embassy area, Chinese people may not enter into the interior.\n\nChina has undergone a lot of natural disasters in China during the Qing Dynasty, and some natural disasters even caused population losses. From the first year of Guangxu (1875-1878) Henan, Shanxi, Shaanxi, Zhili, Shandong and other places have a great drought and hood, especially in Shanxi, 1 million people died of 950,000. The total death count is 9.5 million -20 million, that is, about 2-4% of the Qing Dynasty, Shi called Dishui [10]. 13 years of Guangxu (1887) Henan Zhengzhou Xiantao Shi (now Shiqiao Village, Huachangkou Town, Huiji District) [11], causing more than 2 million (930,000; one said the most conservative estimate of 1.5 million One said 7 million) people are killed.\n\nAt the end of the 19th century, the modern education of the Revolution of 1911, Yang Huiyuan, who opened the foundation, excluded the imprisonment of the old power, and successfully introduced the new school. The Qing government was forced to open a situation in the situation and enacted a new academic system in 1905, abolished the imperial system, and promoted new schools across the country. In 1909, after the local scope stopped, Xi Xue gradually became the main form of school education. It is this fundamental change in education. It has created a large number of ideological progress and innovative social elites and valuable talents for the future of the Hai Revolution and national construction and national construction.\n\nAfter the establishment of the Chinese League in 1905, the Revolutionary Party began to rise, Sun Yat-sen and Huang Xing and others were actively funded overseas, forming party organizations and directed many revolutionary movements in China. After more than ten failed revolution, Hubei New Army with the Revolutionary Party did not communicate successfully in Wuchang. On January 1, 1912, the Republic of Asia, the Republic of Asia, announced in Nanjing, and Sun Yat-sen officially served as the first temporary president. On February 12, Qing Xuantong Emperor announced an abandonment, the Qing Dynasty officially walked into history, and the dynasty dynasty system of more than 2,000 years was basically over.\n\nIn this era of the Empire and the Republic of China, a large number of scholars, such as Kang You, Liang Qi Chao, Yan Fu, Wang Guowei, Hu Shi, Yan Hong Ming, Zhang Taiyan, Chen Yu, Lu Si, Wei Yuan, Qian Mu, Lu Xun and others, known as \"National Studies\" Chinese Literature, History and Philosophy. Liang Qichao has led the \"History Revolution\" against China's traditional history, requiring the \"history of the emperor\" to \"writing history for the national\". Yan Fu has translated the Western famous \"daytime\" to introduce Darwin's evolutionary theory, and analyzing that China cannot break the Confucian thinking of China, far behind the world. Wang Guowei and Life Ming are famous literatologists. They once played all European countries, and later in combined with their own culture and Western thinking. Zhang too inflammation is a famous anti-cleaner, his thoughts reverses China's change, becoming a famous revolutionary and literary. Chen Yu, Lu Si and Qian Mu are famous historians, making superior contributions to the \"History Revolution\". Wei Yuan took the \"Harbor\" to request reform. Lu Xun is the founder of Chinese modern literature, which has been a chapter is so violent student, with \"picking up\" and \"mad diary\". During this period, all new ideas, new culture began to slowly introduce China, broke out in the 1919 Movement, and the establishment of the Chinese Communist Party in 1921. Some historians in mainland China will be praised by the Fourth Movement as the beginning of China's modern history.\n\nOn April 1, 1912, Sun Yat-sen resigned as a three-month temporary president position, from Yuan Shikai, and it was in Beijing, so he also called the Beijing government.\n\nYuan Shikai, I was unable to disperse the Congress and terminate the Temporary law after going to the stage, and the new information was issued to expand its authority. In July 1913, he called Cai Yu into Beijing control, and after a mold model, Feng Guozhen and the public mistaked Yuan Shikai did not call the heart of the emperor, but in 1916, Yuan Shikai claimed to restore the emperor and established the Chinese Empire. Sun Yat-sen, the Chinese Revolutionary Party is a second revolution. In March of the same year, Yuan Shikai was forced to announce the cancellation of the emperor. In June, he died in despair in the desperation in the desperation, and the national war is over. Yuan Shikai was dead, Li Yuanhong successfully served the president, Duan Qirui became the State Prime Minister, but the two did not pay evil because of the opinions, soon, Duan Yuli declared the war, Li Yuanhong dismissed the war, but Duan Qirui arrived La Li, Li Yuan Hong has to help Zhang Xun, June 7, 1917, Zhang Xun, the five thousand braids were attacked to Beijing and supported the 溥 溥 as the emperor, Li Yuanhong also helped Duan Qirui, Duan Qirui used 12 days The discipline is restored, Li Yuanhong also resigned. The Republic of China entered the Department of Northern Wickets (Department, Directness and Feng Department, etc.) to control the central government, and local governments were deployed by various military valve.\n\nIn 1921, Dark Dadin Suhebtt built the \"People's Revolutionary Administration\" with the help of the Red Army of the Soviet Union, in 1924, the People's Revolutionary Party announced the abolition of the monarch constitution, established the Mongolian People's Republic of China, Dingdu Kurent, and changed the city as Ulan Baro. In 1937, under the leadership of Holo Chobe, the foreign Mongolia has launched a large cleaning, the party and the state, the government, the army, and the monks were killed, accounting for two% of the Mongolian population. Three percent. In 1946, he was independent of Mongolia. In 1952, the Republican Government proposed \"Control Soviet\" in the United Nations General Assembly and obtained the joining the United Nations through intention of the Mongolian People's Republic; 1961, the Mongolian People's Republic became the United Nations Member States. After the Soviet Union, Mongolia has abandoned the socialist system on 12 February 1992, and the implementation of multi-party system and presidential political system, and implemented parliamentaries. The New Constitution took effect on the same day, and the national name referred to as \"Mongolian\".\n\nAfter Sun Yat-sen, he launched a missionary movement and protector, forming the Guangzhou Military Government, tried to combine the South Warlord to overthrow the Beijing Central government, and began to turn to Lian Russia, reorganized the Chinese Kuomintang, May 1924, Sun Wen's help in the Chinese Communist Party and the Soviet Union Under the Huangpu, Guangzhou Huangpu, the Army Military School and appointed Jiang Zhongzheng as the principal, accepting the Chinese Communist Party (Third International China Branch) Party member to join the Chinese Kuomintang and achieve the \"First National Cooperation\".\n\nOn March 12, 1925, Sun Yat-sen Due in Beijing, the following year, in June 1926, Jiang Zhongzheng led the National Revolutionary Army to launch the Northern Expedition from Guangdong. By the 1928, Beijing, China, and generally unified China. When the Northern Expedition is in the Yangtze River Basin, the Chinese Kuomintang cannot tolerate the radical workers' movement of the Communist Party of China. In 1927, the General Commander of the National Revolutionary Army Jiang Zhongzheng and the Kuomintang leader Wang Jingwei, launched the Qing Dynasty in Shanghai and Hankou, clearing the Communist Party in the Kuomintang party and Kuomintang left school forces. The Communist Party launched several uprising failed, so it was transferred to the mountainous areas such as Jinggangshan, Jiangxi, and implemented the civilian and agricultural armed departments, and established the Chinese Soviet Republic in Jiangxi Ruijin. From 1930 to 1934, the Nanjing National Government has successively encircled the central Soviet area. The Red Army has repeatedly encircled the first four times, but after the failure of the China Kuomintang's fifth time, I defeated from the north of Shaanxi Province (the Party history of the Communist Party of China \" Five thousand miles) In 1935, the Chinese Soviet Republic changed its name to the People's Republic of Soviet People's Republic of China; in 1936, he renamed the Chinese Soviet Democratic Republic. After the Xi'an incident on December 12, 1936, the Chinese Communist Party and the Chinese Kuomintang launched a second national cooperation And gave up against the National Government, and change the Northwest Office of the Central Government of the Chinese Soviet Republic as a Government of Shaanxi Ningbian District.\n\nOn September 18, 1931, Japan launched a nine-eight incidents, from the three provinces of Northeast, Manchuria established in the next year, the first 傀儡 regime established by Japan. On December 12, 1936, the National Civil War after Xi'an Incident, the so-called \"second national cooperation\" is initially formed. On July 7, 1937, China's anti-Japanese war was full of outbreak. On December 13, Nanjing fell, the Japanese army conducted a massacre in Nanjing, more than 300,000 people were killed. Previously, the National Government has moved from Nanjing to Hankou, and later moved to Chongqing. And between 1940 and 1945: Under the support of the Japanese branch, the main members of Wang Jing, Zhou Fuhai, Li Shunqun, etc., in Nanjing, the \"National Government of the Republic of China\", ie \"Wang Jingwei Politics (Japanese Army) ) \", Implementing the country's Japanese counterfeiting rule. However, the national government of the Republic of China that has been moved in Chongqing (the Castue Capital), that is, Chongqing National Government; from beginning to end, \"Wang Publice\" is not recognized.\n\nDuring the anti-Japanese war, Jiang Zhongzheng commander the National Revolutionary Army and the Japanese Force 22 General Assembly War, the National Revolutionary Army died, missing 3.21 million, the navy is almost completely destroy [Note 1]. In 1945, after the end of the Second World War, China took over Taiwan and Penghu Island and other territories from Japan, abolished hundreds of unequal treaties, and was one of five permanent members of the United Nations Security Council. One of the top five. However, China still recognizes the independence of foreign Mongolia under the Soviet Control in the Treaty signed by the Soviet Union in 1946 [Note 2].\n\nSince the end of the anti-war, the Kuomintang government has conflicts with the power of the forces in the anti-Japanese War, and the parties have conflicted with material reception. Although the two sides signed a double-ten agreement and jointly participate in the political consultation meeting, it is still in June 1946. June 1946 Upgrade to a comprehensive national civil war. At the same time, the National Government is also preparing to have a constitutional relationship. In November 1946, the Constitutional National Conference was held in Nanjing, and the Republic of China constitution was officially implemented in 1947. In 1948, the first national conference was convened, and the national government was reorganized as the Chinese government, and Jiang Zhongzheng was elected as the first China Republic of China. However, in the battlefield of the civil war, after Liao Shen Battle, Pingjin Battle, Huaihai Battle, the national army's force is greatly consumed, and the liberation area occupied by the CCP has gradually expanded. In April 1949, Huaihai Batter started, the People's Liberation Army launched a battle of Fujiang, occupying the capital Nanjing Presidential House. On October 1st, Chairman Mao Zedong, Chairman of the Central People's Government of the People's Republic of China, announced the establishment of the Central People's Government of the People's Republic of China in Beijing. The central government of the Republic of China and the Party Department of the Chinese Kuomintang Central Party moved to Taipei on December 10.\n\nAfter the national civil war, the Chinese government moved to Taiwan to Taipei as the capital of the Republic of China, and the location of the central government.\n\nDuring the martial law, the Chinese Kuomintang maintains dictatorship in Taiwan, and people who support democratic freedom have been compressed by political, but still implement local public official elections. After the death of Jiang Zhongzheng in 1975, Jiang Jingguo took the power. As the industry develops from agriculture to a lightweight industry, the general education is popular, Taiwan has entered the Economic Time of the Economy in the 1970s that the top ten construction promoted by Jiang Jingguo is still deemed to promote the basic project of Taiwan's economic take-off. In the 1960s and 1970s, Taiwan's economic achievements made a whole generation of middle class, leading to the late 1980s, Taiwan's power political control system began to loosen.\n\nOn September 28, 1986, Taiwan's first opposition party democratic progress party was formally established. On July 14, 1987, the Kuomintang government officially declared a strictness, termination of the party ban, reimbursement, and lifting up to 39 years of the government's strict control of Taiwan's society. Soon Jiang Jingguo died, Li Tenghui took over the president, from then on, Taiwan entered a new era. On April 30, 1991, the Government of the Republic of China announced that the temporary provisions of the Mobilization were abolished, enabling Taiwanese Golden Horse unilaterally lifted the active military confrontation to the mainland (ie, officially declared abandoning against the continent policy). After that, the Constitution has repeatedly renovated, in 1996, the first presidential citizen was held directly, and the original president of the Chinese National Party will be elemited; in 2000, the second president of the Republic of China, from the Democratic Progress of the Democratic Progress of the Country Democracy Chen Shui-bian was elected, and the presidential election also implemented the first peace political parties in history. In 2005, the last national conference was held, the seventh increase in the Constitution. In 2008, Ma YingzJi, which was \"unwanted, unique, not Wu\", was elected, the second political parties, the second strait replacement, and the external relations have also greatly improved. In 2016, the democratic progress of the party will be selected by the president, three political parties.\n\nOn October 1, 1949, Mao Zedong announced at Tiananmen Square, which announced the establishment of the Central People's Government of the People's Republic of China. The People's Republic of China was formally established. October 1, 19, will become the National Day of the People's Republic of China. [12] [13]. At the beginning of the establishment of the People's Republic of China, China experienced long-term turmoil and war, the economic level behind, the currency depreciation, and the transportation is not smooth. After the founding of the People's Republic of China, a communist society fully imitated the Soviet industrialization model quickly established. In the early 1950s, the Government of the People's Republic of China conducted a large-scale urban industrial and commercial socialist transformation and rural land collectivity and social reform. The new government has successfully suppressed inflation, revitalizing the economy, and established a industrial system that is seriously damaged due to war. The Communist Party of China has a great impact on all aspects of the daily lives of the Chinese people: the government is flexible in accordance with the party's policy, and the party's grassroots organizations are deeply in the middle and lower laborers, women and other people.\n\nThe land reform movement began in the 1950s will confiscate the landlord's land. From the political and economic elimination of China since Qin Han, there has been a hometown of local political elite since Qin and Han, and has changed the situation of \"Huang Quan Dowe County\", national regime. The mobility power has been deeply entered into the grassroots level. The land reform is the continuation of the Land Reform of the Chinese Communist Party in the Second National Civil War, basically completed the nationwide land reform, until 1953, in addition to the ethnic minority areas such as Xinjiang, Tibet, Qinghai, Sichuan, China The land reforms in most parts of the mainland are basically completed, and more than 300 million unsuspended farmers are free to share about 700 million mu of land and production materials, and exempt from rent 30 million tons of food per year. However, since 1953, the CCP began to implement land collective ownership, enforce the implementation of agricultural products and sales policies and agricultural cooperative campaigns, once again deprived farmers' land. Scholars estimate that land reforms have caused 1 million to 4.7 million people to die, leading to demise of rural elite. Many of the victims have mastered knowledge and understanding of economic laws, with landlords for living. At the same time, three anti-five anti-motion launched, causing many false mistakes.\n\nIn the early days of the founding of the People's Republic of China, the forces of the Republic of China have supported the confrontation between the People's Republic of China and the PLA and the newly built local regime. The Government of the People's Republic of China launched a national \"行 行\" in March 1950, mobilized more than 15 million army. With the development of \"行 行\", after several years, the residual armed armed armed armed for the Chinese government in the mainland was eliminated. On June 25, 1950, North Korea launched a Korean war. In the early war, the Korean people's military, such as broken bamboo, almost occupying the entire Korean peninsula, but the United Nations army launched in Incheon, the War situation reversed, the United Nations army approached the border line. At that time, the Chinese leaders believed that North Korea was occupied by the United Nations military, and will threaten the national security of the newly established People's Republic, and therefore decided to fight in the name of the Chinese People's Volunteers. After five large-scale battles, the two sides entered the plastic state. On July 27, 1953, the two sides signed a stop agreement. The Government of the People's Republic of China has done the main force of the Tibetan army in 1950, and the Tibetan Government reached the \"agreement on Peaceful Liberation Tibet\" in 1951, and the right to control the right to Tibet. At this point, in addition to Taiwan, Hong Kong, Macao, a few coastal islands and other territories in the neighboring countries, the mainland territory has been controlled by the Government of the People's Republic of China. After the Battle of Dongshan Island in 1953, the national army did not organize the construction of the construction. By 1955, the People's Liberation Army launched a rivers and island's battles, and successively captured the entire island of Zhejiang East and was controlled by the national army. At this point, only the golden gates and Mazu, along the coast of Fujian in mainland China, are also controlled by the national army [14].\n\nFrom 1953 to 1956, the Socialist Transformation of the Production Information All Systems of Production Information. Including \"Agricultural Socialism Reconstruction, Handicraft Socialism Reconstruction, Capitalist Business Socialism Reconstruction\", also known as \"three major transformations\", and its purpose is to change the nature of production relations. At the end of 1956, the three major transformations were basically completed. The Chinese government believes that China has entered the primary stage of socialism, and the socialist system (economic aspect) is basically established in China. From 1953 to 1957, China implemented the first five-year plan for developing the national economy. A large number of technical experts, industry workers have raised national income, and improved the modernization of solving army through the introduction of the Soviet Union and Eastern Europe. On September 20, 1954, the first \"Constitution of the People's Republic of China\" (May 4th Constitution) passed at the first meeting of the First National People's Congress, and 106.\n\nAt the same time, various political movements have gradually launched. On July 1, 1955, the Central Committee of the Communist Party of China issued a \"instruction on the anti-revolutionary molecules of the fight against the struggle\". In the provinces, municipalities, autonomous regions, the People's Liberation Army and the Central League of China, the government and the mass groups have begun to clear all hidden Anti-revolutionary molecule [15]. On August 25th, the Central Committee of the Communist Party issued a \"instruction on thoroughly clearing the anti-revolutionary molecules\" [16], Mao Zedong's ratio of the suppression of the groups is 5%. [15]. In 1957, the anti-right movement was launched, and the democratic system in mainland China was severely damaged by millions of intellectuals and democratic people. [17]. In 1958, the eruption of the insection of the incident caused hundreds of people; in 1959, there were riots in the Tibetan area, causing about 80,000 deaths, the fourteenth Daxi Lama exiled overseas [18]. China was basically eliminating schistosomiasis in the late 1950s, but in recent years, there is a digestion and retirement trend [19]. From 1957 to 58, \"Asia Flu\" in Guizhou has caused 1 million people to death around the world; after the virus variation, in 1968-69, \"Hong Kong flu\" broke out, and once again caused 1 million people to death. [20].\n\nIn 1958, Mao Zedong, Chairman of the Central Committee of the Communist Party of China, launched the \"Great Leap Forward\" and \"People's Commune\" movement, objectively separated from the actual situation of lying newspapers such as exaggeration of \"satellite\". Since 1959 to 1961, Great Leap Forward, People's Commune and Institutional Problem have caused millions of people in three years of famine, and Mao Zedong has \"retreats second line\", but the Chairman of the Central Military Commission, A group of central leaders headed by the National Chairman Liu Shaoqi began to resume economic development.\n\nIn 1966, the Cultural Revolution broke out, Liu Shaoqi, Deng Xiaoping and others were knocked down, Mao Zedong mastered the power, and Lin Biao, Vice President of the Central Committee, once became a designated successor, but there was a conflict with Mao Zedong, which advocated the Amendment of the National Chairman. After Lin Biao's conspiracy, the four people became a new important political forces. The political part of the People's Republic of China was further confusing. Mao Zedong re-use Deng Xiaoping's first deputy prime minister, and reminded the State Council to work with each other.\n\nDuring the Cultural Revolution, the non-normal death method of the population mainly includes: the massacre (including official execution), fighting, private penal, suicide, cruel, etc.; according to the current information, the non-normal death population of all parties is hundreds of thousands 200 million. [21] [22] [25] In August 1975, Henan Zhumadian broke out the world's most important technical disaster \"Henan\" 75 · 8 \"Reservoir Dam\", causing 29 counties and cities Sweep, 240,000 deaths [26] [27].\n\nIn 1976, Zhou Enlai, Zhu De, Mao Zedong has died; after the four people have been arrested in Wen Rentang's incident, the State Council Prime Minister Hua Guofeng took the leadership of Mao Zedong, as Chairman of the Central Committee of the Communist Party of China, became the highest leader. Although Hua Guofeng stopped the cultivation of the cultures and other chaos in the Cultural Revolution, the \"two all\" routes were proposed, and there was still not completely detached stages of the Cultural Revolutionary Stage in the country.\n\nMao Zedong's open-national emperor in the past Chinese history, many people have been politically persecuted and big cleaning, especially in his old age, due to serious policy mistakes, greatment of Chinese spiritual cultures. The Mao Zedong era has passed the first stage of the construction of the Jianzheng, the three major sports of the Anti-American Aid, the Land Reform, and the anti-revolutionary movement, and the three anti-revolutionary movements in 1951-1952, 1957 anti-Right movement, 1958-1962 The Great Leap Forward, the Cultural Revolution of 1966-1976, according to the estimated death of 40 million to 80 million people [28], there are millions of people from compensation and persecution. Among them, the Cultural Revolution has been severely criticized and condemned due to huge disasters to the state and people. Chinese traditional culture and moral devastation, legal system and constitutionalism are seriously damaged. The Cultural Revolution also affects Cambodia's red high-kit massacre [29] [ 30].\n\nIn 1978, the Third Plenary Session of the 11th Central Committee was held, and Deng Xiaoping, who retreated to the stage, was officially arrived at the era of reform and opening up. The reform and opening up the first to establish the establishment of the family joint contract responsibility system starting from the countryside, then expanded to the city, establishing a special region, and then opened a batch of cities, after the first time there was a stock. In 1984, the economy of the mainland began to re-enter the right track, and the national economy began to grow.\n\nHowever, in the late 1980s, the folks appeared dissatisfied with the issue of inflation and official falling. In 1989, General Secretary Hu Yaobang became a firefighting, and finally broke out six or four days of Anmen incident. In an event, students and others are active for several months and require political reform. Finally, the Liberation Army ended in violence on June 4, [31] [32], this incident causes multiple casualties.\n\nHe then served as General Secretary of the Central Committee of the Communist Party of China, and the patrol of the third-generation central leadership of the Central Committee of the Communist Party of China, and the patrol of reform and opening up was stagnant until 1992 Deng Xiaoping's South Tour after continued. In 1997, the Government of the People's Republic of China received sovereignty from Hong Kong from the UK, and then received Macau from Portugal in 1999.\n\nDuring the Jiang Zemin, China experienced the 1997 Asian financial crisis, as well as the 1998 floods in 1998, causing thousands of deaths. [33] [34]\n\nAfter the 16th National Congress of the Communist Party of China, he came to the Taiwan National Second Generation of the Communist Party of China. The CCP gradually gave up the diplomatic approach to \"光 养 养\", which has frequent movements on the diplomatic stage, and strengthens the international status, and sent navigation fleet in 2008 to enter the waters of Yama, to safeguard China's maritime interest in China. At this time, China's economic reform already has a significant effect. The per capita living standard has greatly improved, and the foreign exchange reserves are known as the \"World Factory\", which has become one of the most developed countries in the world.\n\nAlthough I experienced the impact of SARS viruses, China's economic growth in 2003 reached a maximum of 9.1% in recent years. At the end of 2002, the Nansu North Conditioning Project began construction. However, economic development is still facing deep problems, including the development of the East and Western development, the gap between the rich and the poor. The Hu Ten government has made several measures, including continuing to implement the Western Development, revitalizing the Northeast Old Industrial Base, and paying attention to vulnerable groups. China continues to open its market after joining the World Trade Organization, although it is still accused of completely fulfilling its commitments. However, the tariffs for a variety of foreign products have fallen a lot. At the end of 2003, China's mainland China and Hong Kong and Macao signed the \"Arrangement of Mainland and Hong Kong and Macao on the establishment of a more close economic and trade relations\", ensuring that the products of the three places can enter the mainland market with zero tariffs.\n\nOn October 15, 2003, China launched the manned spacecraft Shenzhou-five spacecraft, and the astronaut Yang Liwei entered the space, making China have become Russia, after the United States, the third has the ability to send people in space. In the next few years, China has launched multiple manned spacecrafts, and gives a few astronauts to space. In 2004, the Beidou No. 2 project started, and navigation services were available in 2011-20. In 2010, the Dragon Submerson was enabled. In 2011, the successful launch of Tiangong No.1 was the first step in the construction of China Space Station. In March 2012, the major achievements of micron experiments in Shenzhen Daya Bay nuclear reactor were internationally concerned. In October 2012, Mo Yan became the first Chinese writer for the Nobel Literature Award.\n\nAt the same time, on August 8, 2008, the 29th Olympic Games opened in Beijing, and the host China ranked first in gold medal in 51 gold medals. With the Beijing Olympics, China demonstrates the achievements, confidence and unprecedented open mentality of economic development, large-scale foundation construction. The establishment of Beijing's city, the government has achieved high unity on this stage of the Olympic Games, and the public also shows less inclusive and support for the government. [35] From May 1 to October 31, 2010, China's 2010 Shanghai World Expo was held in Shanghai. It is the first comprehensive World Expo in China. It is also the first to host the comprehensive World Expo by developing countries. There are 256 countries. And regional and international organizations exhibit.\n\nSince 2007, the terrorist incidents in China have increased significantly. Multi-terrorism, explosive cases in Xinjiang Uygur Autonomous Region, including the 2008 Kashgar attack, Kuche bombings and 2011 Hetian 7.18 serious violent terrorist incidents, Kashgar violent terrorist attacks. In addition, there are also terrorist incidents for civil aviation flights, such as the Southern Airlines 3 · Seven Explosion Unscreen (2008) and Tianjin Airlines 7554 flight hijacking event (2012). Most of the terrorist events occurred in China's large-scale events (such as the 2008 Beijing Olympics), which caused a huge response at home and abroad, such as the 2008 Kunming bus bombings and several incidents occurred in Xinjiang. In 2012, Wang Lijun incident, Bo Xilai incident broke out, received extensive attention.\n\nOn May 12, 2008, a Wenchuan earthquake occurred in Sichuan Province, a total of 69,227 to 300,000 people were killed, 37,4643 injured, and 17923 were missing. It is the largest earthquake in the founding of the People's Republic of China [36], which is also the most calm amount of casualties after the earthquake in Tangshan [37]. The earthquake caused a total of 845.1 billion yuan in the disaster area of ​​Sichuan, Gansu, Shaanxi, etc., and the health, housing, school building, communication, transportation, public security, landform, water conservancy, ecological, minority culture, etc. were severely damaged.\n\nAfter the 18th National Congress of the Communist Party of China in 2012, Xi Jinping was as director of the Central Committee of the Central Committee, and Li Keqiang served as Prime Minister of the State Council and marked the Fifth-generation leadership collective. The two have created a Peari system, and the national rejuvenation as a goal, explains the \"Chinese Dream\" to actively fight corruption, requiring officials to implement the eight provisions of the Central Committee, reorganize the government departments, deepen economic transformation and reform. The new government has caused a huge response in mainland China society.\n\nIn September and October 2013, the Chinese government proposed a cooperation initiative to build \"all the way\", \"New Silk Road Economic Belt\" and \"21st Century Maritime Silk Road\". The Chinese government pointed out that \"a belt all the way\" initiative adheres to the principle of contending, building, sharing, and strives to achieve more perfect, more secure and efficient to form a higher level of land sea-air communication network. At the same time, the convenience of investment trade is more efficient, and high quality, high standards of free trade zone network is established. In order to make the economics along the world more closely, political mutual trust is more in-depth, human communication is more extensive. [38]\n\nFrom November 10th to 11th, 2014, the annual meeting of the 26th Asia-Pacific OECD leader was held in Yanqi Lagui, Huairou District, Beijing. The Summit adopted the \"Declaration of the 22nd Leaders of the Asia-Pacific OECD\" (\"Beijing Program (Declaration)\") [39], proposed and committed to the \"Beijing Anti-Corruption Declaration\" 旨 在 在 在 [ 40] China began to reveal its global influence. [41] In 2015, the \"TMB\" was held in Singapore, which is the first meeting of the highest leaders since 1949 since 1949 in 1949. Since 2018, a new round of Sino-US trade war is open. Since May 2020, China and India have erupted border conflicts, causing casualties.\n\nAfter Hong Kong sovereignty transferred to China, some Hong Kong people did not satisfy the interference of the central government to Hong Kong elections, requiring \"true\" universal elections, that is, \"citizen nomination\" elections. 2014 launched the occupation of the Central Ring (Umbrella Revolution) to request the National People's Congress to withdraw the resolution. The occupation action ended on December 15, 2014, lasted 79 days. In 2019, Hong Kong broke out the global \"Amendment of the Draft Movement of the Randards\", referred to as \"reverse\", the violent action between the two sides of the Hong Kong police and the demonstrators made Hong Kong's safety and the rule of law were severely damaged, and the tourism industry was close to collapse. The Hong Kong regional economy is seriously frustrated. [42]\n\nIn 2018, the Chinese Communist Party Central Committee proposed that the 13th National People's Congress revised the Constitution to delete the country's chairman and did not exceed the limit of the two sessions. [43] [44] The two of the Central Committee of Xi Jinping and the President of the Central Military Commission have no term restrictions, abolishing the restriction of the national chairman, meaning that he can become a lifelong leader after Mao Zedong, Chairman of the Communist Party of China. . [45] Scholars and media believe that Xi Jinping's practice is like the imitation of Yuan Shikai, \"The Emperor\" [46] \"The Watrich Cadres and Leading Directory\" in Deng Xiaoping, was broken by Xi Jinping. At the same time, vocabulary such as \"Yuan Shikai\" and \"restoration\" is blocked by the network [47].\n\nAfter the death of the coronary virus, Xi Jinping, General Secretary of the CPC, has always emphasized that he personally commanded epidemic prevention, and \"seeking\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" \"\" The speech at the time of coronavirus pneumonia epidemic \"shows that early January 7 has been proposed in the Standing Committee of the Central Political Bureau [48] [49]. With the successful control of the epidemic, China's economic growth is 2.3% [50], better than expected [51], China is not only the only major economy in the world, but also the total GDP has also achieved hundreds of trillion history. Break through [52] [53] [54].\n\nAt the same time, mainland China is also facing huge challenges, mainly in the global financial crisis, single dependence on foreign trade exports, environmental pollution, natural disasters, and increasing social rich gaps, corruption, some ethnic groups because of historical grievances Split activities of history, some local governments have dissatisfied people, and the contradiction between the aging of the future population structure and the overall population foundation.\n\nSince the National Government of the Republic of China, the Government of the People's Republic of China, the Government and the Chinese government of the People's Republic of China claim that they are the only legal Chinese government and negate each other. Since the United Nations seat of the Republic of China from the People's Republic of China, the vast majority of the international community believes that the People's Republic of China is a regime representing China; on the other hand, most of the international communities do not recognize that the Republic of China is sovereign, only non-official Relationship, but there are still 15 countries to admit that the Chinese government represents the government of China.\n\nOfficials on both sides of Taihai began to have interactive relationships in the 1980s and conduct a series of political and cultural exchanges in the next few years. In 2000, the Republic of China realized the first peaceful political parties, the new President Chen Shui-bian government was biased towards the \"China\" attitude towards \"China\" on both sides of the Taiwan Sea. In 2008, the Chinese Nationalist Party's Ma Yingzhi was elected the president of the Republic of China, the second peace political parties, deepened with the nine two consensus and mainland in the middle of the middle, and \"unwanted, not alone, not Wu\" as a cross-strait relationship in principle. In recent years, Taiwanese has declined to \"China\", and according to the investigation of the National Political University Election Research Center, only 2.4% of people think that they are Chinese, and 67% believe that they are Taiwanese. It is considered to be 27.5% of the Taiwanese and Chinese. [55]\n\nRecently, the Government of the People's Republic of China has facing the relevant issues related to the sovereignty of the Republic of China, and the attitude is tough. Taiwan is part of the Territory of the People's Republic of China. As a definition of China, it is the definition of China, and \"Peaceful Unity\" is the main shaft, \"a country, two systems\" as a treasure sea The framework of the two sides of the strait, intend to rule the Taiwan region to the People's Republic of China; the Chinese government, China National Party and other flora camps adhere to a Chinese and Jiuyi consensus [Note 3]; democratic progress party and the Taiwan Unity Alliance emphasize Taiwan's local awareness Need for the existence of nine two consensus. "}