{"chinese_title": "Oceania ", "chinese": "Oceania (English: Oceania) refers to geographic regions of geographic politics in geographical politics in Australia and Pacific; Oceania is not a \"continent\", accounting for 6% of the world's total land area. Oceania General English name is \"Oceania\", which is a large land in the big ocean.\n\nOceania includes four areas: Australia, Melanesia, Micronesia and Polynesia, across the East Hemisphere and Western Hemisphere; the area is 8,525,989 square kilometers, with a population of more than 41 million. Compared with the continents, Oceania's land area is the smallest; the population is less, only more than Antarctica.\n\nAustralia indigenited Australia has settled in Oceania at 4,000 to 125,000 years ago. Fiji has settled in the South Island nation or Polynesia in 1800 AD, then colonized the remaining islands in 1000 AD. [1]\n\nOceania and Asia are bound in the Papua region of Indonesia. Including Indonesia's Papua region, Papua New Guinea, Australia, New Zealand and South Pacific Island Country. Papua New Guinea is the only Oceania Countries in the terrestrial borders of the country, bordering Asian countries in Indonesia. According to the geographical boundaries, Oceania includes the Malay Islands in Papua New Guinea, Indonesia, Malaysia, East Timor and Brunei. However, geopolitical concepts are divided into new Guinea island, Western Indonesia, Sibbler, Papua, Eastern China. Papua New Guinea Independence National Development Oceania. This concept is adopted by international organizations such as the United Nations Organization, the International Olympic Commission.\n\n\n\nOceania has more than 35 million people. The following is a list of population arranged in a population density per square kilometer. Since most of the countries in Oceania are the island, the area in this list is the area containing the water area (the water area includes the area of ​​the land and the lake, the lake, the river, so this, the calculated population density The population density calculated by the net land area is low.\n\n\n\n(/ Km2)\n\n(Km2)\n\n(Estimated 2002-07-01)\n\nPacific Games (previously known as South Pacific Games) is a large-scale comprehensive sports similar to the Olympic Games, participating in the country from the South Pacific region, held every 4 years, starting in 1963. Australia and New Zealand do not participate in the Games.\n\nAU-style football is a rugby movement from the Melbourne area of ​​Australia. It is Nauru's national movement [2], which is also the most popular movement of Australia [3], in Papua New Guinea is the second popular movement [4].\n\nThe cricket is in Australia and New Zealand very popular summer movement.\n\nAlliance's football is a movement of all countries in Oceania. Papua New Guinea uses it as a national sports program [5] (Participation No. 2, second, second only to Australia), is also popular in Australia [6].\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology and guess continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚\n\n1 Site in Indonesia and East Timor are sometimes considered as Oceania.\n2 New Zealand and Papua New Guinea are sometimes considered to belong to the Macau area.\n3 New Zealand and Niue, the Cook Islands Composition Contact.\n4 United States and 帛 琉, Micronesia Federation, Marshall Islands Composition Contact\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central American · Caribbean) · South America) Culture Geography: Angulus America / English Masseari, Latin America (Iberia, Spanish) · · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate · Vice Patent Climate (Moss Climate · Iceland Climate)\nPalace:\nOther: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate\n\n\n\nBiological distribution area\n\nNew North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories, New Tropical, Antarctic "}