{"chinese_title": "Africa ", "chinese": "Afrifa [2] (Latin: Africa), referred to as Africa, is located in the western part of the East Hemisphere, the West of Europe, west of Asia, the earth across the north and south of the Equator, the world is 30, 221,532 square kilometers, accounting for the world's total land area 20.4%, [3] The population is about 1.2 billion (as of 2016), [4] currently accounts for 16% of the world's total population. It is also the main area of ​​population second continents and third world countries.\n\nAfrican climate is a treasure of ecological resources and mineral resources, and is also one of the birthplace of ancient humans and ancient civilization. At present, the oldest human fossil in the world is found in East Africa, and Egypt in northern Africa is one of the world's civilization.\n\nThe total area of ​​Africa is approximately 30 million square kilometers, which is the world's second continent only in Asia. Africa is still divided into two in the equator, and at the same time, it is in the east, west, south, and north hemisphere.\nThe Northeast of Africa has a 163-kilogram Suez Canal, making it separated from Asia [6] (geopolitical politics, sometimes the Egyptian Sinai peninsula in the East of Suez can also be considered part of Africa); the north is the Mediterranean And Europe with it from it.\n\nThe terrain of Africa is dominated by a plateau. It is called \"highland continent\" in the plateau area, and the plateau of 500 ~ 1000 meters above sea level accounts for more than 60% of the total area. The southeast has an Ethiopian Plateau, East Africa Plateau from the south. Among them, the Ethiopian plateau has more than 2500 meters, known as \"African Rock\". Only the mainland has a high mountain range in the northwest and southeast of the mainland. Africa is also distributed in many basins, such as the Equatorial Congo Basin, is a typical big basin. There is also a large area in the western coast [5] [7].\n\nThe East African Rift Valley in the eastern Africa is the longest rift belt on the world. The Sahara Desert located in northern Africa is the world's largest desert, accounting for about 1/4 of the total area of ​​the country.\n\nFrom Africa's most northern Posea, the top of Tunnesia (37 ° 21 \"north latitude 37 ° 21 ') to the most southern point of the Eagles of Eagles, South Africa (34 ° 51'15\" in South, Distance 8,000 kilometers. (Often misunderstanding the most southern end for a good angle) [8] From Africa in Senegal's highest point Cape (West 24 ° 33'22 \") to the most east point of Harbay in Somalia (East 51 ° 27 \"52\"), the distance is about 7400 kilometers. [9] The coastline of Africa is about 26,000 kilometers long, as the coastline of the mainland is relatively straight, so the length of the coastline is not assessed only for one-third of the European (European coastline long) About 32,000 kilometers). [9]\n\nThe area of ​​Africa 3/4 is distributed in the south, and the northern returns line, the equator is more wearing it, and the average temperature in the ANA is about 20 ° C above 20 ° C, which accounts for 95%, and more than half of them is hot. There are nearly half of the area with hot warm seasons and warm cold seasons. The climate is generally warm, and it is characterized by high temperatures, less rain, dry, and climatic belt distribution in north-south symmetrical. The equator is in the center, and the climate is generally lowered from the equator. The average temperature in Dalolol in Northeast Ethiopia was 34.5 ° C, one of the highest average temperatures in the world. Aziji, south of Libya, Tribaya, September 13, 1922, measuring the temperature above 57.8 ° C, which is the highest temperature in Africa. Kilimanjaro is near the equator, but due to high sea level, the top of the mountain is snowing in the end of the year [7].\n\nAfrican climate is mainly divided into five districts:\n\nAfrica's precipitation distribution is unbalanced. Near the Equator and Guinea Bay are one of the most abundant precipitation in the world, and there are few precipitation in the tropical desert climate zone on both sides of the north and south. Africa is the largest continent in the world's arid area [5].\n\nA large variety of mineral resources in Africa, large reserves. Reserves and production of diamonds, gold, chromium iron, phosphate, etc. are in the forefront of the world. African animal and plant resources are also extremely rich. African plants have at least 40,000 or more. The forest area accounts for 21% of the total Africa area. All continents are rich in mahogany, ebony, rosewood, ciba, ebony, eucalyptus, 栲 tree, walnut, yellow paint wood, plug skin, etc. The grassland is vast grassland, accounting for 27% of Africa, ranking first in various continents. The type and quantity of large-scale wild animals in Africa ranks first in the world [7].\n\nThere is a rich natural landscape in northern Africa. It is also the world's largest desert. It is also the world's largest desert. The area is also larger than Australia; there is also the world's first large Nile, long is 6852.06 km [5] .\n\nThe African population is about 1.2 billion. The current fertility is very high, and the population birth rate of Saharan Africa is still maintained at 4.6, and the United Nations and NGO have warned that no population growth will face a great difficult situation in the future. [10]. It is predicted that the African population will be three times in 2100, reaching 3.1 billion, or even 5.7 billion people [11].\n\nThe African ethnic groups are dominated by a black ethnicity of a high-semester, including Niger, and Nigero, Ban Tuas.\n\nThe former is distributed in the north and the latter is home from the south. And the gap between the two is quite large. Although the northern Islamic area is a desert, the northern Arab countries entered the stable development from the Western independence, using oil-selling funds to complete the industrialization of society, and have appropriate political conditions, rule of law Education, basic construction, etc., recently started to launch tourism (such as Egypt), driving Islamic democratic movement and other.\n\nHowever, due to the high fertility rate, the cultural and malnutrition, the cultural level, the level of education and cultural level, the general population is generally low, and the development is slow, although all localities have rich minerals, such as gold, copper, iron , Manganese, uranium and non-metallic ore oil, etc., but only a few partially effectively developed, the meager profits of selling minerals have been diluted with the gap between the rich and the poor, and the past belongs to European colonies, the economic structure is not perfect. Because political corruption is still not improved; if the natural environment is bad, it is not too dry to be too wet, and many small national politics have not stabilized, and the public security of drugs, the black gun robbery is rampant, and the racial complexity is caused by the country of China. It is generally in poverty.\n\nThe African language is mainly 4 languages:\n\nWith the invasion of European colonial countries, most African countries use other languages ​​outside Africa as official languages, but there are also local languages, such as Swahili is used as the official language of African countries. In Africa is widely used in Arabic, French, English, Portuguese, South Africa, and Madagascaries, etc., which belong to the flash system, Indo-European and South Island.\n\nAfrican foreign religion is Jewish and Christianity. Byzantine era Egypt, Nubia (now the Republic of Sudan), Akssum (now Ethiopia) is a regional belief in Christian, the Abu Miki Church of Egyptian Alexander and the Sinai Peninsula Monastery is loaded into the World Cultural Heritage List The ancient Christian remains, located in Tagaste City in the Today's Algeria is the hometown of Christine Master Augustine.\n\nAfter the rise of the AR, the Arab Arab Arab is rising under the banner of Islam, Northern Africa and East Africa quickly have been fought in the Arabian Peninsula, and the Byzantine Empire of the Byzantine Empire, who is hurt in the long-term hurt of Sassan, and is unable to resist Muslims. Conquer the tide, Egypt, Magiib, Nubia, etc. have gradually Arabic and Islamic, only in Egypt, only in Egypt, and believe in Christian Ethiopia has become a fruitful Christianity.\n\nThe ambition of the Muslim conqueror did not stop in North Africa, and the Arabian military continued to promote the south to the south to the black people, and the Arab businessmen came to East African islands and coastals through navigation. Even after the Arab Empire collapsed, after disintegration, Islam spread in Sahara and Sahel zone, the pace of communication has never stopped, the most powerful black country in ancient history - West Africa's Mali and Sanhai Empire are devout ambassador And to foreign mission.\n\nAfter the opening of the new route, the European colonists re-brought the Christianity to Africa and decided in Africa for nearly 1,000 Christianity recovery. In the 16th century, Portugal established a missionary base in West Africa. In the 17th, 18th century, the Netherlands immigrants introduced the new teach Karlin into the southern Africa. In the late 19th century, European powers set off the African frenzy, Portugal, the United Kingdom, the Netherlands, Italy, France, and the United States and other Western countries entered African mission under the support, while West Africa's Haosa people were previously launched. Seventy-decade (1804-1874) Islamic Jihadi also entered an end with Muslim victory, forming a situation in Christianity and Islam and Islam in the West Africa.\n\nAfrican Islamic and Christianity, the forces of the original religion is roughly 12 degrees in the division of 12 degrees in the north latitude. African countries north of Northern African countries are Muslim countries, and the Northern African countries (regions) in the north latitude are in addition to Guinea. Somali, Djibouti, Comoros, Sanjibabal Islam did not account for absolute advantages.\n\nWithin the scope of Christianity and the original religion, the Christian forces is large, and the countries with more devout people teach people have the equatorial Guinea, Uganda, Botswana, Lesotho, South Africa. The former British colonies in Africa are more believed in Christ, while France, Belgium, and Portugal, the pre-colonial colonies will pay more attention to Catholicism.\n\nNigeria, Ethiopia's Christians and Muslims roughly each, the number of Muslims in Kenya, Tanzania, and Uganda, but unable to occupy the advantage, Nigeria's Bo Sheng, Somalia's major black Muslim extreme terrorist organizations for Africa. Uganda's Holy Spirit Army is the largest Christian terrorist organization in Africa. In Uganda, I have happened to the Christian Extreme Party \"Restoring God Ten Commandment\" incitement of hundreds of believers collective self-immolation. The Qinban Ancient Conference is a new religion of Christianism and African traditional beliefs in the Congo Basin.\n\nThe African Unified Organization was established on May 25, 1963. Under the host of Mubeki, the last chairman, was renamed the African Union on July 9, 2002. The purpose of African Unified Organization is to unite African countries to form a unified voice representing African countries. Opposing colonialism, establishing an STUG helped Africa to conduct independent movements.\n\nIn July 2002, the African Union was established in South Africa. Including 55 African Member States Integration Unified Organizational Unified Organizations, AU is a pleasant political entity that is integrated with political, economic and military. The African Union has a planned uniform use currency, joint defense forces, and established a cross-state legislative administrative organ, including a civil cabinet government that manages African Union. The main purpose of this alliance is to help develop and stabilize African democracy, human rights, and the economy that sustainable development, in addition to reducing armed warfare in Africa and creating an effective common market. On July 2, 2007, Libya leaders, Kadafi, in the African Union Summit held in Accra, Ghana, held an alliance.\n\nLong-term racial conflict and tropical diseases, industrialization caused by environmental damage, in the past, the western colonialism, independent corruption regime, education, people self-discipline, so that Africa has become the lowest in the world. According to the United Nations, the human development report published in 2009, 22 of the lowest in the human development index, two of which are African countries (159th to the 182th).\n\nUnder a large number of investment and counseling, China, India and Latin American economy rapidly grow millions of people to get poverty, but Africa is slower than other regions in other regions. Poverty in Africa has a very serious problem, including low per capita expectancy (Swazili expects less than 33 years old), violence.\n\nSome areas of Africa, especially Botswana and South Africa, and the economic development is relatively successful. The former more than 4-point fiscal budget is used to improve the infrastructure of the capital, Haboene, making it one of the fastest growing cities in the world. The latter has rich natural resources, and the perfect Western system, one of the most important gold and diamond producing countries in the world. Other countries such as Gana, Kenya, Garn, Cameroon and Egypt, many of the releared tourism and petroleum industry, so the public security and infrastructure established in foreign assistance has reached a certain extent, and the economic development is also ideal.\n\nAgriculture is an important sector of an African economy. The corn cultivation in grain crops is the most growing area, is the staple food of rural residents; wheat and rice output cannot be self-sufficient, it takes a lot of imports. The economic crops for export mainly have coffee, cocoa, peanuts, cotton and swords. [5].\n\nThe mining industry and light industry are the main departments of the African industry. Gold, diamond, iron, manganese, apatite, aluminum mine, copper, uranium, tin, oil, etc. have an important role in the world. The light industry is processed with agricultural and animal products and textiles. The wood industry has a certain foundation and the material is more. Heavy industry has metallurgy, machinery, metal processing, chemistry, cement, marble, diamond, rubber products, etc. [7].\n\nFrom 1995 to 2005, Africa regaled economic growth, with average of 5% in 2005, and some countries that have just started to develop petroleum resources, such as Angola, Sudan and Equatorial Guinea more than 10%. However, Africa's advancement has a gap in other countries.\n\nAfrica is full of fatal viruses such as malaria, dengue fever, Ebola, cholera, AIDS, encephalitis, etc. Its main reason is usually due to the lag of sanitary conditions and many local primitive viruses. In addition, human beings are also preded by animals with latent viruses. Through wounds, blood contact, water source and other factors are largely propagated, the source of viruses has been said. When these viruses spread, there are also scholars [Who? ] Point out that these viruses may be due to the fall of meteorite falling in hundreds of millions, and the virus in space invaded the Earth, so it ultimately leads to these deadly viruses to be spread, so that humans have always found a way to solve these viruses. [Source Request] Scholars pointed out that these viruses may be in vivo lurking in some animals, and these viruses have gradually contagiously infected people with humanity and destroying nature for these animals.\n\nAfrica has splits many countries after the Second World War, which is the largest in the world.\nThe largest and smallest countries in Africa are Algeria and Island Seychelles; [16] The smallest country in Africa is Gambia.\n\nAfrican Football League (CAF) Official Website (Fiction) (English)\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology Continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central American · Caribbean) · South America) Culture Geography: Angulus America / English Masseari, Latin America (Iberia, Spanish) · · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate · Vice Patent Climate (Moss Climate · Iceland Climate)\nPalace:\nOther: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate\n\n\n\nBiological distribution area\n\nNew North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories, New Tropical, Antarctic "}