{"chinese_title": "philosophy ", "chinese": "Philosophy (English: philosophy) is a discipline, basic issues, including existence, knowledge, value, sensibility, mind, language and other fields [1] [2]. The difference between philosophy and other disciplines is that philosophy has a unique thinking method, such as criticism, usually a systematic approach, and is based on rational argument [3]. In daily terms, philosophy can be attached to the most basic beliefs, concepts or attitudes of individual or groups [4], but this is not here.\n\nEnglish Word Philosophy (Latin: Philosophia) Since the ancient Greek ισοφία, meaning \"Love Wisdom\", sometimes translated as \"Wisdom of Friends\" [5] [6], this word is φίλος (Philos, Love) The derived word φιλεῖῖ (Philein, I Love) and σοφία (Sophia, Wisdom) are combined. It is generally believed that the ancient Greek thinker Pythagora 200 introduces two terms \"philosophers\" and \"philosophy\" in the work [7].\n\nThe word \"philosophy\" refers to the ancient Chinese refers to those who are good at thinking, learn to be young, such as \"Confucius Ten Zhe\", \"Guosheng Pen\", etc. thinker\". In 1874, Japan's enlightenment family, first translation of philosophy in \"Hundreds of Philosophy\" in \"One New On\" [8] [9]. The Chinese name of the philosophy and the Chinese name of the English: Metaphysics is taken from \"Yi Jing · Zhou Zhu\", \"shape is said to be said,\" the person is said to be said \"[10].\n\nBritish philosopher Russell's definition of philosophy is:\n\nHu Shi said in the \"Chinese Philosophical Sylla\". \"Any question of studying life, fundamentally thinks, to find an fundamental solution: this kind of learning is philosophical\" [12].\n\nAlthough philosophy is from the traditional Western tradition, many civilizations have some similar topics in history [13]. East Asia and South Asia philosophy are called Oriental philosophy, while North Africa and the Middle East are often considered part of Western philosophy because they are closely interacted with Europe.\n\nThere are many views on philosophy. Some people think that philosophy is a review of the process of the problem itself; others believe that there is a philosophical proposition that must be answered in philosophy. [14]\n\nAncient Greek philosophers often ask questions. The issues they have proposed can probably be classified as three categories. These three types of issues have formed philosophical basic disciplines, respectively, to go to school, ethics, knowledge [15] [C 1] [a 1] [16].\n\nThe philosophical theory of \"not required to accurate reason\" in modern philosophy, such as \"essential skills\" (identified inherently unknown), this phenomenon will not be known (the existence of someone else can not understand).\n\nSince the Aristotle Era, logic usually plays an important role in classical or modern philosophy. In particular, the three paragraphs proposed have a far-reaching impact on Western philosophy. [17]\n\nPhilosophy can be divided into many different branches, mainly including forms, enhancement, ethics, logic and aesthetics [18] [19].\n\nThese branches are philosophical research applications in other disciplines, or cross disciplines.\n\nMany human communities think about philosophical problems and learn to establish a variety of philosophical genres.\n\nOriental philosophy is organized through historical periods in each region. Western philosophy can generally be divided into three or more, the most important thing is classical philosophy, medieval philosophy and modern philosophy [20].\n\nThe historical source of Indian philosophy is long. As early as the period of the Veda, it has begun to the 6th century BC. At that time, the ancient Indian thought circles were released. The most famous of the famous Buddhist founder Sakyamuni Buddha, Jain founder, Zhamo, Aprendo, Wings, Po, Pu Fu, Franka, Frana · Gay, the number of theories, etc.\n\nThe main part of Chinese philosophy originated in the East Week, when the ambiguism is widely known [21], with Confucian Confucianism, Laozi's Taoist, Mozi's ink home and late Fa, and some geography, such as farms, yin and yang The name is not shown in and the name of the name. In addition to the French, Confucianism, other genres outside the Qin Dynasty were no longer active. In contemporary, Chinese philosophy is still playing in Asian culture, but the physiology is still arguing whether Chinese philosophy should be sure to philosophy.\n\nFor example, Mou Zong San has defined philosophy: \"Anything to the humanity activities and reflection, it is philosophy.\" Milong 3 believes that China has thousands of years of cultural history, there is a philosophy. It is just Chinese philosophy to attach importance to the subjectivity, and the West attaches importance to the objectivity. Therefore, if the philosophy is defined in philosophy, China does not have this. However, if the primary direction is defined under philosophy, Chinese culture has philosophy. The vice versa of the Western philosophy is mostly in literature, art, music, etc. Just in the history of Western philosophy, there is no chapter to talk about Jesus. [twenty two]\n\nAncient Greek-Roman philosophy is a period of Western philosophy, time for the 6th century BC [about 585] to the 6th century. It is generally divided into three periods: former Socrates period, Plato and Aristotle Classical Greek period, and then Aristotle (or Greek) period: sometimes will put new Bora chart and Christianity The advanced era of philosophers is added as the fourth period.\n\nIn the 6th century BC, Western philosophy has begun to stand out from ancient mythology and poetry, and gradually began to develop independently on the composition of the universe and the thinking of the source. Former natural philosophers in the former Socrate period pay more attention to nature, it is considered to be the earliest philosopher in the West [23], whether they understand and explain whether the world is correct, but their ideas are reasons for superstition In yosing, these philosophers have summarized the phenomenon of nature in a rational counseling. Such as:\n\nThe priority of the research in the mid-5th century BC has formed the focus of the study to the human itself. It is believed that \"the talent is the foundation of all things.\" They don't believe in real existence and truth. Protegola believes that it is non-good and evil that is relative to people, and Golgia believes that all the same fake, this is the narrowed shape. [A 2] [B 1] [D 1] [C 2]\n\nAt the end of the 6th century BC, the philosophy of Pythaglas-based Pythaglas School, the philosophy, and the aforementioned views of the foregoing. The history of Rome records the first name of Pythagora, saying that he is a philosopher, or is love wisdom [24]. He believes that \"everything is a number.\" It means that the essence and structure of all things are determined by the digital relationships they contain. He claims that the average, order and harmony is the three major tones of the universe, and the hint of the universe is tiered by music. His school will summarize the universe as a combination of ten nature: limited and unlimited, odd and even, less and more, left and right, male and female, static and moving, straight with song, bright and darkness, goodness Evil, party and circle. At this time, the essence of mathematics and its status has always been one of the main problems of philosophy. Mathematics is not affected by the uncertainty of observation and experimentation, and it is understood by pure thinking. [A 2] [B 2] [D 2] [C 3] [24]\n\nAmong them, the relationship between change and constant, the difference between the real world and the intuition world, the contradiction between truth and opinion, leads to a problem of collapse.\n\nThe key characteristics of Western philosophical methods in the classical Greek period are established: relying on resort to rationality and argumentation, through a critical approach to accept or establish a view. This includes the dialectics of Socrates known as the Socate anti-law or \"refutorial\" approach, and he mainly uses its key moral concepts such as kind and fairness and justice. This approach decomposes a question into a series of questions, gradually extracts the answer you want to find in question, which can be seen from the scientific methods used in the current use of the scientific method. stage.\n\nSocrates did not teach people directly, but the Berracha is deeply affected. The entire philosophical idea comes from two theories: one, never do bad things; second, one inner is really kind and just people will never do the opposite. He believes that the truth has its objectiveness, trying to overthrow the wise people 's ideas for the truth with individual subjective feelings. Then put forward the concept of Germany, as as a direction of life. What is the problem of morality, Socrate's reply is \"knowledge is moral.\" What is the problem of knowledge, he replied that knowledge is the concept of rationality. Socrates pioneered epistemology and ethics, so that he laid his philosophical status [a 3] [B 3] [D 3] [C 4].\n\nThe philosophers in the classical Greek period Zhongba Lave and Aristotle have the greatest influence on the later generations [25], especially Plato is considered to be the founder of Western philosophy. Philosopher Alfred Nos White Black Evaluation Plato: \"European philosophy tradition is most commonly recognized, that is, it contains a series of pins to Plato. I mean is not a suspected scholar system system. Extract the work from the Archa. I hinted the wealth of the general thoughts they scattered. \"[26] Even for thousands of years, people still tried to answer the questions he raised, which also represents these problems. Or more problems extending in these issues are confused.\n\nPythagoras' thoughts have a significant impact on Plato and affect the entire Western philosophy through Plato. Plato and Aristotle have critored other \"wise people\" as the earliest classical Greek philosophers, and these people were called \"defense\" in Greece and quite common before Pythagora. From their criticism, in their classical era, a purely \"love wisdom\" (real philosophers) and those earlier travel teachers - often through their own skills - - was established after the watershed.\n\nAfter Aristotle died, the entire philosophical circle was in the independent period, called the Greek philosophical period. Because the entire society and politics are fascinated. During this period, Stumen Geraiso and Yilu Lu Ruchi were produced, as well as skepticism, New Bra Titi and New Pichatoporism. The common feature of these schools is ethical. Stumen is mainly to comply with nature and homemade. The Eli Lu Luxue is the standard of happiness as the nature and goodness of life. The Newbora Titi and New Pythagoras are philosophies with religiousism and gradually produce melted theory of Christianity and Greek philosophy, which is the later Christian philosophy.\n\nUntil 529 BD, Rome Chairman Chaser Dingniyi Command Close Athens Plato College [A 4] [B 4] [D 4] [C 5]. J.B. Bury said some of the remaining college members escaped into the Sasan Dynasty, Thai Sea [27].\n\nIndian philosophy refers to the philosophical ideology originated in the Indian sub-continent, including Hindu Teaching Philosophy (English: Hindu Philosophy), Buddhist philosophy, Jain Philosophy (English: Jainism Philosophy), these Indian philosophy have some common and complex origins. There are themes related to Dharma and industry, and all hope to reach individual liberation. These philosophy of philosophy is in the previous century to the West New Year's time.\n\nThe medieval philosophy refers to the philosophical system of Western Europe and the Middle East in the Middle Ages, and its time range has not contained, which is roughly from Christian Roman Empire to the Renaissance [28]. The medieval philosophy is partially defined as a re-discovery and further development of classical Greece and Greece philosophy, and the other is to solve theological problems and interact with the world of Bellahan Education (Islam, Jewish and Christian).\n\nRenaissance people exclude a \"transition\" barbarous period between the classical era of Rome, Greece and classical culture. However, in the Middle Ages, this is still growing in Europe in Europe. Netherlands Glacia (English: Jorge Gracia) believes that \"in strength, complexity also has achievements, it is convinced that philosophy in the thirteenth century can be comparable to the golden period of the ancient Greek philosophy of BC.\" [ 29]\n\nThe problems discussed in this era have the relationship between beliefs and reason, the existence of God, the unity, theological topics and shapes, and the problem of knowledge, universe and individuals.\n\nMedieval philosophers include Christian scholar Hippo's Augustine, Bo Yuxus, Aselon, Pavijie's Gilport (English: Gilbert of Poitiers), Pierre Abra, Roill Bacon, Saint Wende, Thomas Aqua, Dun Si Divired, Okam's William and Bridam, etc .; Jewish philosophers Monnid and Gilans Nid (English: Gersonides); Muslim philosophers KFI, Faraby, Heshwood, Iben West, Ansauri, Iben Bazhe, Iben Tufili (English: IBN Tufail), Iben Helestown and Ira Ben Lu Shid et al. The medieval philosophy tradition is still active until the 17th century, such as Francisco Suarez and John Budo Tot (English: John Of St. Thomas). Among them, the parent of Thomas is greatly affected the entire Catholic Europe. He is particularly emphasized in rational and argumentation, one of the new translations of the works of Aristotle and enrichment. His work is obviously away from the idea of ​​the new Bora chart and Augustine, most of the early early quarterly philosophy.\n\nStarting from the Renaissance, people's thoughts begin to go out from the clean paradise and come to the world. Thus developing nature, it also develops humans themselves. Thus, two people who have both humanism and natural philosophy have both links and differences.\n\n\"Renaissance\" is a general term for the transition between the Middle Ages to modern times. [30] The re-learning of the classical literature is transferred from the interesteness of the philosophy, metaphysics and theology of the school. Educate and mysterious research. [31] [32] Research on classic and humanistic art, such as historical and literary, enjoy unprecedented interest in the Christian world academic community, this trend is called humanism [33] [34], it is suspected of Plato, Greece suspected The influence of mismatics and Roman Dora. Humanist's philosophy interest is transferred to the Creator and its virtue, replacing the intention of the medieval and logic [35] [36].\n\nAt that time, there were two new ways to study classical philosophy. On the one hand, the study of Aristotle has changed due to the influence of Aloloism (English: Averroism). The Avilo Yarosian and the more all-handed Catholic Aristotle, such as the difference between Elbot McNus and Thomas Aquari, eventually developed in the revival of literature and art. A \"Humanistic Aristotle Philosophy\", such as Boto, Pomponazzi (English: Pietro Pomponazzi) and Jakomo Sabarrira (English: Giacomo Z Thought of Abarella. On the other hand, with the help of the discovery of the works known to Western Europe, the study of Plato and New Brabi as another choice will become general. The famous Renaissance of the famous Renaissance, including Nikola, Kuca, and after Malcissilio Fechino and John Pedic Dram Milan Dora [36].\n\nRenaissance has also resended the interest of anti-Aristotle as an organic, living whole, not dependent on the theory of theology, such as Nikola, Nikola, Nikola, Nikola. Ni, Jaerno Bruno, Bernardino Telesio (English: Bernardino Telesio) also has the work of Tomaso Cantaina [37]. Such sports in natural philosophy and interested in mysterious, magic, and Hermensian also have interest, which are considered to hide the gates of harvesting knowledge and controlling natural methods. [38]\n\nThese new philosophical movements accompanied by the consensus of European religious and political dramatic: religious reform and feudal decline. Although theologists involved in religious reforms have no direct interest in philosophy, they break the traditional basis of theology and knowledge authority. Also accompanied by the rejuvenation of beliefism and skepticism, reflecting the thinkers such as Irasum, Montene and Sanchez (English: Francisco Sanches) [39] [40] [41]. At the same time, the process of politically gradually centralized centralized centralized centralized centralized political philosophy, such as Nico Makiaville (often described as the first modern political thinker, or the key to modern political thinking Point [42]), Thomas Moore, Irasum, Yustz Leps, letting Bodan and Hu Gui Ge, etc. [43] [44] [A 5 ] [B 5] [D 5].\n\nAfter the first Qin Zhu Si's two-haired, Wei Jin Xi Xue is a part of Chinese philosophy. Since the Tang Dynasty Buddhism has also begun to have an important impact on philosophy; however, the most important part of the Chinese philosophy is the development of Song Ming.\n\nSong Mingzuo has been against the Han Dynasty began to affect Confucianism and the superstition and mysterious elements in Buddhism. It is a philosophical movement advocacy and secularize Confucianism [45]. Although the students were criticized by Taoism and Buddhists, [46] Science still borrowed two of the terms and concepts. However, with Buddhism and Taoism, I met my shape as the spiritual development, the catalyst of religion and the immortal, and the Song Mingzhi has formed a guidance of establishing a rational ethical system [47]. The origin of Song Mingzukes can be traced back to Tang Dynasty: Han Yu and Li Wei are regarded as the pioneer of Song Agency [46]. Song Dynasty, Zhou Dunyi, the teaching of the school, established his ethical philosophical system as a framework, and he was seen as the founder of Song Mingzhi [47].\n\nOther places in East Asia, Japanese philosophy is formed in the local gods and Buddhism, Confucianism, Confucianism, and other Chinese philosophy and Indian philosophical school mixing. Similar to Japan, the emotional content of witch in North Korea (English: Korean Philosophy) was mixed into the acousticization of China.\n\nMain entry: modern philosophy\n\nThe modern early general refers to the 19th century and 18th centuries in the history of Western philosophy, including the enlightenment era [48]. Modern philosophy is different from its predecessor, and its relationship with traditional authorities such as churches, colleges, and Aristotle is more independent [49] [50], there have been new interests in the construction of knowledge and shapes and the above-in-law [51] [52] And get rid of the emergence of modern physics of natural philosophy [53]. Since the 17th century, modern philosophy will learn the focus of study. Due to the controversy of experience (empirical) and the theory (rationalism), the relationship between material and spirit is highlighted as the primary problem of collaborativeism.\n\nAt that time, other philosophical focus included spiritual nature and their relationship with the body. The new natural science impact on the topic of liberty will and God belongs to the theology of theology, and the secular basis of ethics and political philosophy.\n[54]. This trend was first distinctly reflected in the new, empirical procedures for the expansion of knowledge in Francis Bacon, and quickly academic and rationalism in Cartesian mechanism physics and rationalism. The form of huge influence is established [55]. Bacon uses the induction method, the first principal \"person\" proposed to \"people\" should actively interfere with the service [A 5] [B 5] [D 6].\n\nNasmus Hobus, ancestor of modern political philosophy, to apply this methodological system in political philosophy, including the modern theory of \"social contract\" [56] [57]. Early modern philosophy academic classics generally include Descartes, Sinoa, Leibnitz, Locke, Beckle, Hume and Kant [58] [59] [60]. At the same time, other ideas have also contributed to philosophy, such as Galileo, Pierre Galazi, Blazis Pasca, Mararord, Aisak Newton, Christian Wolf, Meng Derset, Pierre Bell, Thomas Rude, Let Le Lang Daren Bell and Adam Smith, let - Jacques Roussea is the groundbreaking character of anti-opening movement. The rough end of early modern philosophy is usually determined to be an attempt to define a definition of Imanur Kant, which proves scientific knowledge and use morality and freedom to adjust the system [61] [62] [63].\n\nThe rationalist Zhongli Cartesia believes that the material world is a single system consisting of mathematical relationships, and he attempts to translate physics into mathematics. In his work, he satirized the Chinese philosophy and the philosophical system in his era. It believes that \"I think so I am\" is an unsubstable starting point. Descartes is a binary attraction of the spirit and substance. In order to clarify the relationship, he firmly believes that in God, the spirit and substance are unified. Its theory is called Cartesian\n[a 6] [B 6] [D 7]. Sinoa is after Cartesale, another famous aurator. His epistemology, geometry and mechanical view come from Cartesi. But he does not agree with the binaryism of Cartes, believes that spirit and substances are only the only entity.\n[A 7] [B 5] [D 8]. Libniz as the only theory firmly maintains Cartesar's theory and refutes John Rock's theory. Unlike Cartes, he thinks the entity of all things is \"single child\", and there is no relationship with each other, but because \"pre-hypodal\" can coexist, that is, in God. \"Anti-harmony\" is adjusted to the duality of Dublin's dual balances and Sinoa entities. [b 5] [A 8] [D 9]\n\nLocke has developed experience. He does not agree with Cartesol's \"Talent Concept\", which presents whiteboard that he emphasizes people from feeling abstract universal concepts, thinking that individual things in the feeling are the first. However, he basically agreed with Cartesar's binaryism. Becklai has developed Locke's philosophical theory and put forward \"existence is perceived.\" He believes that there is no more than a perceptual theme and perceived perception. He very disagree with the abstract concept of the material, thinking that it is not objective, and it can't exist in people's hearts. David Hume's theory is further more than Becklai, but he is not only the substance entity does not exist, but it is more considered that the spiritual entity does not exist. Only recognize the existence of perception. He also believes that there is no uniformity and universality of its own unknown, and the universality is the highest principle. [a 9] [B 7] [D 10]\n\nThe debate of experience and the only theory also contains materialism and idealism. In the 18th century, France's Latini-Television public announced that materialism is the only thing, and the editorial of the encyclopedia Deddo also refused to recognize the existence of God.\n\nIn addition, Voltaire, Monndes and other encyclopedic scholars have involved in political and ethical areas. They all believe that mechanism is the final form - the substance is the only one and the eternal movement, the spirit is just the properties of the human brain. So they think that inorganic matter and organic matter cannot be subject to people, people's thinking is the result of human sense. However, they are still empiric, in causality, they think that only inevitably is the only thing, this is the idea of ​​idealism [D 11] [A 5] [B 5].\n\nSince the middle of the 18th century, until the early 19th century, philosophy entered the summary of modern philosophy, this is the German classical philosophical period. There are two clues to mark the arrival of turning: 1. The relationship between thinking and existence is more clear; Second, the system dialectics are generated. Its represents the characters have I. Kant, J.G. F. W.W. Xie Lin, g.w.f. Hegel et al. [A 5] [B 5] [D 12]\n\nKant has brought three iconic creations to philosophy:\n\nHe is affected by Hume and has brought a revolution for Western philosophy. He believes that the study of philosophy is the rules of rational tasks.\n\nKant agreed to Hume's theory and believed that there were some principles that allowed the soul to organize experience and understanding, and evidence can be found in mathematics. That is, it is much more than the definition of the concept that is included in the proposition. He is called the priori method of critical philosophy, and some of the scientific and forms of experience will inevitably be pre-existing in everything.\n\nWith his three \"critical\" work, the corresponding structure is made for the priori method:\n\nHe also laid a new foundation for moral philosophy, and he gave the new meaning of freedom concept. Because of its influence, it is still in modern times, and its theory is called Kantism. [A 10] [B 8] [D 13] [B 9]\n\nFishert was originally acknowledged the cause of the mechanical decision of Sbinosha, but later was influenced by Kant, began to believe that the cause of the causal decision is only the surface, and it is the main body of independence of the inevitable slave. In this end, he has established subjective thinking and objective existence.\n\nXie Lin is from Fishert theory, but the influence of Subinosa and literary romanticism has created their own way. That is, he thinks that nature and spirit, existence and thinking, object and subject, the opposite surface, the unity of the same \"absolute\", this \"absolute\" is the root cause of all things. He believes that art is the most intuitive rationality. [D 14] [A 5] [B 5]\n\nHegel and its theory have pushed a new height of Western philosophy, and he founded the largest objective idealist system in Western philosophy, and systematically expounded the dialectics. His theory and learning have had a far-reaching impact on modern philosophy and is called Hegelism.\n\nA variety of philosophical movements developed from Hegel's ideological system. Its focus is the historical and logic as the master, history, it understands \"all reasonable is reality\" from different perspectives; logic, it has found the \"truth is the whole\".\n\nHegel believes that the focus of philosophy is to give up division and reach unity. He said the previous era is thinking and existence, ideal and realistic split, freedom and inevitable, personal and social, unlimited and limited, unity and diversity split.\n\nHe started from Kant's \"rationality of the mind and the active role of experience\", but opposed to Kant's \"World of Experience World and the world\" world \"and considered the same base rational structure as the soul. The universality he believes is not from special abstraction, but includes special inside, which is specific; the unified unity is also non-detached, and the aligned unity is included, but the unity of them. Alternatively unified. The above integration is his theory: the most authentic unparalleled overall \"absolute spirit\" is also the unity of opposition.\n\nHe believes that in order to achieve this \"absolute spirit\", it takes three phases, from logic, natural to the spirit, that is, from thinking to the existence, and then to the unity of the unity, thereby completing his unity.\n\nIn this regard, social and historical phenomena have been given a new and new dominant position in philosophy. He also returned ethics to this area, thus making important routes in ethics theory and the understanding of ideas. [a 11] [B 9] [D 15] [B 10]\n\nFrom the middle of the 19th century, Western philosophy entered the modern philosophy. Because in the mid-19th century, Europe's industrial revolution was completed.\n\nModern philosophy, especially in the middle and late philosophy of the 19th century, there is a paragraph of uncle, Xin Kantism, New Hegelism, Marxism. However, at this time, the philosophy and the later existence, phenomenon, etc. in contemporary generally be \"continental philosophy\", and \"Analysis philosophy\" developed by rigorous logic and preliminary analysis after the twentieth century has become two major weeks with different styles. Philosophical model.\n\nThere are two mainstreams in Western philosophy in the 20th century:\n\nModern philosophy mainly includes the following trends. [A 12] [B 11] [D 16] [B 12] [D 12] [C 6]\n\nHistory philosophy:\n\nMainstream Marxism:\n\n\"Philosophy is only continuously explaining the world, and it is related to the present.\"\n\nWestern Marxism:\n\nHegelism:\n\nStructuralism:\n\nAnalysis philosophy:\n\nTentative:\n\nNew Kantism:\n\nLogic motivism:\n\nLanguage philosophy:\n\nPhenomenology:\n\nmaterialism:\n\nNew Thomasism:\n\nScience philosophy:\n\nWillism:\n\npragmatism:\n\nExistentialism:\n\nExplanation:\n\nVarious variants of idealism are quite popular in the 18th century to the early 20th century philosophical circles. The prior artist of Kant's claim is that people's understanding of things is bounded because many things are not available in objective judgment. His work issued in 1781, \"purely critical criticism\" tried to adjust the two major philosophical factions in the 18th century: empirical and rationalism, and establish a new foundation for studying. [64]\n\nGermany's idealistism is the \"spiritual phenomenology\" published in Hegel in 1807. Hegel admits that his own philosophy is not new, but his goal is to complete the incomplete system of previous philosophers. Hegel believes that the focus of philosophy is to give up division and reach unity. He said the previous era is thinking and existence, ideal and realistic split, freedom and inevitable, personal and social, unlimited and limited, unity and diversity split. He started from Kant's \"rationality of the mind and the active role of experience\", but opposed to Kant's \"World of Experience World and the world\" world \"and considered the same base rational structure as the soul. The universality he believes is not from special abstraction, but includes special inside, which is specific; the unified unity is also non-detached, and the aligned unity is included, but the unity of them. Alternatively unified. The above integration is his theory: the most authentic unparalleled overall \"absolute spirit\" is also the unity of opposition. Hegel believes that there are three phases to achieve this \"absolute spirit\", from logic, natural to spirit, that is, from thinking to the existence, then to the uniform process, from Complete his unity. He also returned ethics to this area, thus making important routes in ethics theory and the understanding of ideas. [a 11] [B 14] [D 15] [B 10]\n\nMarxist philosophy is a philosophical system established by Marx and Engels. It believes that practice is the only standard for the truth of philosophy. Philosophy should be accompanied by the development of society, science and technology and culture [65] [66]. Its main ideological system was founded in 1970s, and the establishment of Engels in the 1970s. In the 1920s, a complete system was formed in the Soviet Union - dialectical materialism and historical materialism. This system has developed under later socialist countries. [66] Marxist philosophy declared that his theoretical system was scientific, and it was considered that philosophy can become part of science [65]. At the same time, Marxist philosophy believes that philosophy also has ideological properties [65] [66].\n\nIn addition, Marxism also refers to a variety of communist movements in politics, such as the Soviet Marxism, which was revised by Lenin, called Marxism, and the Treses of the Russian revolution and later established Communists. Its bypass includes the Trotsky and the Marxism, Mao Zedong Leninism, etc. [A 13] [D 17] [B 11] [B 12] [B 13] [D 12] [C 8]\n\nThe pragmatic philosophical faction produced in the 1970s has become a mainstream trend in the United States in the 20th century. The research on law, politics, education, society, religion and art has produced a lot. Practicalism also tries to find an intermediate road in rationalism and empiricism, is the appropriate recipient of \"empirical ideas and human comparison with religious needs.\"\n\nThe phenomenon is the theory of German philosopher Hussell in 1900, emphasizes the distinction between direct intuitive and experience, and believes that philosophy (or at least psychology)'s main task is to clarify the association between the two, and Intuitive understanding of essence. The phenomenon is a philosophical study on experience structure and consciousness structure. As a philosophical movement, the early 20th century was founded by Edmund Hiser, followed by him in the University of Germany and a followers in the University of Munich. After this, phenomenon spread to France, the United States, and other regions, and far beyond the context of early Hussel. [67] Other major philosophers include Heideg, Morris Mero Pont, and Emanuel Lavina.\n\nThere is a philosophical orthodontic thinking, which is used in the early 19th century to some philosophers of the twentieth century, although their studies have a huge difference [68] [69], but they all believe in philosophy Thinking starting in human subjects - not just thinking, including behavior, perception, human individual [70]. The existentialism emphasizes individuals, independent, subjective experience, and believes that people have the meaning of people to get answers to the answer from rational thinking [71]. In existentialism, the characteristics of the individual's starting point are called \"attitude existing\", or a feeling of obviously a lost or confusing world [72]. Many existentists also believe that traditional systems and philosophical academics are too abstract and away from human experience, both content and style [73] [74].\n\nThe 19th century philosopher Kerke Gu and Nietzsche were seen as a pioneer of existence, although they did not use this term. However, their influence extends out of existential idea [75] [76] [77]. Kerka Guoler is primarily targeted by Hegel's idealist philosophical system. He believes it neglects or excludes human inner subjective life. Instead of Krkher Guo Her believes that \"truth is subjective\", the most important issue for human human beings is to process individuals and existence problems. Kerkegher as a Christian truth that believes in religious beliefs is a subjective problem, and people should use enthusiasm to think about this problem [78] [79]. "}