{"chinese_title": "metallurgy ", "chinese": "Metallurgical (English: Metallururgy) belongs to material science, is to study the extraction of metals from ores, and have a discipline of metal materials with a variety of processing methods. Metallurgical studies also study the physics and chemical properties of metals, metal mutants, or mixtures thereof (referred to as alloys). Metallurgy is also a metal technology, and the science of metal, also related to the engineering characteristics of metal parts. Metal manufacturing includes refining metal from ores, as well as metal mixtures (or mixtures of metals and other elements) to produce alloys. Metallurgy and metal processing are different, but metal processing and metallurgical study are related, as the technology is related to technology, medical and medical science.\n\nMetallurgy can be divided into steel metallurgy (sometimes referred to as black metallurgy) and non-ferrous metallurgy (sometimes referred to as non-ferrous metallurgy). Steel metallurgy is related to iron alloys and its manufacture, rather than iron metal metallurgy, is based on iron-free alloys and its manufacture, iron, cobalt, nickel and its black metal related to alloys Accounting for 95% [1]\n\nThe metallographic English Metallurururur is originally a word in self-cultivation, refers to extracting metals in ore, and -urgy-urgy expressed as a process or process. This word has been mentioned in 1797 \"British Encyclopedia\" [2], which has become scientific research on metal, alloy and related process at the end of the 19th century [2]. The radius of English comes from the ancient Greece μεταλλουργ, Metallourgós, \"Metal Workers\", becomes μέταλλον, Métallon, \"Metal\" + ἔἔγον, érgon, \"Processing\". In English, .MW-PARSER-OUTPUT .IPA {Font-Family: \"Charis Sil\", \"Doulos Sil\", \"Linux Libertine\", \"Segoe Ui\", \"Lucida Sans Unicode\", \"Code2000\", \"Gentium\" \"Gentium Alternative\", \"Titus Cyberbit Basic\", \"Arial Unicode MS\", \"IPapannew\", \"Chrysanthi Unicode\", \"Gentiumalt\", \"BitStream Vera\", \"BitStream Cyberbit\", \"Hiragino Kaku Gothic Pro\", \"Lucida\" Grande \", Sans-Serif; Text-Decoration: none! Important} .mw-parser-output .ipa a: link, .mw-parser-output .ipa a: visited {text-decoration: none! Important} / metælədʒi / The pronunciation is common in the UK and the big Britain, and / metələrdʒi / is more common in the United States.\n\nThe prehistoric era can be smented and used with bronze, copper, gold, silver, iron, lead, tin and other metals. The earliest smelted metal should be gold in the natural world, and there is a small amount of elemental gold in the final stage of the end of the old Stone Age, and time is about 40,000, 40,000 [3]. Silver, copper, tin and iron, will also use natural metal (English: native metel), with metallic processing in early culture [4]. The weapons of Egypt in the first three thousand years of Xiyuan are made of ironing, and they are hailed as \"Daggers from the sky\" [5].\n\nMetals such as tin, lead and copper, as long as the ore is heated to obtain its metal (the temperature of the copper may be higher may be higher), which is called smelting (English: smelting). Earlie use of smelting metallic metal with smelt is between the first five thousand years to six thousand years, in the archaeological site of Serbia, Pločnik and Yarmovac. So far, the earliest copper split is Belovode [6] in the Balkans Peninsula, and found a copper ax in the prodeen 5500 in Wen [7]. Other early smelting metals in the first three thousand years in the West Piece, in Palmela, Spain, Spain, the boulder array of British. However, like other prehistoric research, because there may still have new discovery, there may be earlier evidence.\n\nThe metal discovered is not an alloy, and about 3,500 of Xiyuan found copper and tin mixed bronze alloy after mixing, this is also a major technical improvement, which has begun the bronze era.\n\nIron smelting should be more difficult than copper or so much. The smelting method may be that the Herdrons invented 1200 years ago. The secret of the iron era, iron smelting and processing is one of the secrets of the success of the success of the success of the success of the Succession [5 ][8].\n\nMany different cultures and civilizations also have ironmaking technology, like ancient and middle ancient times, the kingdom of the Near East, ancient Iran, Ancient Egypt, Ju Ni, Anabaria (Turkey, Turkey), Gu Naki, Cartai Base, the ancient European, Rome, Europe, China, India, Japan, etc. in the middle of the ancient Europe. Many metallurgical applications, practices and tools are invested in ancient China, such as blast furnaces, cast iron, hydraulic pestle hammers (English: trip hammer) and double-acting piston fan [9] [10].\n\nIron Iron was started for a thousand years before the US. The earliest use of the iron-making furnace is an air furnace or a dried iron furnace (Low Shaft Furnace), and the iron furnace (English: bloomery). Put the washed ore with charcoal into the furnace to ignite, using natural gas flow or human bellows to supply oxygen, producing carbon monoxide into iron into iron, and the resulting product is repeated to remove residue. Later, the water-lifting is boomed, and the amount of oxygen supply increases. Therefore, the cross-sectional area of ​​the furnace and furnace can also be increased, and more ore and charcoal can be loaded, and more iron is more iron, due to the limit of human beating, also Replace human resources in hydraulic force. This wrought iron furnace slowly developed into a blast furnace.\n\nAs the blast furnace increases, charcoal has a shortage of shortage, that is, try to take charcoal with coal, in the 18th century, the British successfully refines coke, and then the furnace temperature increases to increase production. After the steam is appeared, it is used to drive the blower, which increases the amount of heating, rising the furnace temperature, and the yield has increased significantly.\n\nIn the 16th century, DE RETALLICA describes the knowledge of highly developed mining, metal extraction and metallurgical, and is known as \"the father of metallurgy\". 11].\n\nExtract metallurgy (English: extractive metallurgy) is a valuable metal proposed in the ore, and is treated with a higher purity metal. In order to extract the metal from the oxide or sulfide of the metal, ore may be treated with reduction, electrolysis or other chemical.\n\nExtracting metallurgy is mainly focused on metallurgical feed, concentrate (valuable metal oxide or sulfide) and tailings. After mining, large ore will be smashed into small particles, each particles may be a concentrate or an abandoned tail. Subsequent use of other means separate the concentrates and tailings of the particles.\n\nIf the ore and natural environment permit, ore mining can be replaced with a leaching method (English: in-situ leaching). The Lilt Rati will dissolve the minerals in the ore in solution, then collected solutions, and extract valuable metals.\n\nSometimes there is more than one valuable metal in the ore. Therefore, tailings can be used to propose other metals. A variety of metals sometimes acquired, thus need to be separated from different metal components.\n\nThe metal commonly used metal includes aluminum, chromium, copper, iron, magnesium, nickel, titanium and zinc, and these metals are often used to make alloys. The correlation study of alloys is mainly in iron-carbon alloy systems, including steel and cast iron. The general carbon steel is suitable for use in low cost, high strength, no need to consider weight and corrosion problems. Dueded cast iron (English: Ductile Iron) is also part of the iron carbon alloy system.\n\nIf there is a need for corrosion resistance, it is generally used as stainless steel or hot dip galvanized steel. If the high ratio is required, aluminum alloy or magnesium alloy is used.\n\nIf there is a high corrosion environment, there is no need to have magnetic occasion, a copper nickel alloy, such as a Monel alloy (English: Monel). Nickel-based high-temperature alloys (such as nickel-chromium alloys) will be used in high temperature applications such as turbochargers, pressure vessels and heat exchanters. Very high temperature applications use single crystal material alloys in order to minimize the loss.\n\nIn the field of industrial engineering, metallurgy and metal parts are manufactured, including metal or alloys, processing forming, heat treatment and surface treatment of the surface of the article. The purpose of metallurgy is to reach a balance between materials, such as cost, weight, tensile strength, hardness, toughness, resistance, anti-fatigue characteristics, and characteristics at high and low temperature.\n\nFor the above object, it is also necessary to consider the working environment of the part. For example, in the environment of saline, it is easy to corrode the black metal and some aluminum alloy, and the metal is exposed to the very low temperature environment to become easily brittle, and its toughness decreases. It is therefore more prone to cracks. The metal under cycle load will have metallic fatigue [12], if the stress is fixed, but the temperature is high, it will cause the lessence of metals [13].\n\nHere are some metal processes:\n\nCold machining refers to the processing of solid metal parts at normal temperature, which can be introduced into the metal in the metal by one way to improve the strength of the part is referred to as processing hardening (English: Work Hardening). Avoid further deformation.\n\nThere are many ways for casting, commonly used including overlay casting, molten casting (English: invested method), die casting and continuous casting (English: Continuous Casting).\n\nMetal can adjust its strength, ductility, toughness, hardness or its corrosion resistance. Common heat treatment includes annealing, precipitation hardening, quenching, and tempering [14].\n\nThe annealing is heating metal, then slow cooling, can release stress in the metal tissue, making the grain change, and it is not easy to rupture when it is hit. The metal after annealing is also easier to cut. Quenching is a fast cooling after heating high carbon steel, and the tissue of steel will form high hardness of Maixi iron, improve the metal's hardness. However, it is necessary to make one place between the hardness and toughness of the steel: the lower the toughness or impact resistance, the lower the hardness, the higher the toughness, the higher the toughness, the lower the hardness. The tempering can release the stress generated during the hardening process, and the tempering will be slightly softened and can withstand the impact without breaking.\n\nMechanical treatment and heat treatment can sometimes be combined, referred to as thermal mechanical processing (English: thermorechanical processing), which can get better material characteristics, and more efficient. Heat mechanical treatment is commonly used in high alloy special steel, high temperature alloys, and titanium alloys.\n\nElectroplating is a common surface treatment technique, which is a thin layer of other metals such as gold, silver, chromium or zinc, etc., and on the one hand, on the one hand, the resistance of the article can be increased, and the shape can be more beautiful.\n\nIn addition to using electroplating, surface treatment can also be used, and the performance of its articles is better than plating.\n\nGolden Phaseology is the discipline of microstructure and giant structure, which is created by British metallurgist Henry Cleveton Solby (English: Henry Clifton Sorby). In the metaphysics, the sample to be tested is flat and polished to the degree of the mirror, and then the etch etching is added to reveal its structure. Try to observe the optical microscope or electron microscope, the contrast of the image can provide its ingredient, mechanical properties, and the processed processed.\n\nThe current metallurgical studies are often used to identify unknown materials using crystallographic X-ray diffraction or electron diffraction, and understand the crystal structure of the test. Quantified crystal can calculate the number of different phases in the test, or the degree of strain can be calculated. "}