{"chinese_title": "industry ", "chinese": "Industry, refers to an economy, effective use of funds and labor [1] engaged in the various industries of economic goods [2]. Economics, it is commonly used in industrial sectors. In general, the industry can be divided into three categories, namely the first industry, the second industry and the tertiary industry.\n\nThe industrial structure of a country is closely related to the country's economy. Petroleum, finance and sightseeing, for the top three largest scale industries worldwide [3]. The growth of the information industry is also quite fast, and the logistics industry is still a long time.\n\nThere are many different classification methods in industrial classification. The three industrial classification methods used in China. Among them, the tertiary industry is the largest in the output value and profit.\n\nSince each product has its own unique production chain, the first industry has different significance for different products. The following is an industrial classification form (three classification):\n\nexample:\n\nIn addition, there are other ways to classify others. Like market-based global industry classification standards and industry classification benchmarks (English: Industry Classification Benchmark), these classifications are used in the use of goods, function and markets for the use of manufactured goods, functional and markets commonly used in financial and market research.\n\nIndustries can also be classified, such as chemical industry, petrochemical industry, automotive industry, consumer electronics, meat processing, restaurant, food industry, water industry, soft industry (English: Software industry), paper industry, entertainment, Semiconductor industry, cultural industry and poverty industry (English: Poverys Industry), etc.\n\nThe fourth industry is an industrial sector featured by providing smart services [4], with non-direct and hidden services (such as the design of the computer to use the computer to ensure the safety of national personnel, unknown scientific theory). It is generally believed that high-tech industries related to information technology, scientific research, and the information industry belong to the fourth industry. For example, computer program design, biochemical technology, etc. It is also believed that it should be more subdivided to the fifth industry, refers to the public industry that provides non-profit-purpose purposes, including national defense, judicial, public security, fire protection, public services, infrastructure construction, welfare cause, etc., but some people think this industry It is the fourth industry. A country economy can also be summarized into public sector and private sector, and each industry is generally classified into the private sector.\n\nThere are also classification methods to define cultural industries and creative industries as new fifth industries, including publishing, animation, electronic games, drama, dance, planning, decoration, etc. can reflect cultural and creative industries.\n\nThe non-profit public industry will be defined as the sixth industry. [5]\n\nThe industrial revolution has produced a large amount of production as a factory, which has a considerable impact on society [6]. After the Industrial Revolution, the industry has become the main department of national productivity and employment opportunities. In Europe, industrial development broke the economic structure led by the over the past. Many scientific and technological breakthroughs and progress, such as coal and steel production, also promoted the emergence and development of new industries. Many industrial countries have begun to implement capitalist economic policies. The capitalists have the advantageous world market that is difficult to reach in the railway and ships. The company has the ability to expand to the scale of the past and earn the endless wealth. After the industrial revolution, the proportion of industrial accouncing the world economy has thrown from the agriculture.\n\nIndustrial class was earlier by the earliest of British economist, the British economist in the 1930s, and he was a professor of the University of Otaco, New Zealand, in the book \"Safety and Progress Conflict\", he put the first All economic activities other than the secondary industry are collectively referred to as a tertiary industry; thereafter produce a lot of classification methods, although countries are slightly different but almost all roughly the same. Modernities extend from the third type of industries, which is that there is no significant profit in itself but can improve the public industry of other industrial profits, and the cultural and creative industries that reflect cultural and creative.\n\nBritish economists, Statistics Corlin Clark (English: Colin Clark (ECONOMIST)) Through Fisher (English: Allan George Barnard Fisher) Three-level industrial structure, the change and economic development of the three-level industrial structure The relationship has made a lot of empirical analysis [7]. Before the industrial revolution, the human economic industry is dominated by the first level, agriculture, animal husbandry, forestry, etc.\n\nAfter the industrial revolution, the second industry has appeared in large numbers, and various manufacturing industry uses machine production, replaces the production of household handicrafts in the past, and the productivity is greatly improved. The economic share of the second industry is increasing, replacing the dominant position of the first industry, and leads the living standards of human beings to improve. At the level of national development, each developed country will also pass this stage, called industrialization, and famous examples have Japanese Mini Restaurant.\n\nIn the twentieth century, a large amount of funds and labor flowing in developed countries, the age of the secondary industry was also growing away. One of the possible reasons is that long-term industrial development has increased national income and wage rates also rose. Therefore, traditional industrial powers in labor intensive industrial comparative advantages, gradually transferred into homive developing countries, such as Hong Kong's industrial northward movement, the rise of Asia's four small dragons, and the rise of Southeast Asia and China. The industrial structure of developed countries has transformed into a tertiary industry and capital-intensive high-tech industry. National income decided to industrial structure, industrial structure also affects the fiscal revenue of a country, both of which are influenced.\n\nHowever, with the changes in the times, it is not easy to find an indicator that can be measured in the industrial output value and economic effects, and can be compared with the past. For example, in the past, economic effects can be used to use manufacturing, so the number of employment of an industrial block is reduced, often representing the industries of this industry, but recently lean production will bring this situation, it may be only a production line One to two people can manage, just like the current cigarette industry.\n\nMoreover, the industrial development of advanced countries to a certain extent, its actual manufacturing and its supply chain have been moved to other countries, and the industrial output value is not large to the country's economic contribution, forming a certain degree of cavitation (Japanese: caving). So since 2008, Europe and the United States began to re-retransmit some of the economic policies of some manufacturing in China, that is, industrialization (English: Reindustrialization) [8].\n\nFischer's three-level industrial classification (and the basic five-level industrial classification method) proposed in the 1930s and has last time. Human science and technology levels continue to improve and economic development, and there have been many emerging industries, and the industrial structure is also different from the ages of Fischer. Therefore, the three-level industrial classification method has emerged.\n\nSome industries are classified blurred. Some industries are also speaking more than one industry. For example, renovation, it is both a service, and it should be classified into a tertiary industry, but it is also the processing of unfinished products (empty units), and can also be used as the second industry. For example, the energy industry is both processing and services. If it is some renewable energy such as (wind energy, solar energy), it can be called the first industry.\n\nThe tertiary industry is too complicated. Due to the improvement of living standards, various new services have occurred, and the industry is also far from the industry. For example, supplemers and doctors, lawyers are the third industry, and analyze the economic development with generally rough classification, which is obviously difficult.\n\nIn response to the above, some people put forward the industry from the industry from the tertiary industry (in fact, these industries do not necessarily provide \"service\"), called the fourth industry. However, the fourth industry is still not fully popular, and there is no unity. Some people think that non-profit public utilities are the fourth industry, but some people think that it should be the sixth industry.\n\nIn recent years, the cultural industry and creative industries have developed rapidly in countries, and therefore, there have been new fifth industries, which are used to refer to cultural, creative and other industries and their work (including cultural works, creative technology products, art performances, etc.).\n\n[9] The international standard industry classification is classified in all economic activities (English: International Standard Industrial Classification), which is developed by the United Nations Statistics Division, and all economic activities are classified. This classification method is deemed to be the most complete and organized classification method. The statistical agencies around the world have also developed their own classification systems, such as the North American industry classification system (English: North American Industry Classification System), North American product classification system (English: North American Product Classification System), Hong Kong Standard Industry Classification, etc.\n\nThe international standard industry classification will classify different economic activities based on economic activities carried out by different entities (including individuals and institutions). The most detailed level (class) industry classification class is divided according to the materials of relevant activities, in most countries, often combining similar activities in traditional habits and importance, forming different statistical units, which is convenient for use in terms.\n\nThe 4th revision of the International Standard Industry Classification, like the previous version, as the product input, use and output products as classification standards, pay attention to different nature, define and divide different main classes, large categories, medium class, Small class and small classification, etc.\n\nAccording to the 2015 International Monetary Fund and the world profile, 20 countries in the top 20 industrial output "}