{"chinese_title": "civil Engineering ", "chinese": "Civil Engineering (English: Civil Engineering) refers to the plan, construction and maintenance of all and soil-related basic construction. The current general civil work items include: energy, water conservancy and transportation facilities. In the past, all non-military useful civil engineering projects have been classified into this category, but as engineering science is increasing, there are many contents that are the scope of civil engineering have been independent.\n\nThe civil engineering is the purpose of improving the quality of the national life, promoting the public well-being of the nationals, and then transforming the land, rectifying the environment and the prevention of disasters. It is also related to the four major needs of the food in the country, and is closely related to the well-being of the nationals. Therefore, the civil engineering is also directly or indirectly solving the fundamental construction projects of the people's livelihood.\n\nThe historical span of ancient civil engineering can roughly divide from the old stone era to the middle of the 17th century. The civil engineering in this period is very primitive, the building materials mainly use natural materials such as stone, hubbed, and cranes. The construction tools are also very simple ax, hammer, knife, shovel, etc., the construction facilities mainly rely on experience, no system Theory. At that time, the representative of China was Dujiangyan, which was built by Dagu, Li Bing, and the Great Wall.\n\nThe historical span of modern civil engineering is generally considered to have a total of more than 300 years from the middle of the 17th century to the Second World War. During this period, civil engineering gradually became an independent discipline. 1638 Dali scholar Galileo issued the \"Dialogue on Two New Science\", first expressing the design theory of the beam with formulas. In 1687, Newton summed up three laws and the law, laying the basis of mechanical analysis for civil engineering. On the basis of material mechanics and elastic mechanics, France's Naweed has established the tolerance of structural design in civil engineering in 1825. Since then, the civil engineering has theoretical guidance.\n\nIn terms of materials, the invention of Portland cement and 1867 reinforced concrete began application is a historical event in the history of civil engineering. Due to large-scale production of concrete and steel, civil engineers can use these materials to build giant and complex engineering facilities.\n\nThe rapid development of science and technology after the Second World War, making the civil engineering can rely on further development with modern science and technology. The most important civil material and building materials: concrete and steel have a large development, improvement, reliability, durability, etc. have also improved significantly.\n\nThe constant development of synthetic materials broaden the types of materials that can be used in construction, and more excellent in performance than past conventional materials, the application of light and high-strength new materials makes many structures that are difficult to achieve in the past can be realized.\n\nThe numerical analysis of the computer enables the calculation of the calculation of the past due to manual difficulty calculation and being transformed into a more accurate calculation and analysis. For example, by means of a finite element method, the software can easily solve the internal force and displacement calculation of the complicated super-static structure that is difficult to complete in the previous manure. The continuous development of structural mechanics and limited element law makes it easy and accurate to make the calculation of structural and deformation, so that the design work is greatly simplified. Computer Aided Design (CAD) applications, designers are liberated from heavy manual design. More construction machinery use, the degree of construction automation is greatly improved.\n\nEngineering measurement is an application measurement principle, in various projects, such as roads, tunnels, bridges and residential, mainly to discharge the design map of the project to the scene, and the engineers are based on the position Made.\n\nThe structure on the design graph on the engineering drawing is very important. If the error may result in a significant loss of engineering, the cost of engineering measurement is very small, but the importance is very large.\n\nThe construction process of civil engineering must use a variety of metal materials or non-metallic materials, thus closely related to material science and material engineering. Materials science itself is a cross-section discipline, involving material properties and its application in the fields of various sciences and engineering. It studies the preparation of materials or processing technology, the microstructure of the material and the mutual relationship between the material macroscopic performance. The theory involved includes application physics, solid physics and chemistry, etc .; different applications such as wood materials, structural materials, building materials, mechanical materials, refractories are derived from the combination of civil engineering.\n\nAs the media in recent years, the media will focus a lot of attention in Nam Science and NiM technology, the materials science have been pushed to the forefront in many universities. It is also an important part of engineering appraisal and destruction analysis.\n\nEarth project is also known as soil engineering, geotechnical engineering, geotechnical technology, mainly studying the engineering characteristics of soil constituent substances. The Earth Engineer will study data from the mud samples and rock samples from the site, and then calculate the structure required by the construction site. Foundation, geotechnical, soil, dam, tunnel, etc. are construction projects that require earth engineers to provide soil comments.\n\nThe earth project can be subdivided into soil mechanics, basic engineering, engineering geology, rock mechanics and other disciplines.\n\nStructure engineering is an engineering subject of building structures under the role of analysis and design. Structural engineering is usually classified as a branch of civil engineering, but it can also be studied as an independent discipline. [1]\nStructural engineers typically participate in housing buildings and other large structures, [2], but also participate in the fields such as mechanical, medical equipment, vehicles, etc., which can affect the use and safety. Structural engineers must be designed in accordance with national or industry norms to ensure safety (such as: structures that cannot be damaged without signs), maintainability and availability (such as: housing can't have too much deformed, avoiding user discomfort ). The design of the building must be able to withstand huge loads, as well as climate change and natural disasters.\n\nThe structural engineering theory is based on physical law and engineering experience in structures and structures in different situations and materials. Structural design generally uses a few simple structural components to form a complex structural system. [2]\n\nThe earthquake project is also known as the earthquake engineering, which is the study of its structural behavior when the building is affected by the earthquake. It is used to reduce the damage of the building, which is a part of structure design and civil engineering. Vibration control technology and basic isolation are the strongest and most economical tools in seismic engineering.\n\nThe water conservancy project is to control, the general name of various project construction built and protecting the surface and the underground water resources and the environment. Natural exercise and artificial delivery and utilization of civil engineering in civil engineering. The engineering field and bridge, dam, river, canal, and flood control have closely related to the design and construction of water flow, Jiangchuan and Bahai Causeway projects, and also involve public health and environmental engineering related environmental ecology and Water category.\n\nThe main work of water conservancy projects is a variety of hydraulic structures, including dams and river sea embankments, water supply pipe networks and water distribution pipe networks, ecological sustainable, flood management, sediment migration, and other Soil and Water Conservation Engineering and Earth Project. Transaction.\n\nEnvironmental Engineering is a way to apply science and engineering to improve the environment (including air, water, land resources), which in turn provides human living and other organisms to provide healthy water, air, and soil, including pollution site. . We can reduce and control the negative impact on the environment via educational public, protect the environment, the establishment of good projects.\n\nTransportation is a branch in civil engineering, including road traffic, railway transportation, aviation traffic, navigation traffic, and pipeline traffic. Road traffic engineering only studies traffic on the road, specifically, it is to unify people, cars, roads, and environments in a transportation system, explore their respective and intermienal regularities and their best cooperation The road traffic is smooth, high in traffic, less traffic accidents, high transportation efficiency, low degree of public injury, saving fuel and transportation costs and environmental coordination, comfortable. "}