{"chinese_title": "God ", "chinese": "God, also known as God. MW-PARSER-OUTPUT RUBY> RT, .MW-PARSER-OUTPUT RUBY> RTC {Font-Feature-settings: \"Ruby\" 1} .mw-parser-output ruiby.lage { FONT-SIZE: 250%}. mw-parser-output ruby.lar {font-size: 300%}. mw-parser-output ruby.lage> rt, .mw-parser-output ruby.lage> RTC {FONT- Size: .3em} .mw-parser-output ruby.lar> rt, .mw-parser-output ruiby.lar> RTC {font-size: .25em} only (qí) [1], fairy, god, god, etc. It is a kind of supernatural concept in human beings, there is different meaning in different languages, often related to religion, mysterious learning, and ceremonious customs. One of the meanings is the Most High in the supernatural system, which is not limited by natural law, but it is higher than natural law or creates the universe and natural law [2] [3], and dominates the universe. Wanners and the overall world (Holist World), can apply direct or indirect interference to material phase; such as the only master of Abraham, Jewish, Christian (including Catholic) is called Jehova, Yadi or God (Christian God) Islam called Allah, which is called a god. Another concept of God has originated in natural worship and panning worship, and believes that there are very many gods in the world. This kind of religion is known as multi-god education, in fact, in the region of modern belief, before the dismissal, there is also a sense of God If the ancient Roman mythology, the ancient Egyptian mythology, etc.\n\nThere are such conceptualized idols in all human society, but because of cultural customs and religions, faith, people are different, people have completely disagree with God's cognition, and even lead to fascist ideas, unreasonable, racism, lock country policies , Military nationalism, etc. Full of aggressive social orientation (Social orientation).\n\nThe meaning of \"God\" is an incident that the existing god (the ancients of the sky, such as Abraham, the flying, such as Mohammad), which is the miracle of \"prophet\" by the Jewish region. Emphasized, tall-eyed and passed the witnesses, or by the John of the Islands (written by the writer), apostle Paul's record or lecture to date.\n\nThe birth and appearance of \"God\" is that there are countless generations to resist the mechanisms built on the fear of death. First, there is a murder (imaginary will), and then it is divided into three gods (parent, humanity, \" beast). Jewish inherited his father, in order to protect the customs of the kingdom; Christian inherited humanity, with no deliberation transcending death; worshiping inherited the animal, creating a real monk model (Jewish and Christianity only have a \"business\" and \"form\", even Jewish The three gods are all split), and the ancestors have reincarnation, and even don't believe in the existence of God, because of this, he is extremely desperate, and it is extremely arrogant, and willing to \"complete human body\" Challenge the sinking will of the universe, so the bald eagle and the philosophers sitting on the top (Faraha), which represent the human rights of human beings over all natural laws. Nietzsche's argument and superman said the system has been established, so that the US ultimate realism is because of his extremely light, it is directly or indirectly promoting the gods of Hitra, Nazi Party's race cleaning of Jewish cold blood. [Source Request]\n\nIn another point of view, the so-called \"God's appearance\", \"God's work\", it is only the human subconsciousness to refuse to carry a sense of confense and guilt, refuse to \"all things will eventually die\", with the group tacit pair The knowledge of Tacit Knowledge, Nietzsche said \"God has died\" is not just a negation of spiritualism, but hints that there will be self-evolving in the future, and no one has done it. The behavioral mode \", and the truly power will will lead to the eternal life of the whole wisdom. [Source Request]\n\nHowever, when he learned that the soil's unreasonable military competition, the unreasonable hatred of Shavouism, he had premonmed the familiar world will become a human purgatory, and he is completely crazy in the endless remode. And coincidentally, on April 20, the same year, Aldf Hitra, this completely born, completely excluding God's anti-hero (Anti-Hero), and he has experienced in a prisoner in Munich's coup. \"Tracing Stella is saying\" the \"spiritual three-changing\" concept described, completely understanding the super-consciousness of Jacob and God, and breaks relief of the reality of the world, and opens up the mortal self-finance. Road, and \"Human Destiny: Homo Deus: A Brief History of Tomo\" Homo Deus Evolution Blueprint is somewhat by Hitra's pessimism ( Pessimistic Heroism, refers to the anti-hero never thinks that the world has a future, just to fight against the virtual and unreasonable and survived). [Source Request]\n\nBecause of this, \"God\" genetically bundled will inevitably appear, whether cognitive simulation, logical inorganic (integral awareness of the humanized network), or inverse logic, knowledge-based organic (complete deactivation, surpassing artificial intelligence) The form of a wise man, and that ideal \"beautiful new world\" must be extremely cruel, because when human beings are screened, it will only be completely lost after destroying these full-class intelligent flow-water humans. Humanity, only \"always live\", there is labor, and in that future, human free will gradually lost, Personality Instrumentalized, becoming the production tools operated by \"God\", and human beings unconscious The induction of China's hidden induced human or movies in 2000, such as 2013 \"I can't get it\" (HER), \"intelligent rebels\" (Ex numberina). The cruelty is that if human beings can't control artificial intelligence, this \"beautiful new world\" will naturally arrive, which is the \"God\", and this god is unrequited, only pedestrians can't understand Killing. [Source Request]\n\nThe deception process believes that God's concept originated from the primitive social period, the point of view believed that \"God\" was established by people, and all human rights could not be able to be deactivated. \"God\" is originally derived from the gods. With the social structure and cultural development, the image of God, the number of God's body and the number of gods have gradually changed, and the simple object god is converted to complication; by the gods, evolving into one It is a high-level or multi-tier class of a high-level or multi-tier class; it is also spread to the world, and the national or even widespread worldwide is converted to a deminination.\n\nWith the development of society, people have the image of God, fear, fear and love, and then only a spiritual image; modern society, many things that are considered impossible, human beings have successfully realized, people have no fear God has become not terrible, and the existence of God has begun to be questioned, and some people began to become substanceism by beliefism, and some people have materialized or functionalized to God. From the field of aesthetics, philosophy, psychology, such development, \"humanity\" becomes \"inspection\" or \"definition\", \"complex\" is more difficult to be more difficult or defined, entering self-significance \"Unlimited Back\" phenomenon. Humanity is generally more embarrassed, uneasy, and there is no goal in the future.\n\nNatural God stems from the later period of the original society, will not be able to resist natural body, naturally evolve into God, in the early days of the worship, direct natural body, such as fire, thunder, water, solar, etc., think that they are itself With will and life, and even even deactivate animal plants, as people have an abstract ability, the concept of Shenling is independent of the natural object gradually born.\n\nSocial god will social phenomenon or strength, from the later period of primitive society, is the evolution of natural gods, with the development of productivity and complex, classization, people are no longer a single individual, social power It is also considered to be unacuised and unacceptable, such as God of War, Love God, God, Regional Guardian, Industry God, etc.\n\nSociety God has a variety of branches, can be divided into two categories: the first category is related to his own innate status (clan), can be called the clan; the second class is related to its own original identity (such as the industry), in this class The main thing is the industry god.\n\nThe concept of Anthropomorph (English: Personal God) was earlier by Greek philosopher Color Novenny, and human beings imagine a god system in accordance with their own image, which was not in a panoramic, but Refers to God who is fully played by believers. There are two main types, the first kind of religion of ancient Egypt is a semi-propagander transition period, the head is an animal, and the body is the people's gods, and the God of the full spirit is the most pleasant in ancient Greece and ancient Rome. , The gods in Zeus's gods have a human life.\n\nAbstract God can refer to Jewish and Islam in the god of abstravation. Islam prohibits the imaging and 拜 像, e.g., ancient China's concept of \"God\" is quite abstract, almost unmanned and omnipotent.\n\nAnonymists think that any god does not exist, such as supporters Marx.\n\nIn 1982, the Ven. Walpola Rahula provides a re-explanation and comes, and it is believed that \"Whether it is the Buddhist Buddhism or the Mahayana Buddhism, we don't believe this world is created by God and his will. Governance. \"\n\nUnfair people think that God is unknown or impossible to thoroughly understand, and is criticized by theologist. Although the letter and unfinity have not enough reasons, but the doubts of thought is represented by affirmative religion.\n\nNaturalist claims that after God created, complete its mission, let the universe developed, and the earliest year of Christian Soxini proposed that in the Voltaic and Rousseau era, it is now micro.\n\nThe Pan God believes that God is natural, mysterious pan God believes that God is in a natural world, in short, people are a part of God, and natural pan the gods believe that nature is a way of God, in some cases, in some cases Tong, the philosopher Stunos Sand has established the most complete one.\n\nPan naturalism is a philosophical point of view of naturalism and pan the god. This point of view believes that God will become ourselves into the universe and the world after the rules of the universe and its existence.\n\nIMMANENCE believes that God is unlikely, with super in theory, emphasizing God's innerness, emphasizing God's quiet, cycle, business (historical view), also emphasize God's mystery and non-non- Personality (Dead), seen in Buddhism's universe order, Indian chistler, Egypt, etc., the most of the people, the original religion.\n\nThe transcendentalism believes that God is surpassed or independent of the world, compared with the inner disclosure of the gods to the world's external, transcendence, emphasizing the enthusiasm of God, is the ultimate pointing (historical view) of history (historical view), Also emphasizes God's rationality and personality (decentness), exists in Jewish, the theory of Islam, the teachings, and the Nos.\n\nSuper Pofementism (PANENTHEISM) Comprehensive super in the ones and inner theory, thinking that God is itself, and there is a super-existing root base, while existing in the existence of itself is intrinsic, God is both super It is also inherent, a tendency to modern Christianology.\n\nI don't believe that there is a high ghost, such as Buddhism believes there are all kinds of ghosts in the universe, but denying all the supreme gods, thinking that all ghosts are treated by the fruit, the Law, such as the Sandy, Leier sect, such as emerging religions It is believed that the God of traditional religion is actually a higher alien.\n\nMulti-god education begins in the later stage of the primitive society, believes in the existence of many gods, such as the main industry, the main region, the main region, and the worship can choose different gods with different situations and need to choose different gods. Multi-gods, the gods often have a class, usually have the highest primary god, and other have their own relationships.\n\nRotation of primary gods (Kathenotheism) is also called alternating primary god education, with multi-gods, the position of the main gods has not been fixed, and the primary god changes with regional or time. For example, Hindu is born in Brahma, a pivot slave, and a wet husband, like the Greek Zeus, Athena, Apollo, some Huang Emperor in the faith in some Chinese people also has a rotation concept. [4] [5]\n\nA single masterpiece has a multi-god of fixed principles, a transition formation of many gods to a god. A single masterpiece is not necessarily to go to a god, such as Confucianism, and Japan.\n\nDualistic Religion believes that there are two opposite gods, and only good god will be selected as worship, including teaching, Nos, Moist education, etc.\n\nA god is mainly produced in the nomadic society (Example: ancient Jewish), the most typical and famous is Abraham: Jewish, Christ, Islam.\n\nThere is only one of the only true gods, or \"God\", \"Father\", \"Father\", \"The Lord,\" Creator \", etc., there is often no picture, so it usually opposes idol worship, other million The authority comes from Him, and a god is not denying other spirits, such as angels, devils, etc., but they are only being created (God created) rather than creators, so non-\"true god\", and non-worship. For the respect of the only true God, it should be made separately from other spirits to avoid.\n\nIn Christ's religious doctrine, Jesus Christ believes as God. It is said that Jesus is a fishery (the Tao is the sacred words of God). The two of the gods of God, that is, \"the Father, Son, the Holy Spirit\". The three of Christ religion said that in an ancient world, it succeeded in the world, but conflicts with Jewish and Islam.\n\nJewish and Islamic respect for the respect for the prophet, different from the respect for God Worship, that is, refuses to demonstrate the prophet in humans, such as Jewish Moses is not God, Islam Muhammad is not God, can only say that God's messenger, spokesperson.\n\nConfucian Zhou Li divided the gods and genitals of God into God, and only three categories.\n\nThe highest level is God, including all the gods in the sky, which is the highest god (also known as the emperor, God, the emperor, God, the emperor, the old man), and the Taoism is called the Yu emperor God; his jurisdiction of the gods have a nation, The god of the moon, the god of the stars, the windmaster, etc.\n\nSecondly, the land is only the first, and the land gods, the gods, the national society, the township, etc., and the gods, rivers, animal and plant gods, and even the gods, the landlord, the gods, the gods, the gods and so on. The size of the gods in the ground.\n\nSecondly, it is a ghost, refers to the sages, great people, heroes, religious characters and ancestors, and even all kinds of undead, and some kind of occupation becomes an industry god.\n\nAccording to modern academic definitions, God, only natural worship, people ghosts for the ancestors;\n\nIn Taoism, the three types of gods can be known as gods, divided into two categories: congenital respect (natural god), and then the gods (character god), and the characters are mainly divided into the gods (fairy), merits (God) two categories.\n\nThe above Confucianism, Taoist gods constitute the subject of the body of the Chinese folk faith.\n\nBuddhism called all other religions (including Taoism, Christianity, Islam, Jewish, Hinduism, God Taoism, etc.), may be a heaven, such as the emperor of Jianli Tianzhi; or a hungry ghost Dao's more money, such as the night-fork, Raksha; may also be the ghost ghost of the animals, such as Dragon King, Jaho Luo. Even if you are a distinguished man, when you have a life, you will have a \"heavenly five decline\", and then fall into the wheel.\n\nBuddhism has denied other religions to control the natural creation of nature and the destruction of the world and the gods that can be interacted with human interaction and completely. Buddhism only believes that ghosts are very energyful, big blessings, and the life is very long, but there is no point to reach other religions, thinking that as long as it is good, it is not necessarily the sacrifice, it may become the other ghosts and ghosts, etc., worship ghosts Buddhism has defined similar ancestors worship, and believes that the god of other religions may be a senior heaven (such as a god of god, he has said that he is a saying of Tianshi, and there is also a statement of the sky, but not Buddha, still in the triple turn. There are many understandings for the definition of the idiotism. If it is opposed to all the gods, Buddhism is believed to believe the gods, but it is not worthpassing; if it is against the gods with the crew and the master, Buddhism can also be called it. The opposite side \"no the theory\". In 1982, Huaku Luo Rong Luo (English: Walpola Rahula Thero) believes: \"Whether it is the upper part of Buddhism or Mahaya Buddhism, we don't believe that this world is created and governed by God and his will.\"\n\nBuddhism advocates that all sentient beings have been in turn around, and reach the nirvanual realm of the people who are not indispensable. This is no longer in the reincarnation, and it doesn't matter if it is hard or not. These ghosts are also sentient beings. It is the object of Buddhism to teach cultural practice, and Buddhism believes that after the Same of many princes become Buddhas to Sakyamuni Buddha, heavenly ghosts all respect him for the top Tienie, the world, and in Buddhism. In the process of development, always accompanied the navigation of ghosts, He is called the ghosts and ghosts. There are two kinds of objects in Buddhism, one is to protect the ghosts, express tribute and gratitude to them, the other is the Buddha, Big Buddha, Arra Han, the Buddha, etc., the Buddha, etc., or their avatar (such as Maitreya Buddha). The avatar bag monk), these saints are the objects that should have, and should be a teacher, not worship, ask for bless, utilitarian objects.\n\nIn addition to the history of Sakyamuni Buddha, Alo Han and a few well-known monks, usually in the Han Bi Buddhism or Mahayan Buddhism is a Buddha, they are all human heroes and saints, so,, Buddhism is mainly a great man. Shengxian. The Buddha is the first respetence of the world. Although the Buddha, Buddha, the Buddha, the Buddha, but has been repaired by the body to be super-life and rescue, and Buddhism will deliver the Buddha in the three Buddhas. And reporting the Buddha, actually equivalent to abstract god and social god.\n\nThe predecessor of Hindu is Brairon, is a class of multi-gods. Among them, there are three major primary gods, wet women, Brahma, and a wet slave.\n\n\"Brahma\" is also known as \"Brahman\", is the first God of the three major God: It is created a universe. As with Jewish, there is only one temple for Brachnya in India.\n\nSome gods' beliefs (such as the teaching), God can be a hero or the sage when it is alive or dead, but it is not necessarily named by the name of the gods, for example, called fairy.\n\nIn Greek mythology, God's personality and people are similar.\n\nA god is thinking that there is only one of the gods that enclose everything, and there is also a variety of angels and devils in the existence of \"God\".\n\nBut this does not mean that it is absolutely denied that the first sages are refused to be excessive emperor, which is usually called a prophet or a saint.\n\nThe \"God\" in the ancestors is the soul of the ancestors, and the ancestors worship believes that the ancestors' soul still exist, and will still affect the world, and have an impact on the survival status of the children [6].\n\nPanner believes that \"God\" exists in all things in nature, there is no additional supernatural domain or spiritual power. Since the 16th century, this point of view is represented by the characters with Bruno, Sinoa, Einstein.\n\nThe political integration one refers to integrating \"political\" power and \"religion\" strength. For example, the Chinese will call the emperor to the emperor. It is the spokesperson of God, which has a gods; the West has passed the same concept. At present, Iran and Van Ganoa are a few countries in which a minority is a country.\n\nThe idiotist thinks that \"God\" does not exist [7]. Another point of view of some unsoters is: 'The world consists of material, and if there is no material as a dependence, the spirit is no way to exist. ' "}