{"chinese_title": "biology ", "chinese": "Biology (Greek: βιολογ; Latin: Biologia; German: Biologie; French: Biologie; English: Biology) or Biolog Science (Biological Sciences), Life Science (English: Life Sciencees) Departure from empiricalism, extensively study all aspects of life, including life origin, evolution, distribution, construction, development, function, behavior, interaction with the environment, and biological taxation, etc. [1]. Modern biology is a large andcompatible area, composed of many branches and branch disciplines. However, although the scope of biology is wide, some general and unified concepts have allocated all learning and research, integrating it into a single, coherent field. In general, the organism is the basic unit of life as the basic unit of life, and the gene is the genetic basic unit, and evolution is the engine of the synthesis and creation of the new species [2]. Today, people also understand that all organisms survive to consume and convert energy, regulate the in vivo environment to maintain stable and important life conditions [3]. Biology Branch Discipline is defined by the size of the biological object, and the method of studying them is defined by the method of using: biochemistry examines the basic chemistry of life; molecular biology research between biomolecular molecules; botany studies of plant biology; Biology examines the basic components of all life, cells; physiological examination, organs, and organisms of organs of organizers, organs of organisms, physics and chemical function; evolutionary biology investigated the diversity of life; and ecology How to interact in its environment. In the end, it is possible to achieve the treatment of genetic diseases, improve crop yield, improve human life, protect the environment. [4]\n\nBiology English Word \"Biology\" (German, French \"Biologie\") Since the Greek βίος, Bio, It is the Life, and the word-λογ, -logia, It means that learning, merged into \"study life\" [ 5] [6]. In 1802, the French Museum La Mark raised this noun.\n\nThe five foundations of modern biology are also the main research direction: [7]\n\nCytology said that cells are the basic unit of organisms, and all organisms are composed of one to a plurality of cells and cell secretion (eg, external skeleton). All cells were produced by other cells by cell division. The multi-cell organism starts from a single cell from a fertilized egg, and then gradually divides into individual cells, and the cells are also a basic unit of the pathology (English: pathological process). [8]. In addition, the phenomenon of energy transfer between cells is referred to as metabolism, and the cells contain genetic information (DNA), which are also transmitted to other cells during cell division.\n\nModern biology believes that life is evolved, all known creatures have a common origin. The evolution is assumed that all Earth's live and extinct organisms come from a common origin or a gene library. All creatures of all the best in the world appear in about 35 billion years ago [9].\n\nAt present, there is an evolution of evolutionary evidence, and the academic community generally believes that evolution is the fact, not just theory or hypothesis, and there is a strong scientific consensus, anything other than the species or humans outside the evolution. The origin of the origin is not supported. The vast majority of scientific community and academic groups believe that the evolution is the only theory that can fully meet the phenomenon observed in biology, ancient biological, molecular biology, genetics, anthropology, and other fields. [10] [11] [12] [13] A Gale Pusher in 1991 shows that only about 5% of scientists (including other scientists other than the biology field) think that they are creators. . [15] [16] As of now, there is no discussion on evolutionary papers, and the scientific and medical period search engine PubMed is ranked. [17]\n\nThe gene is a basic unit of biometric genetics, and the gene corresponds to a specific region of DNA, which affects a certain part or a certain one of the organisms in a particular manner. All organisms from bacteria to animals have the ability to replicate DNA, and the ability to produce protein. Cells transcribed the gene of DNA into corresponding ribonucleic acid (RNA), and then ribosome translated RNA into a string of proteins consisting of amine acid. Genetic passwords converted from RNA to amine acids are the same in most organisms, but some organisms still have a little difference. For example, if the human corresponding insulin DNA is placed in plants, insulin [18] can also be produced.\n\nIn vivo balance: Balance is an open system that can be adjusted by many dynamic balanced dynamic balanced dynamic balance, so that its inherent situation is maintained in a stable state. All organisms, whether single cells or multi-cell organisms, have a balanced mechanism [20].\n\nA live organism is dependent on the continuous input of energy. The organisms are chemically reacted to extract energy from the food to maintain physical functions and establish new cells. In the above reaction, molecules that form food chemicals play two important roles. First, some of these molecules can produce energy by chemical reactions in the biology. Second, some can form a new molecular structure in the biomolecule.\n\nBiomery responsible for introducing energy into the ecosystem is called producers or self-nutrient organisms. Almost all these organisms were originally drawn from the sun. [twenty two]\n\nBiologists have a lot of research, so there are many research fields. E.g:\n\nBiology itself has continued to develop rapidly, and more and more related integration with other disciplines. A major reason is that molecular biology is in modern times, and finally leads to the order of human gene sequences to complete [23]. Thus, in order to interpret the huge number of gene information, genomics have been promoted. In order to explore the interaction of genes and proteins, a proteomic solution [24] is created. These new research areas help solve problems such as diseases, food, environmental ecology. Its research information and accumulation of massive research data require new computer algorithms to process [25].\n\nMolecular biology is a biological study of molecular levels [26]. Other fields of biology overlap, especially genetics and biochemistry. Molecular biology focuses on understanding the interaction between various systems within a cell [27], including DNA, RNA, and protein synthesis and learning these interactions [28].\n\nCell biological studies of cell structure and physiological properties, including their behavior, interaction, and environments.\n\nAnatomy is in the form of a macroscopic structure, such as organ and organ system [29].\n\nGenetics is scientific with mutation of genes, genetic and organisms [30] [31].\n\nThey are regio, a relationship (RegN), Divisio or PHYLUM, ClassIS, (ORDO), Branch (SPECIES), SPECIES [32].\n\nDouble list is a named method, English is binomial nomenclature. It gives each species two words, the preammers are the genus name, and the post is its kind of small name (species, and the two are called. In addition to the first letter, the rest of the letters should be lowercase. Latin is generally used, or in other language words, add the latin hybrid suffix. For example, China has recently discovered the dinosaur, some scientific names are done in Chinese Pinyin.\n\nSome species must be subsequently divided into subspecies because of the environmental isolation or mutation. In order to facilitate the difference, the scientific community gave a set of three laws in the subcommination design, English is Trinomial Nomenclature.\n\nScientific study of the relationship between biology and its environment [33]. The environment includes biological environment and non-biological environments, and the biological environment refers to the relationship between biological species and interior of the species. Non-biological environments include natural conditions: soil, rock, water, air, temperature, humidity, etc. [34].\n\nBiologists often use observations and experimental methods for the study of life phenomena, usually in both ways.\n\nThe experimental method is human intervention, controlling the object being studied, and the effects of the subject have been studied by this intervention and control. In the 17th century, the earliest biology experiment has emerged, such as the British physiologist William Harvei on the blood circulation, Yang Boptista Fan Haiermont's experiment of the willow growth. In the 19th century, physics, chemistry is mature, biological experiments have a solid foundation, and thus the first is physiology, then bacterial and biochemistry have become a clear experimental discipline. In the 1980s, the experimental method was further applied to disciplines such as embryory, cytology and genetics.\n\nAlthough we have made profound progress in the understanding of the basic process of life in recent decades, some basic problems still have not been resolved. For example, one of the mainly unresolved issues of biology is gender main adaptive functions, and especially in eukaryotic organisms, its key process, decay split and homologous recombination. One point of view believes that gender is mainly developing into an adaptation to increase genetic diversity (see Resources, such as [35] [36]). Another point of view is that sex is an adaptive DNA repair to germ cell line DNA promotes accurate DNA repair, and increase genetic diversity is mainly possible to see a useful product from the long run. [37] (See Severed Reproductive Evolution).\n\nAnother basic unresolved problem in biology is an aging biological basis. Currently, there is no fundamental reason for aging. The theory of various competition in aging # aging theory [39].\n\nThese are the main branches of biology [40] [41]:\n\nAnimals - BOS Primigenius Taurus\n\nPlant - normal wheat (Triticum)\n\nFungi - sheep bacterium\n\nStramenopila / algae - brown algae\n\nBacteria - Gemmatimonas Aurantiaca (- = 1 μm)\n\nBacteria - thoria\n\nVirus-gamma phage "}