{"chinese_title": "constellation ", "chinese": "The constellation refers to the star combination of a group of groups. Since ancient times, humans linked the star of the three five complexes with the characters or instruments in their myth, and the integrated consisters of these hazards were \"constellation.\" The constellation is almost a means of determining the orientation of the sky in all civilizations, and it is quite wide in the area of ​​navigation. The division of constellation is completely artificial, and different civilizations are not the same for their division and naming. The constellation has not been unified and set, until 1930, the International Astronomical Federation is divided into 88 formal constellations in an accurate border in the exact border to make the sky in a particular constellation with the precise border. Most of these official constellations are based on the ancient Greek traditional constellation of the medieval. In contrast, there are some combinations that are widely circulated but are not recognized as a stars of official constellations, such as Beidou Qixing (see Star Recent Model).\n\nIn the three-dimensional universe, these stars do not have actual relationships, but they are similar to the position on the ball shell of the whole ball, and in fact, they may be far apart. If we are in another solar system in the Galaxy, we will see the stars will be completely different. Since ancient times, people are very interested in the arranging and shape of the stars, and naturally link some locations similar to the constellation.\n\nThe landing of stars or constellations is often used in ancient navigation and time determination. The ancient Egypt was determined by the day of the day, and the ancient technology of the azimuth of the azimuth was still saved by the ancient technology of the position of the position in some areas. [Part 1] The literary image of the constellation and its own representative also often appears in the works of literati.\n\nAlthough the importance of the constellation is relatively low in modern times, the constellation does not lose its charm for the night sky. Through its fascinating legend, the constellation has played an extremely important role in the popularity of astronomy. [Note 2] When a significant major sky occurs, astronomers, popular science workers and media will always set off an astronomical boom between society, especially young people. [Participation 3] [Part 10]\n\nIn order to facilitate research and observation of many stars in the sky, people divide the stars into several areas, each district is a constellation. It is difficult to say that human beings start with consciousness of constellations, such astronomical knowledge is far from being seen before there is a historical record. [Part 5] The name of the constellation is likely to source the sailor in the early navigation. [Part 6] Among the civilizations of different regions, the origin of the constellation may be completely different, but with the expansion and interaction of the civilization, the culture of the constellation also includes a fusion process.\n\nIn the 270th BC, 47 constellations were mentioned in the \"object\" written by Greek poets [Note 3] [Part 2]. The star area recorded from the \"object\" is known that due to the difference in the year, the South Pole in the book is inconsistent with the current South Pole, according to this, it can be inferred that the book recorded in BC is 2000 before BC. Starry sky [Note 4] At the same time, the blank area recorded in the stars indicates that the observer should be nearly 35 ° to 36 ° north latitude. [Part 7] Some people think that the tricks are divided into constellations originated from the Babylonian Babylon and the Summel period, Greece and Egypt. It may be introduced from the region. [Part 10]\n\nIn \"Jobs\", a few constellations of Big Bear, hunter [refer to Niksi, the twelve generation, the landline, the land, the land, the land, the land, Scorpio and the Snake \" Participate 10]. The ancient Greek poet Homer and Hessea also mentioned the big bear, the hunter and the stars (at that time, the stars were seen as a separate constellation, not part of the Taurus) [Part 2] [Part 7] And Babylon in the same period has recorded the twelfth constellation with the wedge text. [11]\n\nTo the second century of the AD, Toller's recorded 1022 stars in 48 stars in his \"Astronomy Dacheng\", which is also the prototype of modern constellations. [Part 8] After many astronomers fill new constellations in the idle of Toller; 1603 Bay, 1690 Hevie, 1752 laci, in the past two centuries for the NANDA name. [Part 10]\n\nAncient China is divided into the sky in ancient China. The earliest book is the history of Sima Qian, the official book, which recorded 91 star officials, a total of more than 500 stars [ginseng 12]. At 283 appearances in the Sui Dynasty, there have been 283 officials, which belong to one of three or twenty-eighth. Three is the three areas divided into the Arctic Sky, which is Zi Wei, Taishi and Tianshi, and is divided into four elephants next to the Huangdao and the orbic equator, four elephants will be subdivided. In seven regions, it is known as twenty-eighth. In ancient Chinese ancient times, because the moon rotates around the earth a week, it is about the month, so it is called \"booth\" or \"\" every day. At the end of the Ming Dynasty, due to the influence of the West, Xu Guangqi's \"Chongzhen Book\" referred to European astronomical data to 23 of the Nanji Star District.\n\nThere is different opinions on the symptoms of the stars to three 垣, four elephants and twenty-eighth accommodation [ginseng 13]. During the Republic of China, Ju Lu, Gao Lu, who believed in the \"Star Imposion\" in the \"Star Impation\", and then four elections, the two eighth nights [ginseng 14]. The astronomer Chen, who has served as the first curator of Beijing Tianwen Pavilion, who believes in his work earlier, and then divided into twenty-eight-bedroom, and the three is final, and points out the name of the three 垣 \"in the Sui Dynasty Tiange \"only, the shape of the three 垣 twenty-eight booths also formed in parallel with [Part 15].\n\nIn the early days of the week, some of the bistees of the 23rd accommodation have been found in the Spring and Autumn Warring States Period. Related to the records of the twenty-eighth and four elephants, the earliest seen in \"Historical\". The academic circles have many differences on the origin and location of the twenty-eighth. [Part 16] [Part 17] Traditionally, the beginning of China's Twenty-eight-studded system was the earliest from eight to the first sixth century BC. [Part 18] In 1978, archaeologists were painted in the tomb of the Tomb of the Tomb of Hubei Suizhou, unearthed, painted with twenty-eighth images, which was the earliest found to date about twenty-eighth cums. [Participation 19]\n\nThe ancient China is set to the middle official, and the twenty-eight-bedroom is actually subdivided from four elections. The two-year-old star zone is called the outer official, that is, \"Zhongguan + Four Embrand\", This is only one of the Chinese ancient China. In addition, there is also a \"five-beast + middle official + outer official\" divided into seven regions into seven regions, divided into 11 ways of \"Nine Wild [Note 5] + Middle Official + External Officials\" [Participation 20], only the \"middle official + four icon\" division is spread widely.\n\nIndians' twenty-eighth (नक्षत्र, Nakshatra, means \"moon station\") to China's twenty-eighth poetment, scholars believe that both the same start. [Part 21] Madler, Madler, Schlegel, Schlegel, Xincheng Xinzang and other people advocate that the twenty-eighth category originated in China; Weber, Yan John, Gold Most (KINZEL), King SMILL and EDKIN, etc. Promoting India's origin.\n\nDifferent from China's twenty-eight hunts, India's twenty-eighth accommodation has replaced China's twenty-eighth category, replacing the sedation in China's twenty-eighth. [Part 2] The start of the two is the end (चित्रा, chitrā), but the start of India's twenty-eighth accommodation is changed to Husu (कृत्तिका, Krittikā). According to the ancient classical records, rooms and walls in India, they also have a bisteland for 27 cums, or if there is also a minus weaver, they are consistent with China. [Part 23] [Part 24] The total names of the twenty-seventh place have emerged in \"Sanshan San\".\n\nAfter the 9th century AD, the Ptle Magnograph was transmitted to the Arab world. Toller's work \"Astronomical Dacheng\" is translated into Arabic, named \"To Dad\". Al Sufei wrote \"Hengxing Book\" (ككاب اكككاكك اثثابةة), one of the three masterpieces known as Islamic observation astronomy. [Part 25] Today's common star names, most names come from Arabic. [Part 26]\n\nBecause the ancient civilization is relatively isolated, in different cultures, the pattern consisting of stars is given the same image. For example, Beidou Seven Stars in the ancient Greece's tail; Chinese people think that it is a pot of wine; the British think it is a plow of farming; the southern part of France believes it is a pan; Ponni Indians It is considered to be a patient on the stretcher; Maya believes that it is seven macaw; the Indian people think it is a seven wise people; the Romans are considered a seven cow. [Part 8] [Part 10]\n\nThe ancient China Ancient official system reflects the social system in the world, the name of the official from the emperor, the court temple, military camping, farming hunting and other aspects. This reflects the \"Heaven and Earth\" of the Ancient Culture of China and the Thought of \"Heaven and Man\". [11]\n\nThe names of the constellation in the Western constellation system come from the characters and animals in Greek mythology, and to Nadangji District in Greece, John Bayer is named in the sea and the biological noun from the sea and the sea. After the French astronomer Niola Louis Laki named 13 bright stars in the name of the scientific device and instrument (there is an exception \"mountain case\"). [Participation 6]\n\nModern constellations of 88 constellations include 14 human images, 9 kinds of birds, 2 insects, 19 land animals, 10 water organisms, 2 semi-rim monsters and 29 non-organisms; hair, giant snake, dragon One one of flying horses, rivers (the sum of the number of 88 is because there are more than one image in some constellations). [Part 8]\n\nThe official name of the modern constellation is used by Latin [Part 9], which spells fixed, but the pronunciation varies from person to person. [Part 27] In English, the constellation is also used in \"Latin + English\" nickname, such as South Fish, is called \"Piscis Austrinus the Southern Fish\". [Part 27] At the first Astronomical Federation of Astronomy in Rome, the Third Committee submitted a resolution of 3 letters of abbreviation symbols (such as \"PSC\", ie, Pisces), and obtained . [Part 28] [Part 2] [Part 30]\n\nThere is no single star naming system in academic. [Part 31] The brighter star is basically based on the constellations they are, using a Bayer nomenclature or the Franist star naming method. Such as semi-horsema α (Bayer Name Method), Swan 61 (Franist Stellar Name Method). There are also some stars to use the starry naming method, such as Tianqin Rat RR, etc. The stars that are unable to see for the naked eye, generally not naming according to their constellation unless it forms a two-star or associate system with a brighter star. These things that need to be seen through the telescope typically use their names in a particular star table.\n\nSome bright stars have the common names from Latin, Greece or Arabia, [Participation 31], such as α AQL, generally referred to in English as \"Altair\", and in Chinese, \"Cowherd Star\". In fact, if you are named in accordance with the constellation, this star should be called \"Original α\" (English) or \"River Drum 2\" (Chinese). \"Tianying\" and \"river drum\" are the Western constellation and Chinese officials.\n\nAlthough deep space celestial (nearsighted, galaxy) turns together with the measis, deep space celestial body is not commonly named. [Part 32] They generally add a letter such as M, NGC, IC before the number number, represent Messi Jexing Table, the New Year Table of the Star Cloud Star, index a star table. For significant deep spaces, there is sometimes more common names, such as M42 located in the Orion, often called the Orion nebula; M45 in ancient Chinese star is called a star stars. [Participation 33]\n\nThe constellation referred to in most civilizations refers to the \"bright star constellation\" composed of bright stars or some more deep spaces, but some civilization will also define \"dark cloud constellation\" through dark areas in the sky. .\n\nModern Eighty-eight constellations can generally be simply divided into Northern Constellation, Huangdao Constellation, Nantian Constellation; sometimes it will be independent of the Equator constellation. By finding the center of each constellation, the coordinates of this point are calculated. According to the mound coordinate system, the position of each point contains two counts of red and decline. If the necklitude of the middle point is positive, that is, the point is located in the northern hemisphere of the measp. The corresponding constellation is the Northern constellation; if Naka is negative, the intermediate point is located in the south hemisphere, indicating that the corresponding constellation is Nantian constellation. These constelors can further determine their quadrants by Reduce: Time to 24 hours, the intermediate point of the constellation is from 0 to 6, and it belongs to Q1, 6 to 12 when it belongs to Q2, 12 to 18. It belongs to Q4 to 0 when it is Q3, 18. [Note 6]\n\nSometimes it will also be divided into the constellation in different regions. These constellation families are used in the group's most important constellation, Huang Dao, mythology, and the heavenly aquarium and create John Bayer, Nicholas Lakay. . There are 8 star families: Big Bear (10), Huang Dao (13), Yingxian (9), Wusai (17), Hunter (5), Aquarium (9), Bayer (11) and Lava (15) In parentheses are the number of modern constellations in the family. [Participation 34]\n\nWhen the conditions on the earth can make the dark spots in the central area of ​​the Milky Way to proceed with shadows on the ground, some cultures have seen the shape of these dark spots, and called \"dark cloud constellation\", this is different from the definition of the bright star. Constellation. The silhouette of the dark spots in the Milky Way is more obvious and easy to see in the southern hemisphere. In Inca Civilization, it is believed that dark areas or dark clubs in the Milky Way are like animals, and they are used to track seasonal replacement [Part 35]. Australian indigenous people also have a description of the dark cloud. The most famous is \"鸸鹋 in the sky\", its head is made of coal bag; in the Legend of the Ande, this dark spot constitutes a camel. [Participation 1]\n\n50 of the modern constellations came from Ptle Magno, 12 by John Bayer named in 1603, 7 by John Hevien Named in 1690, 14 by Nicholas Lakay in 1763 name. By 1922, the International Astronomical Society decided to divide 88 constellations all day and set up the Third Committee of the Belgian astronomer Eugess Delgot (IAU Commsion 3); 1930, the International Astronomical Society officially defined The boundaries of these constelors. [Part 28] After this, any star (except for the sun), the nebula, the galaxy belongs to a particular constellation. [Part 8]\n\nIn modern 88 constellations, the brightest constellation is a south cross; it can be seen that the most star of the star is a semi-horsepartment, 6 and more, the number of stars is 101; the largest constellation is long The snake holders are 1302.844 square degrees, accounting for 3.158% of the total area; the smallest area of ​​the South Crock is only 68.447 square degrees. [Part 36] The giant snake holder is the only discontinuous constellation, which is divided by the snake seat, and the ends.\n\nThe international general constellation is based on the 48 constellations contained in the \"Astronomical Dacheng\", which is the \"Astronomical Dacheng\" of the 2nd Century, which is called the Ptalei constellation. All constellations remain in modern constellations in modern constellations except that the southern sessile is separated from the southern vessel. The Ptle Magnoche mainly inherits the star table of the Greek astronomer in the 2nd century BC, which also cited the observation records of Babylon, 200 years before 700 BC. [Participation 37]\n\nThe Ptlei stars include 48 constellations. Among them, the twelve classical zodiac constellations are marked with light blue; the snake is until 1930, the officially confirmed Huangdao constellation. [Note 7]\n\nLater, the number of constellations is increasing, mainly for filling the vacancies between Ptlei (because the ancient Greeks believe that the bright constellation is a dim blank zone), the other reason is that when Europe's adventure home is in the South Import I can see some of the stars that I can't see, so I have to join the new constellation to fill the sky in the south. The southern vessel is deleted in the 48 Tiri stars, plus the following 41 newers constitute a modern 88 constellation:\n\n29 of which were north of Earth equator, 46 south of Earth, there were 13 in the Earth Earth.\n\nThere are some constellations used in history that they are no longer recognized by the International Astronomy Federation. Finally, they did not have adopted a formal constellation, a more famous one as a quadrant set (now part of the shepherd, quadrant meter meteor shower name). But because they have been used for a long time, we can still see them in historical books or ancient star. The following is the statistics of these constellations:\n\nThe constellation looks as the heavens is caused by the motion of the earth, which is more significant to the earth's rotation and publicity. Due to the global rotation, the starry sky is turned around the sky every day; the Star is also slowly changed with the seasonal changes. After a year, the starry sky is almost consistent with the starry sky before a year. The global rotating axis of the earth is called a long period of time, with a cycle of approximately 25,765. This motion causes the Arctic drift in the star background, which is called the year in astronomy. The rough observation of the constellation can ignore this movement within a short period of time.\n\nThe stars are doing high speed movement. The movement of the star can be broken down into the radial speed of the two connecting directions and the vertical self, where it will change the position of the star in the stars. Since the star distance is too far, it is generally considered that the position of the star on the sky is fixed [Note 16].\n\nDue to the position of the sun and the planet, the position of the globe is not fixed, they are cyclically thirteen constellations on the zodiac. In terms of accountating, it is often described in the way \"Mercury is located in Scorpio\". However, it is only twelve constellations on the astrology and is all of them.\n\nThe constellation is a sailor for a long time, traveler as an important sign of the identification direction. With the development of technology, the role of constellations for direction recognition is gradually weakened, but the spacecraft still determines its own position and navigation by identifying bright stars [Part 43]. For starry lovers, the recognition of the constellation is often identified for the bright star.\n\nIn the northern hemisphere, the Polaris of Coughing is the most important basis in the direction of the stars. As can be seen from the mound coordinate system, the height of the Arctic Star is consistent with the local latitude. However, in fact, because of the Northern Polaris is not bright, people usually use Beidou Qixing to find the Arctic Star, thereby determining the direction. You can find the Northern Polar with the scoop (β to α) of the Beidou. In the case where the accuracy is not high, the direction of the Arctic Star is located in the north. In the low latitude area of ​​the Northern Hemisphere [Note 17], Beidou will fall below the horizon, at which time it can determine the position of the Arctic star according to the \"M\" (or \"W\") shaped fairy.\n\nOnce the Arctic Star and any other stars are identified, the entire starry sky can be identified through the relative position of the star. In order to facilitate memory, people usually look for the big corner of the shepherd seat by Beidou Seven Stars, the end of the chamber, the house, the room α). [Part 31] In different seasons, it is also possible to position significant features in other stars, such as bright hunter, light hunter, Big Oro, Little Dog, Taurus, Yushu, or Even Leo, Nautilus You can find the fairy seat, Yingxian, South Fish, etc., and the summer triangle is the most prone to the summer star air, you can find the Swan, Tianqin Rock, Tianying Station at this time. , Horses, Scorpio, Tianlong Blocks, etc.\n\nThe constellation near Nantian is more zero, distributed a lot of small constellations, and very small stars, many areas do not even have a brighter star, know more difficult [refers to 44]. In addition, Nantian did not have an indication star like Arctic stars, so Nantian is often extended by the Cross (South Cross γ) and the Cross (South Cross α) in the South Cross (South Cross α) to determine [Note 18]. At the same time, the south gate of the semi-horsema and the half-horses alpha) and the horseshopper β), the old man of the boat (the base α), the boat of the Bojiang Radi (α α) is identifying the Southern Hemisphere Important reference.\n\nThe star map is formed in the view position of the star or other celestial body on the mound, and information such as the orientation, brightness and morphology can be identified by the star map [Part 45]. In general, modern star charts will indicate the reference lines such as Red Territory, Ningwei, Huangdao, and the calendar used. The star map is often drawn, and the simple constellation or image is adjusted.\n\nThe Twelve Star Palace of the Xiyang astronomical is a position using the \"constellation\", from the relative position of the earth and the sun, observing the interaction of the solar star operation, to divination or statistics to determine how human fate and personality have affected the study. [Note 19]\nAlthough the thirteen zodiac constellations in astronomy have a year in the middle of the middle of the spring (or the sun) [Note 20], now the astronomical constellation and the Western Astrology Starting period (the creation of the new Babylon dynasty, 626 bc) has already The difference between about 36.85 ° can be inferred that the definition of 12 constellations is earlier. Therefore, the Supreme Palace used by Western Astrology is not a year-on-year problem, which is the starting point of the first palace Aries. [Note 21] Western astrology is usually divided into two pseudo-hears, English: SideReal and Tropical Astrology, but pseudo-heraldian is only based on each of the middle gas generations. Plus 25.5 days, there is no relationship with the real star year or star. "}