{"chinese_title": "Chemistry ", "chinese": "Chemistry is a subpropedic department that studies the nature, composition, structure, and changes in the law. The object of chemical studies involve the relationship between the substance, or the association between material and energy. Conventional chemistry is often a process of contact between two or more substances and subsequent changes, that is, chemical reaction [1], or a substance to become another substance. These changes sometimes require electromagnetic waves, and among electromagnetic waves are responsible for exciting chemical effects. However, sometimes chemistry does not have to react with the substance. The relationship between the spectroscopy study material and the light, and these relationships do not involve chemical reactions. Accurately, chemical research is included in the nuclear-electronic system, including molecules, electrons, ions, atoms, and atomic groups. [2] The word \"chemistry\" is the meaning of \"changing learning\" in the literal explanation. The primary study of chemicals [3] is scientific with each other. Chemical as a broader physics is the basic science of natural science. Many people are called \"central science\", because chemistry is the core of some scientific scholars, connection physics concepts and other science, such as materials science, nanotechnology, biochemistry, etc. Students studying chemistry are called chemists. All substances in the concept of chemists are consisting of atoms or more small and small than atoms, such as electron, neutron, and protons. [4] However, the chemical reaction is carried out in the least structure of atom or atomic group. Several atoms can constitute more complex structures such as molecules, ions or crystals in a certain manner. Contemporary chemistry has developed many different learning doors, usually every chemist only specializes in one, two. Chemical, chemist in the middle school curriculum is called ordinary chemistry. General chemistry is chemical introduction. The General Chemistry Course provides a simple concept of beginners into the field, and it is not very in-depth and accurate than the professional dominance, but ordinary chemicals provide chemists' intuitive and image. Even professionalist, still use these simple concepts to explain and think about some complex knowledge.\n\nThe language of \"chemistry\" in English has a variety of statements. One statement is considered to be named \"Alchemy\". The word \"alchemy\" from the English \"Alkemie\" and \"Al-Kimia\" in ancient French language, meaning \"The Art of Transformation\". The word \"Kimia\" in Arabic is derived from Greek. There is also another saying that \"Chemistry\" in English is derived from the \"Kēme\" in the Egypt, meaning \"earth\".\n\nIn China, the term \"chemistry\" first appeared in the 2007 Mohai Library published journal \"Liuhe talk\" [5]. Weili Yatai mentioned Wang Hao recorded the word \"chemistry\" from Dai De Sheng, in his diary [6] [7]. The term \"chemical\" in Chinese is generally considered to be invented by Xu Shou translation of the book \"Chemical Approach\" book.\n\nThe term \"chemistry\" is introduced to Japan, replacing the translation of the original Japanese [8] [5].\n\nThe earliest chemistry should be considered by human pairs. For the people at the time, the fire can turn an object into another object, so it has become the most interesting research at the time. If there is no fire, human beings will not find the refining method of iron and glass.\n\nHumans have discovered this valuable metal of gold, many people transfer research how to turn other substances into gold. From 300 years to 1500 BC, alchemists have studied how to convert some inexpensive metals into gold, thus accumulating the extraction and treatment of metals. Observation and technology. Some alchemist's main work is to manufacture drugs, and China is also an alchemy. Before 2000, humans have widely used gold, silver, mercury, copper, iron and bronze. The human civilization at the time had certain achievements in ceramics, dyeing, brewing, paper, gunpowder, etc., in technical experience, the understanding of material changes has been observed and delivered.\n\nEarly chemists collected many different substances. Before the 17th century, chemical achievements were not large (the aggregate, alchemy), including more accomplished, such as Robert Yishe. In 1750, chemistry still has mysterious colors and dominates for incorrect theories. Until 1773, Antoan Lauren Deca proposed the quality of quality conservation, and explained the combustion phenomenon with an oxidation reducing reaction, overthrew the \"intersection of the medieval\", only opened the path of modernization; he Therefore, it is respected as \"the father of chemistry\". Then Dalton integrates chemical knowledge at the time and proposes an epoch-called atom with its own experiment. Since then, some chemists have discovered various chemical elements, and later the door Lev has established an elemental cycle to make the chemical vision more complete. In 1901, the chemist Nobel settled the Nobel Chemical Award in its heritage to express contributors in the chemical field.\n\nModern chemistry begins in quantum mechanics that flourish in the early 20th century. The essence of the quantum mechanics in the introduction of the quantum mechanics to describe the linear superposition of the wave function. The discovery of protons, neutrons, and electrons, enabling chemistry to actually understand chemical reactions from atomic scale. Quantum mechanics and electronics have enabled many new instruments to explore and analyze the structure and components of the compound, such as spectrometers, chromatographs, nuclear magnetic resonance and mass spectrometers.\n\nContemporary chemistry is roughly divided into four universal gates, and there are many extension of subgramation and application chemistry.\n\nThe four universities are mainly:\n\nOther extensions and applications:\n\nOne atom is a particle composed of an atomic core and a negative charge electron (called nuclear external electron), which is generally the minimum scale category of chemical studies. The nuclear nuclei is usually composed of protons and neutrons. Unlike the usual physical concept, a single proton is considered to be a 1H (氕) atomic nucleus in the chemical field, that is, the atomic nucleus will inevitably contain protons, but may not contain neutron.\nThe electron with negative charge, proton tape positive charge, and the number of charge balances, so that the entire atom is electrically neutral. When the number of nuclear extracted electrons is different from the nucleus of the nucleus, ions are formed. It is generally considered to be one of the atoms.\n\nThe same atoms with the same proton number are called \"elements\". For example, all atoms in the hydrogen are only one proton. This concept is changed. It is also possible: All hexagonal atoms in all nuclear nuclei are carbon, and there are ninety-dollars in all nuclear nuclei are uranium. Elements also have another definition, that is, all materials that cannot be decomposed by chemical methods are elements.\n\nIn such a variety of methods of enumerating elements, most common and most convenient is the elements periodic table. The periodic table is arranged in accordance with the atomic order, and the atomic order is the number of protons in one atom. Because of this strange arrangement, the elements of the row, whether the same straight, the same rampant is still nearby, have some substantially fixed relationship.\n\nThe same element may have a lot of different nuclides. Their number of protons is the same and the number of neutrons is different, and the chemical properties are the same. However, due to their difference in neutron, there is a different nuclear stability, and some nuclides have radioactivity. Different kits of the same element occupy the same position in the element cycle table, so different nucleosides of the same element are mutual alternative. For example, 1H (氕) and 2H (deuterium) mutual mutory isotope.\n\nChemicals refer to an object that determines its chemical composition and its chemical properties [9]. In strict, mixed compounds, elements, etc., can not be considered chemicals, can only be said to be chemical or chemicals. Most of our daily life encounters chemicals are mixtures, such as air, alloys, biological products.\n\nThe nomenclature of the substance is the most stringent ring in the chemical language. As long ago, the title of the compound was determined by its discovery, so that naming difficulties and confusion. Now we are most commonly used or international pure and application chemical federation (IUPAC) naming methods. It uses a naming system to let all compounds have a unique name and code. Organic compounds are named after organic naming [10] system; inorganic compounds are named after system named [11] system. Through the chemical index service (Chemical Abstracts Service), we can easily find the nature, characteristics, naming and structure of each compound through the CAS Registry Number.\n\nOne molecule is the most basic structure of the compound, and the chemical method is not unfolded. Most of the molecules consist of two or more atoms, but there are some special examples, such as helium molecules, only one atom. These atoms, if more than one, is combined by chemical bonds.\n\nIons are charged substances, which can be lost or electronically formed by atom or molecules. Positive ions (such as sodium ions Na +) and negative ions (e.g., chloride CL-) can become a charge neutral salt (e.g., salt NaCl). Some ions are composed of several atoms, while they do not separate, such as phosphate ions (PO43-), ammonium ions (NH4 +). The ion of the gas phase is generally referred to as a plasma.\n\nThe substance can be classified as an acid or a base. Usually we have several theories of acid base classification definition. Among them, the easiest import of Arrhenius Theory, it believes: acid is a substance that is capable of ionizing hydrate ions in water; while the opposite base is ionized in water to ionure ions . BRØNSTED-LOWRY ACID-Base THEORY is considered to be a substance that can give other substance hydrogen ions in a chemical reaction; and the base is a substance that can obtain hydrogen ions. The third theory is called the Lewis Acid-Base Theory, which is based on the formation of a chemical bond. Louis Theory believes that acid is a pair of electrons in the formation of bonds; and the base is a pair of electrons to other substances in the process of forming a bond. Therefore, if a substance may be acidic for different acid-base theories, it is a base in another theory.\n\nThe measurement method of acidity is mainly two types: the first is that Arezus definition is the most commonly used pH, which is determined by measuring the concentration of hydrogen ions in a solution to determine the size of the acidity. Its calculation method is pH = -LOG10 [H +], that is, the pH is equal to the negative of the hydrogen ion concentration (at 10). It can therefore be said that there is a higher concentration of hydrogen ion solution, the lower the pH, and the acid is stronger. The second is Brønsted-Lowry definition, that is, acid-to-regular (KA), which measures the ability of the substance as acid as acid to give hydrogen ions. Therefore, the stronger the acidity, its Ka is higher, and the tendency to give hydrogen ions. Similarly we can use POH instead of pH, KB instead of KA, will express alkaline strength.\n\nThe concept of redox reduction and the ability of a substance atomic acquisition or the ability to electronically. The ability of the substance has oxidative other substances is becoming oxidative, and this substance is becoming an oxidant (Oxidizing Agents) or as an oxide. An oxidant can remove electrons from other substances. Correspondingly, substances having reduction other substances are referred to as reducing agents or become a reducing agent. A reducing reagent can be transmitted to other substances electrons and oxidize itself. It is precisely because of its \"given\" other substance electrons, it is also known as the supplier electronic matter. The nature of the redox reduction is related to the oxidation number - in fact, the true or acquired electron does not exist. Therefore, the oxidation process is defined as increasing the number of oxidation, and the principle is reduced by the number of oxidation.\n\nSimply, the oxidation reaction refers to the reductant to lose electrons, and the coincide is rising; and the reduction reaction is referred to as electrons, but the chemical price is lowered. Oxidation and reduction reactions must be carried out simultaneously.\n\nChemicals generally refer to the substances that have indeed chemical structure and chemical compositions, so they are also known as chemicals. They may be elements, compounds or mixtures. In daily life, most of what we will encounter is a mixture, such as an alloy.\n\nCompounds are some substances that are combined with a fixed ratio of different elements. The proportion of ingredients determine its chemical properties. For example, water is combined with hydrogen in two to two, and the three atoms constituting the water molecules constitute 104.5 degrees. Changes between different compounds and elements are referred to as chemical reactions.\n\nMoore (English: Mole, only in Taiwan \"Moore\" one word) is an international unit of the material, the symbol is mol. 1 mole is the number of basic particles and 12 grams of carbon-12 (\n\n\n\n\n\n\n\n6\n\n\n12\n\n\n\n\n\nC\n\n\n\n\n{\\ DisplayStyle {} _ {6} ^ {12} \\! {\\ mbox {c}}}\n\nThe amount of a system substance containing the number of atoms contained. When using molar, the basic particles should be specified, which may be molecular, atom, ion, electron or other basic particles, or a particular assembly of a basic particle. The number of basic particles contained in the molar material is equal to the Avo Gado constant, the symbol is NA, the value is 6.0214129 × 1023, and 6.02 × 1023 is often taken.\n\nThe molecular weight and molecular weight of a substance is in terms of using international units, and the value is equal.\n\nChemical bonds refer to the force of mutual action between the particles of the molecule or material, wherein the particles may be atoms, ions or molecules. The physical essence of the chemical bond is derived from the electrostatic force between particles and particles, and quantum mechanics means that the wave function linear superposition of the atomic electrons. Chemical bonds are one of the most important concepts of chemistry, and the physiotheoretical nature is established by Lenas Bown. The chemist can simply express the chemical bond and avoid the complexity of quantum mechanics, classify the chemical bond into covalent bonds, ionys, and metal bonds, and weaker bonds such as hydrogen bonds and more special coordination interactions. Regardless of the classification, its physical essence is the same.\n\nMolecular interstitational force is the force between different molecules, mainly hydrogen bonds, Van Dew Huawei, hydrophilic effect / hydrophobic effect, this force is better than chemical, easy to open or recombine, but is a molecular spatial arrangement and architecture The important role is one of the important research directions of modern chemistry.\n\nSubstances are sometimes liquid, sometimes the solid, sometimes gas, which is called a substance. Whether a substance is soft, translucent, and it is a refractive index, which is the physical characteristics of a substance. In summary, physical properties are characteristics that can be disconnected by a substance without chemistry.\n\nChemical reactions, also known as chemical changes is a process of transition to another substance, involving transfer, formation or disappearance of chemical bonds in molecules. Changes in chemical reaction can both make many independent molecules In conjunction, a larger molecule can also be unpubged into many separate small molecules, even with an atomic movement in the same molecule, even if the number of atoms has not changed, but still constitutes a chemical reaction.\n\nChemical changes, also known as the chemical reaction is a process of transition to another substance, involving the exchange, formation or disappearance of the atom's exchange and chemical bonds in the molecule. Changes in chemical changes can only make many independent molecules, and a larger molecule can be opened to a lot of separate small molecules, even with an atomic movement in the same molecule, even if the number of atoms has not changed, but still Component chemical changes.\n\nAlthough the balance concept is widely used in the fields of science, in chemistry, chemical balance refers to a variety of different states in chemical components, such as in a mixture of several compounds that can react with each other, or when the substance can When there is more than one kind of phase.\n\nEven if there is a constant chemical composition, chemicals in balancing systems are generally not in a static state; the molecules of these substances continue to react, thereby generating dynamic balance. Therefore, chemical balance describes a state in which parameters such as chemical components remain unchanged over time.\n\nThe conservation of chemical reactions must meet the law of physical conservation, and the reaction should be compliant before and after:\n\nChemical Industry (Chemical) is an important part of contemporary economic activity. The 50-year-old chemical manufacturer sold a total of $ 587 billion in 2004, of which 8.1% is occupied, including 2.1% of R & D costs [12]\n\nOther, such as radiation analysis, isotope chemistry, radiation chemistry, nuclear fuel, reactor and fission chemistry, geochemistry, marine chemistry, atmospheric chemistry, environmental chemistry, cosmochemistry, intertrochemistry, drug chemistry, neurochemistry, agricultural chemistry, oil Chemical, wood chemistry, soil chemistry, coal chemistry, food chemistry, chemical geography, celestial chemistry, rock chemistry, spatial chemistry and colloides and interface chemistry, etc. "}