{"chinese_title": "Safety ", "chinese": "Safety (English: Safety) is a state, the simplest definition is not dangerous [1], more detailed definitions refer to protection, not subject to various types of faults, damage, errors, accidents, harm or other unwilling events The impact, these types include physical, social, spiritual, financial, political, emotion, occupation, psychological and education. Safety can also be defined as able to control a particularly identified hazard (English: hazard), so that the risk is below a certain level of acceptable, so it can also reduce the possibility of health or economic losses. Safety can include protection against people or objects.\n\nIn some guarantees or insurance, security can define an item or tissue functionality, and this function is harmless. Its purpose is to ensure that items or organizations will only perform the function of the original definition.\n\nIn some cases, security is a relativity concept. It is impossible to eliminate all risks, or because of its difficultness and its cost. In this case, security is the risk and damage of personnel or items, within an acceptable range, and can be managed.\n\nSome products meet the corresponding safety standards, which are safe, but some products are only a safe, how to distinguish these two types of products is very important. In order to distinguish between different safety types, road security communities use these nouns:\n\nNormal security (Normative Safety) refers to the standards and protective measures that design or product meet the applicable.\n\nSubstantive refers to the history of a product in security issues, but it does not necessarily meet the relevant standards.\n\nPerceived Safety means a customer's cognitive security. For example, traffic lights are generally considered safe in perception, but in some cases, it may increase traffic accidents in the intersection. The safety record of the ring is quite good [2], but the driver will be nervous.\n\nLow perceived safety design may bring additional costs. For example, after the US 911 attack, many people choose to drive without plane, but in actual data, even if they consider terrorist attacks that the aircraft may have, the plane is still safe than driving. Perceived risks are also avoided to walk in the process of walking or riding a bicycle, but these health is greater than the risk of injury [3].\n\nSafety (Security) is also called social security or public safety because of the risk of deliberately criminal acts such as attacks, theft or destruction.\n\nBecause there is a moral consideration, the security of the security will be highly substantive and safe. For example, a person is serious than that of murder and death, but the number of people died in a car accident will be more than murder. .\n\nWhen considering security issues, it is often representative of a significant risk to cause casualties or damage to items. In order to deal with these perceived risks, many interventions may be, which may be engineered or regulatory measures.\n\nIn response to the perceived safety issues, common individual strain methods are insurance, if it is damaged, money compensation can be obtained.\n\nSystem security and reliability project are engineering majors. Under the continuous change in technology, environmental supervision and public safety issues, analysis of complex safety key systems is increasingly strict.\n\nThere is a common fallacy in the motor engineer, and it is considered that security issues can be easily informed and treated. In fact, in the event of more than 100 years, the security issue will appear one. Thousands of people are engaged in related work, unlikely to be fully informed by a single engineer in decades. The understanding of the literature, standards and usage habits of specific applications is the key to safety engineering. It is necessary to cooperate with the accumulation of theory and practical experience, and the tracking record will point out that the theory of certain fields is related (in the United States, if the motor engineer has The professional engineer's state license requires the best work, but although there is this provision, most motor engineers do not need this license).\n\nSafety is often seen as one of many related properties: quality, reliability, availability, maintenanceability, and security (sometimes not mentionable, because the availability is a combination of reliability and maintainability). These issues determine the value of any work, and any of these prosthesis will increase costs, and increase the increase in the cost of these attributes far exceeded, so good management hopes to minimize total cost.\n\nSecurity measures are to improve security, reduce activities or measures for human health. Here are some common security measures:\n\nThere are many standards organizations to make safety-related standards, which may be a voluntary committee or a government agency. These institutions define standards and release safety specifications. There will also be certified agencies or authorized independent third-party units to check and confirm whether the product is in line with safety-related standards. For example, the US Mechanical Engineer Society (ASME) proposes many boilers and pressure vessel specifications (BPVC), and authorizes the German Rhein TUV Group to provide certification services to confirm that the product is in line with its safety standards [4].\n\nThe main standards organization in the United States is the National Standards Association. Generally, it is a constituent committee, research security issues, and proposes a standard for US National Standards Association. The National Standards Association will review and adopt their recommendations. Many government regulations require that the products that sell or customer use must meet specific ANSI standards.\n\nMany government agencies set security regulations for their jurisdiction, such as\n\nIn the United States, most product safety tests are managed by the US Consumer Product Safety Commission, in addition, products related to the workplace are also jurisdiction in Occupational Safety and Health Authority (English: Occupational Safety and Health Administration) (OSHA) the following. It is required to be certified by an independent test company called \"National Recognized Testing Laboratories, NRTL) [5].\n\nFor test labs, the European Union Committee provides legal frameworks, but Member States can authorize the test laboratory for safety testing.\n\nMany countries have national organization to recognize safety testing and safety certification, generally referred to as certification bodies. "}