{"chinese_title": "painting ", "chinese": "The painting is at the technical level, is a surface as a support surface and adds a color above it. Those surfaces can be paper, oil, wood, wood, glass, lacquer or concrete, etc., the color of the color can be a brush, or a knife, sponge, or even a paint sprayer (English: airbrush), toothbrush, fingers, etc.\n\nIn art term, the meaning of painting includes the purpose of using this art behavior and plus graphics, composition and other aesthetics to achieve the purpose of showing the concept of drawers hope to express.\n\nThe brightness means that the color of the color is dark (degree of depth). The more shallow is that the brightness is high, and the relatively deep is bright, and one of the elements in the painting is the feeling and effect of brightness. Every point in the space has different brightness, which can be expressed in black, white and middle gray in the painting. In practice, the painter can express the shape of the object in parallel, relatively, if only different colors of the same brightness may only indicate the shape of the image. The basic technique of painting includes geometric patterns, many different perspectives and organization (perspective) and symbols. For example, the painter is watching a specific white wall, because the impact of the shadow and the surrounding object reflect, every point will have different brightness, but in the ideal, even in a full black room, the white wall is still White. Because even if there is no light in the room, it is dark, the object still exists, and there is no disappearance, so it can be proved to be correct.\n\nColors and tones are the foundation of the painting, just as the pitch and rhythm of the music. Color is highly subjective, but the psychological effects brought can be observed, but its effect may vary with culture, for example in Western culture, black means death and mourning, but in oriental culture, it is white Indicate\n[1]. Some painters, theoretists, writers and scientists (including songs, Wasi Kanting, and Newton) have proposed their color theory. Moreover, the language can only represent an abstract color, such as red this word to represent light in a range near pure red light in a visible spectrum. As in music, different musicians have a common definition for central C or C♯4, but different painters do not have a recognized definition for colors. For painters, the color is not limited to basic color or derived color (such as red, blue, green, brown, etc.).\n\nIn painting, the painter is colored with pigments, so the painter's \"blue\" may be one of the following colors: midnight blue, indocus, cobalt blue, group. Colors are not necessarily related to the meaning of the painting and the method of painting. Colors can add some potential, derived significance, so the feeling of painting is very subjective. This part can be compared with music. Music (eg, central C) similar to the light in the painting, shadow is similar to strength, color is similar to the tone of different musical instruments, although these do not necessarily form a melody, but some different content can be added to music.\n\nModern painters have extends painting, such as srath of three-dimensional derivatives, strictly not painting. Some modern painters will integrate different materials due to the texture of the material, such as sand, water, straw or wood. This is a class like letting Dubi (English: Jean Dubuffet) and the works of Aselm Kaffe. There are also more and more artist communities to use software and Adobe Photoshop or Corel Painter to draw color painting on digital canvas, and can be printed on true canvas if needed.\n\nThe rhythm in the rhythm and music in the painting is as important. If the rhythm is defined as \"pause in a sequence\", there is also its rhythm in the painting. Such pauses allow imagination to participate in it, producing new creation, typing, melody, and coloring. The distribution of these forms (or any kind of information) is quite important in art work, directly affecting the aesthetic value of the work. In the aesthetic value, the free flow of perceived is deemed to be beautiful. Not only in art or science, the energy free flow will enhance its aesthetic value.\n\nIt is known that the oldest painting is located in the French Geote Chauvet, some historians believe that it can be traced back to 32,000 [2]. Those paintings are carved and painted by Red Ochre (English: Red Ochre) and black pigments, the theme has horses, rhinos, lions, bursts, mammoths or hunting people [3]. Stone-hole murals are all common in all parts of the world, such as France, Spain, Portugal, China, Australia and India. The discovery of these paintings has caused many different guess for their purpose. Some hypothetical assumptions are those who think that they think that painting can capture the soul of animals, so that they are more smoothly hunting; some hypothesis think that it is a kind The phenomenon, expressing their respect for nature; there is another assumption that human beings have the needs of self-expression, and those paintings are their results; there is also the point of view of application information [4] .\n\nWestern culture is mainly based on oil painting and watercolor, and has a rich tradition in form and theme. The Eastern is mainly in the painting of ink and mineral pigments, and has a rich tradition in form and theme.\n\nPhotography has a big impact on painting. The first photo has been admired in 1829. After decades, photography technology continued to improve and widely used, so painting was also challenged by the original function of logging the real world. A series of art activities in the late 19th century and early 20th centuries include an impressionist, post-impressionist, wild beast, expressionism, three-dimensionalism, and Dadaism, challenged the idea of ​​art revival age. However, Oriental Art and African Art still maintain past style and is not affected by photography.\n\nThe idea of ​​modern art and contemporary art and the historical value and concept of traditional art are different. Therefore, in 1960, he said that the rigorous painting type was dead [5]. However, this did not prevent most of the painters from continuing to use the painting as part or all of its creation. The vitality and variability of the painting in the 21st century have passed the declaration of rigorous art. In the era characterized by cultural diversity (English: cultural pluralism), there is no consensus for the representative style of the times. Artists continue to create in different styles and aesthetic temperament, and their achievements remain in the market.\n\nAt the beginning of the 21st century, the painting faction continued to have monochromatic paintings, hard-edge painting (English: hard-edge painting), geometric abstractism (English: Geometric Abstract), misappropriation, super-handleism (English: hyperrealism) , Photo truthist, expressionism, minimalism, lyric abstract (English: lyric abstract), Pu Art, Oep Art, Abstract Pistachi, Color Domain Painting, New Expressionism, Laqi, Intermedia (English: Intermediate) Painting, Collection Art (English: Assemblage (ART)) Painting, computer art (English: Computer ART) painting, postmodern painting, Xida painting, three-dimensional canvas (English: shaped canvas) painting, environment murals, traditional characters Painting (English: figure painting), landscape, portrait and glass painting animation.\n\nPainting can be classified according to many different methods, such as by media, subject matter, culture, etc. A modeling does not necessarily only use a type, but can be associated with multiple categories, such as white drawings that can be classified or classified in form.\n\nAesthetics is a research on art and beauty. It is one of the themes discussed by Kant or Hegel etch the 18th century philosopher. Greek philosophers such as Arto and Aristotle also have special discussion on art and painting. In Plato's philosophical system, the status of painters and sculptors is not high. He believes that painting cannot describe truth, painting is just copying actual things, including crafts, no other ingredients, like shoemaker and cast iron [source request ]. However, in Dawen West, the cognitive understanding of painting and the cognition of Plato were considered \"La Pittura è Cosa Mentale\" (painting is the things of the soul) [8]. Kant is divided into two concepts of beauty and beauty, analyzes the same place and different places [9]. Although he did not mention painting, it extends its concept to the painting like Joseph Marold William, and Caspa Friedrich.\n\nHegel believes that it is unable to give a common definition in his aesthetic research, thinking of painting, poetry and music is three \"romantic\" art in his aesthetic research, including the purpose of symbolicization, high intelligence [10] [11] .\n\nPainting is a form of capture, record and performance of different creative purposes, and its participants are similarly numerous. The essence of painting can be nature and objective (such as still life or landscape), photographic painting, abstract painting, narrative, symbolism, emotional or political nature. There is a large part of the painting of the painting and the concept of spirituality and concept, which is in the inner wall of the pottery to the inner wall of the Western, and the Bible story scenes on the ceiling. They will express it through the human body itself. Spiritual theme.\n\n[Edit in Wiki Data] "}