{"chinese_title": "game ", "chinese": "Games can refer to a recreational activity, or this activity process. The props of the game can be toys. In English, sports competition (Game) is also a game, and sports is also evolved from the game. The game is an organized play, usually in entertainment, sometimes there is also an educational purpose [1]. The game is different from the work of the corresponding money remuneration, and it is also different from the art of presenting aesthetics or conceptual elements. However, the divide between each other is not necessarily clear, and the game and work like professional athletes may be integrated, and like jigsaw games will have ingredients for games and art.\n\nThe main ingredients of the game have purpose, rules, challenges and interactions. Games generally have psychological or physical stimulation, many games can cultivate relevant techniques, organic, educational, simulative or psychological significance.\n\nFrom the Jiyuan 2600 [2] [3], the game is part of human experience, appearing in all cultures, like the Urrude, Senet and playful chess are the historic related long-standing games [ 4].\n\nLudwig Vitgenstein may be the first philosopher trying to define under the game, in his book \"Philosophical Research\" [, Vitgenstein proposes several elements, like playing, rules and Competition, but these are unable to define the game. Vitgenstein believes that humans use \"games\" to call many different activities. However, with the presentation of the game definition, the present philosopher believes that Vitgenstein is not the final conclusion, like Thomas Hurka, think Bernard Suits is a good definition of the game.\n[6]\n\nFrench sociologist Roger Kelos (English: Roger Caillois) is active in the book \"Game and People\" (Les Jeux et Les Hommes) [7] defined the game:\n\nComputer game designer Chris Clais Claus (English: Chris Crawford (Game Designer) is the founder of \"Computer Game Design Journal\", trying to use a series of two-point definition game: [8]:\n\nThe game can be \"what is the player wants?\"\n\nThe game often classifies the props needed when playing games (eg, a zoom (English: MiniaTures Game), ball, card, chessboard and chess pieces or computers. Like the area that is easy to get in leather, since there is history, the ball is popular, and the global ball game has football sports, basketball, football, baseball, tennis and volleyball. The props needed by other games will be different from the region. Like European standard gaming groups, chess, such as Western chess, can be seen from their chess and develop.\n\nSome games represent other things, representatives can represent chess pieces on the board, game money (English: play money) or other games, invisible things.\n\nLike a hide and seek, there is no need for special props, but its interaction is also related to the environment. If the environment is different, even if there is similar or even the same rule, it may become different games, such as the school's hide, hide, hide, and seek . The car used by the car is the same, and the difficulty in the car or the general road will be different.\n\nGames are often classified according to rules, and the rules may have changed or even change. When they change to a certain extent, they become a new game. For example, the baseball can be played with a general baseball, or it can be played with a weapon ball, or a baseball. However, if you agree, there is only three barriers, it turns another game. However, some games are characterized by changes in their rules, just even so, there will still be constant metamorphic rules.\n\nThe rules will determine the order of playing, the players' rights and obligations, and the player's purpose. Players' rights may include the use of resources or moving representatives. The general victory may be the first number of points to collect or represent detries (such as Cattan), with the most representatives at the end of the game. (For example, real estate tycons), or representatives of both parties have certain specific relationships (such as the death of Western chess).\n\nThe props and rules of the game will affect the game in different levels of skills, strategies and luck, and may be the above combination.\n\nGame Skills (English: Games Of Skill) includes skills, such as wrestling, tug, hopping houses, and shooting sports, including mental skills, such as Western Checkers and Western Chess. Strategy Games in Western Checkers, Western Chess, Indian Boucu, Go and Wicker Chess, usually need to cooperate with special equipment. Game game emphasizes its luck ingredients, like gambling games (, mahjong, roulette) and snake ladder, scissors, stone, cloth, etc., mostly need cards or dice.\n\nBut most of the games will use both techniques, strategies, and even all of the luck. For example, American football and baseball will use skills and strategies, while TiddlyWinks (English: Tiddlywinks), poker and real estate tycons are dominated by strategies and luck. Many chess version of the game will use skills, strategies and luck, and most of the luck ingredients of the game are smaller, like the Warring States State, Katan and Kakari and other strategic games.\n\nMany scholars have found that games not only exist in humans, but also have a lot of game behavior in many mammals. The game history is very long, but the study is carried out in modern times.\nThe study of the essence of the game is still developing, and there is currently no final understanding of conclusions.\nThe game theory mainly:\n\nGerman poets and dramatic Schiller proposed a game theory. This theory believes that \"human beings should be subject to mental and substances in life, lost ideals and freedom in these constrains. So people use the remaining spirit to create a free world, it is the game. This creation activity Produced in human beings.\n\nSchiller said: \"When people are full of people, he only gamously; only when people play, he is completely people.\"\n\nThe remaining energy is a game theory, which is proposed by the British philosopher Herbert Spino. He is a further supplement to Schiller's instinct.\n\nThis theory believes that \"human beings have completed the main tasks of maintaining and continuing life, there are remaining energy, this remaining energy vent is the game. The game itself does not have utilitarian purposes, the game process itself is the game the goal of\".\n\nGerman biologist Carl Garrus (English: Karl Groos) to the residual energy of the British philosopher Herbert Screws and Schiller's instinct said.\n\nThis theory believes that the game is not a purposeful activity, and the game is not associated with the actual life. The game is a preparation activity that faces life in the future. For example, the kitten grab minus is practicing the mouse, the little girl gives the doll, is practicing as a mother, the boy playing the game is exercising.\n\nFreud has also proposed a game's theory. He believes that the game is an alternative to being suppressed.\n\nThere are many games, and different types of games will be derived in different media, the number of items or participation in different types will be different. These include:\n\nHuman body (such as hands, feet) or use toy entertainment. More common, \"stone, scissors, cloth\", sometimes sports activities, and even martial arts programs are also treated as games. Commonly used toys have caches, balls, cold weapons, etc.\n\nTable games are used to describe any games playing on the table or plane, including layout games, paper strokes, card games, dice games, designers in the table in recent years have more and more action, sound, rhythm , Props, pictures, dolls, story background, or even art, film and television, music, dance and other materials to join the trend of the game, providing players or players more sensory stimuli and different experiences in the past, To enhance the fun and quality of the game.\n\nPlanning games are used to describe games that will draw graphic symbols on the plate as a record tool, which is to play games with chessboards and chess pieces, including common chess games, chess is one. The number of participants can be one person, two people, or even many people. Flying chess, Go, etc. are more common layamers.\n\nIt is used to describe games that will only have pen and blank sheets, including wellword chess, alone, you draw me guess (PICTIONARY) and crosswords, etc.\n\nAlso known as card games or card games, broadly use cards (cards) to conduct a total name. The narrow sense refers to the game of the playing card.\n\nAlso known as the collective game, the number of participants must be more than three. The game can be seen as an experimental study activity, helping the group to learn from the game, learn interpersonal skills and how to make the team to work. Participants and or the host may be some groups such as churches, teachers and students. Since the participants may have many, large spaces are usually required to play games, such as auditorium or school playground.\n\nIncluding TV games, computer games and carrier gaming machines, etc. Its features must use the display of the electronic device containing the display, see the game console.\n\nIn the game, players play a game in a virtual world in a particular scene. The role has different capabilities according to different game plots and statistics (such as health, power, strength, sensitivity, intelligence, etc.), and these attributes will change according to the game rules.\n\nAmong them, role playing games are divided into table role play games, electronic role play games and presence dynamic role playing games.\n\nPutting game, or puzzle game, intelligence game, puzzle game\n\nSuch games require players to use their wisdom to solve problems in the game to achieve the goal of the game.\n\nThe latest commercial game usually adds action elements, making the puzzle game can exercise the brain, hand, and eye coordination of the players through the game, and maintain intelligence and open thinking.\n\nReferred to as MOBA game, originated from the \"Warcraft III: Chaotic Treatment\" model called \"Remaining War\" (English: Defense of the Ancients), due to its changing game situation and multi-game factors welcome. Such games are multi-cooperation with teammates to achieve the purpose of defeating the hostile camp.\n\nCurrent relatively well-known Moba game with League of Legends, DOTA\n\nOther game types include outdoor games, fun play and mathematical games. "}