{"chinese_title": "Earth Science ", "chinese": "Earth science, also known as gerics, refers to all sciences studying the earth, is a special branch of planet science. The disciplines usually study the earth with physical, geographical, geological, meteorology, mathematics, chemistry, and biological perspective. It is closely related to human life. The gold ornaments and diamonds wearing in people are mineral resources from the earth; sand, stone, cement used in the house, also from the earth; the fish and shrimp, most Since the ocean; the changes in temperature affect the life; the operation of the celestial body is also affecting us. Therefore, earth science is a very foundation, very important discipline. Earth science is wide, covering geology, oceanography, meteorology and astronomy. Geology is to explore the history of Earth, including its evolution and distribution of various miners, rocks, and minerals; oceanography is studying seawater sports, seawater physics and chemical nature and seawatum; meteorology is analyzing atmosphere Composition, constructing, and motion; and the development of the earth, the formation of the solar system and the movement of the celestial body, the evolution of the universe, all of which are astronomical research. Taking meteorite hitting the earth as an example: high temperature and high pressure impact Earth's results, it is bound to cause changes in terrain and geology; flying dust particles in the atmosphere will obscure the sun, atmospheric and seawater temperatures. Therefore, it seems a simple astronomical event, causing changes in geology, weather, and ocean, which can be seen in various fields, and ring-ring.\n\nEarth science has focused on field surveys, spatial space, emphasizes geographical characteristics and major integration, and is described below:\n\nWild surveys or observations are the primary work of the study of Earth's science, investigate the distribution of rock formations, record weather changes, observe the tide landing and observation stars, moon, solar, etc., are wild surveys. After detailed observation, analysis, summation, organizing the theory of Earth Science. Therefore, the field survey is the most basic work of the earth science.\n\nSome nature changes, the time is long, and the impact is wide. If the scholar wants to simulate the phenomenon of nature in the laboratory, it is greatly limited. So they often investigate outdoors, the time required for it is usually very long.\n\nEarth science explores a wide range of spatial spaces, and the weather phenomenon between the surface is turned between, and the time unit used is small, seconds; while the goalball from the birth to the process of extinction, the time is billions of years, The scale is from seconds, points, and even hundreds of millions of years, all have an example. In electron microscopy, the distance between the atoms between the mineral crystals is preferably represented by å, but the distance between the galaxies can be much more than millions of light years. It can be seen that the range covered by the spatial scale is also ignorant.\n\nEarth science has a very strong geographicality, such as Taiwan because it is between the first Ocean Pacific and the world's first main land, so the weather changes multi-end. The weather in mainland China is relatively stable.\n\nEarth Science is a discipline of \"Shangbao Astronomy, Looks Geographical\", the land that is stepped on by people, the air breathed, and the ocean that we live is closely related to the stars, the moon, the sun, and the whole universe. Both are the objects of research. Scientists use a variety of theories to study the earth, for example, mathematics help calculate the movement trajectory of comets, the movement of the gas group and the scale of the earthquake; physics is used to study the gravity field of the earth, the gravity of the mutual body, the movement of the front or foreign flow; Chemical knowledge can analyze the chemical composition of rocks; and the principle of biology, help understand the meaning of fossils, and then establish an ever-evolution architecture. So the earth science is an integrated discipline.\n\nEarth science is generally divided into four areas: rock circles (geo: geosphere), water circles, large air circles and biospheres; respectively correspond to rocks, water, air and life of the earth. In addition, there is also a snow ring (corresponding to ice), part of the aqueous ring; the soil circle (corresponding to the soil) is the outermost layer of the rock circle.\n\nEarth Science Branch and Related Crossics. "}