{"chinese_title": "System theory ", "chinese": "The system refers to an organic overall with a certain structure and function composed of interconnection, interacting elements (or part); exact, feature + structure = system. From the perspective of the system, the disciplines of the objective world are observed, which is system science. It studies the field across natural sciences, social sciences, but removes more narrow physics, biological, psychological, economic significance, and puts the research center in the essence of various systems. System science main research system elements (or elements), structural, and system behavior (nature). [1]\n\nGeneral System Theory (or common systemism) is a scientific field of logic and mathematics found by Betaran, and its purpose is to establish a general principles suitable for all systems. He published in 1948, \"Life Problem\", a general sign system, general sign system. Betarangfi proposed the open system theory of biological development, and established the first river for the theory of biological evolution.\n\nFor life and non-life, the average person has an intuitive feeling of distinguishing between them. The former is an open system that requires constant and environmental exchange energy and information, while the latter's stability needs and environmental isolation, the can maintain its independence, such as pure oxygen, once released into the air, immediately mixed with other gases. Therefore, there is a significant difference in life and non-life. The concept of thermodynamic physicist Buri Province proposes negative entropy corresponding information, information disciating the metrics, the Austrian theory physicist Schrödinger \"What is life? - Physical concept of live cells \"propose the negative entropy principle of life, Puli Gaojin proposes the self-organizing theory of energy dissipation structure from physics, thereby architectural bridges of physics and biology.\n\nOu Wen Razlo and Budapest Club issued a generalized evolutionary theory and established magazines such as \"Generalized Evolution\", \"General Evolutionary Theory Research\", thus establishing a universal system self-organizing theory system. Aigen applied chemical kinetic principle to propose the biomolecular supercircum theory of cell origin, further in the cell and molecular levels.\n\nThe famous scientist Qian Xuesen proposed the hierarchical model of the system science, and its detailed classification is as follows:\n\n110 mathematics\n120 Information Science and System Science\n130 mechanics\n140 physics\n150 chemistry\n160 days\n170 Earth Science\n180 biology\n190 psychology\n\n210 Agricultural University\n220 forest\n230 animal husbandry, veterinary science\n240 aquatic studies\n\n310 basic medicine\n320 clinical medicine\n330 Preventive Medicine and Public Health\n340 military medicine and special medicine\n350 pharmacy\n360 Chinese Medicine and Chinese Medicine\n\n410 Engineering and Technology Science Foundation\n413 Information and System Science related Engineering and Technology\n416 Natural Science related engineering and technology\n420 Surveying Science Technology\n430 Materials Science\n440 mine engineering technology\n450 metallurgical engineering technology\n460 Mechanical Engineering\n470 power and electrical engineering\n480 energy science technology\n490 nuclear science technology\n510 Electronics and Communication Technology\n520 Computer Science Technology\n530 chemical engineering\n535 product application related engineering and technology\n540 Textile Science and Technology\n550 food science technology\n560 civil engineering project\n570 water conservancy project\n580 Transportation Engineering\n590 aviation, aerospace science technology\n610 Environmental Science and Technology and Resource Science and Technology\n620 Safety Science and Technology\n630 management\n\n710 Marxism\n720 philosophy\n730 religious\n740 language\n750 literature\n760 art\n770 historical\n780 archeology\n790 economics\nPolitics\n820 law\n830 military school\n840 sociology\n850 nationalology and culture\n860 Journalism and Communication\n870 Library, Intelligence and Document\n880 Education\n890 Sports Science\n910 statistics "}