{"chinese_title": "demography ", "chinese": "Demography is a discipline studying human born, death, and migration. At the same time, the impact or cause of the population increase and decrease changes is further explored by the growth or reduction of these populations.\n\nThe population has the following differences:\n\nProduction age: refers to the population of 15 to 64. Generally referring to young people and strong people.\n\nDependent age: refers to the population of 0 ~ 14 to 65 years old. Generally referring to young and old population.\n\nThe middle of the age: is the median age, sufficient to divide the age area into half.\n\nPopulation-dependent ratio: also known as the support ratio, is the value of the production age ÷ dependency × 100%.\n\nA chart for distinguishing between population gender age and structure to represent the distribution of people 's gender age.\n\nAge ratio: refers to the proportion of different numbers, that is, the structure of various ages.\n\nGender ratio: Also known as gender ratio, is a metrology that measures the proportion of men and women in population. When it is more than 100, it is more male than women; less than 100 is reversed.\nSee * Gender ratio\n\n1 Enhance type: That is, low pyramid, presenting a wider structure. There is more than low development countries.\n\n2 Stable: Population structure is stable, and the development is balanced. It happened in developing countries.\n\n3 Decrease: That is, the pyramid is reversed, which presents a narrow structure under the width. There is a developed country.\n\nHas two main population increased down modes.\n\nIt means that the population birth and death in a region has increased or decreased by the population.\n\nThe natural increase in population usually involves the phenomenon of relevant economic and social factors. (, Such as the influence of national economic development on natural increase or decrease.)\n\nRefers to the influence of the population export or flow in a certain region, which causes the population increase in a society.\n\nSocial increase is involved in the influence of economic development gap between the output country and the importance, including the impact of religion, war, and cultural factors.\n\nRefers to the temporary or permanent change of the place of residence. At the same time, the power and cause of the relevant factors constitute the migration\n\nRefers to the migration of counties and cities in a country, usually the economy is the biggest influencing factor, which reflects the flow and level of lifestyle. (For example, rural migration into the interior migration of the city).\n\nRefers to the flow of lives between transnational international. Usually, in countries that have international migration, if unemployment is high and the residential is inadequate, it will cause \"anti-immigrants\" to create turmoil and uneasiness to the local social order.\n\nSee World Population Research Institutions "}