{"chinese_title": "TV ", "chinese": "TV (English: Television, referred to as: TV) This word represents three different meanings, such as: continuous dynamic images and sounds are converted to electronic signals, and after transmitting electronic signals through various channels, the electronic signal is restored as an image. And sound technology, that is, television technology; refers to the device that receives such an electronic signal, it can receive and restore the electronic signal as a continuous dynamic image and sound, that is, a television; a social and cultural phenomenon, a community The crowds and people use TV as a communication carrier to communicate, message communication, that is, the so-called broadcast process, such as TV program, transmission, reception, and audience for judges and feedback on TV programs. aspect. The facilities for making television broadcasts are called a TV station.\n\nTV is one of the important inventions of the world to believe in the 20th century, and it is still very popular in communication tools. With the advancement of technology, TV is also gradually evolving, such as smart TV and network TV.\n\nThe TV is not the invention creation, but a large group of people in different historical periods and the country. As early as ninety centuries, people began to discuss and explore ways to convert images into electronic signals. In 1900, the term \"television\" has appeared.\n\nTelevision can also be understood as electromechanical television. We know that the movement of the TV picture is the illusion of human visual, that is, you can \"synthesize\" movement, continuous screens, \"synthesis\" moving static screens. How to quickly restore these static pictures, so that people can generate an illusion, there will be two ways. One of them is that the mechanical reduction method is also a Nikovovi. Russian German scientist Paul Gairn Ben Nikov raised and applied for patents in the world's first mechanical TV system in 1884, and he was only 23 years old, still in Germany [1] [2]. After study, he found that if the image is divided into a single image point, it is very likely to transmit images of people or scenes to the distance. Soon, a instrument called \"TV Telescope\" was here. This is a photoelectric machine scanned disk, which looks a stupid brain, but it is extremely created. On November 6, 1884, Nipkov declared his inventions to the Royal Patent Office of Berlin. Write in the first page of his patent application: \"The instrument described here can make an object in A.\" One year later, the patent was approved. The Nikocus tray in this patent is also considered to be the world's first TV image grating. However, Nipkov himself never made a model to prove his design. Until 1907, the progress of the imperial tube technology proved that his feasibility of this system [3].\n\nIn 1897, German physicist Carl Braun invented a cathode ray tube with a fluorescent screen. When the electron beam hits, it is displayed on the screen. At that time, Braun's assistant had proposed a display of the image tube to make a TV, stubborn Braun thought it would be impossible.\n\nConstantin Perskyi made the word Television in a paper submitted to the 1900 Paris Expo. The Persi's paper evaluates the status of electromechanical technology at the time and refers to the contribution of Nikkov and others [4].\n\nIn 1906, the two assistants of German physicist Carl Braun made a picture receiver with this cathode ray tube to perform image reproduction. But their devices reproduce a still picture, should be a fax system rather than a television system.\n\nFrom 1907 to 1910, Boris Rosing and his student Vladimir Solin were verified the use of rapid rotating mirror scanning devices and used cathode rays in the receiver. Television system. Pres Luo Xing left people's sight in the \"October Revolution\" in 1917. After Sulic, I went to the US Radius. He established a pure electronic TV system there. However, his system is ultimately considered to infringe the patent of Philo Taylor Farnsworth.\n\nIn 1911, the engineer Alan Archibald Campbell-Swinton delivered a speech in London, and also reported in the era magazine, which describes how to use a cathode ray tube at the same time in the transmitting end and the receiving end. At the end of the 1920s, when mechanical TV was also commonly used, inventive, Fairo Farnsworth and Vladimir Zuli, were also in studying the work of the full electronic transmission tube, respectively.\n\nRussian American scientist Flagimir Solin opened up an era of electronic TV. He began researching electronic photography technology as early as 1912. In 1919, Zwarley is immigrated in the United States, after working in Westtenhausen Electric Company [5].\n\nIn 1923, a friend of John Logjie Beld, inventor, was told him: \"Since Marcni can launch and receive radio waves long, then the emission image should be possible.\" This made him highly inspirated . Beld is determined to complete the image with electronic signal. He has sold only some of the property and collects a lot of information, puts all the time on the developing TV, and completed the design of the TV. Beld successfully displays the video on the screen [6].\n\nRussian American scientists Flagimil Solin also produce and display images at experimental cathode rays. During the work of Western House Electric Company in 1923, he developed an electronic camera tube. However, during the display of 1925, the image is unclear, the contrast is very low, the resolution is poor, and the image is stationary [7]. This image tube has not passed the experimental stage, but RCA (acquired Xidao Electric Company Patent) believes that the patent conditions of the Fina Swar 1927 image decomposer are too broad, which will exctrue other forms of electronic imaging techniques. Therefore, RCA, after acquiring the patented application of Squorin in 1923, the patent pending litigation was proposed to Falnesworth. The prosecutor of the US Patent Office vetoed the 1935 resolution to formulate the inventions of Fina Sworth priority to Solojin [8]. In October 1939, RCA lostd from court appeals, but they still hoped to produce commercial TV equipment, and RCA agreed to pay $ 1 million in Farnsworth (in 2006 equivalent to 1 thousand 3008 Wan Dollars) In the next 10 years, the use of Farnsworth patents need to pay additional licensing fees. In 1929, Zwurkin introduced a improved model and the results were still not ideal. US ARC finally invests $ 50 million, 1931 Zwalley finally created a camera image tube. In the same year, a complete field test of a complete photoelectric image tube system was carried out. In this experiment, an image consisting of 240 scan lines is transmitted to a TV outside 4 miles (using the mirror to reflect the image of the 9-inch image tube to the TV), and successfully makes TV photography and image formation [9].\n\nThe first semi-mechanical analog television system was seen by the Scottish John Logji Beld in the London in the London. It is called a sign of TV birth. He is called Do \"the father of TV\". Later, his system was adopted by the BBC. After 1937, the BBC terminated the use of this technology. Because the electronic TV system is more popular at that time [10].\n\nDecisive Solutions - The basic principle of TVs is based on the continuous release of electronic flow accumulation and secondary electron storage in the entire scan cycle - the first time I found this technology in 1928, in 1928. 11].\n\nOn December 7, 1927, Philo Farnsworth was transferred to the first use of image dissector photography tube in his laboratory in His Francisco Green Street. Image: A simple line. In 1928, Farnsworth developed a complete system to demonstrate the media and transmitted an animated film by TV. In 1929, this system was further optimized, removing the electric generator, and now his TV system does not have any moving parts. In the same year, Farnsworth used his TV system to transmit the first live Human image: a 3.5-inch his wife PEM closed a dynamic image (perhaps the light is too bright).\n\nIn 1928, the 5th German Broadcasting Expo was opened in Berlin. The TV in the exhibition is the first time as an open product. The distance and scope of the wired mechanical TV communication signal is very limited, the image is quite rough, and the fine picture cannot be displayed. Because only one-third of the light can be improved by the ideal light through the Niphole, it is necessary to increase the hole, but the picture will be very rough. To improve the resolution of the image, you must increase the number of holes, but the hole is small, and the light that can be reduced will be reduced, and the image will be blurred. This defect in mechanical television leads to the elimination of this technique [12].\n\nIn 1929, BBC allowed Beld to carry out public TV broadcasting business. After the 1930s, Beld turned to the research of color TV. After continuous improvement of equipment improvement technology, the TV effect developed by Beld is getting better and better, causing great sensation. Later, \"Beld TV Development Company\" was established. With the continuous improvement of technology and equipment, the transmission distance of Beldow TV has a large improvement.\n\n1933 Russian American scientist Flagimir Sulid also developed a camera tube and image tube that successfully served for TV image. Complete the process of complete electronic development of the TV screening and imaging, the modern television system is basically formed. Today, the imaging principles and instruments received by TV cameograms and television are based on his invention improvements.\n\nOn August 25, 1934, Franklin, Franklin, Franklin, Philadelphia, Pennsylvania, to demonstrate a complete full electronic TV system [13] in Philadelphia in Philadelphia, Pennsylvania. Other inventors have just shown some of the similar systems, or demonstrate electronic systems using still images or moving videos. But Fina Sworth is the first system that integrates electronic scanning TV cameras and electronic scanning TV receivers, providing live, dynamic, and black and white images. Unfortunately, his camera needs a strong light, so his work is forced to interrupt.\n\nIn the UK, ISAAC Shoenberg developed Marconi-EMI's own electronic camera tube, which forms a camera manufactured by BBC. Core components. Using this camera tube, on November 2, 1936, a 405-line service was set in the photohed of the Alexandra Palace, which is broadcast by a mast antenna installed on top of the Victorian building. It temporarily broadcasts the Beld mechanical television system of the next door, but it is more reliable and has the best resolution. The mast shaped antenna is always used. This program that is fully played with electronic TV systems has left a deep impression. The report of the Olympic Games held in Berlin in the same year, a total of three cameras [14] were used. Solijin's all-e-camera, but this machine is large, its 1.6-meter focus lens weighs 45 kg, 2.2 meters long, is called to TV cannon. The video signal of these four cameras is transferred to the Imperial Post Center through the cable. After mixing, the image signal is mixed there, and it is emitted through the TV tower. During the Berlin Olympics, the live broadcast of 8 hours a day, with more than 160,000 people watched the Olympic Games through TV [15].\n\nIn 1939, approximately 20,000 families in the UK have a TV, and the US radio company's TV also expands in the New York Expo and starting the first fixed TV program. The eruption of World War II made the development of the developed TV have been suspended for 10 years. After the war, the TV industry was booming, and the TV was also quickly popular. In 1946, the BBC resumed fixed-television show, and the US government also lifted banned ban on the manufacture of new televisions; the TV industry quickly developed. In the United States, from 1949 to 1951, not only the TV programs have been widely broadcast nationwide, but the number of TVs has raised from 1 million to more than 1 million units, many TV stations have been established. Humorous, light songs, cartoon, entertainment programs and Hollywood movies often broadcast in TV [16].\n\nGerman scientists Carolus also made achievements in television development. In 1942, the Carolus Group (including two scientists, a mechanic and a woodwork) made a device. This device uses two Nikockefark disks of two diameters as transmitting and receiving signals. There are 48 1.5 mm small holes on each disc, which can scan 48 lines, with a synchronous motor The two discs are connected, rotate in the 10th screen synchronously per second, and the image is projected onto another receiver. They call this machine as a big TV. The effect of this big TV is much clearer than Beld's TV. However, there has never been publicly displayed, so their inventions are known for people [17].\n\nIn 1956, Kingsberg and Andon designed MODOLL VRLLO recorders have made TV technology a big step. Two ways are generally adopted because of the initial production of television programs. One is to shoot the program with a television film, rinse, and then broadcast by electronic scan. One of the biggest defects used in this way is the live broadcast of the TV program. The other is to spread the signal directly from the camera. This satisfies the needs of those who wish to see the scenes, but it can't play. The appearance of the video change has changed this situation [18].\n\nIn 1972, Sony, Japan launched a 3/4 inches of cassette tape fundamentally changed the production method of TV programs. It is the first cassette tape used in the world's first professional color video screening system [19].\n\nNow, TV is working on a revolution.\n\nIn 1934, Sun Mingjing has developed China's first video, transmission, accepting and playing television principle sample machine in China, as Yang Jianjing's assistant. Yang Ji started \"TV\" to determine the corresponding name of Television in Chinese.\n\nIn 1939, Sun Mingjing officially launched \"TV\" as the 13th Department of Movie Projects in Jinling University, \"TV\" officially became a Chinese university course.\n\nTV program production is the process of forming the sound, image material and related text data and the process of content on the content to finally form a television program.\n\nType Type Classification:\n\nClassification by restore:\n\nCategory by viewing:\n\nCategory by imaging:\n\nPress the aspect ratio of the display screen:\n\n\"Note: There is still a less science The way is divided into large screens, small screens, and micro. The equipment in the micro-micro-high resolution LCD is included in the helmet display, and also includes a DLP display chip in a huge DLP projection wall. \"  It is well known that the improvement of television technology and the production of television programs are needed. Therefore, the development of the development of the TV industry in a country and region is generally proportional to the economic level of the country or region. At present, the earliest national country is the United States, and the last country that introduces TV is located in Borsa in Africa.  Mexican Commercial TV Station Tel Avisa has achieved greater progress in China. In addition to establishing an office, sales show, Format trading with Hunan Satellite TV, jointly producing \"ugly female invincible\" drama, the first quarter attacked the top of the top China TV top. "}