{"chinese_title": "government ", "chinese": "The government is a system of political systems that entered into, implement legal and management in a region. The broad government includes legislature, administrative organ, judicial organ, military agency, narrow government only referred to as an administrative organ; the term \"government\" is also used to refer to the core representative of the highest administrative agency, namely \"cabinet\" .\n\nThe government is also a pattern of power distribution. Not only is the relationship between judicial power, legislative power and executive power, but also the relationship between the central government and local governments, and even the power distribution between government departments and civil servants.\n\nThe government is an important part of the overall state, and the government is affiliated to the country. Therefore, the replacement of the ruling government's stagnation or regime does not mean the death of the country, and if the country is extinct, the government will not exist. Citizens' legitimacy of the country has a degree of identity than the identity of the government.\n\nThe government is also an organization that distinguishes between general social organizations, and government power must have legitimacy and have mandatory and authority. The power is only responsible for the source of power, and the government is no exception. If the government's source of power is just a national or citizen, the Government is responsible for the national citizens and serves public interest.\n\nThe government exercises law enforcement rights in accordance with the law, if the scope of the law given by the law is \"abuse of power\"; if it is not completely exercised, it is \"not\". Both are the incorrect of the government.\n\nThe state has its own government. The government is the main body of tax, which can achieve reasonable use of welfare. The government's service object is different from its national system. In democratic countries, the object of government services is the people, and the government is appointed by the people, agency that manages the country; in autocratic countries, the object of government services is a ruling class, assisting the ruling class to maintain rule.\n\nIn the administration system, the narrow government is only the representative of administrative power, and the legal constraints enrolled by the legislature are subject to the judgment of the judicial organ. Some governments have been authorized by the rights authority to conduct administrative actions, and their power organs are usually generated by elections or nominal elections. They own legislative power, judicial interpretation rights (or legislative interpretation rights), and the government's audit trust rights, etc. A major influence or dry matter, performing rights interference, such as interferometric judicial departments, interference administrative department governance, etc., itself uses elections to reflect public opinion and realize democracy.\n\nIn the autocratic countries, the government uses different ways to maintain rule, including the police and the army (see the police countries), sign an agreement with other countries to win the internal support. Typical winning methods include providing judicial systems, management agencies and social welfare, and states that the state is supported by God, providing interests in most groups, holding elections in important departments in China, restricting national power and using nation through legal and constitution . Groups against government control include free shipists and anarchist.\n\nThe principle of modern governments is mainly the principles of the people's sovereignty and the principle of Acting system. The government system consists of state heads, administrative agencies, legislative bodies and judicial institutions. The forces between them determine a government tissue type. Main there [1]: 167-172:\n\nIn order to facilitate governance, the central government consists of different government agencies. This includes governments at all levels between government departments and administrative regions based on geographic regions. The power relationship between the central government and local governments can be divided into [2]:\n\nA government of developed countries usually includes institutions such as office, provincial (provincial), bureaus, department, department (class), etc. The person in charge is called \"Minister\" or \"Secretary\". Ministers or ministers in theory are the consultants of the head of state, but in practice, there will be some implementation in a particular field. In many modern democracy, although the state's heads have great power to designate the government, the legislature produced by the elections also has the right to disband the government.\n\nThe ancient Greek philosopher Plato proposed the five polies of Plato (English: Plato's Five Regimes), divided into [3]:\n\nThere are other categories below.\n\nAs the largest public organization in society, the government is not only responsible for value-oriented, safe defend, and maintain order, but also shoulders political rule, economic management, and socially coordinated society. The government has public properties, and the government's function is to serve the public and the interests of the public. At the same time, the government also has a certain class, which is often a specific class service to become the class management of other classes. The government has valuable guidance responsibility, such as the pursuit of \"the highest and broadest\" of Aristotle. \"[4] The government function also covers the full range of social public life, and as the society changes continuously development of. The Government also provides convenient, creative conditions for public welfare, and even improving the public's living standards by directly providing public goods. From the perspective of procedures, the government's functions include decisions, plans, organization, command, coordination, control, etc. Decision is the core function of the government, and the high and low decision-making will reflect the capacity and level of the government [1]: 197-199.\n\nFrom the perspective of task, the government's functions can be divided into political functions, economic functions and social functions. Among them, political functions are the most important functions of the government, which is mainly reflected in maintaining existing political order. The government's primary task is to maintain the normal operation of society, followed by designing policies that are conducive to national and social development, promoting social progress. In order to ensure the smooth role of government functions, military, police, prisons, etc. violently defend national sovereignty, maintenance of government rule, and fight crime. The government also needs to establish and maintain structural systems from the central government to local governments, and protect the rights of staff [1]: 199-204.\n\nIn terms of economic development, the government has adjusted economic development through fiscal and monetary policy, ensuring the stable growth of macroeconomics. During the downturn, through the reduction of tax, adjustment tax rate, increase spending, to promote investment and production; when the economy is overheating, reducing government expenditures, reducing money supply, improving interest rate, suppression demand, and reducing prices. At the same time, the government has redistributed social wealth through taxation and government expenditures to ensure social equity and stability. In order to control monopoly and external uneconomic behavior, the government guarantees fair competition between enterprises by improving resource allocation. The government also needs to provide full policies and funding support, actively create conditions, promote the optimization and transformation of economic structure, and encourage the growth of emerging industries. The government also provides public services such as national defense safety, public works, and social welfare [1]: 199-204.\n\nAs a social public organization, the government has the responsibility of maintaining social security and order, reducing various social issues. Affairs involving social public interests, such as traffic, health, education, culture, environmental protection, etc., are often responsible for the government [1]: 204-205.\n\nIn order to maintain its equality and open features, the market promotes competition, there is instinct rejection against the government's interference; on the other hand, the market needs to stop in order to maintain order. In particular, when the market failed, the government's intervention is required. The government's intervention in the market includes public welfare services, developing public utilities, addressing external problems (such as environmental pollution); controlling the emergence of monopoly, the maintenance of market stability and opportunity; solve information asymmetric issues.\n\nThe government may also lead to the occurrence of the government's failure due to the low efficiency of policies and work. In real, there is more or less intervention in reality, how is the key to control the government's failure within minimum.\n\nThe model of government intervention markets can be divided into non-governmental society, minimal national (guarding nights), mixed political economy, welfare, all-rounder countries [1]: 216-219.\n\nThere is no government intervention in anarchic society, completely relying entirely on market rules, but actual inactivated states often behave in confusion, and cannot establish effective market rules. In the national model of the night, the government basically does not interfere with the economy in addition to national security and maintenance order. Hybrid political and economic countries advocate the implementation of national moderate intervention on the basis of the free market economy, most of the modern countries belong to this type. Welfare countries provide a detailed welfare policy for citizens, and the government has strong control over the economy. Almighty countries do not advocate market economy, the Government not only has a large amount of economic resources, but also controls its configuration, and the economy is completely attached to politics [1]: 216-219. "}