{"chinese_title": "Religious history ", "chinese": "Religion History (English: History of Religion) refers to a text record of human religious experience and ideas. The historical period of religion is approximately 5,200 years ago (3,200 BC) starts with the inventions of the text. The prehistoric religion involves the study of religious beliefs before writing.\n\nToday, the word \"religion\" (English: Religion) in the Western sense, there is no obvious pre-colonial vocabulary in the non-European language outside the West. Daniel Dubson (French: Daniel Dubuisson) wrote: [1] \"Western and Religious History later in\" religion \"concept is very unique, it may only be suitable for yourself and your own History. \"Other cultures have the history of interaction in religious category, which is the interaction between the concepts of Europe's only developed in Europe [2].\n\nThe earliest evidence of religious thinking dates back to the mid-term and late in the old stone age. Archaeologists mentioned that the burial behavior of early wise people was the evidence of religious concepts as early as 300,000 years ago. Other evidence includes symbolic cultural relics from the mid-African old stone era. However, there is still controversial for the interpretation of the end of the old stone era.\n\nMore than the nearby archaeological evidence is less disputed, some cultural relics in the old stone era (50,000 - 13,000 BC) are usually considered by scientists to represent religious concepts. Examples of the late-state and religious beliefs include prehistoric lion people, Venorf Venus, Shawvan Cave, and Cardiy Ceremony in the Somir region.\n\nThe ancient Egyptian pyramid (English: Pyramid Texts) is one of the oldest religious classics in the world, approximately 2400-2300 BC [3] [4]. The text has played an important role in maintaining organized religions, and religious concepts are regulated regardless of time or locations.\n\nGerman philosopher Carl Yaspez is called the \"axial era\" from 900 years to the first 200 years before the history of human history. For this historical era, Yaspez said: \"The spirit of human spirit is simultaneously and independently ... and these remain the foundation of today's human beings.\" Peter Watson will summarize this period as Many of the most influential philosophical traditions of human beings, including Persian and Canaan's aid, Greece Plato, India's Jain and Buddhism, and Chinese Confucian and Taoism.\n\nThe historical roots of Indian Jain teaches to be traced back to the 9th century BC, with the rise of the Bar wettop, the rise of the English: Parshvanatha, and his non-violent philosophy [5] [6].\n\nThe main religion of contemporary world began in Eurasia, including: the Christianity of the Western world; Buddhism to East Asia's decline and the decline of the Indian sub-continent; and Islam throughout the Middle East, Central Asia, India, North Africa and some European spread.\n\nThe conflicts between multiple different religions occurred throughout the Middle Ages. Islamic conquered Persian, Muslims conflict with Zhurus. Arabian - Byzantine War, Cross Army, Follow the Land, Byzantine - Osman War, Christians and Muslims Conflicts; Shaman During the Mongolian battle, with Buddhists, Taoists, Muslims and Christians have conflicts; Muslim conquer India During the conflict with Hindis and Sikh.\n\nMany medieval religious movements emphasize mysterious, such as Christian Carterry and related sports, Spain's Jewish Mystery (Kabara), Hindu, Essence (English: Bhakti Movement) and Islam Sophie. A God has formed a clear form in Christ Christ Christ and Islam. The non-secondnate of Hindu also reached classical forms under the teachings of Adi Ji Luo.\n\nThe invention of the 15th century printed, played an important role in the rapid communication of religious reforms such as Martin Luther and John Galvin. The conflict of new education and the old teaching has evolved into a 30-year war in Europe in 1618 to 1648. From the 15th to the 19th century, due to the geographical discovery of Europeans, colonialism and new and old-tech conflict, Christianity spread to Saharan Africa, America, Far East and Australia. After the 18th century, especially after the French Revolution, Europe gradually became secular. From the end of the 20th century, the religious beliefs in most parts of Europe declined.\n\nIn the 20th century, communism in Eastern Europe and China's regime is anti-religion. There is also a wave of emerging religious movements in the 20th century, integrating many different religious elements. However, in 2000, the population of global tribute is limited (<2%). Classical world religion believers account for more than 75% of the world's population, while indigenous tribal religions fell to 4%. As of 2005, 14% of the world's population is estimated to have no religion. "}