{"chinese_title": "physical education ", "chinese": "Sports or sports competitions are social activities for enhanced physical exercise, technology, training, competitive competition, etc., including social activities for cultural life, including all forms of competitive physical activity (English: Physical Activity) or games. The sports competition originated from ancient Greece.\n\nSports are the general name of entertainment of entertainment for participants in all organized or organic participants, through use, maintenance or improvement. [1] [2] There are hundreds of sports in the world, with a plurality of forms, and some need two people can be completed, and some need multiple teams to complete.\n\nSports are often considered all activities based on physical fitness or physical coordination capabilities. Large-scale sports events such as Olympic Games are only allowed to meet this defined sports into, [3] other organizations such as European Parliament also will not Activities in physical exercise elements exclude in the concept of sports. [2] However, there are some competitive features, but the activities lack of physical movements are also considered to be motion, such as mental movement. The International Olympic Committee will identify chess, Go, electricity and bridge as \"real\" sports, the international single Sports Federation will always determine 5 unhealthful sports, [4] [ 5] However, the brain motion that is identified as a sports is still not much. [1]\n\nSports often have a range of rules or traditions to ensure fair competition to ensure consistency for victory ruling. Determining whether the win or not may be a physical event, such as a hit score or first across the finish line, or a referee score the determined result according to the performance or subjective indicator.\n\nIn organized sports, there is usually a record of excellent performance, some popular projects, such information may be widely reported in sports news. At the same time, sports is also an entertainment for non-participants. Ornamental sports will often attract many viewers to visit the venue, and touch the broader audience through broadcast.\n\nWith the expansion of international exchanges, the scale and level of sports cause development is an important indicator of a country, social development, and has also become an important means of foreign diplomacy and cultural exchanges. The level of sports development in a country is measured by the following aspects: the level of physical fitness levels and sports in sports, the scientific theory level of sports and sports facilities, sports technology levels and the best exercise results.\n\nSports can be divided into large-scale sports, professional sports, school sports, sports competitions. Including sports culture, physical education, sports activities, sports competition, sports facilities, sports organizations, and sports science.\n\nIt is not uniform for how to distinguish between sports and leisure activities. The International Sports Association believes that a sports should meet the following conditions: [1]\n\nAccording to historical evidence, such as cultural relics and construction shows that China has begun to perform sports around 2000 BC. [6] Gymnastics is a very popular project in ancient China. It can be seen for the monument to the Lao to build, including swimming, fishing and other sports have developed and established sports rules in the ancient Egypt of thousands of years ago. [7] Other sports projects carried out in Egypt also include throw guns, jump and wrestling. The ancient Persian sports include traditional Iranian martial arts project hero sports, it is closely related to fighting skills. [8] Sports projects originated from ancient Persian also include malls and rushing to comparison.\n\nA large number of sports projects and competitive competitions have been produced in the ancient Greek period, and the development of military culture and sports in ancient Greek. Sports for ancient Greeks have a deep outstanding performance that they founded the Olympic Games, held a small village called Olympia in Bernonia every four years. [9] Spanish philosopher Fernando Savater believes that the sports competition is the direct product of democratic political construction; the first is that when the class legalization form of bloodline, God and wealth is invalid, it is necessary to find a social distinction from other sources; second It is only equal to compete with each other [10].\n\nSports have developed in the period of ancient Olympic Games, and its organizational and related rules have been strengthened. Industrialization has made more leisure time in developed and developing countries, which allows them to participate and watch governs, and the number of sports has increased, and spread more common. This trend is more pronounced with the strengthening of mass media and global linkages. Sports specialization becomes mainstream, sports more popular, sports fans chase professional athletes through radio, TV, and Internet, and they also participate in amateur sports, and they will work out and entertain.\n\nThe spirit of sports is a kind of pursuit of fair competition, and is a good gift for teammates and opponents, obeying morality, and sincere, regardless of winning, always keeps decent attitude. [11] [12] [13] For this, modern Olympic's father Pisel De Gu Becou Due has said: \"The most important thing is not losing, but participating, this is a classic for the spirit of sports. Statement.\n\nThe core principles of sports include that the results of sports should not be decided in advance, and both parties should win by the same opportunity. In order to ensure fair competition, people have developed the rules of competition, but participants can get the advantage by breaking the rules.\n\nParticipants may make their own desires by cheating, or some more hidden motives. For example, people participate in gambling for the results of the game, leading to a strong motor motivation, the entrant may deliberately put water in the game to ensure the expected result. For example, if the rule of the group is hoped to get a better group by putting water, such as at the 2012 Summer Olympic Games, China Badminton Team has given the ball for the gold and silver, and finally involved players have been ruled against physical education and being elapsed. Olympic Games. [14]\n\nThe competitive nature of sports makes some participants trying to improve their competitive performance by using drugs or other methods (such as increasing blood volumes in the body).\n\nAll sports projects recognized by the International Olympic Committee or International Sports Association should detect whether the athletes are banned, and they are found to have a positive athletes may be banned and recovered. Honors.\n\nAge, deception, etc., not only affect the fairness of the game, but also make the country and the victim of the country.\n\nViolence in sports often swims between fair competition and intentional aggressive violence. Athletes, coaches, and sports enthusiasts may have violence against people or property. In some national and international events, the phenomenon of riots is very common, and the organizer is plagued. Like football, American football, ice hockey, football, kangar, boxing, horn, water ball, and integrated fighting, etc. are easily violent.\n\nAt the same time, if the audience is like racial discrimination, discrimination, LGBT groups, chaos, fans riot, malicious injuries, etc., or the team itself has a violation of fair competition, the result may lead to the team's warning, fine, There is no audience competition, deduction points, severe downgrades, and even the name is possible.\n\nIf you do it, there are other improper behaviors, such as home storms, crimes, and the same point of punishment.\n\nFor example, the football member Suarez is a typical example. During the 2010 to 2014 World Cup, make a race discrimination black player, biting in 3 games, let him have not taken a red card, a total of 48 games, at the same time Pay more than $ 200,000, and a negative image of the public.\n\nAt the same time, it is possible to make a specific race and religious person to make a particular race, and a big trouble for the sports world. I don't know how to deal with it is the best (punishment is too light and relevant people to protest; if it will cause the parties Supporters protested to punish, considered to be free of behavior, and even resisted).\n\nThe exercise can be amateur, occupational or semi-professional, whether the participant is saved or salary due to participation exercise.\n\nSince viewing sports can be used as an entertainment that is for the non-participants, the exercise becomes a industry, and the high-pay culture of the professional movement is produced. Excellent athletes pay more than average salary bonus, up to millions of dollars [15 ].\n\nSome sports or individual competitions will only allow amateur athletes to participate. The Olympic Games starts only allows amateur athletes to participate, because if there is a professional athlete to participate, it is unfair to those athletes who think of interested only [16]. After the 1988 Olympic Games, the International Olympic Committee decided to participate in the Olympic Games, only the horn and boxing were still subject to amateur rules due to the rules of amateur and occupations.\n\nGrassroots refers to the exercise of the amateur participating, in line with the idea of ​​\"People's Sports\", does not have a better exercise achievement, and the main purpose of participating in sports is entertainment [2] [17].\n\nTechnology is an important role in modern sports, and some of the exercises (such as racing), which can improve exercise in other sports.\n\nSports science is a comprehensive discipline for scientific analysis of human sports activities, which can be used in areas related to athletes, such as movable micromid-tuning movies, or some equipment, such as swimsuits and sneakers, etc.\n\nSports Engineering (English: Sports Engineering) is a discipline in 1988, not only focusing on the design of the equipment, but also focuses on the application of technology in sports.\n\nIn order not to let technology affect the spirit of fair competition in sports activities, sports authorities often set special provisions to control individual athletes due to unfairness.\n\nPolitical and sports often affect each other.\n\nIn 1936, the Summer Olympic Games held in Berlin may be the best example, and instructions can be publicized with sports activities to promote a particular ideology. The 1936 Summer Olympics is a typical example of political and sports symbiosis, with high propaganda Nazi Germany. At that time, Germany had already prepared for war, but using the Olympic Games to create a peaceful impression to the world, so the Olympic Games become a technique that hides an extremely military purpose. The lack of human rights is the shadow of the Olympics. At that time, the Nazi Germany was arrested in February 1933, and the first Jews massacre appeared in April 1933, in 1936. On July 12th, Saxony Gaosen concentration camp began to use, where the location is near the Olympics. A total of 22,000 people were arrested during the Olympic Games [18].\n\nMany athletes (especially rugby players) think they should not participate in South Africa during the period of apartheid policies. Some athletes believe that this is a positive contribution to the Final abolition of South Africa's apartheid policies, and some people think this has strengthened the bad influence of racial isolation [19].\n\nIn the Summer 1980, the Olympic Games held in the Soviet Union, because the Soviet Union invaded Afghanistan, the United States and other countries launched a boycott of the Moscow Olympic Games, making events that only 80 countries participated in [20]. The four years later held in the United States, the Soviet Union and Eastern European Group and North Korea, Vietnam, and Lauga and other countries have boycotted four years later in the Summer Olympics in Los Angeles 1984 [21].\n\nIf there is a serious case of sports event violations, its violations, such as using banned drugs, negative competitions (fake balls), post-reported age, gender discrimination, sexual tendency discrimination, athletes collectively do not gently behavior (racial discrimination, inciting hatred, unpacking The competition unit and other entrants) and the competition unit advised invalid, ... and other violations, it can be recommended that the International Single Sports General will even decide directly to the international single-sports, and the track and field of Russia. Bulgaria's weightlifting is due to the banned incident, the Rio Olympics in 2016, while facing a fine, the plot is serious or even the intersection, and even single sports will always consider the expense of the membership. "}