{"chinese_title": "crime ", "chinese": "Object · Behavior (not active)\nHazard results · Causal relationship · Criminal subject\nSubjective elements (deliberate, negligence)\nNot attempted · 遂 · 中 · · Preparation\n\nResist illegal\nJust as defense · emergency avoidance\n\nLoss of heart gods · Spiritual Weak\nReason free behavior, responsibility ability\nLooking forward to possibility, crime consciousness\n\nDirectly, indirectly\nCommunistism is committed to seek common commitments\nInstitute of confused, help\n\nImagine competition · Purified commitment · continuous\nNumber of crimes and a penalty\n\nDeath penalty, life imprisonment\n Introspection, penalty, penalty\n Criminal detention\n 褫 公 权 · 夺 政 政 权利\n Senior sentence, declaration\n Self-commutation, prison\n\nCrime refers to the behavior of taking the legal norms. In the general sense, the term \"crime\" can also refer to violation of other similar individuals (others) or serious violation of social morality, but universally not becoming social tolerated. The people who have been established by the crime are sinners or prome of criminals. The discipline of studying crimes is called criminalization.\n\nIn countries with the United Kingdom law as the rule of law, such as the British, the United States and Canada, called \"threat, harmful or other ways to endanger personal property, health, safety and moral welfare behavior.\"\n\nIn countries with the European law as the rule of law, such as Switzerland, the Republic of China and the People's Republic of China, called criminals, prisoners, criminals, criminal suspects, suspects, suspects, suspected, criminal actors, criminals, and behavior and many more.\n\nAccording to the Criminal Law of the People's Republic of China, the crime has no simple and widely acceptable definition [1], but it is defined under the law or for a specific factor.\n\nThe most common definition is that the crime is defined by the law (if the law is considered to be a crime, it is a crime). Another definition is that crime is a behavior that is harmful to other individuals, the group is also harmful to the group, and the law will set up this thing, and there will be a penalty [2] [3].\n\nThe French sociologist Tulkan pointed out that the crime has existed in all society, and all society has a criminal. Crime is like murder, rape, drug trafficking and theft, fraud, etc., is prohibited from all over the world [4]. However, the definition of crime is defined by criminal laws in countries.\n\nCrime can be defined as a behavior that harms others, society or countries, and the law is to protect the legal rights of the people. Any violation of the law, destroying the rights and interests guaranteed by others is a criminal act.\n\nCountries have different concepts on crimes, and some behavior (such as adulsive) is a crime in a country, but it may not be a crime in his country.\n\nArticle 13 of the Criminal Law of the People's Republic of China on the definition of crime is: \"All the polls of national sovereignty, territorial integrity and safety, splitting countries, subvert the people's democratic dictatorship, and overthrow socialist systems, destroy social order and economic order, violation state Property or labor masses collect all property, violations of all property rights of citizens, violations of civil rights, democratic rights and other rights, and other harmful society, in accordance with the law, it is crime, but the plot is remarkable It is not considered to be a crime. \"\n\nLegal rights is that most people believe that the interests should be protected, not limited to rights or property, such as privacy and credit is one of legal rights. It is a crime if it is prosecuted, and it is a crime if it is prosecuted, and it is crime.\n\nKill, hurt others or theft, etc., in most countries is a crime behavior, called natural crime, that is, this behavior is fundamentally being negatively evaluated; but according to the legal principle of criminal pencil, if there is no clear text, even if it is Natural crimes must not be punished. It is known as a criminal act as a criminal act, referred to as a criminal act, referred to as a crime;\n\nAlthough some behaviors have passed sinful, as long as they are in society, they still have a negative evaluation act, and will still become an object of criminal research. That is, the criminal scope recognized by the criminal is not the only standard for criminal behavior settled by law, and sometimes the act of sinfulness will still be explored the study.\n\nLegally, the crime will be divided into the \"infringing of national law\", \"infringing social law\" and \"infringing personal law\" and \"infringing personal law\" and \"infringing personal law\" and \"violations of personal law\" and \"infringing personal law\". Faising, \"Freedom of Freedom\", \"Infringing Property Conduction\", etc. In terms of criminal research, crime is usually distinctive, such as violent crimes, white-collar crimes, and adolescents.\n\nContinental criminal law generally speaking crimes into deliberate crime and miscontinement crime, natural persons and legal crimes, but this is just a classification of legislation. Theoretical criminal law is often divided into natural committees and legal commitments, identity and non-identity, behavioral commitments, and fruits and dangerous criminals.\n\nJudging whether the mainstream standard for a criminal act is the third paragraph of criminal law. This process of applying three paragraphs refers to the princess of conviction, except for the court, other organs and individuals do not have the right to declare others as a guilty.\n\nIn most countries, when the law enforcement agency searches suspicion, it usually deduct it in the detention center or the detention room unless there is no bail system, it will sometimes be permitted. Then, the court decided whether the defendant made crimes, this process is called criminal proceedings.\n\nIf the court declares that the defendant is guilty, the defendant is usually declared by a certain penalty, such as a fine, free punishment (such as crimping, in prison or life imprisonment) or death penalty. In some countries that retain meat, it is also possible to be punished. For mild plots, it may be probation; for different situations, it is also possible to apply non-punishment security punishment. "}