{"chinese_title": "family ", "chinese": "Family is a common living unit formed by marriage, blood, adoption or cohabitation. [1] [A 1] Family relationships consisting of marriage, with children who have no blood relationships, with children with blood, produce blood, and proposed blood. [C 1]\n\nThe word family can further extend to the ancestors, such as those listed in the family; and the horizontal also covers the relatives and relatives of the relationship between the marriage; of course, there are people who have no relatives, such as living in one Other people in the house consist of.\n\nBecause of a common life, a family will be confused with a household, and a household consisting of households and hosts in the house will be statistically. Due to blood, the family will be confused with the family, but a family can be divided into several families. Family is often confused with marriage, and marriage includes both relationship establishment and termination, also including mutual obligations and commitments, and families contain economic social dependencies in members. [B 1] It is also worth noting that \"Comrade Family\" is not different from the \"heterogeneous family\", and many studies have confirmed that there is no significant difference in the growth of the heterogeneity or comrades. . [2]\n\nThe core family is usually doubtful, plus their children, live in a private or separate house. Expanded to the grandparents who contain together, relatives, and even married children and their partners and descendants, the so-called big family. [B 1] Composition family, not only relying on the name of marriage, do not want to get married, and another civil combination option. France's PACS, Germany's same-sex partner, Canada's CommON law, is the starting point for changes to their families and marriage. [3]\n\nAlthough family structures in different societies may vary, all human society have some form of families, that is, the family is one of the universal culture of universal culture; the US anthropologist Murdoch (George P. Murdock pointed out in 1949 that the core family exists in all human society, the core family is not the only major family form in a society, or it is the basic unit in the larger family, in all human society, The core families are a group that has a strong effect. [4] [5]\n\nFamily has a variety of valuable features for members, the most important thing is that it provides family members with emotional and psychological security, [6] [7], especially because of their lives and their partners Safety brought by the relationship between children. [8] In addition, families provide economic functions for their members, as well as families and stability of society, regardless of the race, gender, and religious beliefs of family members. [9]\n\nThe world's top medical period \"New England Journal of Medicine\", \"New England Medical Journal\" (NEJM) tracking up to 32 years of \"long-term research in the United States National Girls\", indicating that \"female comrades are raised to adult proceedings, their mentality There is no difference between health status and general young adults. \"Showing multi-family members have no negative effects on society and future generations.\n\nHistorically, in most cultures, families are parental systems or by men, this period is generally a big family. The industrial revolution and the rise of the city have made many changes in the composition of the family. This process leads to the transformation of large home systems. [10] [B 2]\n\nAfter the industrial revolution, new families have been produced, and modern families are different from the past families. The current family is more like a consumer unit instead of producers, family members generally work rather than at home. [10] The public authorities, including the government authorities instead most of the original family, such as care for the elderly, patients, education youth, entertainment, etc. The development of technology makes the couple have a decision to play the power of children and to give birth to a few tires. [B 2]\n\nFamily law in different cultures is different, but its most basic effect is to define the law between family members and the various relationships between families and society. The importance of the family law includes the conditions defined by marriage and change, the position of future generations, the child's inheritance of the property. Multiple aspects of family law lies in social rights and interests, and the personal interests have produced wonderful balance. [B 3]\n\nThe important rules of the future of the marriage are to let the brides will legally transfer to their grooms. In addition to his wife's custody, the husband has almost all things to control his wife. For example, the Women will lose all legal status after the woman is married. The exception is that Muslim women have a lot of control over their own personal property rights. [B 3]\n\nAmong the home systems of many countries, their members have only two generations, which are parents and their minor children. In Japan, based on the 1947 \"Japanese Civil Code\", the relative group affiliated to the same household registration is called a family. The family is completely consistent with the household registration, and the member is not a person who lives together, but it is still a family member. Switzerland, in the \"Swiss Civil Code\", family must make a family in a family life that work together to work together. Parents have the right to develop their own regulations and execute, and have obligations to protect home property, and they also implement home property. [C 2]\n\nConfucian culture has a profound impact on Chinese traditional society. The law is known as \"kiss\", \"respect\", or it is also known as three. Family members are distinguished by respect, legal elders, husbands are respectful, late generations, wife is humble, the same behavior, respect. In social life, the former has an overwhelming power of the latter, that is, the \"father wants to die, the child is not dead\", is to feudal parents. Marriage pursues a wife and a wife, and there are more generations of tangible, more gathering, and form a clan. Such a family is called an expanded family. [11]\n\nTraditional families affected by Confucian culture, especially the three-regular affected, have the following ideas:\n\nAt the end of the Qing Dynasty, the political, economic patterns of the society became the new idea of ​​human equal equality, and China. The feudal parents have become critical objects, and the legal relationship has also changed. After the establishment of the People's Republic of China, the family relationship stipulated in the Marriage Law is as follows.\n\nA large number of human scholars and sociologists are studying \"family\", mostly indicated by parents and their children with relationships with marriage. Most of the above scholars believe that in all society, the organization has a similar fixed function. It is necessary to maintain the presence of society is the main role of any activity. The individual activities of individuals form various roles in one organization, which often surrounds a special function, such as cultivating children. Even each character suggests another role of interest, such as in marriage, two characters of gender have two stakeholders of husband and wife. [A 2]\n\nIn order to distinguish the functions of each role, you should first know the role of the role and role. For example, in each society, both husbands and their wives have different rights and obligations, but they have the same set of functions, which is to meet each other's in terms of quality. [A 2]\n\nGenerally speaking, family has four basic roles: sex, birth children, economics, and educational elders. If there is no sex and fertility, the society must disappear; if the economy is in the economy, life is difficult to continue; or there is no education, cultural customs will be broken. There is also a fifth role, but also a popularity, both the status of society. The actual functionality of this role is that in society, every legal child has the chance of all rights and success in the social structure, and also assumes considerable obligations. It is believed that only families can make individuals to achieve this role in all social interactions. [A 2]\n\nAs people can know, in some society, the family cannot meet all the roles. For example, Mexico's El Nayar can be separated after the man is involved in the legality of the children's legitimacy in the future. After that, women can also maintain sexual relationship with the proper social status, and their husbands have no economic responsibility, and they cannot have special sex rights, and they cannot have any needs for their children. Therefore, in the family relationship of Naar, sex, childbearing children and husband and wife, the economies of the husband and wife are divided. [A 2]\n\nIn addition to this place, in general, husbands and their wives have different role properties to make families produce all their roles. From a historical inspection, after analyzing a large number of social organization samples, the results of their role are basically that the husband's role is representative of the family, his and sexual-independent of other roles belong to the economic and social status. Since the husband is a bridge between family and society, the wife often needs to bear the bond between husband and children. The relationship between husband and wife is not a simple economic cooperation, and there is also a sexual needs. Wife's role is usually engaged in raising and educational offices in the family. She has a broader emotional and emotional dependence than her husband's role. This is the popularization of the roles of both parties. It is existed in a large society. of. [A 2]\n\nJust when people focus on the diversity of families in different types of societies, some sociologists have begun to try to find the function of family popularization. Just like sex, prosperity, economic collaboration, and children's socialization, the conclusions of all humanity, the same, diversified family organizations are also the impact of social structure on family life. Derived. Because the family's production makes the society to continue inheritance, and the family's morphology is different from science and technology, population and regional factors, as well as political, economic and religious factors. [A 3]\n\nWhen the family is in the form of a degree to a certain extent, it should manage the form of marriage according to social practices. Today's world understands that society is strictly forbidden to get married, this ban often occurs with the incest taboos, which prevents the sex between these people. The incest taboos generally refers to the abnormal relationship between father, mother and son, and brother and sister, but also need to determine the special regulations from the family, some taboos do even extend to the side relatives. But for the incest does not have a taboo, it is in part of the ruling class. For example, in ancient Egypt and Peru, in order to maintain the family's property and rule, they encourage the brothers and sisters. [A 4]\n\nIf the taboo who lost incest, a family member will continue its own single blood, to inherit the rights and obligations of the property, the power status, the economic rights and the ceremonial ceremony, so the spouse must also be limited to family members. . The contraindications of nearby parents will make the traditional and value status of the aforementioned families, which makes it changed or even destroyed because of the introduction of different values ​​and standards held by another family. [A 4]\n\nThe restriction on the spouse selection prevents the change between the family separation. The more inheritance of his family's values ​​is more than those of other families from values. One of the important tasks of the family and relative system is to limit the freedom of personal marriage, but in some society, individual marriage in the family does not appear in the previous circumstances. [A 4]\n\nDifferent society, there are many different restrictions on the choice of spouses and the methods of pursuit. These restrictions should be related to property and social status, and the other is also related to social changes and social and economic development. Its parents should have different degrees of restrictions on the pursuit of pursuit, as follows: 1. Child marriage, the choice of their partners is determined by parents; [13] 2. Marriage with parents to determine suitable objects; 3. Let Outside the possible object of the choice of the choice of the selection standard in the parent; 4. Before marriage, it is necessary to strictly monitor via parents, such as Spain's teenage needs to be monitored; 5. Non-mandatory from relatives, parents or friends Restrict; 5. Compliance with personal free choice. [A 4]\n\nThere are many ways in marriage. Single associate or a wife's wife, a person can legally owned and recognized spouses. There are two forms: 1. A husband, a man, allowing a man to have a wife at the same time; 2. A wife is multi-husband, license a woman has more than one husband. According to historical records, the phenomenon of marriage is rarely discovered in society, but it is very popular in the idealized region of the Plato and other philosophers. [A 5]\n\nIn the original agricultural society, marriage is often associated with women's economic roles. Another wife is more likely to happen in a society where women have relatively low in women, and in the society where women's production capacity will have a husband or a wife and a wife. In society where women agriculture is lower, there is only a small demand for women. These customs are mainly dowry, or exchange gifts between the groom and the bride's two families. [A 5]\n\nThe other situation is different, and the groom will be required to serve the service to compensate for the women's family, or the man's family needs to pay some value to exchange the new lady. Compared with other marriage methods, a wife is soaked. This situation will occur in a region where the economy is very economical, and the woman's contribution is not a region. The groups of these places, their brothers, fathers or sons, etc., which is more likely to have a woman married to a woman. [A 5]\n\nCheck the literature of sociology, in which different marriage forms and family organizations have many different speech. These different remarks come from many reasons. For example, after the progress of anthropology, it will naturally introduce more precise classification. Example: Once the mother's society and the parent society, it is based on the family attached to the mother or his father to distinguish the organization. Usually, it is not only a pass in the mother society. It should include the rights of husband and wife in marriage, the inheritance of wealth and the power of the family, etc., is a family of mother. [A 6]\n\nThe following studies have shown that this classification is not correct, in fact, such features often be independent of each other. At the same time, the relationship between the family is abnormal, and the composition of the family and family relationship is also unknown. For example, in some society, although a man is affiliated with father's family system, there are also some rights and obligations of the ceremonies in the mother's ethnic group. [A 6]\n\nAnother difficult point is that different terms are used in the same thing. Such terms are in different concepts of family or family. It is often considered to be the most basic form of core families, including father, mother and child. However, other vocabulary can also be used to describe this type of home. Such as: marriage family, simple family or base family. [A 6]\n\nThe significance of the core family This is to bring the family to the nuclear nucleus, and relatives surround around this nucleus, and the peripheral relatives are more distant. Sometimes the family is expanding because of the individual relationship belonging to two families, but in his own family, his status is a child, but after the child once again, he became a parent in his home. Therefore, a single core Family will have a direct relationship with families with similar members, and the relatives in which indirect relationships are increased. [A 6]\n\nThe family family is a parent-child combination that exists due to parental marriage. It is different from the blood-proof family combined with blood relationship. The relationship between the blood family will have two contexts, which can be done by a grandeur to a certain descendant, or based on the same ancestors to calculate the proximity of the descendants. [14] [15] Because many of the characters can be implemented in the same utility in the family, in order to avoid conflicts, one of them should be specified to play this type of role. So, this part of the designated is a home form in society. [A 6]\n\nThere is no society that is a family or blood family, just in the organization of family life, the role of couples and parent-child relationships. In certain societies, the blood family will be highly organizational and functional, and there is also a clear boundaries between members. [6] But other society, such as the United States, this blood family lacks similar organization, only a little function, the boundaries between members are more vague [16]. [A 6] [17]\n\nBecause of a wife and their children's partners and children of children, they are different from simple families. Mixed home organizations often consist of Divisions and lives in Duofu. Society also usually constitutes a mixed home as long as there is any of the aforementioned any one. [A 6]\n\nThe base home is a home for distinguishing between parent children, and has different (iens) between the huge family groups that have been combined with individual families. Sometimes base families may also be combined with relatives living in one place (such as joint families) because of blood relationships. Or under the rule of parents, uncle and other blood relatives, more basic families will connect to each other (such as expanding the family). [A 6]\n\nBasic families may be integrated because of the elders in the blood family, the heads, leaders and soldiers. These units are important to many societies that are often occupied by the hered system. They develop status, living methods, and political, economic obligations. [A 6]\n\nThere are several ways to determine the pedigree: 1. Male members of the family (Father family); 2. Female members in the family (mother family); 3. Members of men and women (double-line families); 4. One party (single family) by male or female members. [A 7]\n\nDifferent restrictions on the rule of the rule of the hereditary system. The parent or mother family in a complete single system has more personal obligations in the relatives of the mother or father. Someone can participate in the event of the father-in-law family team, and the relatives of the mother can also be very enthusiastic, and vice versa. More extremely, the relatives of the parents have complete rule, in any case, most sociologists only recommend appropriate distinguishing between parents and relatives. [A 7]\n\nThe organization of family relatives in each society is different. Among the basic units of society, the important inheritance groups of political and economic life are an incense group in the family, often consisting of brothers and their respective children. After a few generations, the family organization will expand, so the family is divided into the analysis, the new incense group is formed. In a certain society, the incense group may be the significance of the basic family is subject to a national or more family system. [A 7]\n\nThe family and the clan implementation have made family integration into a larger organization, which is often attached to the leader of the rule and politically. Most of the groups usually composed are more territory than the original family and a broader forces. The family will often limit the choice of marriage objects. For example, Kiowa Apache's family system is characterized by single lineage and loves the family within the family. Excluding the favorite of the same family, is also a marriage of the group, which is rarely limited to the choice on the partner. [18] Cheyenne has fully restricted other marital status, in addition to the two-legged family, and more severely controls the rule of the family or branch to maintain the original social value and standard [19]. [A 7]\n\nSince the mid-19th century, scholars have begun to study families as a social system, which is in the research trend of the origin and evolution of the society. Darwin published \"Species Origin\" in 1859 [20] [21], 1861 Henry Maine published \"Ancient Law\". Although he disagreed with \"no matter how, the human society is coming through the same continuous evolution\", it is regarded as the basic relationship between the status and marriage as the basic relationship in the modern social crisis [22]. [A 8] [23]\n\nEarly research families, social evolutionists will discuss families as a single continuous body from primitive society to the feudal society to industrial society. Their assumption is that all home forms are the same evolution process. Germany's socialist theoretical Engels is analyzed by Marx's point of view, which is \"mother\" (DAS MUTTE RRECHT) published by Bahofen (Das Mutte Rrech) in 1861, starting with the family. It is part of the social system to study. [24] The story of the Bible and the record of the ancient Greek Roman family have become the basis for the history of Western society. Bahofen tried to use the derailment of sex as a starting point, and then list a way to modern home. He speculated that the origin of the initial love was accompanied by women's betrayal. After adhering to your own point of view, the woman continued to live a calm life, and since then, he gradually lost the control and political power in family life. The consequence of loss of power is that the male right replaces the foundation of female rights to the family. [24] The researchers began inheriting mother-induced (ie, to track women's context) as a homework, but not only to the interest of special tribes in Africa. [A 9]\n\nIn addition to Bahifen, the basic characteristics of John Ferguson Mclenna in Scotland also hold similar theory on the basic characteristics of the mother's inheritance in the family evolution process. [25] [26] [27] It describes in 1865 \"Primitive Marriage\" books.\n\nIn Meclennan model, there is constant nomadic nomads with other nationalities. When the enemy surrounded them, they perceived that the woman was too weak and therefore implemented a strategy of massacre baby girl. From this woman, it is greatly reduced, which will lead to the killing of some very special women. Since then, women are transferred to the male family by their families, and the children of her fertility are also male family system. Because his own tribe lacks women, we have to go back to women in other tribes, and the most beginning is all methods that have passed women, and then they will begin to get women from exchange. In McRerennan's structure, the marriage and foreign marriage is the most basic concept, which is still popular in anthropology and sociology. [28] [29] McRerennan will define marriage with foreign countries to be strictly prohibited to marry. Its learning is that family life begins with foreign countries. [A 9] [25]\n\nEven in the 19th century, scholars are still a lot about the evolution of the family. The American anthropologist Louis Henry Moore Moore believes that the results of the foreign countries are naturally selected. It is believed that it can promote this tribe in their region, and people who have improved, the cultural area has expanded. Mooregen is classified as a foundation based on the names of the family members, and if all the brothers of the father have used \"Father\". He believes that the \"parents\" used in today's people, the essence is a use of genetically inherited from the past, from the former so-called \"parents\", it is considered to contain all possible people. According to Moore's theory, the use of \"parents\" is increasingly strict, and it is representative of someone who is inherited by someone. [A 9] [30]\n\nEngels' \"home, private ownership, and the origin of the country\" rely on Moore's evolutionary theory. However, Engels summarizes the principles of the family to control the production method, not the decision of inheritance. [31] In his evolutionary process, the family must be adapted to the change of social division of labor, which has become the promotion organization of economic and wealth control. Engels believes that the subsequent stage of the division of labor is the production of socialist society. The family's characteristics will be an independent and women of the property rights, but this needs husband and wife commit to each other will continue. It is believed that this is the basic form of family in the proletarian system. [A 9] [32] [33] [34]\n\nIt is that the Finnish sociologist Edward West Mark believes that the family is developing in a lot of different paths. In the work of \"Human Marriage History\" in 1891, his view is: [35]\n\nAs with his functionalists in favor, West Mark assume that incest is a common feature in all families. It is believed that the core family belongs to the most basic home model, and the family incense continues to continuing, and the way of marriage with foreign countries is developed from the incest taboo. [A 10] [36] [37]\n\nBaronislav Malinovsky, Baronislav Malinovsky is the followers of West Mark. He studied the method of family function analysis and proposed the role of father in relatives. Its view is that although the parent is uncertain, there must be a social father in all society to provide legal status for its children in society, and the father is the legitimate security of family members, so that in the mother society This is also true. [A 10] [38] [40] [41] [42]\n\nMalinovsky assumpquately, incest taboo and core families are generally widely accepted by modern social researchers. Based on psychological analysis, functions recognize that incest taboos are suppression and sublimation of personal impulse demand, such behavior makes men to achieve and reach the required social status. [A 10] [38] [40] [41]\n\nAccording to this point of view, the root cause of civilization and continuous roots are incest. Its popularity and core home pattern, affecting the American humanologist Murdock About home function model [43], and US sociologist Talcot Parsys The association between the family and the general social system [44] [45]. [A 10]\n\nThe development of urbanization and industrialized society has brought problems such as poverty, slums, crimes and individuals, which makes additional academic traditions in the mid-19th century, this school is a sociologist who criticizes the institutionalism of society. [A 11] [C 4]\n\nGermany's sociologist Lille is based on observation and query about the experience gained, and the \"family\" is in the crisis and disintegration state, leading the conservative reform to stabilize the parent system. In 1855, FRéDéric Le Play conducted two books such as miners and other workers, published two books such as \"European workers\" and \"family composition\", and believed that family organizations need to follow social and physics, Especially related to poverty, parental blood family is studied. Following the August Confudent, Lep is tired to consider the basic social unit of conservative and continuity. It is believed that the general characteristics of people's living areas will determine the work of people, then affect the model of the family. Then, the family will affect the other aspects of society. Lepu is a profound impact on poverty, family economy and family continuation. [A 11] [C 4]\n\nThe root cause of many family problems is the concept of thinking families as a \"overall personality\", this concept is proposed from the American sociologist Burgess, which caused unity and provision of interference families. Research on the Factors of Interactive Problems. For example, discovery in the study, the concept of marriage will continue to appear in marriage and continue to the next generation. [A 11] [46]\n\nIn developing health and personality attitude, the role of the family is crucial. Studies on children in adoption institutions have shown that young children need mother like to avoid obstetrics and intelligence. Lack of father love also hinders the child's development of appropriate behavior. [A 11]\n\nMany sociologists are useful for families in mental treatment. One of the important roles of Malinovsky is to verify the assumption of the common phenomenon of the love mother's complex proposed by Sigmund Floyd in the mother department of Tolble Islands. If this is a child, it exists, then the special family cannot affect the left and right. [47] Malinovsky found that there was also intimate relationship between the father and son, and the power and control of the mother and son were attributed to the mother's brother. The son did not hate his father, but he had a jealous emotion to his mother. Malinovsky's information is clearly presented by Freud's psychological phenomenon, which is from home. According to research results, people can find a home form of forming psychological barriers. The study also indicates that the interference relationship between the public conflicts and relatives between parents, often affects the psychology of children in the family [48] [49]. [A 11]\n\nIn the early 20th century, many sociologists worried that their families would lose their functions. In 1929, the American sociologist William Willin Ogben studied the trend of American society, discovered economic, maternity, protection, granting, education and religious family basic functions already have other organizations. [50] The last function of the family is emotional and fertile. [A 12]\n\nAnother American sociologist Soro Jin (Pitirim A. Sorokin) presented that the functionality of modern families will decrease to \"the place where the night is sexual relationship\". [51] [52] Additional sociologists, Birjis believes that family functions are transferred to external agents, which is in line with modern urban society [46]. [A 12]\n\nAfter World War II, the family considered a social system research trend. William Lloyd Warner pointed out how family and blood are closely related to the social class system in modern society. Other sociologists focus on how family life and how relative relationship affect a person's future. Parents' funds, relatives, and relatives have established organizations, making sociologists believe that in modern urban society, families and relatives still maintain their applications. [A 12]\n\nThere is also a special relationship between modern society and family characteristics. Although some specific trends continue for a long time, it still can't get rid of this factor. People born after the Baby tide after World War II After adult, the importance of the relationship between the family and relatives has also disappeared in the 20 years of war. Subject to some social trends present before World War II or germination on the homes. [A 13]\n\nNow the main trend of society is the rise in migration, the reduction in rural population, the industrial and commercial enterprise mergers and acquisitions, the population flows into the city and suburbs, the great progress of manufacturing technology, the level of manufacture, the rapid development of the government and network technology, and The most important family is the innovation of contraceptive technology. [A 13]\n\nThese popularization trends significantly reduce the differences between men and women in society and economy, politics, laws. Women's education is rapid than men. Women's employment rate has greatly improved, especially in professionals and management. Married women want long-term maintenance of employment. In contrast, many couples have begun to think that family responsibilities and attitudes are even greater than if they are satisfied. [A 13]\n\nIn addition, the world's excess is also concerned about problems. On the one hand, fear of society is unable to cope with the food, waste, environment and social security factors required for the next generation. On the other hand, it is also worried that the production and service technology can be completely controlled by a few labor, so that a large number of people will become excess resources, and the number of unemployment is increased. [A 13]\n\nThe current social and economic trends have also promoted people, especially young people, and paying attention to the abnormalities of individual freedom and individualism, and paying attention to freedom from the concept of traditional family life. Take advantage of the social movement of citizens' freedom has also supported this view, forming more consequences in sex, marriage, and productivity. [A 13]\n\nPeople's marriage is a large latency, and children in childhood are often nearly 30 years old. Married couples do not have children's proportion, divorce rates, and remarriage, and even maintain a lot of marital sexual behavior is much smaller than the older generation. [A 13]\n\nIn accordance with the early 1990s, there were 10% divorce rate in the US marriage population, and it was not yet married for nearly half of the 24 years of age. The proportion of birth children in the family is reduced, 50% down to 40%. This trend is further distinct, and it is almost considered that this situation has a reversal possibility. [A 13]\n\nThe change of marriage, the change in sexual concepts and birth rates also promotes the diversification of home life, including always single, unmarried and cohabitation, same-sex, same-sex cohabitation and government and community arrangements. [54] It is difficult to measure the correct unmarried number in these families. It is pointed out in the 1990s, in the 1990s, about nearly 80% of the population is 20 years old, with its parents, spouses, women under the age of 30, with unmarried male, less people and same living together. Have a complete freedom of living. In recent years, many men and women have attracted many men and women, but about 90% of adults have been married and have children. [A 13] The average age of American women's birth first fetus has been delayed from 1970 to 2012, of which the senior woman is more. [55]\n\nBecause of the dramatic changes in family life, the society has a sharp change, but these changes cannot be made to \"death\", but only a change, including the modern society from ancient times to today, many societies have Similar features. [57] Some observers maintain pessimistic arguments because they have discovered certain stipulations and practical roles, and this part of the provisions and role in their eyes are important security for maintaining home systems. [A 13]\n\nAfter studying the corresponding society, such as China, the Soviet Union (Russia), Greece, India and the North African Arab World and the Middle East, and people have found that the family system of these societies is roughly similar to American society. Some advanced societies have long been developing a family policy to increase social welfare. There are also many European national legislation to provide family allowances, giving difficult domestic legal economic assistance, implementing a family medical plan, and other guidance on maintaining family stability. Another place, such as Taiwan, India and Japan, also implemented or is implementing the Family Planning Act to limit the family size. [A 14]\n\nIn China, in a certain sense, the family reflects its long history and cultural accumulation, built a very unique family form, and the Han nationality is more than generations. However, following the development of economy and technology, this traditional big family model is getting a small impact. Especially in the city, only the small families of the two generations and even generations have become more and more, and a family often has only three or four people. The freedom of marriage, the wife, the pair of men and women, and the old love has become a common concept. The French system is when other children are married and they are separated from home, there is still a son to live with their parents after marriage. The implementation of this plan is obviously very important to family stability, and it is the same regardless of the political and economic adoption. [A 14] [58] "}