{"chinese_title": "religion ", "chinese": "Religion (English: Religion) has a variety of definitions, which can be a cultural system in contact with god or super nature, sacred; it can also be defined as the principle or theoretical system of beliefs with enthusiasm and firm belief [1]. According to the former definition, it can be divided into multiped, pan the god, and the title. According to the latter, no theory, naturalism, can not be known [2], etc., is also different religious beliefs. These religious systems, including personal behavior, traditional ritual, values, world concept, classic work, worship, moral normative or social groups. Religion is a consensus and reverence of a certain system. The humanologist Clevrew Germ is claimed to complement with myths and philosophy, and religion is equivalent to a \"survival of survival\" in a human social sector. [3]\n\nDifferent religions may contain different elements, including but not limited to sexy, sacraging, beliefs, supernatural existence (one or more), the ultimate or superior life experience of believers or strength. The form of religion includes ceremonies, preaching, commemorative or worship, sacrifice, sacrifice, holiday, festive, funeral service, marriage service, prayer, music, art, dance, public service or other cultural form. Religion may record the origin of life, universe or other things through the sacred history, the symbolic meaning and holy land, and to express the meaning of life. In the traditional sense, faith is considered a source of religious beliefs. About 10,000 different religions around the world [4], about 84% of the population are attached to one of the world's main religions, Catholic, Christian, Islam, Hindu, Buddhism, Taoism, or different forms of folk religion [5].\n\nSome faith groups, especially some emerging religions, may be given a \"cult\"; however, the faithful faith group and the legitimate religious room usually have no real difference, so the current American religious course has abandoned the use of \"cult\" \"This subjective concept, replaced by neutral\" emerging religion \"concept without derogatory color [6] [7] [8], and some scholars think more about\" cult \"is a group with different dogms and rituals. Personal attack. [9] Megan Goodwin pointed out that in the general people's usage, the so-called \"cult\", in fact, is \"the religion I don't like\", so it is [10] and religious scholars Rodney Stark and William SIMS Bainbridge (The Future Of Religion) published in 1996, the next commentary At the beginning, all religions are hidden, tiny and deviated from the mainstream \"cult\". \"[11]\n\nIn Chinese, the words have its meaning, this is not a unified buffer word. According to \"Wen Wen\": \"The host, the temple is also in the temple.\" \"\" \"\" Exemplary, Tianlaxy icon seeing good and bad, from the two. San Duan, the sun and the moon, watching astronomy In the case of the observation, the gods are also in the case. \"Subject,\" Zong \"said the respect and worship of the natural universe and the human ancestors of human ancestors. \"Teaching\" refers to education, feedback, inspiration, etc., which focus on expressions and dissemination of the expression of God, humanity, or a certain atrial system, which is relatively close to the word connotation of the Western Religion. Modern China often called Confucian thinking and tradition as \"holy teaching\", this \"teaching\" connotation is extremely similar to the Western Religion.\n\nUntil the 10th century, \"religion\" as a bobby word, first seen in the Buddhist scriptures, such as the \"Renewal Lighting\" [12]: \"I have been in the mountains, no religion, dare to be tired of the court.\" The word \"religious\", the teachings of the Buddha tradition and its disciples, and the term is narrow. However, since the Central and Western exchanges of the Chinese and Western China's academic community, and the word \"religion\" in the modern Chinese in modern Chinese, with the rise of the Chinese and Western China's academic community. The word Religion \"has a concept of general meaning; the Western Religions Study is also translated in order to religion, that is,\" religion \"is the discipline of research objects. Religious score from the earliest theology, but ultra-off the research direction with religious prejudice in traditional theology, and turning the commonality and characteristics between various religions, the essence of religion is the research direction, emphasizes the maintenance of religion. Research.\n\nIn Western languages, \"Religion\" is derived from the Latin Religio of the ancient Roman era. Religio is related to modern Western religion concepts, but more belongs to a spiritual concept. The ancient Roman philosophers used Relegere in its book \"The Best of God\", which would be anti-reading, meditation) or Religere (ideal as paying attention, be careful), visible to him at the time of worship It is necessary to pay attention to it. In addition, the ancient Roman Augustus Augustine is expressed by Religare and the residual relationship between people, God and the soul in the \"The Quantity of the Soul\" and the Soul of the Soul. Augustine also used RE-Eligere in \"revised\" and \"The City of God\" to express people's reparies and decisions, people need to re-considerate and choose to make well. Therefore, the word Religio is basically used in Latin to express people to sacred beliefs, obligations and worship, and the combination between the gods, which is more closely integrated with the combination of theology. The medieval Europeans have started from the perspective of theology, often with a slightly derogatory Paganism (Chinese translation as \"paganism\", but because of the lack of relevant contexts, only as a neutral word) other non-Christian beliefs such as Islam; English vocabulary Religion and its corresponding Chinese concept \"religion\" is neutral vocabulary, which can be used to refer to Christian, Islam, Buddhism, and other religions.\n\nReligion has a variety of definitions, most definitions tries to find balance in many extreme interpretations and unconscious expressions. Some people think that the application form and theory are defined, and some people have emphasized the factors, sensibility, intuition, and ethics.\n\nEastern and West also have different differences due to historical background, and religion is a translation resignation. Feng Youlan pointed out: \"Have its own meaning, you can't see a teachings in Chinese, think is religion.\" Take \"the way to serve the gods\" means, the key is \"as the\" Zong \"of the ritual site, not as the\" teaching \"of the sacrifices of Chinese humanism hindrances.\" [13]\n\nSociologists and anthropologists tend to think of religion as an abstract concept, meaning. This kind of abstraction is based on its own cultural development.\n\nThe definition of modern famous monks to religion is - \"Zong\" has: main, important, respectful three meaning. \"Teaching\" has: three meanings of education, teaching, and teaching [14].\n\nTaiwanese monks, the founders of the Gully, the founders, the release of the sacred, considered \"There is a person who believes that the taught is the religion.\" [15]\n\nIn the \"Religious Encyclopedia\", the definition of religion is like this: [16]\n\nTranslation: In summary, each known culture contains more or less religious beliefs, they or clearly try to perfectly explain this world. When some behavior is established in a particular culture, it will lay a deep historical imprint in this culture. Even if religion is different in form, completeness, credibility, etc. due to different cultures, but people in society must inevitably be affected by religious.\nThe following is the definition of the Western monologists to religion:\n\nA religion is a religion because it consists of three levels. It is a religious ideological concept and feelings (doctrine), the second is religious worship behavior and etiquette norms (tiger), three for religious faculty system and Social organization (teaching group).\n\nThe teachings of religion are mainly divided into \"concept\" and \"experience\".\n\nThat is, the awe of the gods is the internal factors and core of the whole religion. Therefore, \"the belief in God\" is all the fundamental of all religions. The object of religious beliefs is understood as a super natural and control natural mystery or sacred, it is regarded as the power, elf, gods, to the high god, or abstractly absolute, eternal, supreme, self There is a perimeter, an infinite existence, surpass the time and space. This belief is regarded as the origin of everything and the foundation and basis of all existence. However, all religions have the same understanding of God, it is possible to \"many and orderly\", \"single-row him\", it is possible to \"super\" or \"inner\" existent, it constitutes multi-gods, a title, single The primary god education, binary god education, etc., there is also a different temper of super population, pan the god, and all things have different mymens.\n\nThe interpretation of religion to the concept of \"Theology\", theology is constantly being adjusted in religious spread, historical evolution, and human progress. Theology is the maximum difference between consciousness and spontaneous religion, because theology has its theoretical and systematic, and spontaneous religion is not theological system.\n\nThe worship behavior of religion, etiquette norms belong to the external factors of religion. It reflects the practice of religious doctrine, and also reflects the reform of religious traditions and its social culture background. The tube is standardized, stylized, institutionalized and institutionalized, including prayers, sacrifices, sacred, etiquette, practice and ethics.\n\nThe teach is based on religious theoretical system, and the tutor is based on social practice activities. The former provides basis and guidance for the latter, the latter makes the mental interest in the former promotes and externalizes; the former is constantly interpretation, collection, and compiling religious classics and deepen The latter is also an empirical accumulation to determine the extent of its implementation, so the teachings and tollors produce a publicly recognized social practice in the cultural atmosphere.\n\nReligion's faculty system (such as: Christian church, pastoral area, Buddhist monk), representing the institutionalization and socialization of religious belief system, is the true shell of religion, but it is indispensable. On the one hand, the activity space is provided for religion and also gives an existence guarantee. The faculty system makes religion have visible external forms to work on society. In history, political and religion often have one or separation, reflecting the organic combination of social administrative functions and priest religious functions, indicating that the individual and secular society have both links and differences.\n\nThe formation of the teaching group and the faculty marks the maturity of the human belief system, enriches religious, complementing the doctrine and tongue, and highlights the uniqueness of religion and other social consciousness and social culture history. Different characteristics.\n\nReligion stems from the quasi-religious phenomenon, before the original religion, one of the earliest forms of human awareness activities in today's knowledge, but when there is no supernatural body concept, the object is not empty, no worship The idea, everything is fully alive, think that certain actions can affect certain phenomena or things, such as spell witchcraft, needle-piercing wooden engraved, wearing jade, etc.\n\nThe beast image of the old stone mural murals is covered with traces of cuttings, and it is considered to be a spell to increase hunting medals. In the tomb of Ni Ander, the mountains and other tomb, all discovered that the bones were covered with red powder and gravel, which may be a blood-colonial line, so as to ask the deceased to be stable or regenerated. When religious and god concept forms, the witchcraft spell has become a religious annex. The disciplines studying religious origins are religious anthropology, the main theory is a spoon, before, all things have spoken, witchcraft, original one, functionalism, mythological structure, and language diseases, the top four are evolution theory, The three cultural circle schools.\n\nEverything is made by the British archaeologist Edward Burnet Taylor, and the primitive people have the concept of \"all things\" before forming religion, people feel people in the shadow, reflection, echo, breathing, sleep. There is an intangible thing within the physical body, which makes people live, and when the feelings of dreams are the most affected, when this unknown thing leaves the body, the body lost the ability, and the breathing also stops, Taylor said this Unknown things are anima. The primitive people have done all grow or activities, and they are even as anima, but modern religiousologists believe that the primitive people do not have this abstract reasoning ability, and have not found any archaeological empirics.\n\nEverything is a spoon (English: Animatism), \"Physical Actim\", \"Fantasian Worship\", is a revision of the humanologist Robert Ranulph Marett (Robert Ranulph Marett) to all things, he believes the original person At the time of the concept of \"all things\", it has a concept that it is to think that the whole world is alive. Therefore, everything in the world is also live, and it is not a premise that all things have their own independent soul, but no Find any archaeological empirics.\n\nThe witchcraft is proposed by Fraser. He believes that human spirit is developed by witchcraft to religion, and then to science. Witchcraft is a quasi-religious phenomenon. The primitive believes that witchcraft can control nature, the reason is nothing more than the proof or similar law, that is, a part of the method can affect the whole thing of the matter, or that the similar object to the subject can affect the object, but When the human beings do not believe this virtual force, the transfer is to the soothing and compassion of supernatural existence.\n\nLanguage Diseases said by German philosopher Max Miller, he believes that ancient Indio language abstract words, some conceptual vocabulary must give a personality link, otherwise it will not be used. The gods were originally just the name of the natural phenomenon, and later learned from the vocabulary, it caused a sense, and myth was born. In this way, the object that causes awe is gradually masked by the language, and is finally separated from the direct perception due to metaphor behavior.\n\nThe original aid is proposed by Schmit. He believes that in the oldest culture, there is the most fascinating existence, which can be seen in the nation of the North American Polar Nationality, the southeastern in Australia, so the title is the oldest humanity. Religious view, the image of God is the initial revelation from God. The future religion is degraded, and it is covered by the gods and ghosting strange.\n\nThe function of functionality is first proposed by the British anthropologist, also known as a series of functional theories. He believes that religious rituals and witchcraft behavior are to meet the psychological needs of individuals, slowing their life pressure. Providing positive attitude towards life and death test, also protecting the traditions and values ​​of tribes, which are mainly divided into biometric, mental and normative.\n\nMythology Structure said that the french anthropologist Li Vihai, he believes that the original human soul of different places in the world has a common structure. Here is to explain the world, this common phase is a set of myths. The original power.\n\nReligiousness Theory is to explore religions with reason, logic, it is like a double-edged sword, but also teaches teaches.\n\nThe anti-teacup people's view is the most prominent, first of all, he believes that if all things have caused, God should no exception, and the first cause of religion is not logically. Second, he thinks science has a certain randomness. Today, we know that quantum mechanics, chaotic theory also has a certain degree of irresopeability, which indicates that natural law is likely to have the hand of God who decides everything, but is just a constantly changing scientific temporary conclusion. In addition, he believes that the monologist is full of \"human choice principles\", and theologist thinks that the world is like this. It is to make people survive. This is undoubted to say that people grow tall nose is for Like the truth of the glasses, the result will change the result, Russell believes that human beings are only a product of natural evolution. If God is a creator, why created a fascist party or so many terrorism? He also believes that if the non-standard depends on God, the God should not have goodness to be good, if God is good, then I have to admit that it is non-standard by the things other than God, this two difficulties Also make the title of the the the the theth.\n\nSwinburn is a famous rationalism. He mainly starts from \"why there is the most common natural law\". He emphasizes that many people ignore the universe does not exist, or it is always in chaotic state, so it may be very large. This universe of this high order is surprising, beyond science, and this is not due to unable to explain behind scientific, but the nature of science must finally have a certain ultimate natural law and material structure. One of this \"ultimate\" may explain is a title, because God will definitely be able to do this, order sexually in order to control nature, change nature, change nature . Evolutionary view is impossible to design in this issue, because we can't help but ask such a law, what is it? This makes us either uninterrupted, either explanation from hypotheses, rating a reasonable explanation of a monument assumption.\n\nFor the two kinds of rationalism (peer and related theory) from scientific, rational to interpret religion, Paul Tian Like believes that too many people think of religion is a knowledge that religious authority relying on religious authority, but he must clarify Religion and science have essentially (separated matter), it is unnecessary with science to go to the anti-education or care education, because the truth seeks in different rations, the science can be treated, and science can only be with another science phase. Fight, religion can only compete with another religion. He believes that the quantum has not been allowed to launch, and some people are used to prove the theory of creation, and they say that freedom is ridiculous. The struggle is the most strihy of evolution, and the opponents are only in the literal meaning of the Bible, and the creation of creation is scientifically, distorted.\n\nReligious emotions aim to indicate that the essence and significance of religion is not reflected in the activities and achievements of reason, and is an intuitive \"unlimited person\", the \"sacred person\" is absolutely, unconditional dependence. Schlelmach believes that critical or moral ethics to criticize religion is superficial, scientific and scientific, with the inevitability of the world, with the uniqueness of the facts, and the morality, and the morality from people, develop a responsible system Why shouldn't you do it by the ultimate authority command? Religion has a set, in general, religion is \"absolute dependence\". Through the actual limited activities, we have faced those invisible, eternal full of respect, once intuitive universe, knowing that they are small and humble, thus evogene \"for unlimited emotions\". Otto pointed out that religious classics describes the gods in a large number of vocabulary. When the conveyor concept is, the more clearly determined the religion, but religion is \"unreasonable\" (Note: Not \"rationality\" the Irrational. We only borrow vocabulary to determine the subject's properties, but this unlimited body cannot rely on them to understand, he pointed out this highest intuition-\"sacred person\" - must exclude any moral factor, this \"mystery \"The\" fear \",\" noble \"and\" energetic \".\n\nEmotional discussion is logical question, Schlelmah, the religious experience that does not have emotions is to talk about faith, religion, and in other words, the religious emotions can prove belief. But don't forget that if religion is \"unreasonably\", why can religious emotions demonstrate faith in causal logic? Once this proof is recognized, it recognizes that religion contains intellectual components, it must accept the critique of psyllism. Although Outo shows that the religious experience can only be seen as \"a substitute for the solution\" to approach religion, it is the closest language that describes the ultimate human beings in conjunction, but this is inevitable. The concept is able to describe religious experience. Contemporary scholars have a more study pointing that emotions need to rely on understanding or concepts, which are rational elements, rather than \"unreasonably\" proposed by non-emotions. Another religger Pan Nengberg criticizes the emotionalist to reduce religion to personal experience. Religion is only the subjective of unlimited emotions, but this subjective has no binding.\n\nReligious will theory from Pasca, by William James. In summary, the beliefs do not reach our choice of letter and do not believe, but analyzing risks to make bets, can use the five words of \"Belief's bet\". The premise is that God is a \"real choice\", James defines the real choice \"\" There is vital, unavoidable, have a major value \", at the moment we are in the opposite side, all have arguments, in the future I don't see some people fully support or overthrow the propositions of God, so we don't want to be committed to gain, and lose the benefits because of avoiding fallacy, and this is also very likely to make God's unhappy, and believe and do not believe it. It is a major bet. If you believe there is God's existence, gambling will get everything, if you bet, you will not lose anything, but if you don't believe in God's existence, bets Win just the victory of emotions, and bet Loss will lose your life.\n\nRegarding the opinion of the will, Russell criticism is \"utilitarian, subjective\", first, James only wishes to believe that the religion can get eternal life, but he didn't confirm in this proposition, it is possible to believe in hell It is also said. In addition, the devout religious, God is exactly, as a person like Mao Zedong in history, the orthodox religious person will think \"I believe in God, I am blessed\", not James, \"if Let God, you will happiness. \" The willingness of the religion will be divided into religious, sacred, and the modern businessman who is absolutely dedicated to become utilitarian will only become the best, do not explore the truth.\n\nHumans generally recognize the entire universe must be the same as one of the ultimate roots. Therefore, as the countries that are generally considered will eventually die, religion should be treated in human society, and they should also die in the ultimate inclusion and identity. in. [Source Request]\n\nDue to the development of information, religious freedom, plus social economy and self-sufficiency, global integration, and Earth Village gradually formed. Dialogue between religion is not just self-survival, preaching the need for the right path, is also a way to conflict with disasters, whether it is the inter-church, or all religious rooms, more and more people put forward to talk, and all religions have their own self-position. It is the alien, multi-graphical and merger.\n\nIt is absolutely true in many religions, and the rest is false. It has an absolute view on the truth, and this is the nature of religion. If a religion is not the only \"truth\", then It is not worthy of beliefs. In fact, any congress will naturally have an intrinsic exclusive exclusive exclusive to his religion. Orthodoxism is the orthodox position of most of the gods, they only think that their God is true God, only to be dedicated to the religion to be saved, and other religions are deemed to be non-real. When this exclusive excluding other races become racism, or to eliminate other pagans, it has become a closed religion, and there is a large-scale battle in the history of human understanding.\n\nAbraham (Christ religion, Jewish and Islam) have strong row of hunt, emphasizing the only true god. Christ religion (including Catholicism, Orthodox Church and new education) is a typical exclusive discipline, but part of Christ religion also proposes \"universal salvation\". So this has become a difficult problem. In addition, Christ's new teach emphasizes the \"Senses to save\", causing the reversal of his arguments to think that this is just a narrow salvation, which is not good as the beauty of the United States.\n\nMulti-alarm advocates that all major beliefs in the world is very different, but this is just that we call God or God's equally effective understanding, experience and response. Hick believes that all religions are like the truth of \"blind\". We can't conclude that the religion is true, because the truth is likely to be completely confirmed, each religion is just \"different lights, the same light\".\n\nHowever, the anti-polyvoepers believe that this will undermine the essence of religion, and if other religions are also right, the religious doctrines, the Holy Society is lacking unique. The blind man is not shared in the different ends of the end, but it is all wrong, and the tail is not a representative. Unless someone can talk about the entity of the entire icon, all religious standing out of the conversation, just a pair of blinds, and it is better to say that it is wrong. In addition, anti-multi-pilot believes that Christians have to talk to Buddhists, and they have to be unknowwords, and they have unreasonable consensus. This is just a lot of blind people talking, and it is getting farther and farther.\n\nMergence theory between his theory and multi-diversity, on the one hand, God only had one, but also regards other religions as \"legal religion\", god gave the revelation of religious redemption, but other religions in the grace of God The deviation of inclusions due to cultural differences is not as good as a religious orthodox, other religions are just some \"unknown people\". They accepted some of the correct but part of the wrong concept. Orthodox believes are to correct they.\n\nAnti-mergers believe that this argument will merge with a very disadvantageful position, because if other religion accepts revelations, it is also possible to get the Shenge Demon Redemption, why do you want to convince them to believe in orthodial religion? \"The\" unnamed people \"is even more exciting, since everyone has God's grace, the kind of religion is the real religion? That kind is the unknown religion? This implied exclusiveness also makes both the merger two heads.\n\nReligion is widely existed in various countries and nations in the world.\n\nThe relationship between religion and politics is very complicated, and religious beliefs will affect law. Religion is also a social ideology and is part of the upper building. Historically, religion often is used as a spiritual tool for rule people. On the other hand, religion is often used as a tool for anti-oppression.\n\nModern in many countries, citizens have the freedom of religious beliefs, and there are only freedoms of religion, and there is a freedom of religion. Let's believe in this kind of teaching, and there is also the freedom of the kind of teaching. It is one of the basic rights of citizens. In the Middle Ages, there are many countries in the world to adopt a system of political and disclosure, and the national regime and religion are one. The leader of the religious leader is the head of the country, directly mastering the national regime; set up a single religion to become a national education, the teaching is a national law, citizens must believe And obeying, citizens do not believe in the freedom of other religions or non-beliefs, otherwise they will be considered to be \"pagan\" and persecuted. But in ancient China, due to the influence of Confucianism, citizens allow citizens to believe in the freedom of other religions, but various other religions must be included in the framework of Confucian ethics. The religion of the People's Republic of China must be one of the patriotic ideology. Marxist views believe that religion will disappear when social development into communism.\n\nIn the development of religion, inevitable will be integrated with culture and art.\n\nThere are many famous scientists in history, such as Eucula and Kexi. Ferman believes that more than half of scientists have no religious beliefs (in the 1950s), and science cannot argue God does not exist. [17] Due to the many \"truth\" of religion, it is not confirmed but is said to be like the \"truth\", just the logic, the content is not really precise. According to the recent survey, scientists believe in religion is the lowest. [Source Request]\n\nWorld main belief ratio [18]:\n\nAmong them, Christian, Islam and Buddhism are often called the world's three major religions. Although the Hindu's congress is higher than Buddhism, it covers the range only within a specific country or nation, so it is generally not included in the three major religions of the world.\n\nWhether Confucianism is a religion, there are different opinions, depending on the understanding and definition of two concepts, respectively, the concept of \"Confucianism\" and the concept of \"Confucianism\". In some countries and regions, Confucianism (Confucius) is always considered religion, so the Confucianism (Confucius) in the form of religious form has always existed, such as in Taiwan, there is a Chinese Confucianism [19], in Indonesia, with a well church [ 20] In Hong Kong, there is also a well-collected college as a religious group.\n\nConfucianism has a controversy, mainly in Confucianism without the obvious ultimate goal as the general religion, but the gods have also not clear the ultimate goal. And Confucianism is based on the Han Wudi \"Since the hundreds of people, the only Confucianism\" uses political power to religion, and the Confucianism is teaching [21], so there is a political support Confucianism to absorb many folk beliefs. Related knowledge It also produces its own exclusive ritual to make it more in the form of a reload to a r believer, and there is a complete system in the Song Dynasty [22], however Christian, Islamic development is also based on the support and shaping of political power. "}