{"chinese_title": "Buddhism ", "chinese": "Buddhism (English: buddhism) originated in the Gu Shiko Swiguo (now Nepal and Indian border), Daxie Qiao, was 35 years old. After the Sakyamuni Buddha, The teachings of \"bitterness, set, destroy, and road\" presenting the disciples have been transferred to religion in the modern world, and is one of the three religions of the modern world. For the world, especially in East Asia, Central South Peninsula has a profound impact, in addition, cultures in Central Asia, South Asia and Nanyang Islands have extensive influences, and is now developing to Europe, Africa, North America. Buddhism experienced the development of history, through the two spread routes in the south, and the modern existence of Buddhism in the middle of the South China, the two branches of the North Biography, the Mahayana Buddhism is divided into Xianzong (the main content of Han Chuan Buddhism) and Tibet (Tibet) The main content of Buddhism), so there is also a seat, Han Chuan Buddhism (big), Tibetan Buddhism (King Kong) three-point method [Note 1], there are many sects; Nanchuan is mainly Luo Han Guo is the highest breeze, and the north is pursuing in the future, it is called Nirvana.\n\nThe ciglers are Sakyamuni Buddha, which is generally called \"Buddha\", \"Buddha\" is a sense of consciousness, and it is impossible to include the Three Buddhas. Buddhism is the intention of Buddha, not the religion of God Buddha, which is more like a philosophy than other religious doctrines. This is because of the most primitive Buddhist concept, there is no clear point of definition, and even against superstition, Buddha It is considered that time thinking about the concept of hardships. \"Dharma\" is, \"the pain comes from the desire\", the Buddhist is \"the person who believes this law\", the Buddhist \"the highest principle\" is \"the pain does exist, how can I escape?\" The existing Buddhism The Buddha and Bodhisattva are also developed by the later sects [1].\n\nBuddhism has made an indelible contribution to world cultural dissemination in history. Buddhism attaches great importance to the progress and consciousness of human minds and morality. According to Buddhist opinions, people and other six sentient beings, indulge in bitterness, and constantly rotating life and death, but only unknown talents can be separated from the three worlds, no longer reincarnation. Buddhists practiced the purpose of Dharma, that is, follow and practice all the four-holy 谛, seeing through life and the truth of the universe, breaking all troubles, and finally surpassing the old and sick and all suffering, ending the six reincarnation, getting the liberation, getting Nirvana's realm.\n\nIn 2010, the census showed about 500 million Buddhists in the world [2] [3] [4] [5] [6] [7] [8] [9]. The population distribution of world Buddhists in the 21st century is: 67.3% (360 million people), 28% (150 million people), 3.4% (18 million people) in the Buddhist region of Tibetan Buddhism, 1.3 % (7 million people). [10]\n\nThe ancient Indian society before Buddhism, Brahmen's conviction is dedicated to God - the three major primary gods: Creating thousands of Brahmā, protecting the gods, viṣhṇu, and destroying, regeneration, and dance god wet wife (śiva), think He dominated everything. By praying for these gods, he can get the benefits of the world, so they gradually have a variety of sacrifices, as well as the praise of various gods, and write records into four \"Vedures\".\n\nBrahmin believes that all the surnames of the ancient Indian society are born by Brahma; Brahmen is generated by the head or mouth, the highest position is the highest; the brakes are generated by the arms, and the status is second to Brahmen; Due to the long-term huge differences between ethnicity, social division, cultural education, etc., the ancient Indian society gradually differentiates into four very unequal classes such as Brahmen, Bag Demuli, Lesha and State Luo, and actually a set of blood. On the social rating system, called a subscriber system. Among them, Brahmen mainly engaged in sacrifice, braked emperor's world, the handicraft industry, the singer, the maintenance of the country, and the maintenance of the poor, engaged in a more low profession. In addition, there is a \"spree\" class outside the four surnames, the status is lower, called \"in contactless\". [11] [12] According to the famous \"Datang Western Regions\" of the Tang Dynasty Xuanzang Master: \"His Brahman, Learn the Si Bun Tunatory. One Skull, It is said to be raised; the second is to enjoy the sacred pray;曰 平, the etiquette, the military, the military, the four, the number of skills, the top of the curse doctor. \"\n\nThe many unfortunate thoughts brought about by the surname system, people are called \"Shamen New Thoughts\" (Sanskum: śramaṇa), including the Buddhism of religious reform.\n\nIn the first sixth centuries in BC, India's social productivity has risen, enough to support a large number of prosperous production, thinking and pursuing the truth of the universe, these Shamen is supported by the customs of the people; at the same time India is in a tropical environment, more fruits and vegetables It is often available in the four seasons, and it also provides convenient and safeguards for the diet of Shamen. Under this condition, \"Shamen's new trend\" is rapidly developed, and all kinds of non-Poemun thinking, mainly include the following genres:\n\nSakyamuni Buddha (Buddha) was born in Nepal today, part of the Indian cultural circle, and other local, religious culture, which were affected by Indian civilization. Recently, the \"Buddha is Nepalese is not an Indian\", which is not accurate, because the concept of these two countries does not exist. [13] About the students who have learned a multi-proud prince have two, there are two different types of Buddhism, one is considered to be the month of the month of May 543 BC, and the other is the first 589 years. Or prior to 588.\n\nSiddharta Qiao Ma Mao is born, it will be seen by the Anti-Dai Shengxian and other gods and preprophydroids will become a generation of Run Run, or out of its own road as the most distinguished provenance. In order to avoid him in order to avoid him, I expel with the pain, ugly thing that can see, and leave a desire, good thing. However, it is so far to see the old man, the patient, the dead person, and the people who see the people are impermanent, and they see the Salou, which will be solemn, and determine the identity and distinguished life of the royal family, and the Zen princes. After experiencing the hardship failure, I realized that I couldn't liberate the bitterness and just relying on meditation. Therefore, I entered the four three-way, and after the disturbance of the Devil's Army, I finally was 35 years old. Luo Shu (after being honored by Bodhi as a Bodhi tree), there is no matter what is equal, and it is known as the Buddha, Sakyamuni. After that, he walked through the branches of the Ganges, gave people a very deep truth they found, and gradually attracted more and more people to listen to his teaching law, and accepted some people to follow him, which was built. Among them, the five ministers followed by the Siddhand practitioners who had just watched the home have accepted the teaching of the Siddhand to become the Buddha, becoming the first batch of Biqiu, which is the first batch of Shanha [14]. The Buddha believes that all beings are equally, against the surname system, unwilling to preach to the people from all walks of life and the people of each identity. He went around in the middle of the decades, recruiting many disciples, and the influence of Buddhism gradually expanded. The Buddha died during the 80-year-old (Buddhism said it was Yumiro).\n\nAfter the Buddha, after four assets - all sects were only recognized by the first twice. In addition, modernity has two assemblies, syndicated, six collection, but did not receive Northern Buddhist recognition - the classic basic formation of this Buddhism. The latter group split into multiple sects, each development, slowly fused, roughly there is a Nanchuan Buddhism that evolved from the Volkswagen, the evolution of the Shediarian evolved; from the Peacock Dynasty, Buddhism spread to the north and south direction. Nan Chuan Buddhism (now the surdo of Buddhism) spreads to Southeast Asia via Celan, mainly affects the Zhongnan Peninsula in Southeast Asia. Beichuan Buddhism (also known as the Mahayan Buddhism) was to arrive at Xinjiang in Kashmir. When the Buddhism in the Eastern Han of the 1st Century was introduced into China, it was passed into the Korean Peninsula, Japan; Bei Chuan Buddhism officially introduced into India north from the 8th century Tibet; hereinafter, Bei Chuan Buddhism is divided into two Buddhism and Tibetan Buddhism. Tibetan Buddhism has great influence on the living culture of Tibetan people, and later passed into Mongolia and Northeast China and other regions. By 16 or 17th century, Tibetan Buddhism has laid the foundation in the far East.\n\nDevelopment and communication schedule of Buddhist inheritance\n(450 years - Jet 1300)\n\n\nIndia\nInitial Buddhism\n\n\n\n\n\n\n\n\nSri Lanka and Southeast Asia\n\n\n\n\nCentral Asia (English: Buddhism in Central Asia)\n\nGreek Buddhism\n\n\nSilk Road Buddhism (English: Silk Road Transmission of Buddhism)\n\nEast Asia\n\nHan Chuan Buddhism believes that everything is unreasonable to live in Tianjie, humanity, Ashura, beast, hungry ghost and hell. The South is only five. Because greed is constant, there is no end, and it is considered that the endless trouble is suffering and incompatible.\n\nThe purpose of Buddhism is to liberate from the reincarnation. It means that life is able to get out of life and death reincarnation and its various bitterness. From 'Roundback', 'Nirvana' thus 'release' is Hinduism, Jain, etc. India The common concept of religion, but the specific connotation is different.\n\nBuddhist doctrines believe that Nirvana is a state in which all all the people in the world are all exhausted, so Nirvana will never have all kinds of troubles, pain, and the insights of the multiplication, the insights are no longer affected.\n\nSakyamuni Buddha's words: Although only Sakyami is a Buddha, but in his life, this world has had Buddha's birth, and there will be Buddha's birth in the future, and now there is a lot of Buddha. Therefore, Buddhism does not think the Buddha is unique. Buddhism admits that there are countless Buddhas in the past, now and the future, and believe that all people, all the lovers (mainly referred to animals), regardless of the Buddha or not, there will be a Buddha in the future. Buddhism believes that the Buddha is a realistic sentient beings, and all beings are the Buddha that has not been realized. At the realm, the mortal is different from the saints, but the Buddha is equally equal, so Buddhism does not worship the Buddha as the only God, and does not admit that there is another universe Creator. So the Buddha and Buddhists are atheist. [15]\n\nBuddhism's teaching, the teachings deep Hongbo, the words can only be metaphor, it is difficult to clarify that the experience people can self-understanding the trueity. The simplest summary of Buddhist doctrines is that the Buddha's educational point is only one - bitter stop, interest (tendon) to Nirvana. In terms, the basic doctrine of Buddhism is the basic doctrine of three legs (or three-phase), four, eight bitter, twelve factors, four survival, and \"seven Buddha\" - \"诸 莫 莫 莫, The good deeds; self-cleaning, is a summary of Buddhism. [16]. In Mahayana Buddhism, there are four legal stations.\n\nThe so-called bitter is because everything is to die, all the existence is due to the performance of the edge, and the origin is survive. When the fate is done, it is temporary, it can be separated, no entity, ie The so-called cavity (not empty, but fancy, nature is empty), and once the persistence is considered to be forever, it is not separable, there is an entity, and it will feel pain when all things will be destroyed. All beings are unknown, persistent, and the heart is in good condition, so they can't stand in life and death. In order to destroy the bitterness, it is separated from the six reincarnation, and the Buddha said that the Buddha has. The effluent includes the sound of the ride, the fate, and believes that it is a sound of four fruit arrants and the fate to open the Buddha. If there is no longer Ignore, this is the main teaching of Nanchuan Buddhism. Bodhisattva is awarded to become a Buddha in the future. After three major Amuse, he has been constantly giving a six-degree Puji people, and eventually gains no bodhi, becoming the Buddha Zunzun like Sakyamuni. No Yixinji is liberation, this is the main teaching of Beichuan Buddhism and Han Chuan Buddhism; Bodhisattva has also inherited in Nanchuan, but the content is simpler than north, there are many statements. The Bodhisattva has another branch, and it is believed that there is no need to practice the three major Amusement, and it is the main teaching of Zen and Tibetan Buddhism, but it is generally considered to be \"\" \"Buddha\" is not a satisfactory Buddha.\n\nThere are many ways to practice the hard practice, which can be summarized as a quitter Hui three studies, eight holy roads and thirty-seventh products.\n\nThe three legal prints are: \"There is no normal print, the law is not in my print, Nirvana Static\".\nThe North Biography Buddhism is in compliance with this three principles. It is the Buddha's Factive, there is such as the world's insignificant, and it is used to prove, the sense of name Nanchuan Buddhism said that there are three phases, which is impermanent, bitter, no, without saying three law, in fact, the concept is different. Nirvano is not a line, nirvan is not impermanent, but because \"the law is not me\", Nirvana is not me.\n\nAccording to Buddhist traditions, the four saints (bitter gathering deck) is the core of the Division of Buddhism. The meaning of the meaning here is true, true, truth.\n\nThe twelve won clearly tells the relationship between the three consequences.\nBuddhism believes that the world is still born, and there is an incident. There is no thing that does not rely on other things and independence, anything is due to the happens; there is nothing to be affected by other things, and there is nothing else to affect anything else; anything is before There are also consequences, and this causal relationship constitutes a neuroped chain. And according to one of the trends, as the phenomenon of life, the cause of the life of the life is not a constant life. Twelve factors specific content: \"None of the fate, the row, the knowledge color, the famous color edge is six, six into the edge of the contact, the fidelity, accepting love, love, taking, taking, there is a chance, Floral old disease is sad, \"among them:\n\nAfter repairing four clues, it will disconnect the twelve factor [20] and end the round.\n\nWhether it is to become a Buddha, a Buddha, the Archeon disciple of the Buddha must repair the four-story, such as the spirit of the five-year-in-law [21] and impermanence, bitter, no me [22], there is a way to prove four, four fruit , Nirvana, disconnect all troubles and leave the reincarnation, and you can't identify four, four fruit, nirvana, and disconnect all troubles [23].\n\nThe Bodhisattva of the Mahayana Buddhism is dominated by six degrees (North Chuan Liupo), with the three big arrival time to accumulate Ford, wisdom, and Rao Yisheng, and finally have a successful Buddha. For the high-end multiplier, it is necessary to encourage good law, and the Bodhi is not returned.\n\nThe Buddhist World Viewing is self-interest, the Buddha sees the world's past, now, the future appearance of the world, and presents people.\n\nAll beings have nothing to do, there is a result, good business must have a good news, and the evil must have a bad report, what is the power and causality. Because of the common business (common business), it has formed a world, because all sentients are different (individuals), and they are reported and felt.\n\nThe world is divided into love in the world, in which the environment and the mentality behavior characteristics are divided into three worlds - want the world (sex), color circles (no sexual desire but have a substance), colorless circle There is no consciousness existence). There is a six-way beings in love, and it is a living body, and it is here to see it. The world is ie, landscape, land and so on.\n\nThe so-called world (Sanskrit: lokadhatu) is in the world. There is a Mi Mi, a small world, and the world is surrounded by Missha, and there are four major departments and the nine sea. It is Msi Mingshan, hell is hell, and the upper and upper void is people. Room, desire sky, color world. One thousand small worlds are small in the world, a thousand thousands of worlds are thousands of worlds, a thousand thousands of worlds are the world. Xiaoqian World, the thousands of worlds, the world is known \"Three thousand thousand people\", not to say \"three thousand thousands of worlds\", and only one Buddha is born. Mahayana Buddhism believes that there are countless Buddhas in all worlds from their respective three thousand worlds.\n\nOur world is called the world, located in the southern part of the four continents (also translated into a Yanfuzhou), is the center of the three thousand thousand people, more specific, in the Buddha's Buddha, Nepal, India is a center of the world.\n\nThe origin of the world is described in \"The World\".\n\nThe origin of the world is not created by any Creeders, it is called by all beings. All things have four stages of a bad empty, also known as robbery, living, bad robbery, empty robbery, meaning to build, maintain, collapse, demise, and then reincarnation. The same is true for our husband and wife. There is no robbery, and the world is destroyed and reborn and destroyed. For the time, the past is called the solemn robbery, now is called Xiancheng, the future is a star robbery; the 劫 千 千 千 出, the Buddha before Sakyamuni is [[叶 | | .mw-Parser-Output Ruby .zzy {text-align: Justify; Text-Justify: None} .mw-parser-output ruby.zy> rp {user-select: none} .mw-parser-output ruby.zy> RT {font-feature-settings : \"Ruby\" 1; Padding: 0 0.1em; user-select: none} (shě) Buddha]], before the past, the Buddha's name, after the Buddha is Maitreya - Malaysia Buddhism \"Think that Maitreya Bodhisattva is currently living in the pure land of the Tyuten, the pure land is waiting for the Buddha; each small robbery has a locked, the score of robbery, the so-called increase or decrease is the life expectancy of the person. At present, the burning robbery is in the stage of robbery.\n\nThe world is destroyed when the bad robbery is destroyed, and three disasters, water, and wind, three disasters. The seven rounds of the sun are empty, and the world is burn into ashes; when the floods, the rain, \"boiling ash\" (like sulfuric acid can be corroded), flooding, the two meditation is immersed; Spicy, the three Zen days are filled. The four Zen days are not affected, while the two-Zen sound of the sound is not affected by fire. When the fire started, the sentient beings saw the disaster. They were all sent to the past, began to repair ten good, because of the good industry, so they lived to the light sound. When the world is successful, the world is beginning to work, and the next generation is found in the world. It is until the real world set up the wind, water, golden three-element (round), and generates Mi Mi, Qijin Mountain, four major arches on the gold wheel. The sound of the sound is born in all walks of life, and finally in the world [30] [31].\n\nInitially, the heavens in the next life still have magic, which can be flying. Because of the development of the business, the ground naturally growing the taste of \"Flat\", there is a food, it is often seeding, so these people are gradually thick, no light, and the god disappeared, no longer as the day People with joy is food, but must eat with fertilizer, and have been ugly, and some of the sound is less than eating, still maintaining the appearance of the man. This has the score of beauty, and there is a heartless heart and arrogance [32]. Since then, the fat is gradually disappeared, and glutinous rice has a glutinous rice, and people have a glutinous rice. Time is long, some desires are heavier to be born for women, and there is a division of men and women in the world, and there is a lust between men and women [33]. I started to disgust the love, but I have a dedication, people have expelled, and they can return to the group after three months. Later, the desires are getting more, people build homes, not see, women at this time Start pregnancy, human born approach from naturalized students into pregnant birth. Humans have more birth, the glutinous rice is not enough to eat, people compete hoard, and the glutinous rice is less, and the ground is born on the ground. In order to eat rice for a long time, it is divided into planting. Some people have saved sales, some people have robbed, but they must be cut off, others see people to change the evil, and they will come to build meditation, and they don't sit in meditation, and they will previse the classics and sacrifice the heavens. So there is a businessman, farmer, elder, and priest, etc. (by using Indian prostitutes, as a metaphor), and then established a royal family and country. Also because human beings have repeated, there is a production of animals, hungry and ghosts, and hell roads. At this point, the world is final.\n\nBuddhist scriptures were originally from the assembly of Buddhist disciples. The \"Tibet\" integrated is also known as \"Sui Cable Tibet\". \"Law\" transliteration is \"Nini\", so \"Law\" can also be called \"Pini\"; \"the Tibetan\" transliteration is \"Abji Grinding\". The early Tibet of Buddhism, the contents of the law, the content of the law, and the difference is different.\n\nThe upper part of the Buddhist \"Bali Law\" records the Buddha to say that the Tibetan Tibetan [34], Bali Tibetan records the \"Abbid Dieni, An Nishi,\" [35], the small part of the biography \"Bodhisattva Once I followed Chen Ruver, Fasfon, Keri Buddha, the family studied the Tibetan Aji Dinda, the Bodhisattva was in the fourth seven days after the Buddha spent seven days in the northwest of the Bodhi Tree, the \"Baojia\" thinking about the content of Tibetan Aji Da mill [ 36]. Whether the academic community is related to the early assembly, it is unconventional. Most scholars believe that Abida mill is gradually developing, explaining, explaining, and further elaborated, organizational and systematic. \"Abji Dawe\" in the law often appears together with \"Aby Nijay\", but this term does not necessarily mean the current standardization. [37] The academic community generally believes that the procurement of Buddhism may contain the Buddha, and some scholars advocate that most of their content is the Buddha. [38]\n\nThe broad Buddhist script contains multifaceted content, Buddhist history, Buddhist directory, Buddhist works, China's summary of such Buddhism's generalized Buddhist classics into a \"big Tibet\", or everything. Tibetan Buddhism divides the classic into Ganzhuier, Danzhuier. South Chuan Buddhism uses the name of the three hidden. Because of the different places, there is a subtle difference, so in the translation of Chinese habits to use the \"Da Tibet\" translation of other systematic classics, such as the name of Nanchuan Buddhism is \"Bali Treasury\", and the European and American schools often Use the three-hidden name [39] (also using Japanese \"Treasure\", but relatively small). In the Buddha, it is clear that the Buddha allows disciples to use dialects to pass the Buddha and book a classic. The academic circles have focused on the changes in Buddhist scriptures, and the changes in the Buddha were circulated, and which were the teaching law of the Buddha's era, which is the later development.\n\nBuddhists can be divided into homes and in their families. The family is subdivaled out of the bikhi, Bhikcuni, Shami, Shaemi, TKATIN, saying the five people; in the family, according to gender, it can be divided into Youso, Men, Yousong Yi, Waiti, etc. The two are collectively referred to.\n\n袈裟 (Sanskrit: Kṣṣṣya; Balli: Kasāva), it is known as the color, not color, because the Buddha stipulates that the name cannot be dyed as positive (bright color, solid color) is named; it is also known as Futian clothes, Tian Saixing, The split square is similar to the field, and Yu Zhong livelike seeing Futian Clothing is a family, happy, willing to support, cultivating Futian.\n\nThere are three small three pieces of large middle and small, and the names of the greece are also known as nine clothes, coats, and the Chinese famous princes are also known as seven clothes, the small name Avocad is also known as five clothes. In the case of different occasions, it is called three clothes, and there is a \"three clothes that do not leave\" in the commandments of family members. The traditional Buddhist monks have to carry three clothes with you.\n\n袈裟袈裟 From India, inherit the style of Indian traditional costumes, is very obvious, and the Buddha said that the Three Buddhas are wearing the same style. [40]. Nowadays, South-Biography is still in daily wear, and the passage of different countries is slightly different. When Buddhism first entered the Han Di, the Han people cooperated with the traditional clothing Hanfu, and gradually became a form. Only the Fa Conference was still wearing; however, Xuanhua people also criticized the phenomenon of the family, but in his The Dao Wanfo City strictly promotes the ancestral system that does not leave. In Tibet, 袈裟 also varies depending on the local style, the different sects of the sect also have color differences; after the Han Chuanzheng to Japan, because of historical reasons, it also develops \"half-embarrassing\" such a pure table and ignore the clothes. Significance style.\n\nIn the Han Di, the seafood, three treasures, straightforward and other robe patterns are developed, and they are wearing daily for the Master, and the Haiqing does not involve the style. It does not take a field, the Skim Skin can wear. At the Fa Conference, Han Di also had a five Buddha crown, and thousands of Buddha clothes and other wear. There was also an emperor in history.\n\nThe Buddhist monks distinguish between people's image is the most easy to identify the bald head or short hair. When the Buddha was cut off with a knife, he was called \"Bald\" by his Brahmen to teach Saume. Later, he went out of the saints of the saints, and a small amount of hair is used to block. Meat.\n\nBuddhism believes that there will be too much hair to make life to the pain of the colors (you can understand as a passionate dress, forget the essential task), saying that the hair is \"troubles\", but can usually leave the length (about 3 cm). Therefore, the monks of the original Buddhist monks need to take the knife with you, used to cut the clothing, and cut hair. In Tibetan Buddhism, because the sun is extremely strong, there are generally two fingertips to block the ultraviolet. In the Han Di, due to the historical reasons of the Song Dynasty, there was a habit of hot crash, and modern has been abolished, only the characteristics of shaving heads.\n\nThe law name, the law is the religious title of Buddhists. The name is the name of the family, and is relatively similar. The title of the law is the title of the influence, and the monks are advisable and can be taken in the commonswo.\n\nIn the Mahayanian Buddhism, Buddhism's believers self-calling the disciple of Buddhism, and the disciple of Buddhism; where Buddha's family is also self-designed, the children of Buddha are also known as Buddha. Han Chuan Buddhism has established the tradition of the \"release\" word \"release\" in Dong Jin, Sakyamuni, and the monks are in front of \"Interpretation\", such as the printing of Indian, Vietnam, a row of Zen teachers, but there is no such region, but in the name. For example, the name of Damo Zu Master is the meaning of Sanskrit Dharma, \"Act\", \"Dharma\", is not called \"Sakyama Tam\".\n\nThere are a variety of styles for your head. Because Buddhism is born in \"Shamen Tide\", the Buddha is also known as Shamen (Sanskrit: śramaṇa, Balli: Samaṇa); because it is a home and seek, he is called family (Ballikaarika); One member, so I said, Sangha (Balli: Saṅgha, Sanskrit: Saṃgha), etc. Generally known as Mage (Sanskrit: Dharma-Bhṇṇaka, Ballma-kathika; original is a kind of monk, righteousness, teaching teacher, and becomes a monk's respect), elderly or upper seat (Sanskrit: Sthavira, Bali : Thera), Supreme or Saints (Sanskrit: ārya, Yi Zun Sheng), Dad (Sanskrit: Bhadanta), which is common in all Buddhist definitions, especially in the south-transmissive upper seat.\n\nIn the Han Di, also known as monk (this is the meaning of professor, \"now has become a representation of the monks), Master (not master), go out, a family, a monks, monks, and a master (original refers to the Buddha, then refer to Gao Shuang, Modern is commonly known as Buddhism), sorghum, pedestrians (the practitioners, generally finger people, can self-proclaimed in common children), Taoist (Yi is a monk, people, etc.) In the middle, there are also monks who claim to be real people), etc .; Hostel, abbot, deacons, supervision halls, people, Taoist, and other faculty.\n\nIn Tibetan Buddhism, there is also a lama (Yi Yue), Kanbu (Tibetan translation of professor, is equivalent to the intention of Hani, generally for the monasterist), Rinpoche (Ningbo car, righteous treasure), Dalai, Ban Zen, living Buddha, yoga, yogi, etc.\n\nDivided into Youppye (Sanskrit: Upāsaka), both of the Po Yi (Sanskrit: Upāsikā), also known as the Han Dynasty (Sanskrit: gṛhapati), Chinese translation, at home.\n\nAs a hill, the Bhikkuni must be held in the foot, Shami, Shaemi must be rushed to Sand, and the trifut is Saff. The commandments of the family are more detailed than the family, and the Han Chuan Buddhism is 250, and 348 in Bhikuni; the Nanchuan Buddhism is full of 227. Shami, Shamini and the Forkama were much less than the stages of the formal Biqiu and the bikhi. According to the Buddha, Biqiu and Bhiges, in the month of the month, Bosa, studying the commandments, if there is a command, the remorse, the people repent.\n\nAfter the housekeepers and girls can follow the five rings after converting; the five rings are: (1) Do not kill, do not kill anything all animals or love. (2) Do not steal, do not steal, fraud or robbing others. (3) If you are not evil, the man is not with \"Women who guard others\" [41]. (4) I don't tell me, don't lie, not, don't say it. (5) Alcohol drinks do not drink non-medicine wine. It is not to cultivate the compassion of all beings, theft and evil spirits are the ban on the world. It is not to avoid alcohol's order, but because of alcoholic anesthesia to reduce wisdom. Guoshou is in order to get the merits and interests of the ring, even if you can't hold the ring, you can always believe in Buddha, first and wish, return to Dharma, depish.\n\nIn addition to the five quings, there are further ten good industries. In addition to the good words, there is no words, not bad, not bad. In addition to the five quings, the arms can be held in the family, there is also eight off. Southeast Asian countries also have a happiness at home (holding out the counseling) to gain a custom. [42]\n\nIn addition, the Hanfa Buddhism can hold the Bodhisattva in the family. Tibetan Buddhism has Tibetan Bodhisattva.\n\nHan Si is called Van Yin, Vatican, because Buddhism is born in the Indian civilized district, and the music form and instrument used is Indian, and they are spread with local music as Buddhism is in the world, and they are integrated with local music. Such as a blow musical instrument India (Shehnai, from ancient Persian) is incorporated into the Han Di, it has become a 唢 唢 today, and so on. Tibetan Buddhist instruments fused in Indian, benzo, forming a unique copper.\n\nIn addition, India's Zhuzong is paying attention to singing, it is rich in rhythm, convenient memory, which is also brought into Buddhist traditions. Han Si said that it is Vatican, singing with wood fish, bell, and accompaniment, and all localities have all the places, such as Tianjin Vatican, Chongqing Shangjiang.\n\nThe modern Buddha also has a large development, and the new century style is integrated. If the Taiwan Buddha is Huang Yin, there are also some gentle and soothing light music to help yoga, meditation.\n\nThe original Buddhism does not have a habit of sculpting paintings, more Buddha's footprints, Falun as a worship target, meaning more.\n\nDuring the Angjan, Buddhist sculptures were more common, and it is also more common for plastic performance of various stories. The most prestigious representative is a Greek-style 犍. With the global spread of Buddhism, statues sculpture all over the local style and develop their own unique aesthetics. For example, the Buddha statue of Myanmar is more jade carvings, the image is full; the Thai area likes to use gold, there is a lot of money, The buddhism of the Buddha is hidden; the image of the Tibetan image pays attention to the symbol of the soft and handheld, the Buddha statue is usually fine, and the Buddha statue is a Tangka; Han Di's sculpture painting is greatly improved by Buddhism And improved, from the transformation of the transformation to the realistic facts, and develop the art form of the transformation, the Buddha statue is full of rich state, the ear tone is long, and the pleats of the clothes are vivid.\n\nBuddhist literature is mainly reflected in the Buddhist scriptures. The Buddhist scriptures have a general structure, such as the beginning of \"such as I smell\", end with \"circulation points\"; Buddhist scriptures, simple, primitive Buddhism multi-use Bari Wen, etc., then use Indian Jaccent, Han Chuan The classics of Buddhism and Tibetan Buddhism are mainly from the Buddhist scriptures from the Vive lady (but Sanskrit is mostly lost), so existing three major inherits are also divided into Balli, the Chinese Department, Tibetan Tibetan system [43]. The most close to the folk customs in Buddhist literature is the fable story collection \"Bailian Jing\".\n\nIn the translation of Buddhism, the roughly context can also be separated, the Chinese Buddhist scriptures are the Eastern Han Dynasty, the Eastern Jin to the Northern Dynasty, the Sui Dynasty, the Tang Dynasty and the Song Dynasty, during this period, the Morosh, the true meaning, Xuanzang and not The four major translators \", making great contributions to the development of Buddhist translation and the development of Chinese language, especially Xuanzang Master,\" five kinds of non-turning \", becoming a standard.\n\nBuddhism's folk literature mainly focused on Buddha's past life (such as \"Buddha praise\") and Buddhist disciples, this is quite popular in Southeast Asia [44]. Some Buddha's Buddhism has become a major source of folk literature, many local stories have the tendency of the Buddhist story, such as the tendency to absorb each other in India, Buddhist stories and Hindu, such as \"Braho Capricorn \"In Tibet, Han Di is also more obvious, such as Mongolian, Tibetan national epic\" Gesal King \"has many Buddhism, benzene, and the story of Han Dynasty is Taoism, Confucianism. The Buddhist scriptures.\n\nIn the Chinese cultural circle, Buddhist culture has already penetrated into the Chinese culture and Chinese culture, not only many Buddhist words become Chinese common words, and in Japan, the Korean Peninsula, Vietnam and other places are widely circulated, but also promotes the development of folk culture. Tang Poetry, the prosperity of Song Words is also aware of Buddhist culture, such as poetry of poetry, many pictures come from Buddhism, Taoism; Many words are directly from Buddhist terminology, such as Buddha. On the basis of changing, the monks develop common words, change, they play the purpose of the Buddhist story and doctrine to the people who do not know; on the basis of its basis, continue to develop (speak), Baoli and other folk literature More than talk about Buddhist stories, but put the field of view in historical allusions and legend. The \"Yi Yi\" in the Tang Dynasty was the deformation of Buddha [45], Wu Zetian wrote a famous \"open\" 赞 赞 [46]. The drama literature in the Yuan Dynasty was rapidly developed, and Buddhist stories also showed in the opera. Scholars believe that this phenomenon is \"Buddhist literature\" and \"literary Buddhism\" [47] [48].\n\nIn modern times, Buddhist literature has more popular development trend. Due to the influence of \"human Buddhism\" thought, Buddhism reveals the characteristics of chemicalization [49].\n\nThe Buddhist early monks live in the woods, called Aranya, is abbreviated as Lan Ruo, which is the woods, which are distant, away from the secular place. The first room for the group is bamboo forest, the second is a tree that is located on the tree. Early known as hooks (ViHāra), the exquisite house; \"Sakney\" is originally the title of Confucianism, Buddhism is brought into the Chinese translation of Sanskrit Vihāra; (Jiā) Samghārāma, the garden of Sangha, is a temple, referred to as gamwide.\n\nThe earliest record of Buddhism is in the Han Dynasty, and the court will build a Baima Temple for aunt. The temple is a political affairs department of the court, a total of nine, called Jiu Temple; after Buddhism, it gradually as a synonym of Buddha Temple, also known as monasteries. China traditionally welcomed Buddha and Bodhisattva, the religious place of God, the ancestors, called the temple, and even the title of \"temple\" in dialects, in fact, Buddhist temple should not be called the temple, because the temple is specialized in Buddhist temples, while temples Originally, it is the \"temple\", such as the ancestral temple, Temple, Confucius, these temples should not be called \"temple\".\n\nIn the southern part of Yunnan, China (North Thai Yi, ACA, Deru, etc.), the Buddhist temple of the surcharge, the Buddhist temple is also known as the housing, and the Burma Temple.\n\nStroke, originally an Indian earth grave, also used to put the Buddha reserves, classics, etc.\n\nIn China referred to as the tower, or called the floating tower (Buddha), the Buddha, is a deformerus generated after combining the Chinese style building.\n\nThere are two algors of the Buddha, one is generally popular in the Buddha and the discipline in the southern biography area, that is, in the first year of Sakyamuni, it is the first year; one is the Buddha's birthday, that is, Sakyamun Birthday (birth) is the first year.\n\nNanchuan, Beichuan is born in the Buddha, from home, Chengdao, Nirvana records, in fact, the most conservative estimates of the specific years on the Buddha deeds around the country, the Millennium [50]. At the 1950th World Buddhist Friendship Association, the World Buddhist Friendship Hall held by Sri Lalan (Celan), the world's Buddhist community has made a joint provision: the Buddha is born in the first 623th day of the day; the Buddha is 29 Years, Chengdao is 35 years old; that is, the first 588th months to witness the star enlightenment; the Buddha said 45 years, 80 years old, Nugan, 543 BC, the day and night in the month, the Buddha is from the Buddha I started.\n\nThe moon of the Buddhist calendar, there is a set of jurisdictions, and Han Di is accurate with the lunar calendar, that is, a yin and medium calendar.\n\nIn the Han Di, the Buddha is usually marked with the sky, such as the Tibetan, Guanyin, Ten Dahai. Some of the influence of the three shots, some will also mark some gods (ghost gods), the birthday and avoidance of the monks.\n\nThe Buddhist ceremony is called the Fatisculation, Fa Conference, etc. The rail specification is called the instrument. Different sects have a conference ceremony that combines monks and believers, as well as the rituals of three transactions, and the ring, and the traditional rituals such as homage, Bussa.\n\nThe religious ritual of Nanchuan Buddhism is relatively north to pass. For example, there are rituals who have invited the monks to hit the blessings in the Thai area.\n\nThe north biography Buddhism is more focused on the ritual, the localization characteristics are obvious. For example, Han Chuan Buddhism absorbs a large number of Taoist rituals, ceremonial order and ceremonial etiquette, local creation of the laws and land faith, etc., and some of India's ceremony such as Japan Tzan Popular care; Tibetan Buddhism absorbed Benzo ceremony, such as the customs such as 桑 (祭).\n\nBuddhist common instruments have rosary (Beads), Monitan, Falun, Cooky, Cum, King Kong, Ring, etc., Falun is more like a symbol, mascot, is one of the symbols of Buddhism.\n\nHan Chuan Buddhism, other wooden fish, counting, curse wheel, mantry pendant; Tibetan Buddhism has a bone (human bone device), leg drum, 嘎 (like pendant, can be installed, spell, spell).\n\nWinning a solemn Buddha, you can use fragrance, flowers, water, light candles, diet, buildings, 幢, etc.\n\nThere are many Buddhist holy land, mainly:\n\nBuddhism believes that the world has always been born in the future, and the Mahayan Buddhism also believes that he has a unity of the world's endless Buddha, and there is an endless sacred sacred bodhisattva under the Buddha's education, so he can't be all available here. Enumeral, just some famous Buddhas and Bodhisattvas and some are from the ancients.\n\nBuddhism believes that the world has all the days, hell, and the \"species\" of the animals, people, and the people. There are ghosts living in the sky, the world, the ocean, and the void. As a guardian of all beings, protecting the law and ghosts of the Buddhism, it is generally believed that there are eight people, called Tianlong Babu. In the later development, Buddhism will also absorb the gods of the outer road into the law-making law system.\n\nBuddhism has the deepest influence in Asian countries, and Buddhist thinking has integrated into the lives of people who believe in Buddhist countries. Although India has been a prosperous land of Buddhism, but today, it has been in the border of China, and Buddhist beliefs are only strong.\n\nAt present, Buddhism is mainly distributed in mainland China, Taiwan, Japan, South Korea, Mongolia, Vietnam, Singapore, Cambodia, Thailand, Myanmar, Singapore, Malaysia, Sri Lanka, Nepal, Bhutan, Brunei and Australian Christmas Island, and also India, Bangladesh, Philippines, Indonesia, Russia and Kazakh, etc. have sporadic distribution, and North Korea is crushed because of the local North Korean government, and the number of people who believe in Buddhism is very rare. 99% of Buddhist live in Asia. Among them, Buddhism is a national education in Thailand, Cambodia and Bhutan. In recent years, Buddhism has also developed in Western countries such as the United States, Canada, Australia. 72% of Buddhists are religious minorities in their residential countries, 28% belong to most groups, live in 7 countries (Mongolia, Bhutan, Myanmar, Thailand, Liao, Cambodia, Sri Lanka). [2]\n\nIn recent years, the spread of Buddhist beliefs is closely integrated with charities. It is like Taiwan Buddhist group actively spreads Buddhism and developing charity in the world, making Buddhist beliefs no longer limit Asian regions, such as: well-known Ciqi Gong Dehui Province funded the Caribbean Haiti, the Buddha Mountain group established a Buddhist temple in Brazil, Argentina. In addition, the ACC organization (Amitabha Care Center) established the first Buddhist Temple in Malaway, South Africa, gradually expanding to Swashi Lan and Xinbawei, opening Buddhist beliefs and charity in Africa.\n\nGlobal Buddhists reach 500 million, the number of Buddhists is far less than Christianity (about 2.4 billion letter) and Islam (about 1.5 billion letter) [2] [5] [9]\n[59] [4] [7] [60] [61], but it is still still considered Christianity, Islam and Buddhism are the world's three major religions [62] [63] [64]. This is because although Hindu's social demographics reached 1 billion people [60] is much higher than Buddhism, but Hindu teaches national restrictions, centralized countries (such as India or Nepal), and Judaism also has national restrictions (for example: congregation leads to Gentiles It is not easy to advice), compared to Buddhism advocates equality, peace and fraternity, and there is no national restriction, so Buddhism is generally believed to be more suitable for Christianity and Islam and call three major religions in the world.\n\nAlthough Buddhism has experienced unparalleled glory in Gu Indu, its influence is also spread to all parts of Asia, but in India's local decay.\n\nBuddhism has established the first-class academic centers in Gu Indu, such as the Nago Temple and other universities are the highest academics of Dharma and the science and philosophy. However, due to the educational education of the ancient Indian Buddhism to deal with the upper aristocrats and keen on high-profile academic thinking, it is incompletely neglected to the communication education of the middle and lower class, and the group is gradually become the upper aristocrat. Believe in close relationships, alienating the elite group of the middle and lower class people.\n\nTherefore, Buddhism has not been able to establish a family tradition of the upper middle and lower class public as other religions such as Boiren (the current Hindu), so that Buddhism gradually lost the public foundation in ancient India. Once the support of the king and the aristocrats has accelerated Buddhism in the decline of the ancient India.\n\nSince Ayongwang, Buddhism Sama is forbearing, and in the late 12th century, the Turkic people who believe in Islam invaded India, they were not friendly. The Buddhist temple such as the Tharaoh Temple was flattering by the Muslim army. In particular, the Library of the Tharaoa is paid, causing a large number of books in Buddhism and ancient Indian civilization disappeared. The articles of the ancient Indian Buddhism in this period were almost lost. However, a number of secret monks fled to the Bangladeshi area to be scared, from this batch of monks changed their faces, usually the same as civilians, and married the wife and children, abandon the arms to avoid the persecution of the Muslo, only in the believers, wedding and funeral Practice. India's residual Buddhism will reserve this, and in the last century, Burmese Wang Lai Banglan, the Karama, all of the Karama, all the Buddhism of the upper part.\n\nThe Buddhist scholars after robbery multi-pace is far away from Tibet. Buddhist holy land, such as Lantan, which is born in the Buddha, is also ruins. By the 13th century, Buddhism has almost disappeared in His birthplace India. Until the end of the 19th century, a revival movement appeared in a 400-year-old Buddhism in India. In 1957, the Indian Buddhists organized Buddhist Party India Republican Republicans (English: Republican Party Of India). Later, some of the people were still trapped by the political route of the DSH. The party has a certain impact on Mumbai and other places. According to statistics from 1980, India has 5,554,000 Buddhists, accounting for about 0.8% of the total population. India's Buddhists have little proportion of people accounting for rare, but in India's ideological and cultural community.\n\nIn 1956, BR Abeada (Am Bagl / Br Ambedkar) launched Dalt Buddhist campaign and believed in Buddhism in 1956 with approximately 1 million, and BR Ambedkar launched. Rit Buddhist movement and followed by about 1 million followers Buddhism. Ambedkar has revived Buddhism in India, and he is called Bodhisattva. In 1951, India's Buddhists were only 181,000. After this shift, Buddhists increased from 1600% to 3.2 million in 1961. [65] In 2011, India had 8,500,000 Buddhists, of which 7,300,000 (87%) were Ambedkar supporters. [66] [67] In the total number of Buddhists in India, the Maharashtra is 6.5 million Buddhists (77%). Ambedkar is the founder of India's greatest leaders, human rights activists, the author of the Indian Constitution, and the founder of the India Republic. Ambedkar has revived Buddhism in India, and he is called Bodhisattva. In 1951, India's Buddhists were only 181,000. After this shift, Buddhists increased from 1600% to 3.2 million in 1961. [65] In 2011, India had 8,500,000 Buddhists, of which 7,300,000 (87%) were Ambedkar supporters. [68] Maladian Buddhist community is the largest Buddhist community in India. In 2011, Maladian Buddhists exceeded 6.5 million, they lived in Maharashtra. [68]\n\nIt is generally believed that Buddhism is incorporated by the Western Field of India in the end of the Western Han Dynasty, and the Eastern Han Dynasty. According to the record, the Han Mei Diyuan Yuanshu (the first 2 years) Dr. Jing Lu (Qin Jingxian) broke the Dali, the Dali King, the Dali, the Buddhist classics, the history book called \"Floating String\", but not Strong from royal family. In the Eastern Han Dynasty, Ten Years (67 years), Hamming Emperor saw Jin people flying in the main hall, the Minister Fu Yi told him that \"Buddha\", so he sent Cai Wei and others to Tianzhu, ushered in Gaya Mori and Falun two Gao Yan, and brought many Buddha statues and Buddhist scriptures, with a white horse camel back to Luoyang, the emperor's deceived people changed their summer palace to the home to let the monks stay [69], translate \"forty-two chapters\". That is, now the white horse temple. Therefore, in the history of Chinese Buddhism, more than ten years of Hamming Emperor as a Buddhist introduction. Baima Temple became the first Buddhist temple in China. \"Forty-two chapter\". Later, Chu Wang Liu Ying used Huang Lao (early Taoism) and the new Duo (Buddha) to make a confidential rebellion, Chu Wang smoke, the emperor ordered Huang Laogao and Buddhism, but Huang Lao Road and Buddhism were in private secrets spread. Han Di, the Han Lingdi period, a lot of the Huang Emperor, Buddha's ancestral hall. Many Western Western monks in the Han Dynasty, such as An Shi higher Buddhist translatters have begun to introduce China to introduce Zen and the Buddhist classics into China. An Shigao has passed the most prestige translator in the early days of Buddhism. Its translated media is more sound, including \"people's own wisdom\", \"unusual and secrecy\", \"Yin Hold\", \"Decuting the Second Site\", \"Aiji Five Five Four Four Edition\", \"Twelve Breatus\", \"Eight Words\", \"Zen Method wants\", etc.\n\nThe Wei Jin Dynasty, Buddhism has a deeper popularity in the folk, \"Sui Shu. Economic Zhi Four\" records: \"Wei Huang Xiaoxiao, the Chinese Started by Buddha, shaving\" [70]. During the Nort-North Dynasties, Buddhism translators such as Morosh, Buddha Luo Luo came to China to make Buddhism greatly promoted. After the Xianbei Tuoba is in the main Central Plains, it will accept Buddhist thoughts, and use it to teach folk customs. Therefore, from Wei Taizu Tuo, the Wei Dynasty rulers have salute Buddha Shamen, Tuoba The same is true at the beginning of the place, and each trister is talking about.\n\nDuring the position of Northern Wei Temple, he was in place, and the north of the Yangtze River was unified. He first Chong Buddhism, after the influence of Taoism, he took the teachings, and privately, in the 440th, the year was Taiping Zhenjun. It is believed that the Buddhist system \"Xiqi is average\", \"for the world is full\" [71].\n\nTaiping Zhenjun five years, 禁 王公 以下 以下 至 私 人 人 人 人 人 人 私 高In the seven years, Taiwu Diji arrived in Chang'an, and he saw that there was a weapon in the Buddha Temple, and it was also found that the wine, the treasure treasure, found that the monks and rooms were private, that is, the ban. [72]\n\nSitu Tri Hao was so extracted to the sky, destroying the temple (71). In March, the Emperor Xiaoman Shamen, and left the prince who left the flat city or waited to abolish the national Buddhism [73]. The Prince respects Buddhism, slowing the script, making it far away. [74] Therefore, the Quartet Shamen has escaping, the gold and silver Buddha statue and the script are secretly collected, only some of the monks are killed, and the Wei's temple building is more destroyed [75].宦 宦 宗 爱 太 武 帝, Li Nan An Wang Tuo Kebo Zhen is an emperor, but also kills Bozhen, the minister Liu Ni, Yuancome, etc. Dharma. Buddhism is still recovered.\n\nLater, Northern Wei split into North Qi and North Zhou, and the Gao Ye had ordered the deck. Beginning in Northern Monday, I also respect the Buddhism to Zhou Wu Emperor's swelling, so I have to explore the Buddha to the Buddha in the world, and the monk Taoist eliminated the civilians or arms, the Buddha statue camped money caused weapons. Later, after the death of Wu Emperor, Sui Wen Di Yang Jian resued Buddhism.\n\nThe Nanliang Dynasty Liang Wu Emperor Xiao Yan advocated the Buddhism and went home many times. In addition to their own Buddha, Liang Wu Emperor also vigorously supported the development of Buddhist career. In Liang Wu Emperor, \"Break Meat\" before the Buddhism, \"There is no broken meat method\" [76], Liang Wu Emperor believes that all Buddhist monks should comply with the Mahayan \"Dawei Nirvana\" does not eat meat [77], so The promulgation of \"breaking meat\" is prohibited from eating meat, and I also eat, I have done it, open the tradition of Han Chuan Buddhist vegetarian food. After the Han Bi Buddhism group began to comply with Van.com [78].\n\nSouthern Dynasties Since the Jin Dynasty clothes, the large number of monks are also transferred, and the Dharma is prosperous, and the most famous is the net Tuzong. Tiantai Zong is also developed in the South Dynasty. The emperor has built a Buddhist temple, supporting monks.\n\nZen Legend Generation Bodhi Mapoa Southern Song Dynasty, the Bank of Commerce Arrival arrived in Guangzhou, from learning to find the Hall, and then taught the disciples of \"Sangha Jing\", which is one of the Sangan. After the Liang Wu Emperor believes in Buddhism, so he is to Jiankang (now Nanjing, Jiangsu Province) and its discussion. At that time, Liang Wu Emperor won the Buddha law. Dharma was broken, told Liang Wu Emperor without merit, both parties.\n\nDamo knows that Liang Wu Emperor can't accept such advanced thoughts, so I will leave the south, \"a reed River\", in the mountainous wall of Shaolin Temple in Henan, waiting for the pass. After the pass of the second ancestors (487 - 593), Sanzu Yuliu (? - 606), Siupu Daoxin (580 - 651), Wuzu Hongle (602 - 675), Liuzu Hui Hui Can (638 - 713). He spread Sangagong to northern China, landing roots, becoming a unique martial art. But Zen is still not popular, and it has been in accordance with the Lifen, and the Tang Dynasty has a formal Chan Temple.\n\nTang Jianjun, the problem has been turned out one by one, but the Fu Yu, who is Tai Shi, believes that Buddhism and Taoism are violating the way Kong Meng's way, but the country is not good, so there is a order: \"Pseudoh, is a non-unknown, state Don't have a temple, stay thirty, all the people. Sino-Wude Nine years, Gaozu has promulgated the priest: \"The three of the Beijing Temple, the second place. The rest of the world will stay, Yu Si,\" Taizong led the soldiers to the Sui Yidu Life: \"Waste Road, Chengzheng Ni is a famous German hundreds, and the rest of the festival.\" Taizong successively after another three sessions. According to \"Continued Higher Biography · Ming Gu Chuan\" record: Yuguan, Ming Gu, in Chenzhou, judge, and only thirty. According to \"Zhi Zheng Chuan\" record: the first year of the nuts, the sentiment of the book, the Royal Shi Du Yun, the Dharma, the Qing Dynasty. \"Fa Chong Biography\" records: \"The first year of Zhun, there is a private person to the criminal. When there is more than a fugitive, the capital is poised.\" \"French transmission\" also records: \"Tuanji three years, The world is binding to the privateness, no out of the person, smelling this. There is also the prime minister of the prime minister Di Renjie, Li Wei, Suhuan, official to the hunting history, the prime minister of the prince; Zhong Zong Dynasty Wei Yili, Yao Chong, Yu Shin, Waiter, Song Duang, Qingyuan, Temple in the Hall of the Temple to serve Lu Yuantai; Ruizong Chao's prime minister Wei Zhi Ancient, Zhongshu, Master, 漼 漼, 太 太 洗 洗 洗 洗, 谏谏 大 大 原 原, Taiwanese and Waitong Hui people; Su Zong Dynasty's prime minister Zhang Hao; the prime minister of the DPRK is often 衮, the high-rise (De Zong Chaoyou), Dongchuan Festival makes Li Shuming; De Zong Dynasty staff Bole, 即 相 洎 洎 洎 洎 人 人 人 人 人 人 人 人 人 人 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像 像劳 劳 以 存 直 直 直 直 直 直 直 直 截 截 截 截 截 截 截 截 截 截 截 深 深 深 觉 截 生 护 觉 觉 饰 深 觉 饰 深 深 饰 饰 护 护 深 土 营 深 营 深 深 深 深 深 深 土 解Knowing, because of the mind, you can't see you. \"The high-graphic seal of the temples> The same and two teachers, he pointed out that\" Buddha does not do, you can't have a difference; Therefore, \"therefore opposes Dezong as the first Queen, the temple, the temple, Xing Fuxi, is divided into disaster. From the front of the Buddha, there is a problem today, and today is all true.\n\nAfter the popularity of Buddhism, the impact of China's social, economic, cultural, and political all aspects made Han Yu feel the impact of severe drugs. He did not first solve the ideological problems from Buddhism. The external problem is solved. The book \"The Buddha Bone Table\" (\"Welcoming Buddha Summing Table\"), the Buddhist doctrine is unseaful, but the difference in the form of religious forms and the diligence of the life and death, it is indeed pair of agriculturalism and diligence. Nationality brings great impact and temptation. \"Customs Tong Jian\" Volume 24 〇 Remember: \"In the middle of the bones, the bones are allowed to stay in the third day. There is a burning arms to the servers. The Ministry of the Ministry of the Ministry of the Criminal Department Han Yu is cut, ... go to the table to be angry, show the prime minister, will add a little punishment. \"Although this case, although Han Yu is taught, it is temporarily calm. However, through his student Li Wei, standing in the Confucian position, retrieved the essence of Buddhism, rationalization and Confucianism, \"Since the Confucianism, on the one hand, Han Yu's turtlerance, on the one hand, in the new year of Li Wei Road, living in the realm of \"Jing Zen, Movement Confucian\", and they will be relieved and social events, and become the Journal of Song Ming. \"[79] [80]\n\nDuring the Song Dynasty, because many of the Dynasties of Wuzong Diwande, the Buddhism was disappeared. He went to the five generations of the north of China Zhou Shizong, and the world is united. The Buddha, and the Buddha is still casting money, and the monk Taoist is still ferrous or degrading. For civilians, the Buddhism is more snowing. In the Song Dynasty Buddhism, there was only the Zen and the pure land, and there was a slight Tiantai Zong, and a large number of Buddhism was lost, and they had to re-translate from India and the re-transportation of Korean Japan. The three have been favored by Zen, and the net Tuzong is in depth, Tiantai Zong is only attached to Zen. Although the Emperor Song Dynasty is good about Buddhism, when they are mainly tutorial; and Buddhism has been attacked by Confucian and Taoism, and Buddhism's Zen advocates clear-hearted perspective to oppose the monk believers to study the Buddhist scriptures, and the net Tuzong is in depth for many classics. It is also universal. The inheritance of Tiantai has long been broken. The scholar is only relying on their own understanding. In the face of Confucian and Taoist attacks can only be worthy of three homes to reduce conflicts. At Song Huizong, because the emperor Chongxin Taoist Lin Lingsin, Lin Lingsi originally Shami because of the teachings of the sneak drink, the arrogance to do the Taoist is said to repair the Rage faction, in order to retaliate Buddhism, Huizong ordered to change to Derse, Buddhism Tianzun, Bodhisattva, Rohan, Remitted. The monk dress should be the same as the Taoist; this order is some monk to commit suicide or is exiled. It is also the prince of the Prince's Qinzong invited the Western Regions to repair the tribute to Lin Linger. It is conquest that if Hu is won, the Buddhism will return Buddhism into the original look and remove Taoism. However, the Hu Yin of the Trichor was defeated by the Lake of Linger. I have been going to the floods, Lin Lingshen can't be saved, and the prince landed in the city to worship the four square water, Huizong ordered Buddhism to restore the original face, and do not have to be jurisded by Duo.\n\nIn the Southern Song Dynasty and the Jin Dynasty, the Japanese Golden Monks were actively studying Zen, but Buddhism passed Lin Lingsu's Taoism, and the two teaching in the folk misunderstandings were originally a family; the monks had only meditation, one in-depth Calling Buddha, no matter what these. However, Zen and the netizen, Zen can't afford to clean Tuzong, Zen 僧 believe that there is no need to go to the world, the heart is clean, so don't go to other worlds. The netizen of Zen Zen is unable to take off three, and repel the Zen unhappy Buddha statue, Zen is not a classic; and after the Zen gods, they are the mainstay of the Temple, such as Wuzu Temple, turned into Su Dongpo, Yandang The Shan Yan has turned into a story of Qin Yu and so on. The net Tang Zong and Zen have been the Ming Po Master of the Ming Dynasty, and the two arguments ended.\n\nThe rise of the Ming Dynasty and the Yuan Dynasty letter from the Demolition, and the red towel army was related to the white lotus, and Zhu Yuanzhang was born. Therefore, Ming Taizu established the Ming Dynasty to inhibit and utilize the mergers of religion, in addition to change the exam. Eightened the essay and revised the Taoist Taoist Taoist Method. And each of the emperor has to shave a monks; confirming the status of the three education, mainly hope to take this to compress the Monasi-Teaching and Malaysia and other religious organizations have changed again into the Anti-Dang, and I hope to use Buddhism. The power of religion and other religions to maintain social order, but strictly forbidden to participate in politics and the development of the \"Royal Food\", which has become the lack of spiritual innovation, and seeks from the general beliefs. As a comfort, the Northern Zhili soldiers rushed to use Zen thought and have created a well-known Luo Gu, and the non-born parents of Luo, which affected all folk sects.\n\nAfter the mid-Dynasty, the Buddhism was strengthened by the royal religious activities and the Confucian contradictions. This contradiction has prompted some of the people to strongly oppose the construction of the temple and publish the Buddha's speech. It is still the effort of Confucian political social philosophy and relying on the group of Si Dafu [81]. The change factors and contradictory sources, in the penetration of the public to the national regime, the royal specialization behavior, the people of the people, and some people's three-school cross-belief integrated, some officials believe that Catholicism is looking for new ideas . The public (sentient beings) asked God to worship the behavior of the Buddha, essentially the misunderstanding of Buddhism. [82]\n\nThe Ming Dynasty has the same difference between Tibetan Buddhism policy and the Buddhist policy of Han. One of its important differences is that the Ming Dynasty is closely related to Tibetan Buddhism policies and the Western Border Policy, and the Chinese Buddhist Policy is basically unrelated to the peripheral relationship policy. In addition, some Shi Dafu's \"Fan\", \"Tibetan\", and the degree of identity is inferior to Buddhism in the Mainland. Ming Dynasty, some emperors were \"spells\" because of the lama of Tibetan Buddhism, and they have special interest and thus causing criticism of Scholars to relevant policies. [81]\n\nPart of Chinese Buddhism and the branch, the Taiwan Buddhist system was passed down by the China Minnan area, and the secular belief system (which represents the rock and sorghum beliefs) for its major characteristics, with the jungle system mainly owned by the people (with four Dafa veins are representatives. During the war of Taiwan, the Chinese Buddhism Buddhism in China was introduced into the Jiangsu Zhejiang system, covering the original native Buddhist power, making the original local Buddhist system often misunderstand. Japanese Buddhism came from Japanese Buddhism, and a total of eight 14th Japanese Buddhist Party came to Taiwan. After the war, he withdrew from Taiwan due to political factors. After lifting the martial law, he returned to Taiwan to Hongfa. In addition, there is still a Tibetan Buddhism and the inner Buddhism. About 35% of Taiwan is a Buddhist, but its beliefs may be with other Taiwan folk beliefs such as Taoism, Confucianism or consistent road, and even have overlap with other emerging religions.\n\nFrom the Korean Peninsula, it has been rejected by the local gods, and the Suhe has played up for more than a decade of war with the Buddhist Buddhism. The leader of the final material was shot, Buddhism was only spread. In the safe era of Japan, the two sorghum, the sea and the most clear to China to learn Tutan and Tiantai Zong. Back to the Japanese Air Sea to create a true freewor to establish Gaoani as the fundamental road, and the most clearly established Tiantai Tianda Triao, which is still until Japanese Buddhism. Two businesses. Modern Meiji-dimensional emerging, disrupting Buddha, ordered the new Taogong Officer to restore Buddhism, and allows monks to be eating meat to eat meat, forming today's Japanese Buddhism. But Japanese Buddhism still has a monk who strictly presses the commandments. It is about 70% to 80% of the people in Japan. When the Japanese die, it usually holds a Buddhist burial instrument, so many Japanese Buddhists today are just in the form of Buddhists, only participate in the funeral and the ancestral ceremony.\n\nAfter China's introduction, the Buddhism in the Three Kingdoms and the Korean period, when Li Chenggui established North Korea, because Zhu Yuanzhao looked over the Gaoli Dynasty (Li Chenggui adopted Chongruo policies, causing Buddhism to fight, even sometimes It is considered illegal, and if there is no holiday, the monks must not enter Beijing, and the status of monks is at the bottom of the society. When I arrived in the North Korean, I would like to organize three thousand monks to resist three thousand monks, and I have a breath of the court. After entering the Seafood Retrocession, the Korean Governor's government lifted all kinds of prohibitions in Buddhism, Buddhism, and the Governor's government allowed monks to eat and marriage. At present, there are more than 20% of the Buddhists in Korea, compared with Christians [83], now \"Cao Xi Zong\" belongs to the Zen Gate, is the largest, most authoritative in Korea, the most authoritative, all walks of life. A relative. \"Cao Xongzong\" is extremely influential in Korea, which is considered to have the power of the South Korean election. Whether the President's candidate will be willing to go to the \"Cao Xi\" temple will be willing to visit the temple of Cao Xionzong after the new Korean president. In North Korea, due to the official relationship between the official Buddhism is limited.\n\nThe United States \"Christian Science Monitor\" Points on September 14, 2006, Buddhism pointed out that Buddhism has developed rapidly in the United States. It has believers 1.5 million. It is the fourth largest religion in the United States. One third of them is later to change Buddhism. And pointed out that one of the most attractive Westerners in Buddhism lies in that people think that the outstanding Buddhist masters like the Dalai Lama and a line of Zen are to contribute wisdom to the society, not what others believe in. \"[84] According to Association of Statisticians of American Religious Bodies In 2010, most American Buddhism lived on both sides of the country, about 75% of Buddhists lived in a population of more than one million, and California San Jose is the highest in the proportion of Buddhists. Zone, accounting for 1.25%. Many Buddhists are Jews. [85]\n\nEuropean intellectuals have been interested in Buddhism since the 1870s, such as Artist Arthur, Uncle, Nietzsche, and mystic, such as Helena Bravitzky, is affected by Buddhism. The European Buddhist Alliance is the largest Buddhist organization in Europe, which is estimated to have more than 1-4 million European Buddhists. The conservative estimation of the academia is more than 100 million. [86] [87] [88] [89]\n\nIn the early days, Buddhism is a period of the historical staging of Buddhism in the academic circles, refers to the period before the foundation of Buddhism to Buddhism to Buddhism.\n\nLegend has it for three months after Nirvana, five hundred Arun Have the first settlement, from Excellent wave to the law, A is difficult to come out, and spread in the way. The mainstream academic point of view believes that the title is gradually improved after the division is divided. However, the Buddha's era may already have an argument in the Ajima maicu (Mātŗkā).\n\nThe Buddhist Teacher has a fundamental split by two hundred years. Due to the difference between the commandments, the disorder is different, resulting in the era of the top part and the public. After that, it was divided again, and finally the 20 (or 18) part of the part.\n\nThe traditional Buddhist doctrine of Mahayana will be regarded as a small Buddhist Buddhism that onlys seeks their own salvation. However, there is no Buddhist teaching group that claims to be \"small\", \"small multiplication\" is the title of the big Buddhism to the ethics of other Buddhist paradis, and the objects of the beings are especially the pets, and they are said that everything is [90]. (At that time, the Buddhist sects had the use of the sect of the sect of the best, such as that all have parties, said that the department is unknown, it is a dark fruit, the \"Island History\" of the South Passage, said that the parties are thorns)\n\nSince the word \"small\" contains the meaning of derogation or secting, the academic community has gradually not used this word. [91]\n\nThe upper part of the Buddhism, Buddhist Zone, today popular in Sri Lanka, Myanmar, Thailand, Cambodia, Lauga, China Yunnan Yi people, etc., and some ancient India has existed in Bangladaji Dagang Mountains (and Moram, Nuram, India). State, Arunachal, Aunlona, ​​is listed as the most basic bobics of existing Buddhist Buddhism.\n\nBecause of its Zi San Tibet, Bali is the Holy Deminger, so it is also known as the Balli Buddhism, Bali Buddhism. Because of its southern Southern Ceylon and Southeast Asia, it also called Nanchuan Buddhism; and the North Pass to Central Asia, China and Northeast Asia's North Biography is relative. Nowadays, the top department is Buddhism, from the Sri Lanka's surveillance, respectively, said that the temple is inherited. Nowadays, the top, Buddhism, from the Sri Lanka's surrounded, said the Basih Temple (Mahāvihāra-Nikāya).\n\nMahayana Buddhism, Buddhist Zongpai. At the beginning, the mid-term Buddhism was circulated in mainland China, Hong Kong, Macau, Taiwan, Japan, North Korea Peninsula, Singapore, Malaysia, Vietnam, etc., became a Buddhism in Han Chuan. In the late, the Mahayana Buddhism was introduced into the area of ​​Tibet, Mongolia and Russia, became Tibetan Buddhism and visited parallelism.\n\nThe Mahayana Buddhism complies with the A Hanjing and Dajing Jing, and the teaching is self-rolland, which is divided into Buddha and is divided into Chinese view and the privilege (or think there is such as Tibetan School). The teachings are based on the three-lying and five rings, the four sacred, and the twelve causes, and I have a six-degree polish to practice Bodhisattva with a Buddha as the ultimate goal.\n\nFor one of the Chinese pass Buddhist Zongmen, it is passed on China, which is introduced to China since India. It is the same as the imperial man of Maitreya Bodhisattva, and the world is in turn, the world, Chen Na, the protection method, the sages, Xuanzang, peek, Hui Mark , Zhou. Zu Ting is the Shaanxi Dawen Temple, so Ci Enzong is also known.\n\nThe basic education of French is \"French Items\", which proposes \"three people\" based on this view.\n\nLegend has it in the way of the Buddha's heart in the Lingshan Fa, and the Buddha's heart was posted to Zen ancestors. After the Capricorn, Zenmen sent from the Capricorn, until the 28th generation of Zen Zongshi Bodhidda Mozhong sent to China. Its Acting is located in Wuzu Temple in Wuzu Town, Huangmei County, Hubei Province.\n\nDuring the North and South Dynasties, India's monks came to China to create China's Zen, advocate \"not standing in writing, teaching; directly refers to people, seeing sex into a Buddha\" method, has become the basic education of Zen. Zen believes that liberation is not outside, and there is no need to use classic guidance. The way is to be in the hearts of the human, as long as it can put down the persistence, let go of yourself, it is free.\n\nZen will use the \"Diamond Sutra\", \"Liuzu\", \"Yuanjue Jing\", \"Vivo\".\n\nIts practice method is mainly four Zen, including\n\nNine times the second four Zen four no-color set (4 Zen eight) is not a Buddhist unique, and there is a practice in the ancient Indian. However, the death of the Buddhism is alone, and Buddhism believes that nine times are unworthy, but they only have the Buddhist saints of Ana or Arrahan to enter, and the fourth Zen is the most suitable meditation for the practice of wisdom.\n\n\"Dazi Nirvana\" describes the Buddha in the arrest of the Galone Rooseo, first entered the nine times, and finally entered.\n\nAccording to Zen Legend, Bodhi Mo Mo is Zen ancestors (China), the second ancestors, the three ancestors, the four ancestors, the five ancestors, Lu Hong, there are two disciples of the show, Huilong, two According to one party, the Zen Master was honored as the six ancestors, changing the courtesy, and there were Northern Xiu Southern energy, and these two inherits were called Bei Zongchan and South Zong Zen. After experiencing a series of debates, I finally debated the victory in the slide conference in the slide conference. It became the mainstream of China Zen, \"Six Ancestors\" The word is scheduled to be. Huiliang no longer passes the clothes, so that all disciples are free to play, their sects have developed to the size of the five seven pieces, and it is great. Five seven schools, mainly in the stone, Hongzhou. In the case of the Hongzhou Road, Cao Cong, Yunmen, and the Human Dynasty are under the door of Shizhou Road:\n\nSince the Tang Dynasty, Zen is very prosperous in China. Zen thought itself has experienced a lot of development, and has produced a lot of influence on China's literature, art, and ideological culture, and passed into Japan, Korean Peninsula. Chinese character cultural circles such as Vietnam.\n\nThe broad pure land beliefs mainly include the Western Pure Land, Maitreya Pure Land Belief, the Pure Land Faith, Pharmacist Pure Land Faith, etc. The common point is that I hope to pass the Buddhas and Bodhisattva, from this world (turbidity), can enter The pure land where the Buddha is located. Therefore, the pure land belief is the form of beliefs that are particularly advocated in Buddhism. In the faith in many pure land, the Western Pure Land Faith is most prosperous in China, and has developed a \"net Tuzong\" in one of China Buddhism. The net land will be named after advocating the pure land method. The net geothepan is mainly belief in Amitabha and Western bliss world, and his ancestors are considered to be in the East Jin Huiyuan or 昙鸾, and the ancestor is awarded, good guidance, etc., and becoming an important force. . Its Australia is located in the Xiangji Temple of Shenheyuan, Guo Du Street, Chang'an District, Xi'an, Shaanxi Province, China.\n\nAlthough the source of the pure land thought is in India, it has become a sect in China. Its main content is to rely on forty-eight great willing, through the \"Buddha\", and become a genus of Amitabha by \"Buddha\". About the Buddha, including the \"God of Buddha\", \"Treat Buddha\" (即 即 佛 \"(即 即 名 号), the academic community generally believes that the way to read Buddha is the early net Tuzong practice, and the Buddha is popular After the road.\n\nThe net Tuzong has a major impact on Japanese Buddhism, which not only passed the net Tuzong, but also derived an important sect called the Zhenzhou Zhenzong. There is also an influence on the thoughts of Japanese Lianzong and the true words.\n\nThe net Zongyi can be summarized as: \"Let's believe in Amitabha to save,\" I hope that the Nighta Buddha is known; \"I hope that the Navita is pure land, and the Guangsheng is all sentient.\" It means \"letter\", \"wish\", \"line\". I believe there is Amitabha, and I believe that he has sent forty-eight great wishes and has been successful, this is a letter. Then, according to the \"no amount of life\", it is willing to born to the Western pure land. Because there is a thirteen, including \"Live\", \"Separation\" and \"Run\", in order to ensure that it is born, it will be unbelievable, which is not chaotic, and this is \"line\".\n\nThe net Tuzong will also be dedicated to the pure land five passage: \"Amitabha\", \"Viewless Strong Strike\", \"Quasi-Quality\", \"Hua Yan Jing\" \"Pu Xian Bodhisattva\", \"Shu Jing Jing\" \"Great to Bodhisattva Buddha Round Times\", \"Bring theory\" as a syllabus.\n\nThe net Tuzong can be divided into top, middle and lower three products in the middle, middle and lower three products in all generations.\nAnd the clearance Master also proposed that the net Tuzong practice needs to be based on the net industry, including: filial parents, feature teachers, child is not killing, repairing ten good industries; two are hosted three returned, unfair The triple bodhi heart, convinced that causal, read a big multiplier, persuaded.\n\nModern scholars believe that approximately 6, 7th centuries, secret education. Some people think that taught is a major Buddhist absorption of some ideological theories and practice methods of primary Poemon and sexuality. [92] The teachings and the larger Buddhism are also based on the three law printers. In order to hopes to become a Buddha, it is in the practice of the common way, in the centrifuge, Bodhi, \"Concerns\" Waiting for the practice of stopping, thus rapid accumulation of Ford and Wisdom.\n\nAt present, the Trin Buddhism of Han Chuan Buddhism is only retained in Japan, and local has been lost. Tibetan Buddhism is mainly mainstream.\n\n[Edit in Wiki Data] "}