{"chinese_title": "imaginary ", "chinese": "The fiction is imagined in the art of fantasy and art. Such as: writers in the creation process, based on life logic, through imagination and match, create things that do not exist in real life, but affordable things.\n\nFiction often appears in different works, such as novels, plays, movies, moving comics, etc. In order to distinguish between the real life, the author will add \"this story is purely fictional\", \"if there is a realistic coincidence\", and it can also prevent unnecessary laws.\n\nIn some fictional works, it is not suitable for many real things, or the real life is not enough to support the background content of the work. For example, in the \"Fantasy Country\" in the famous children's literature \"Alice Dream Tour Xianjing\", there are many people who speak. Through this setting, the plot in the virtual work can be pushed very smooth, so these fiction settings are very important.\n\nSometimes authors will adapt in realities in content, such as reducing mice into Mickey mice, cats change to Dora a dream, etc.\n\nOn the other hand, some things in real life will have copyright issues. If it is mentioned in the content, it is likely to violate the law. Therefore, in order to save trouble, the authors usually set fictional scenes directly, and avoid reality and places into the story. For example, in the game Winning Eleven, because the work is not accessible to most copyright holder, most of the game, the team, even the name, the team emblem, the team emblem, etc. It is built in the form of a film. For example, Barclays Premier League uses ENGLISH Premier League, the European Champion League uses European Champion League, and the team's Axus is more images like North London Reds. Although this approach may make the game feel, it saves a lot of copyright costs for producers.\n\nHowever, all things use fictional settings, may make content convictions and topic, such as Gossra, the author will also arrange it to destroy the Tokyo Tower and Tokyo Dudu, if destroy is false buildings It is indeed that the shock is insufficient, so the fictional work also requires the right amount to set the real content to increase the inference.\n\nFictional roles may be realized in response to market reactions and practical needs, such as in some large exhibitions such as World Expo, the organizer will set some mascots, then build a series of scenarios. These virtual factors are realized. And Santa Claus is a representative of the \"Santa Association\", \"Santa Village\", etc. in reality, and the people who believe in Santa Claus \"dream come true . At present, it is a very common business behavior of fictional roles and scenes, because such products are often easily intimate.\n\nIn addition, some \"fiction settings\" used in the fictitious works can actually be intentionally implied or moving with the reality. The author will reality to the number, sometimes the effect of satiric disadvantages.\n\nThe fictional world is also known as an overhead world, a unreal world that is completely conceived by the author, including historical background, biological, race, religion, language, geography and even the universe, like JRR Tolkin's \"Rings\" series There is a fictional world.\n\nIt means that there is no existence in reality, and the country produced by people. Most of them appear in a literary work or a movie plot, but do not exclude the possibility of making a fictional country in a very small number of entertainment purposes.\n\nRefers to any character, personality mask and identity that appears only in a novel, anime. The process of creating roles and characters in the novel is called \"English: Characterization\".\n\nFor a part of the fictional set of artificial language, such as the language set in book or fictitious, the fictional language is the language set for a fictional world, and is usually more depth and in the fictional world associated with them. The reasonable performance is designed.\n\nIncidents, legends, myths, or weapons that do not exist in reality. The Qinglong, the \"Three Kingdom Romance\" in China 's classical novels, Zhang Fei, who holds the eight snake spear.\n\nFictional religion refers to a fictional religion, sect, or cult, more appears in science fiction, movies, etc., may also be spoof for some religions, such as flight surface; or belonging to network culture and netizens participating Spoof, such as spring brother. "}