{"chinese_title": "Religious philosophy ", "chinese": "Religious Philosophy (English: Philosophy of Religion) is a philosophical thinking about religion and the problems and ideas. The topics of religious philosophy include: God's presence or absence, God's attributes, religious and scientific associations, religion and morality, good and evil nature [1].\n\nReligious philosophy and religious philosophy have different philosophies, and the former is standing outside of religion. Therefore, people who study religious philosophy don't need any religious beliefs.\n\nReligious philosophers have more research on God's essence, similar propositions are:\n\nThe above proposition is derived from countless related philosophical thinking and paradox. For example, about several characteristics that are often used to describe a single god of Christian, will have the following related thinking:\n\nAll known - The Lord is often considered to be a whole, but this character threatens the freedom of humans. Suppose God is a whole, then he will inevitably know what someone will do (for example, a particular event is completed). Once God knows that someone will complete the event in the future, this person will definitely do this, because God is \"all\", so it will not be checked. However, if the human beings are free to conscious, can this person can't choose to avoid the event? Considering the recognition of God's titles, this person's free will cannot do any impact on the development of future incidents, then deny that humans have free will. So God's \"titled\" and human \"freedom will\" are contrary.\n\nYing Shi - The Lord is generally considered eternal, and his existence has not ended. So, there is no \"past, now and future\"? Or is God existing outside? If God is in time, God should change due to time, and how can I be eternal? If God exists in time, how do he have any exchanges in the time? Is there anything that can exist outside time?\n\nCharity - Is the goodness of the LORD and human understanding? The reason why good things is because God specifies that they are good, or because they are so good, God has stipulated that they are good? God is charity because he is only a charity, because no matter what he does is charity? [2] See the Watcuple Flan Distress.\n\nOne of the main topics of religious philosophy is to inference whether God exists. On this issue, many well-known philosophers have elaborated their opinions. For example, ancient Greek philosopher Aristotle has proposed that every sports object has its due fact. If we trace the causal association between objects, we will inevitably find a \"non-moving actor (English: unmoved mover\", which is the beginning of all sports or the first athlete. And this is God. [3] The following is a few famous demonstrations in the religious philosophy.\n\nOverall, scientific is committed to studying the world that can be observed, and religion involves non-substances, unable to use the sensory to directly notice. History, science and religion have lived peace. In today's scientific, a religious philosopher believes that religion and science are incompatible, and the other party believes that science and religion are two separate areas and do not affect each other. [9]\n\nMany great scientists in history, such as Newton, Descartes, Cartier and Bacon are compatible supporters. Compatible the alarm division. A distribution believes that scientific research can make people learn more about the natural world created by God. The more you understand the mystery of the natural world, the more you can experience God's greatness and universal.\n\nAnother faction of compatibility believes that science and religion are two areas of interference. Scientific research is the natural world, and religion involves non-material world. Since both research areas are completely different, then there will be no contradictions and conflicts.\n\nIncompatient thinks that science and religion are not able to be correct at the same time. If the religious belief is correct, that scientific is wrong. And if the science is correct, the religious belief is wrong. Does notachaists often raise evolution as an example. If the evolution is correct, the God of the Abraham, which is said to the God's deeds will definitely be wrong. "}