{"chinese_title": "South America ", "chinese": "South Asia Mergence (Spanish: Sudamérica or América del Sur; Portuguese: América Do Sul; French: Amérique Du SUD; English: South America; Dutch: Zuid-amerika; word source: Amei Give Visphi) It is referred to as South America, one of the seven continents, located in the south of the West Hemisphere (or the southern Hall), the western South Pacific, the west is the Pacific sector and the Nasca board. The pacific sector and the NASC can be tension, derived from the eastern Pacific Hailing; and the Nasca Plate and the South American section of the South American sector are squeezed, derived the ditch belt of the Peru Chilean ditch, and Under the South America sector. It is the Atlantic Ocean with the east, and the north is the Caribbean. South America is part of the south of the American mainland. The west has a daytime, thousands of towering Andes Mountains, mainly plains, including Amazon Rivers and Amazon Tropical Rainforest.\n\nSouth America has an area of ​​17.84 million square kilometers, accounting for 3.5% of the surface of the earth. Until 2011, the South American population has been 80 million, and the world ranks fifth. Among them, Brazil is the largest in South America, accounting for about half.\n\nSouth America has a diverse terrain, with long-towering reasons, ancient crystalline highlands, river allume plains and basins. The rehabilitation mountain range extends from the Mexican plateau to the Andes Mountains; the ancient crystalline rock formation is located in the Brazilian plateau, Guyana highlands, rich in metal minerals, and Copper ore in Chile is also in ancient geology. The plains of the rivers include an Olino Basin, Amazon Basin, Labrada Plain, Pengbara.\n\nThe Andes is 6,400 kilometers long. It is the longest mountain of the land, the highest mountain is Avoida Mountain, high 6,962 meter [2], Heng Venezuela, Colombia, Ecuador, Peru, Bolivia, Chile, Argentina. The southern part of the Andes Mountains have a number of row of Cidilera Mountains, with an average altitude of about 3,350 to 3,900 meters, which have an Atakama Plateau. Mid-Armed Andean Mountains is about 3,000 to 3,600 meters above sea level, divided into east, west, there are Bobith, Lake Michara. In Peru, it is also divided into many mountains, and there are many live volcanoes, including Qin Borato volcano (6,310 meters), Cota Park (5,896 meter). In Colombia, Colombia is divided into three Venezuela, which is finally turned to the northeast, forming the Merida Mountains.\n\nGuyana Highlands is a low-end land in the southeastern part of Venezuela, which extends to the southeast from the southeast to Gaia, and North of Brazil. There are many cliff waterfalls, the world's highest Angel waterfall is here.\n\nThe Amazon Basin has been accomplished by the Amazon River. It belongs to the tropical rainforest. It is not suitable for people. It is the world's largest tropical rainforest, the title of the earth's lungs, with an area of ​​about 6.5 million square kilometers.\n\nFor an ancient crystalline rock formation, several minerals have several minerals, located in the eastern part of Brazil, and the main city of Brazil is in the eastern part of Brazil.\n\nIt has been extended from the Rarawa to extend from Argentina to Paraguay and Uruguay. West Nest Mountains, Northeast Picking the Brazilian Plateau.\n\nFor the southernmost mountain group in South America, it belongs to the highland climate. Its east is the origin of several rivers. The original covered large forest is now developed as a ranch.\n\nThere are several rivers in South America, more famous with Amazon Rivers, Olino, Labrador; Main lakes, there are other lakes and Malaku (lagoon).\n\nFor the world's traffic, the largest and second long river, the origin is 150 kilometers from the End of the Andes Mountains, and the river is bent, there are many branches, and finally gathered to Malau Island. The river has two algorithms, one is to count from Lake Lake Lake (the source of the Midira), about 6,280 kilometers long. The other is counted from the Lake Belavro, about 6,449 km.\n\nFor the world's highest air transport value, the sea level is 3,812 meters, with an area of ​​8,290 square kilometers, about 177 kilometers long, about 56 kilometers wide, and 475 meters wide. It consists of Lake Chukuito and Virgina Maca. The south bank is the palace of the Empire.\n\nLocated in Venezuela, Tavrao Bay and Venezuela are approximately 210 kilometers, with an area 13,210 km.\n\nThe broadest area in South America is close to the equator, the temperate land area is small, with a small temperature band, and the tropical range is large. The Amazon Basin and the Eastern Tropical Rainforest of the Highland in Guyana. The Olino Basin, the western part of Guyana and the Brazilian plateau belong to a tropical grassland climate. The Andes Mountains are all highland climate. Peru, the northern part of the Northern Subtropical High Pressure, the East Southeastern Letter and Peruvian Cold Flow, forming a tropical desert climate. The middle of the Chile is a Mediterranean climate in the winter rain in summer. Strip Temperate Temperature Temperature Temperature Tape Chile. The eastern Labrador Plains is a humid climate in summer rain. Pengbara is a temperate steppe climate. The Patagonia plateau is a temperate desert climate.\n\nSouth America is mainly affected by three major disasters, which are earthquake, volcanic eruptions and El Niño phenomena, causing incidents such as human casualties, property damage, and impact on a country. In addition, in the northern Venezuela, Gaian and Surikan and other coastal areas will be invaded by the hurricane.\n\nThe mountainous movement of South America is squeezed by the South American sector and Nasca plate, forming the Andes Mountain, which is a new pleated mountain range, which is also distributed in many live volcanoes. In the past 150 years, 4 major earthquakes have occurred. The first time I have occurred in Ecuado and Colombia in 1868, the number of dead injuries is about 70,000; the second occurs in Qi Lian (Chile), the earthquake strength is the scale 7.8 30,000 deaths and injuries, occur in 1939; the third occasion occurs in Valparaiso (Chile), the earthquake strength is the size of the scale 9.5, which is the strongest earthquake since the record, 20,000 dead injuries, the fourth in 1960 At Qinbot (Peru), the earthquake strength is 7.7, 66,000 dead injuries, which occurred in 1970. February 27, 2010, 99 kilometers southwestern Talca, Chile Town, and 117 kilometers north of Concepcion, 3:34 in the early morning, occurrence 8.8 earthquake. The main volcano still has several seats.\n\nSouth America's highest Avoida Mountain, located in Argentina, 6,960 meters above sea, for the dead volcano. There is also an esure of Eusaya, located in Chile, Argentina border, with an altitude of 6,723 meters, for the dead volcano. Inaugasea, located at Chile, Argentina border, with an altitude of 6,709 measures. Qinbolaçon, located in Ecuador, 6,310 meters above sea level, belongs to the volcanic.\n\nKotopa, is located in the harmonium, 5,896 meters above sea level, is a volcano; Ruis volcano, located in Colombia, 5,399 meters above sea level, is a live volcano; Sangko volcano, located in Ecuador, 5,230 meters above sea level, belong to the volcano; Tonggulava volcano, in the harmonious land, 5,016 meters above sea level, is a Hui Mountain; Piqin Chaoshan, in Ecuades, 4,794 meters above sea level, altitude.\n\nWhen the El Niño phenomenon, due to the weakening of the faith, and the strong wind squeezed the tropical warm stream to the South America, the water temperature rose, the spring flock in the West Bank of South America and even disappeared, and the squid was forared, and the fish is foraging in the fisheries. The seabirds decreased, and the bird fertilizer as an important raw material for phosphate is also reduced, and the local residents have caused economic losses. South America's West Bank has been drought to moist, Peru and Chile have thus rare floods, causing many casualties, and financial losses are difficult to estimate. After the environment is changed, many mosquitoes, mice, etc. have increased, disrupted infected diseases such as dengue fever, rat, malaria. [3]\n\nSouth America has a variety of environmental resources, but is affected by the colonial economic and land, and there is no economic take-off after independence, and is mostly developing countries. The main land is large due to the largest production scale, more income; small farmers with weak competitiveness live poverty. There is a gap between the rich and the poor.\n\nIn order to avoid the interest of the colonial mother country, South American industrial development is limited, only low-cost agricultural, animal husbandry, mine and other raw materials, and high-priced industrial products\nDue to the influence of colonial economic, South America is still based on export first-level products, and is unstable, and the South American economy is unstable, and it is more economical, and more economic crops are in response to international market demand. Many countries must import food, leading to imbalance in agricultural development.\n\nThe 12 countries in South America joined the South American National Union. The Alliance Headquarters will be located in the capital of Ecuado. The parliament is located in Bolivia, and South America will be located in Calakas, Venezuela, is scheduled to be available. The tariff of non-sensitive commodity and sensitive commodities will be canceled before 2019.\n\nSouth America's agriculture is a colonial agriculture, a single system, a large-scale planting, and its commodity prices are vulnerable to market fluctuations, causing foreign debts of South American countries to high. There are several crops in agriculture, with rubber [4], pepper, cotton, tobacco [5], cocoa [6], sugar cane [7], coffee [8], banana [9], soybeans, etc., food crops are rice , Wheat, corn, tomato, etc. Rubber production location is in the middle of the Amazon River. Pepper produces branches in the Amazon River. Coffee, Corn, Tobacco, Cascade [10]. Colombian coffee, bananas, cotton, sugar cane, corn, rice, soy, wheat [11]. Brazilian cotton, tobacco, cocoa, sugar cane, coffee, rice, bananas, wheat, soybeans [12]. Peruvian cotton, rice, sugar cane, potato [13]. Bolidian cane, rice, cotton, potato. Chile planting sugar cane, cotton, wheat, corn, and Mediterranean climate fruits and vegetables (grape, citrus, olives, figs) [14].\n\nThe land required for animal husbandry is large, only in Brazil, Argentina, Venezuela, Colombia, has no obvious animal husbandry.\n\nThe Andes Mountains belong to the new pleat mountain, copper-copied, other blocks, there are more minerals, with a variety of more than ten kinds, of which Brazil is less developed. Brazilian iron, manganese, nickel, uranium, gold mine and gemstone and aluminum; Argentine coal, gold, silver, copper, iron,, tungsten, manganese, uranium, lime, mica mine and oil and natural gas; Peru Gold, silver, zinc, copper, lead, iron ore and oil; Chilean gold, silver, copper, iron, coal mine and nitrite; Venezuelant, copper, iron, nickel, manganese mine and aluminum and oil; Bolivian , Silver (now depleted), tin, tungsten, iron, lead ore and oil and natural gas; Colombian funds, silver, platinum (platinum), emerald, nickel, coal mines and oil and natural gas.\n\nNowadays, South America is slower due to early colonists, and there is no high-tech industry now. Brazil's main industrial steel manufacturing, chemical industry, petrochemical industry, machinery industry, textile industry, cement industry, automotive industry; Argentina main industry is the cement industry, fertilizer industry, steel industry, plastic industry, paper industry, textile industry, motorcycle Automotive industry; Main Indies of Peru is steel manufacturing, automotive manufacturing, tire industry, cement industry, wool texture industry; Chile main industry is steel manufacturing, paper industry, cellulose manufacturing; Venezuela main industry is a cement industry, steel manufacturing industry , Chemical industry, shipbuilding and product; Colombia main industries have textile industry, leather industry, chemical industry.\n\nSouth America's cultural is mainly based on Indians, and the European colonists introduce black slaves after a large number of deaths in Indians to supplement labor, so that they are complex in this area. Due to the long-term dominance of Latin Culture, Spain and Portugal, the South America is often known as Latin America, but Indian culture has not disappeared, and it is integrated into African black culture, and there is a conflict and integration between cultural and cultural, forming synthetic culture. The culture is more rich.\n\nDue to the long-term colonies, the official language of all countries is a language of colonial mother-of-colonial country, but a small number of Kuchusian, Guaran language still exists. The official languages ​​of most countries in South America are Spanish, and other Brazil is Portuguese, Gaiaa is English, Surika is Dutch, and the French Guyana is French.\n\nSouth America has 12 countries and 4 yielding overseas territories. These overseas territories belong to the British (2), France (1) and Norway (1), which is affiliated with the British South Georgia and South Sandwich Islands and Bowe Island, which is affiliated to Norway. [15]\n\nAll countries and regions from South America are listed below:\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology and guess continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central American · Caribbean) · South America) Culture Geography: Angulus America / English Masseari, Latin America (Iberia, Spanish) · · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate, Vice Patency Climate (Moss Climate, Iceland Climate)  Palace:  Other: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate  Biological distribution area  New North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories "}