{"chinese_title": "social science ", "chinese": "Social science is a scientific method to study various phenomena of human society. Narrow \"Social Science\" is an empirical scientist study, interpretation and prediction of human social organization, structure and activities, such as sociology research contemporary human society, political research politics, policies and related activities, economics research resources distribution. Generalized \"Social Science\", as a corresponding object of natural science (in nature research object), is a collective discipline and humanistic disciplines of all human research objects. The concept of \"Social Science\" originated in the \"Encyclopaedia of the Social Science\" published in 1930, which includes psychology, linguistics, criminal, education, legal, political, economics. And a discipline related to business, sociology and social work, geography, management, etc. related to social sciences.\n\nSocial science is a discipline after the enlightenment of the Eighth Century. Over time, it has also established which scope of research objects, and the concept of social science has broad and narrow. In 1968, Taiwan published \"Cloud Five Social Sciences\" has identified the following 12 social science research objects, including: psychology, education, statistics, legal, political, administrative, International relations, economics, sociology, anthropology, historical, geography.\n\nSocial science includes:\n\nPolitical, economics, and sociology are typical narrow social sciences. Some disciplines, such as historics, is a narrow sense of social science and human discipline, but it is usually understood as the humanities. The broad \"Social Science\" includes humanities disciplines, such as the Chinese Academy of Social Sciences with two types of social sciences and humanities. Legal or legal research is less research methods, and therefore do not belong to the social science disciplines in the narrow sense, and law research is not in traditional humanities, but the law study is sometimes Subject to a broad social science discipline.\n\nSome disciplines, such as psychology, anthropology, archeology, geography, intersection of social sciences and natural sciences, which is different from research direction, policy orientation. For example, psychology, China's mainland education institutions will psychology in accordance with Natural Science and Technology College, such as participating in the establishment of the Psychology Department of Nanjing University, in 1956 (including the Republic of China) in 1956 (including the Republic of China) Next; and Hong Kong educational institutions are attributed to social sciences.\n\nNorth American education institutions advocate \"unsolicientation\" (immediate social sciences and natural sciences as the same big category), with more social science disciplines into the \"College of Liberal Arts and Sciences\", will social science, nature Scientific and other subjects are called \"Sciences\".\n\nIn mainland China, in Maxie thinking, marxist philosophy as the guiding ideology of Chinese social sciences, one degree of humanities discipline and social science in philosophy, and collect humanities and social sciences as \"philosophy and social sciences\". With the diversified transformation of society, academic freedom explores spaces will become increasingly large, and the definition and classification of social science will begin to change. "}