{"chinese_title": "mining ", "chinese": "The mining industry is a mineral or other substance that has economical value from underground. The mining parts are minerals, and the materials mining them include aluminum, coal, diamonds, iron, rare metals, lead, limestone. , Nickel, phosphorus, rock salt, tin, uranium and molybdenum, etc., almost any original substances that cannot be produced by agricultural production are provided by minerals. From broad sense, oil, natural gas, and even groundwater can count the category of mining industry. .\n\nIt is known that the earliest human mining site is approximately Swaziland's \"lion points\" according to the radioactivity assay, which is a pocket belonging to 43,000 years ago. At that time, it was a pigment for the mining of the hematite used to do the original people totem. A mine of the original man exploited the mine in Hungary was also discovered in Hungary. In addition, an ancient Egyptian mining mine was found in the Sinai Peninsula.\n\nIn 1627, the first black gunpowder was used for the first time in Slovakia.\n\nThe development of the human mining industry is associated with the technical revolution. The stone era uses stone, wood and bone mining, underground mining using wood support. The key force of the bronze era mining tool and support is replaced by bronze, and the iron era is replaced by iron. In the advanced explosive black powder in the late Iron Age. The first industrial revolution replaced the previous humanity into mechanical operations, with steam engines, black powder replaced with nitridified glycerol. The second industrial revolution uses internal combustion engines and TNT, the third industrial revolution began to use nuclear power, and the computer also has more advanced explosives, such as China's total nitrogen anionic salt and metal hydrogen in the United States.\n\nFrom a broader level, the human production tools and weapons of the stone agents are stone, bones, and wood. The bronze era is replaced by bronze. The iron era is replaced by iron, and explosives have also occurred in the Iron Age. The first industrial revolution took the steam machine into the factory and battlefield. The second industrial revolution brought into internal combustion engine. The third industrial revolution has brought nuclear power, and explosives also turned from black powder from the three industrial revolution from the iron age. Nitrified glycerol, TNT, to all nitrogen and metal hydrogen.\n\nBasically divided into two forms\n\nMining is a professional science and technology that refines the concentrated valuable minerals, chemical methods and mechanical methods, including pulverization, grinding, gravity distribution method, water selection, etc. After selecting post-selected residue is tailings Need to abandon it. In order to prevent pollution, the disposal of tailings is also a topic of research.\n\nThe impact of the mining industry includes soil erosion, the ground settlement, biodiversity damage caused by the pit, and the pollution of the chemical in the mining process.\n\nModern many countries have strict environmental protection and restoration of the status of the mining industry, ensuring that the mining area should restore the original state, and even better the environment before mining. Using past methods mining, countries that are not stringent in mining industries, the mining industry will cause damage to the environment, while affecting human health.\n\nThe mining industry will have a considerable impact on the surrounding environment and groundwater. The chemicals will concentrate on contaminated large-scale areas. For example, the coal mines will generate approximately more than 20 toxic chemicals, and they will spread pollution through the channels of discharge and supply water. There are countries with strict control of the law. The mining must have hydrological experts and geologists to carefully study treatment of pollutants. Generally, five separate measures are generally treated: water separation system, contain pollutant wastewater concentrate on the pond, groundwater collection system , Surface water discharge system and isolation system. For water containing acidic contaminants to be discharged directly to the water treatment system.\n\nIt can be engaged in mining careers from private or small companies, but modern mining needs require a lot of capital investment, generally engaged in internationally renowned large companies.\n\nModern mining business is no longer just excavated on the ground and requires special personnel in different fields. Join directly or indirectly to the mining industry, including engineers, laboratory technicians, geologists, environmental scientists, etc., in addition to people who work directly in mines, many professionals are mining industry services, such as accounting, lawyers. , Marketers, public relations personnel, etc., have not counted thousands of mine machinery production and maintenance personnel.\n\nThe salary of the mining employee is generally higher, especially in the remote area of ​​mines, according to the investigation of the US Labor Statistics, the salary of coal mine workers should be 30% of the average salary, university graduates or geological engineers working in the mining industry. The average annual salary is $ 80,000. In the mining industry, you can only work to 46-50 years old, but there are fewer and fewer people who are currently learning mining in college.\n\nAt present, the largest advancement of mine design is to adopt three-dimensional design software, which is no longer as time consuming as before, as long as exploration staff, geologists, mine engineers and other technical personnel enter the necessary data, software can give optimization Mining design.\n\nMining machinery must be able to break and remove any hardness rocks, excavators, drilling rigs, explosives and trucks are essential, especially for open-air mining. Underground mining machine is more complicated and expensive, many internationally famous companies produce continuous mining machinery.\n\nSecurity issues have always been the most important issue in the mining industry, especially for underground mining, although the modern mining industry is more secure than decades, but often has a mine disaster. On March 28, 2010, there were more than 100 people in Wangjialing Coal Mine. [1]\nMine ventilation is the key to safeguarding miners, and ventilation will lead to silicon disease in miners. Especially in the coal mine will cause gas (methane) accumulation, explosion. The ventilation system is completed by the strong exhaust fan, so that the mine is negatively negatively pressed, and the fresh air is input to the mine from other pipes to achieve a good air cycle. In terms of antispectangab materials, the Benxi Lake Coal Mine explosion stops to blow up the wind to the well and lead to more death. [2] [Source reliable? ] [3]\n\nAbout 70-800 abandoned mines in the United States, many also accompanied by abandoned villages and towns (\"ghost towns\"). Experts strongly warned not to enter these mines, don't go there to explore it. Abandoned pits often have accumulation of toxic or suffocating gases, or such as bats, snakes and other toxic animals survival [4], there will be collapse caused by land erosion around the pit, and it is very dangerous to enter these ore pits. Every year, more than a dozen people have been hurt even in these mines, and the US Mine Safety and Health Department initiated a \"staying distance, maintaining survival\" movement, with the purpose of playing and educating children and adults playing and adventure near abandoned mines. It is very dangerous. In the past, there is a risk of fatality and collapse from a high place [5] [4] [6]. An environment full of water is also prone to danger of rescue ambulances [7]. Mining workers are also more susceptible to pulmonary disease. [8] [9] [10]\n\nHong Kong Maanshan Mine 240ml Tunnel Export\n\nWaste mine in Nevada "}