{"chinese_title": "mathematics ", "chinese": "Mathematics, the number of studies [1], structure [2], change [3] [4] and space [1] and other concepts, from a certain point of view, it belongs to a formal science. The mathematics is produced by the use of abstraction and logic reasoning, and is produced by counting, calculation, measurement, and observation of object shape and motion. Mathematics expand these concepts, in order to formulate new conjectures and build a rigorous derivation of a rigorous propagation from selected axioms and definitions. [5]\n\nThe knowledge and application of basic mathematics is an indispensable ring in individuals and group life. The improvement of the basic concepts of mathematics, early ancient mathematics text in ancient Egypt, Mesopoamia and ancient Indies, and there is a more rigorous treatment in ancient Greece. Since then, the development of mathematics continues to make a small progress, until the Renaissance of the 16th century, because the interaction of new scientific discovery and mathematical innovation, causing accelerated development until today. [6] Mathematics and become part of the education category of many countries and regions.\n\nToday, mathematics use in different areas, including science, engineering, medicine, economics and financial schools. The application of mathematics is often referred to as application mathematics, and sometimes it will also arouse new mathematical discovery, leading to the development of new disciplines, such as some of the theoretical stimulating mathematicians established in physics's substantive development. Mathematics for some Thoughts on the Different Angles of Problems. Mathematics also studies pure mathematics, which is the substantive content of mathematics itself without any practical application. Many studies have started with pure mathematics, but many applications have also been found in the process. [7]\n\n\"Mathematics\" in Western languages ​​(Greek: μαθημττκκά) The word origin is from άθημα (máthēma) of ancient Greek, with \"learning\", \"learning\", \"science\", and there is still a narrow and technical Meaning - \"Mathematical Research\", even in its language. Its adjective μ θηματκς (Mathēmatikós), meaning \"related to learning\" or \"function\", will also be used to refer to \"mathematics\". Its complex form in English, and the surface plum in French, Les Mathématiques, which can be traced to the neutral multiple Mathematica of Latin, translated from Sichylo τα μ θη α μτικά (Ta Mathmatiká), this one Greek was taken by Aristotle to refer to the concept of \"all things\". [8] [9]\n\nThe word \"mathematics\" expressed by Chinese characters is approximately in the Song Dynasty in China. Multi-pointed number of pictures, but sometimes I also contain today's mathematical significance, for example, Qin Jiucao's \"Mathematics\" (\"Yongle Code\", \"Number of books\" is also known by the Song Dynasty Xinyi \"records\" Mathematics Ondears \"),\" Mathematics Tracks \"(Ming Dynasty Kehang),\" Mathematics Keys \"(Qing Dynasty Du Zhiped into a Plow),\" Mathematics Pickup \" . Until 1939, after the Chinese Mathematical Nouns Review Committee studied the use of \"Algorology\" and \"Mathematics\", it was confirmed that \"Mathematics\" expressed the math meaning in today's sense today. [10]\n\nMathematics has a long history. It is considered to originate from early production activities: one of the six art in ancient China, \"number\" [11], mathematics word in the West has greek phrase μαθηματτκ ((Mathematikós), meaning \"The foundation of learning\", source Μ θη μα (máthema, \"science, knowledge, learning\").\n\nPrehumans have tried to measure the quantity of the substance, the length of time, such as the time unit, season and year, etc. Math (addition and subtraction) also has naturally occurred. The ancient stone monument and mud plate also confirmed the knowledge of the already geometric time [12].\n\nFurther, writing or other recordable systems, such as monuments, or odds used to store data in the Empire. There have been many different counting systems in history [13].\n\nAt the initial historical record, the main principle within mathematics is to do relation for tax and trade, in order to understand the relationship between the digital, in order to measure the land, and to predict the astronomical events. These needs can be simply summarized as mathematical research on quantities, structures, space and time.\n\nIn the 16th century, the initial mathematics of the arithmetic, primary algebra, and the triangular school has been generally complete [14] [15]. The production of variable concepts in the 17th century makes people begin to study the mutual relationship between the amount and the amount of the amount and the mutual transformation between the graphics, and the concept of calculus is also formed at this time. With the formation of mathematical steering, the aggregation and progeny logic of the study of mathematics is also begun. The focus of mathematics from solving practical problems to the general form.\n\nFrom ancient times, mathematics has been continuously extended, and there is a rich interaction with science, and the development of the two benefits to each other. There are many mathematical discovery in history, and it is constantly new discovery today. According to MIKHAIL B. Sevryuk, the January 2006 in January 2006 said, \"Store the quantity of the paper and books in the mathematical review database since 1940 (mathematics comments) The year of the publication) has now exceeded 190,000 copies, and it has increased more than 750,000 copies each year. The most of this school sea is a new mathematical theorem and its proof. \"[16]\nThe Maasa number next to it is a black point represents a black line representing five\n\nWhenever there is a difficult problem involving quantity, structural, space and variation, a mathematical tool is usually required to solve the problem, and this often expands the research category of mathematics. At the beginning, the use of mathematics can be found in trade, land measurement and subsequent astronomy. Today, all sciences have problems worthy of mathematicians, and mathematics it also gives a lot of problems. Newton and Leibniz are the inventors of calculus, Ferman invent Fayman path points, which is the product of the two of the foreigners and physics, and today's string theory also demonstrates new mathematics. Some mathers are only related to the fields that generate it, and more of this area is used to answer more questions. However, it is generally useful to be very useful in many other fields, and can be a general mathematical concept. Even \"the most pure\" mathematics usually also has practical use, this is a non-ordinary fact that 1963 Nobel Physical Award winner Vigna said \"Mathematics in natural science is not imagined in natural science\" [17] .\n\nAs in most research areas, scientific knowledge broke out the specialization of mathematics. The main differences are pure mathematics and application mathematics. In the application mathematics, it is divided into two major areas and has become their own discipline - statistics and computer science.\n\nMany mathers are talking about the beauty of mathematics, their inner aesthetics and beauty. \"Simple\" and \"Generalization\" are one of them. In addition, ingenious proven, such as proof of unlimited multi-prime numbers; or speeding the calculated numerical method, such as fast Fourier transform. Gao Defi Harold Hadi is in the book of \"a mathematician's self-contained\". He believes that it is a single aesthetic meaning, which is enough as a legitimate reason for pure math research.\n\nMost of the mathematical symbols we used today were invented after the 16th century. [18] Before this, mathematics is written in the form of text, which limits the development of mathematics. Today's symbols make mathematics easier to master for experts, but beginners often look at this. It is extremely compressed: a small amount of symbols contain a lot of messages. As music symbols, today's mathematical symbols have clear grammar, and effectively encode information, this is difficult to do other writing methods. Symbolization and formation makes mathematics rapidly and helps establish basic support theories in various science.\n\nMathematics languages ​​have also difficult to speak for beginners. Such as \"or\" and \"only\" have more precise meanings than the daily term. It is also annoying that beginners, such as \"open\" and \"domain\" and other words have special meaning in mathematics. Mathematical terms also include special nouns such as \"same embryo\" and \"conjunctionability\". However, the use of these special symbols and proprietary terms is why: mathematics requires more accuracy than daily terms. Mathematics refer to this requirement of language and logic accuracy as \"rigorous\". But in real-world applications, some stringency will often get better results.\n\nStrict is a very important part of mathematics proven. Mathematics hopes that their theorem is inference in a systematic reasoning. This is to avoid the incorrect \"ore \"in order to be unreliable, and this situation has experienced many examples in history. [19] The rigorous level of math is different from time to time: the Greeks will be careful, but in Newton's era, the method used is not rigorous. Newton's definitions made to solve the problem, re-dealt with careful analysis and formal proof by the 19th century. Today, mathematicians continue to argue the rigidity of computers. When a large number of calculations are difficult to verify, it is difficult to say that it is so strict.\n\nThe axiom in traditional thinking is \"Do not know the truth\", but this idea is problematic. In form, the axiom is only a string of symbols, which is only meaningful for the contents of formulas that can be derived from the axiom system. The Hilbert plans to put all the mathematics on a strong axiom, but according to the Naddel's incomplete theorem, each compatible and inclusive formula will contain a unresolved formula; Thus all mathematical final systemification is impossible. Despite this, mathematics often imagine a collection of a axioming, in which meaning, all mathematical descriptions or proof can write a collection of formulas.\n\nCarl Friedrich Gauss said the mathematics as \"scientific queen\". [20] In Latin Original Regina Scientiarum, and its German Königin Der Wissenschaften, the meaning of \"science\" is all knowledge (field). In fact, the word Science in English is the meaning in English, and there is no doubt that mathematics is indeed a \"science\" in this sense. Limiting scientific limits in nature science is after this. If science is to refer to the physical world, mathematics, or at least pure mathematics will not be a science. Einstein has been so described: \"The more relevant mathematics Law and reality, the more uncertainty; if they are determined, they will never be related to the reality.\" [21]\n\nMany philosophers believe that mathematics does not have no negative negative [22], and therefore is not the science defined by Carl Popme. However, in the 1930s, in the logic of mathematics, the mathematics cannot be returned to logic, and Popul is inferred \"Mathematical law, such as physics and biology, it is assumptions: pure mathematics has become Close closer to its assumptions, natural sciences, which seems to be more close than it now. \"[23] However, other thinkers, such as more famous Lakatos, provided a delegation of mathematics itself.\n\nAnother point of view is that certain scientific areas (such as theoretical physics) are just mathematics to try to meet realistic mathematics. In fact, John Ziman, is considered to be science is a public knowledge and therefore also contains mathematics. In any case, many areas of mathematics and physical science have many identical places, especially from the hypothesis of the logic preview. Intuition and experiments play an important role in mathematics and scientific conjecture. The importance of experimental mathematics is continuously increasing, and the roles of calculation and simulation in science and mathematics are increasingly aggravating, alleviating the shortcomings of mathematics do not use scientific methods. In Stephen Volfham's work in 2002, he proposed that computational mathematics should be seen as its own scientific field to explore.\n\nMathematics is inconsistent with this attitude. Some studies in studying the application of mathematics think they are scientists, and those mathematicians who study pure mathematics often feel that they work in a near logic, and therefore basically a philosophers. Many mathematicians believe that their work is a science, which is an importance of its aesthetics, as well as the history of one of the seven major Boya; It is also believed that if it is ignored, it is ignored that the relationship between its science is Pretending to see math and its interaction between science and engineering, in turn to promote this fact in many scientific development. The difference between the two views has created mathematics in philosophy and \"created\" (such as art) or \"discovered\" (such as science). The University Department is divided into the \"Science and Mathematics Department\", which is pointed out that the two areas are seen as close contact rather than the same. In fact, mathematicians usually work generally to scientists, but they will be separated in detail. This dispute is one of the many topics of mathematics philosophy.\n\nAs mentioned above, the primary disciplines of mathematics are first generated in the needs of commercially calculated, understanding the relationship between digital, measuring land and predictive astronomical events. These four need to be related to quantities, structural, space and variations (ie, arithmetic, algebra, geometric and analysis). In addition to the above major attention, there is also use to explore subsequent domains from mathematical cores to other fields: to logic, to agreed (foundation), mathematics (application mathematics) of different scientific experiences (application mathematics), And stringent studies of more than modern to uncertainty.\n\nIn order to clarify the fields of mathematics, mathematical logic and collection theory.\n\nMathematics logic focuses on the results of this architecture in a rugged aquary structure. As far as the mathematics logic itself, it is the area where the second incomplete theorem of Gotel is, which may be the most widely circulated results in logic: there is always a true life that cannot be certified.\n\nModern logic is divided into conclusion, model theory and proven, and the theoretical computer science has a close relationship, and the P / NP problem in the Millennium Grand Prize is the famous issue in theoretical computer science [24].\n\nThe number of studies started from the number, and at the beginning, the number of natural numbers and integers and arithmetic operations described in arithmetic numbers and integers were described. The integer has a deeper nature in detailed research in the origin, including the famous results such as the final theorem, such as the Fatim. The paper also included two unsolution issues that were widely explored: the number of twins and the guess of Gothbach [25].\n\nWhen the number is further developed, an integer is considered a subset of rational numbers, and the rational number is included in the real number, that is, the continuous amount is represented by a real number. Real numbers can be further widely understood. Further broadness of numbers can last until the number of quad numbers and eight metals. From the number of natural numbers, it can also be extended to overrun, which forms the concept of counting to unlimited. Another field of research is the size, this leads to the base and the other concept of unlimited: Alev number, it allows no The size between the set collectors can make meaningful comparisons.\n\nMathematical objects such as numbers and functions have an internal structure. The structural properties of these objects are discussed in abstract systems such as groups, rings, and domains, in fact, such a system. This is the field of algebra. There is a very important concept, which is a vector space in vector space, which is studied in linear algebra. Vector research combines three basic fields of mathematics: quantity, structure and space. Vector analysis expands them to the fourth basic field, ie changes.\n\nThe Burbaki School founded in the 1930s believes that pure mathematics is the theory of studying abstract structures.\nThe structure is the interpretation system starting with initial concepts and the axioms.\nThe Burbak School believes that there are three basic abstract structures: algebraic structures (group, ring, domain ...), order structure (predepending order, full order ...), topology (neighborhood, limit, connectivity, dimension) ...) [26].\n\nSpace research stems from geometry - especially Eucli Geometry. The triangular school combines space and number and includes a famous ticking theorem. Today's research is more promoted to the geometry of more high-dimensional, non-Europoliology (which plays a core role in general relativeism) and topology. Number and space have a very important role in parsing geometry, differential geometry and algebraic geometry. There is a concept such as a fiber plexus and a gang shape in a differential geometry. In algebraic geometry, there is a description of geometric objects such as polynomial equations, combined with the concept of numbers and spaces; there is also a research on topology group, combining structural and space. Li Qun is used to study space, structure and change. In many branches, topology may be the most important field in the 20th century mathematics, and include there is a long-standing Pangola guess, as well as controversial four-color theorem. Pangola I want to confirm in 2006 by Russian mathematician Grigo Perelman [27], and the four-color theorem has been used in 1976 by Kane Apel and Woffgang Hamken. Computer proves [28], and has never been verified by manpower.\n\nUnderstanding and description changes in natural sciences is a general topic, while the calculus is more popular with changes in the changes. The function is born, as a core concept of describing a change. For the strict research of real and real-transformation functions, the complex analysis is the equivalent area of ​​the plural. Liman Guess - One of the most basic unrequisites in mathematics - it is to be described by repeated analysis [29]. Functional analysis focuses on the (generally unlimited) space in the function. One of the many applications of functional analysis is quantum mechanics. Many problems naturally export a relationship between an amount and its change rate, which is studied in differential equations. Many phenomena in nature can be described by the power system; chaos theory is a clear description of the system's neither predictable and decisive behavior.\n\nDiscrete mathematics refers to the general name of mathematics in the most useful mathematics of theoretical computer science, which contains calculated theory, calculating complexity theory and information theory. The limits of different theoretical models of the same theoretical test computer can be calculated, which contains the most powerful models - Triumplate [30]. Complexity Theory Studies can be made by computers to be more easy to handle; some problems can be solved by computer, but because they will spend too much time or space, it is still not actually possible, although Quick progress in computer hardware. Finally, the theory of information is focused on the total amount of information that can be stored within a particular medium, and therefore there is a concept of compression and entropy.\n\nAs a relatively new area, discrete mathematics has many basic unhyth questions. One of the most famous for P / NP - one of the millennium prizes. [31] Generally I believe that the answer to this problem is negative.\n[32]\n\nApplying mathematical thinking to use abstract mathematical tools in answering the reality of science, industry and commerce, and other fields. An important area in the application of mathematics is statistically, which utilizes the opportunity to describe the tools and allow for a phenomenon containing opportunity ingredients. Most of the experiments, investigations and observations require statistical analysis of their information. (Many statistically do not think they are mathematicians, and more than one part of the cooperative group.) Numerical analysis studies have any calculation methods, which can effectively solve mathematical problems that are calculated by those who have limited humans; it It also contains the study of errors of rounding errors or other sources in the calculation [33].\n\nMathematics Awards are usually separated from other scientific awards. The most famous award in mathematics is the Filz award, [34] [35] was founded in 1936 and awarded once every four years. It is usually considered to be a Nobel Prize in the Mathematics. Another international major award is the Abeel, founded in 2003. Both awards at specific work themes, including the innovation of the new field of mathematics or no solutions in the mature field. The 23 issues called Hilbert were proposed in 1900 by German mathematician David Hilbert in 1900. This series of problems have a very high sense between mathematicians, and at least nine questions have been answered. Another new seven important issues, called the millennium prize, published in 2000. There are one million dollars in the solution for each question, while there is only one problem (Liman guess) and the problem of Hilbert repetition.\n\n110 mathematics\n120 Information Science and System Science\n130 mechanics\n140 physics\n150 chemistry\n160 days\n170 Earth Science\n180 biology\n190 psychology\n\n210 Agricultural University\n220 forest\n230 animal husbandry, veterinary science\n240 aquatic studies\n\n310 basic medicine\n320 clinical medicine\n330 Preventive Medicine and Public Health\n340 military medicine and special medicine\n350 pharmacy\n360 Chinese Medicine and Chinese Medicine\n\n410 Engineering and Technology Science Foundation\n413 Information and System Science related Engineering and Technology\n416 Natural Science related engineering and technology\n420 Surveying Science Technology\n430 Materials Science\n440 mine engineering technology\n450 metallurgical engineering technology\n460 Mechanical Engineering\n470 power and electrical engineering\n480 energy science technology\n490 nuclear science technology\n510 Electronics and Communication Technology\n520 Computer Science Technology\n530 chemical engineering\n535 product application related engineering and technology\n540 Textile Science and Technology\n550 food science technology\n560 civil engineering project\n570 water conservancy project\n580 Transportation Engineering\n590 aviation, aerospace science technology\n610 Environmental Science and Technology and Resource Science and Technology\n620 Safety Science and Technology\n630 management\n\n710 Marxism\n720 philosophy\n730 religious\n740 language\n750 literature\n760 art\n770 historical\n780 archeology\n790 economics\nPolitics\n820 law\n830 military school\n840 sociology\n850 nationalology and culture\n860 Journalism and Communication\n870 Library, Intelligence and Document\n880 Education\n890 Sports Science\n910 statistics "}