{"chinese_title": "culture ", "chinese": "Culture (Japanese: Culture / ぶ か か か か) is the first use of the ancient Roman philosopher Sichylo first using Latin \"Cultura Animi\" definition, the original interest is \"the cultivation of the soul\", which is derived as a biology to accumulate Self-living-related knowledge or experiences make it adapt to natural or surrounding environments, and is a group of foreign performances that work together in the same natural environment and economic production methods.\n\nThere are a variety of definitions for \"culture\", one of which is to achieve perfection through the essence of learning human thoughts and behaviors; [1] Generalized culture includes text, language, architecture, diet, tools, skills , Technology, knowledge, custom, art, etc. [2]. It can be used in the form of a nation to allege a culture [3].\n\nIn archeology, \"culture\" refers to the remains of the same historical period, the complex of the relics. The same tool, utensil, manufacturing technology, etc. are characteristics of the same culture. Cultural and civilization sometimes confused in the use of law.\n\nNowadays, the meaning of Chinese culture is, borrowed from Japanese and Chinese \"culture\", the concept of expression, the collection and meaning of the integration and the original difference of Huaxia ancient books should be avoided.\n\nMature development of Internet networks makes the original relatively alienated individual or organization can easily via the community website, build many new values, ideals, ideas, business, friendship, blood, etc. very intricate, thereby developing specific Network culture of community awareness, this network culture contact instant explosion force, the impact of the specific issues and elections is already the power of emerging cannot be ignored. [4]\n\n\"Zhou Yi, a resignation\": \"There is a miscellaneous, so 文.\"\n彖 曰:, ...... just soft, astronomy; civilization, humanities. Watching astronomy, in case of time; watching humanities, to become a world.\nAmong them, human culture, can be abbreviated as \"culture\".\n\nCulture is actually a referusion of \"humanism\" in Chinese. The premise is that \"people\" are cultural, and it is a special language to discuss human society; \"Wen\" is the foundation and tool, including language and / or text; \"Teacher\" is the true center of gravity of this word: as noun \"Teaching\" is a common norm of people's spiritual activities and material activities (and also reflected in this norm in spiritual activities of spiritual activities and substances), as the \"teaching\" of the verb is a joint norm, inheritance, transmission and recognition Process and means.\n\nTraditional China has Huayi, but there is no Culture concept, and there is no difference between Chinese culture, foreign cultures, and the translation of the culture is the Japanese.\n\nThis word in the Latin system originated in the first time of the ancient Roman philosopher Sichylo in the \"Tuscoo debate\". At that time, he refered is the soul of the soul or \"Cultura Animi\" [6], that is, the use of agriculture Come to metaphorism The development of the so-called soul is the highest realm of human development. Samuel Pufen Doff transformed this metaphor to the \"culture\" of modernization, but he didn't think philosophy is the natural perfectness of human beings. In contrast, he believes that culture is \"to make human beings from the wild, and become a full person\" [7].\n\nTherefore, the meaning of culture not only cultivates the land, but also refers to the practice of the land, raising animals; care for people's lives, such as dressing, decorating the body, care and care for friends and sacrifices; also means living in urban or urban, and cultivating Correct moral and mental, etc. In the late Middle Age, culture begins to refer to morality and mind, and artistic achievements [5].\n\nCulture actually includes three aspects of the instrument (material culture), system (system culture) and concept (spiritual culture), including language, text, custom, thought, national strength, etc., objectively, cultural, is the sum of social value systems.\n\nThere is a different statement on the composition of cultural, the most common is the \"three-level saying\" of material culture, institutional culture and spiritual culture [5].\n\nCultural and civilization sometimes confused in the use. So some scholars have filed distinction, civilization, and the performance of politics, law, economy, education, etc., as well as the results of technology and science, can be considered to be civilized. As for the culture of culture, it is highly regarded in the spirit, including religion, philosophy, art and other ideas and customs [3].\n\nAs early as the primitive social period, human beings have formed the first division of labor, producing agricultural nations and animal husbandons. Animal husbandry should live in water grass, and they are unsettled, and it is not easy to produce large-scale gatherings. There is no urgent need for text. The life of the agricultural nation is contained in the nomad, not only a fixed residence, but also a fixed person to survive the source of food. This way of lifestyle is not only easy to form larger, but also provides soil for the generation of \"early civilization\". The emergence of text symbols caused the second division of labor to form brain labor and physical labor, and made a good foundation for the development of \"medium-term civilization\". The shape of the text marks the beginning of the original social period, the beginning of the feudal society.\n\nDifferent disciplines have different understandings of culture.\n\nFrom the perspective of philosophy, culture is believed to be in essentially a philosophical idea. Due to the era and regionality of philosophy, the cultural style is determined. In general, the changes in philosophical ideas have caused changes in social system, with the rise of the suppression and new culture of old culture.\n\nFrom the perspective of existism, culture is a description of the presence of a person or a group of people. People exist in nature, but also in history and era; time is an important platform that exists in nature; society, national and national (family) is a person or a group of people exist in history and era. Another important platform; cultural refers to people in this process or statement, interaction or behavioral way, awareness or cognitive method. Culture is not only used to describe a group of people's external behavior, and cultural special includes self-cultural awareness and perceptual way for people of individuals. A person who returns a self-dialogue that returns to their hearts, observe the way.\n\nThe functionalism believes that the cultural includes two aspects of matter and spirit, whether specific substances, such as cane, tools, vessels, or abstract social phenomena, such as custom habits, ideology, social system, etc., have satisfied humanity The role of actual life needs.\n\nIn sociology and cultural anthropology, \"culture\" can also be grasped as a symbolic system, especially a symbolic symbol system. American cultural anthropologists C. Gilz has undergone such a definition: the so-called culture, \"human beings in order to convey the knowledge and attitude of life, making it inheritance and development, in the form of inheritance The concept system.\n\nT. S. Eliot in the book of Christianity and Culture, the cultural industry is customized as: a living in a nation living in the same area. Cultural art, social system, custom habits, and religion of the nation.\n\nThe core of culture is its symbol system, such as text. The various text systems have corresponding cognitive psychology.\n\nCulture has social, diverse, systematic and phased properties.\n\nCulture also features geographical, era, variability, inheritance, and so on.\n\nIn recent years, zoology research has found that some high ideas are widely distributed, such as traffder, kick whales, etc., their different regional groups, is not simple environmental habits, but in relation to humans, Have a certain cultural form.\n\nBy comparative study of different cultures to understand the characteristics of culture.\n\nFirst, cultural is a common, it is a series of common concepts, values ​​and code of conduct, which makes the common standards accepted by individual behavior as a collective. Culture is not from personality, and it is hosted to create self-group, not the genius individual can be original, but most of the results of the continuous efforts [8]: Sequence 1. Culture is closely related to society, there is no culture without society, but there is no culture that has no culture. Since culturality is the result of most people, there must be social, together with each other [8]: Preface 1. Inside the same society, culture also has inconsistent. For example, in any society, men's culture and women have different cultures. In addition, there is also a difference in subculture between different ages, occupations, and class.\n\nCulture is learned, not through genetics and is natural. The way physiological satisfaction is determined by culture, and each culture determines how these needs are satisfied. From this perspective, non-human primate also has some cultural behavior of cultural behavior, but these cultural behaviors and huge complicated cultural symbolic systems in human society are only slightly short.\n\nThe basis of culture is symbolic. These most important of these are languages ​​and texts, but also include other expressions, such as images (such as totem flags), limb movements (such as handshake or spitting tongue), behavioral interpretation (gift), etc. Culture is not in a state of still, but is developed in dynamics, and it is also desirable to rejuvenate [8]: Preface 1. Almost, the entire cultural system is to depth in human thinking through a huge symbolic system, and people also interpret all kinds of things presented in front of them through this symbolic symbol system. Therefore, how to interpret various symbols in this culture, become one of the important ways of interpretation of human minds in humanity and linguistics.\n\nIn 1976, Richard Daokins created a new word model in \"selfish gene\" book, indicating the process of cultural inheritance, and the evolution rules in biology to make a cultural gene [9 ]. The model contains a wide range of religion, rumors, news, knowledge, concept, habits, customs, or even slogans, proverbs, terms, words, and jokes, also evolved via replication (imitation), variation and selection process. The concept of replication will not be exactly the same as the original concept, so there is a variation. These similar but different concepts, they compete in each other during the spread, especially in the era of online online, the general concern affects the scope of the content, and the length of the time, there is a similar day. phenomenon.\n\nIn addition, cultural as a whole trend as a whole of each other.\n\nCultural invention means that a group of people can be helpful in its behavior, but it is not the invention of actual items. Humanity in a global \"cultural acceleration period\", because of international trade, mass media, more importantly, the explosive growth of the world population.\n\nCultural itself will be affected by support changes and opposition to the changes of the two parties. These strengths and social structures and natural events are related to some concepts and practices in the existing social structure, which may also be part of cultural evolution [ 10].\n\nThe development of social conflicts and technology can adjust the dynamics of society and put forward new cultural patterns and can change society. The evolution of these societies may accompany the metastasis of ideology, or other cultural evolution. For example, the US women's movement (English: feminist movement) and new practices in society have also caused changes in gender relationships, causing gender structures and economic structures. For example, after the end of the previous glacial period, the tropical forest began to appear, and there were plants that were properly planted, which brought the rise of agriculture, which later brought many cultural inventions and social dynamics [11].\n\nCulture is not a \"existence\", which itself is a \"evolution\"; if it is not evolved, the culture is killed, and the culture of death is lost. [8]: Sequence 2.\n\nCultural will be affected by contact between different societies, which may cause social and cultural evolution, or may prevent this evolution. War or resource competitors impact technology development and social power, in addition, cultural concepts may be transferred from a society to another by diffusion or implication. In the diffusion, a thing of a thing is transferred from a culture to another, but its significance may vary, such as Burgers' fast food, and become a symbol of exotic style after China. Stimulating diffusion (concept sharing) refers to an element of another culture or invented another culture. On the other hand, Direct Borrowing refers to a culture to another culture, and the technology or tangible material diffusion. Innovative diffusion theory is a research-based model that describes why individuals and a culture will accept new concepts, new things and new products, and the opportunities are also described.\n\nThere are many different significances in culturally related texts, refers to a cultural replacement of another culture, like some American Aboriginal people and the situation in the process of colonization in the process of colonization. The similar situation of individuals is assimilated (individuals adapted to different cultures) and cultural mutualization (English: Transculturation).\n\nGerman philosopher Kant has a personal definition of \"Enlightenment\": \"Enlightenment is an unproved from him.\" [12]. He believes that this immature is not from lack of understanding, but because there is no courage to think independently. For this kind of knowledge, Kant proposes \"Be brave in the wise!\" Like Held and other German scholars responded to Kant's appeal, although human creativity brings many unpredictable and multi-cultural results, but humans Rationality is important. Furthermore, Held proposed a group of collectors: \"For Held, the teaching is the sum of people's overall experience, giving people a common agreement, and the feeling of the same fate.\" [13].\n\nThe concept of high-cultural and civilian culture proposed by Adehua Burned Taylor application in 1870, proposed religious evolution (English: Evolution of Religion), he believes that the religion will slowly evolve from the gods to a god [14]. He also redefines the culture is the sum of all activities of human society. In the \"original culture\" book, he believes that culture is a complex whole, including knowledge, beliefs, art, moral, legal, customs, and any capabilities and habits that are employed as members of society. This is also preparing for modern cultural understanding. It is worth mentioning that Taylor is the first scholar that defines a culture.\n\nThere are a lot of classification methods of culture, which can be summarized as follows:\n\nThis classification below is a comprehensive application of time, region, and nation. "}