{"chinese_title": "city ", "chinese": "Urban, urban, city, city or capital refers to a region with a dense population, more developed industrial and commercial, generally involved in residential areas, industrial areas and commercial districts, etc., and has administrative jurisdiction. In the city, there are basic constructions such as buildings, streets and parks. The city's administrative jurisdiction (ie, the so-called \"Building\") may involve more extensive areas themselves.\n\nGenerally, the city will have a relatively complete public health equipment, utilities, land planning, residential and transportation systems. The intensive development is convenient for people's interaction, and it is also convenient for business activities. Metropolis generally have corresponding suburbs and 城. The metropolis usually has its urban area, many people live in the suburbs, and we will go to work every day. If a city has expanded to other urban borders, this area will form a collection city.\n\nThere is no clear definition and standard in the city, and the standards of different countries are different.\nThe following examples are listed below:\n\nDenmark's urban population is 200 people. [1]\n\nCanada's urban population is 1,000 people.\n\nGermany's urban population is 2,000 people.\n\nThe definition of the US city is determined by the states, so the state will also have different urban population limits. For example, the lower limit of urban population in Massachusetts is 12,000, and the lower limit of Maryland is 300 people [2].\n\nIndia's urban population is 5,000 people.\n\nThe lower limit of the urban population of Malaysia is 10,000.\n\nChina: On March 10, 2006, China National Bureau of Statistics issued the \"Interim Provisions on Statistical Division\", which made new divisions for \"urban\" and \"rural\". Article 4 stipulates that \"town\" refers to the area that is defined by this provision based on the provision of the provisions of China's construction and administrative divisions. \"Town\" also includes \"urban\" and \"town\". Article 5 stipulates that the urban area refers to the area that is defined in the city of the city and does not dispose of the zone.\n\nTaiwan's urban definition is as follows:\n\nAustralia has a minimum of 10,000 to 30,000 talents for the city.\n\nThe Constitution of Belarus divides the city into three types [4]: ​​The capital, urban area of ​​more than 50,000 people in Oblast, and the RAION area of ​​more than 6,000 people in urban areas.\n\nThe city is an important part of human civilization. The city is also accompanied by human civilization and progress. It is generally believed that the real city is the product of the development of industrial and commercial industry.\n\nThe earliest city originated from the Middle East for 10,000 years ago. Before that, human beings lived in life, hunting and nomadic. Later, I entered the farm era, and human beings began to settle. The Mesopoamia Plain located in the two river basins Due to the soil fertilizer, excessive agricultural, residents do not have to worry about the lack of food, so they can put into the manufacturing and invented industries, the rise of urbanization and urban civilization began to spread. However, at this time, the urban population is still in the aristocracy, the ruling class and military defense, holding a ritual ceremony as the master, civilians are unable to live, and thus live, production functions, so the scale is not large.\n\nThe evolution of European cities in the Middle Ages is relatively slow than the East, because there are many balances provided by the surrounding rural areas, plus the implementation of the feudal system, each city and the rural areas, constitute a small unit, forming a relatively closed, Self-sufficient manor economy, industry and commerce is not developing, so that urban development is stagnant. However, the commercial city of the East began to rise, such as the Chang'an and Song Dynasty in the Tang Dynasty; the 13th century Mediterranean area of ​​Milan, Venice, Florence and Byzantine Constantinople, or Arab Peninsula Baghdad, etc. These municipalities are very prosperous due to their homage of transportation, whether they are commercial, trade and cultural exchanges, so booming.\n\nHowever, 1453 Contracting Tintinople was captured by the Turkish Turkish people, leading to India and China's trade route. Due to the increasing demand for Eastern products such as fragrance and silk, plus the desire to colonial and wealth, even missionary factors, resulting in the coming of the Navigation Sea, and the European Economic Center has gradually moved from the Mediterranean to the Atlantic coast. Portugal. Harbor city in Spain, UK and Netherlands.\n\nFollowing the 19th century industrial revolution, the city has gained an unprecedented development. The Industrial Revolution has caused rapid advancement of technology and the introduction of many inventions, which in turn caused many factories. Due to most of the factory sets near the convenient metropolis, the phenomenon of farmers has continued to flood into these urban, and the phenomenon of urbanization has begun to expand from the United Kingdom from the Industrial Revolution. To the eve of the First World War, the extent of industrial powers such as British, Mide, Germany and France is quite high. This is not only a rich logo, but also a symbol of civilization. However, during the Second World War, the improvement of weapons and the emergence of the new state war, the number of civilians who suffered from warfire and injury, plus urban residents to avoid attacks, and large migration to the countryside, resulting in urban population Less.\n\nAfter the war, the rural population returned to the city, which made the urban population increased rapidly. Since the urban population is increasingly crowded, the urban area has increased significantly, and there are many urban and suburbs, thus forming a large number of large-scale districts. After the improvement of industry technology and improvement in medical facilities, it has exacerbated the significant increase in the number and scale of the area, and the phenomenon of urbanization is increasingly obvious. Today, more than 3 billion people have lived in urban, but Europe, the United States and Japan have developed the country's urban development has been nearly saturated; in Latin America, Africa, China and India, the urban, population growth Still quite rapid.\n\nThe \"city\" proposal itself contains two meaning: \"City\" is the concept of administrative geography, that is, the agglomeration of the population; \"City\" is the concept of business, that is, the site exchange. The earliest \"city\" (actually should now \"town\") is formed after the commodity exchange gathering group. The emergence of the city also has a direct origin relationship with the transformation of the business. The industrial agglomeration in the original city is also formed in order to make commodity exchange easier (can be sold, local sales). Direct machining sales in the city is a commercial change in the emergence of industrial cities in direct processing sales relative to the process of processed goods into the city. The city includes urban scale, urban functions, urban layouts and urban transportations, and changes in these aspects will inevitably affect the business activities of the city, which prompted to have corresponding changes.\n\nUrban economics has made different levels of classification of urban, such as small cities, medium cities, big cities, international metropolis, world-class cities, etc., a standard for urban energy class classification is the size of the population.\nAccording to the history of urban comprehensive economic strength and world urban development, the city is divided into market type, functional type, comprehensive, urban group, etc., these categories are also various stages of urban development. Any city must pass the market.\n\nIt belongs to the surrounding farmers or handmarers' merchandise exchange, commercial is mainly constructed by the trading market, shops and hotels, restaurants and other supporting services. City is in the market stage to call the town in China.\n\nThrough the concentration of natural resources development and advantageous industries, it is beginning to develop its unique industrial industries, which makes the city have specific functions. Not only is the exchange of goods, but also the production of goods. However, the urban functional monotone formed by the industrial division, the dependence on other regions and urban economic exchanges, the business began to transfer intercity transactions in closed-type urban transactions, wholesale trade industry has been great development of. This type of city mainly has industrial heavy towns, tourism cities (sightseeing cities), etc .;\n\nSome urban economic functions in some geographical advantages and industrial advantages have become comprehensive, financial, trade, services, cultural, entertainment and other functions. The agglomeration of cities is increasing, which makes the economic level of the city greatly improved, and become regional Sex, national or even international economic center and trade centers (\"Metropolis\"). Commercial is developed by simple commodity transactions, and commercial activities also extend extension to promote all activities of commodity circulation and meet transaction needs. Such cities are typically municipalities in China, provincial capitals.\n\nOr urban band, urban area, urban circle, etc. The economic functions of the city are no longer embodied in an isolated city, but consisting of urban agglomerates with a central city with a series of small and medium-sized cities that maintain close economic contacts. Such as the \"Boston-Washington City Band\" in the East Bank, \"San Francisco-San Diego City Band\", USA, the \"Chicago-Pittsburgh City Band\" in the United States, Tokyo, Osaka, Nagoya, Japan, Taiwan, Taiwan Taipei - Kaohsiung City \"City Belt (Western Western Corridor), the UK\" London-Liverpool \"city belt. Looking at China, Hong Kong is located in the Pearl River Delta region, Shanghai where the Yangtze River Delta region and Beijing are actually formed three economic relations close-in Pearl River Delta urban group, the Yangtze River Delta urban group and the Bohai Rim urban group. The overall economic function has become increasingly high.\n\nUrban Planning System In order to avoid the plan to implement urban issues caused too fast, such as pipeline design, road network planning, division area, etc.\nUrban planning can be roughly divided into overall planning and detailed planning.\n\nThe overall planning refers to the planning of the \"overall layout\" of the urban nature, development direction, scale, usually in 20 years. Under the overall plan, it can be divided into several \"recent construction\", which is the formulation phase of the overall plan, and the planning period is generally 5 years.\n\nThe most famous example of the city's overall planning, such as the Washington DC and Brazil in the United States.\n\nDetailed plan is a further concrete manner compared to overall planning. It is mainly for specific arrangements for the construction of buildings, public utilities (hydropower), park green spaces in the terms of urban recent construction plan.\n\nIt is known that the city will now form a slight weather because there is a large number of absorbent surfaces, and the temperature will rise during the sun irradiation, and there are many rainwater in the waterway, rather than turning a part of groundwater.\n\nGarbage and sewage are the two main problems in the city, and air pollution caused by various forms of combustion is also one of the problems of the city [5], combustion sources include fireplaces, burning wood or coal stovers or other heating systems [6] And the internal combustion engine (the engine like a motor vehicle). The impact of the city's other regions can be expressed in urban ecological footprints. Other negative impacts include infectious diseases, crimes, high traffic flow, and long commuter. The interaction between people and people in the city is complicated in rural villages, so it is more likely to cause infectious diseases, but it is also helpful in health in vaccination, water filtration systems, etc. Crime is also an important issue in the city, and has studied that the chance of criminalization in the city is relatively low. In terms of thief, the high concentration of urban population has also caused more high prices, and it is worth theft. Urban traffic flow is large, which also makes it difficult to travel in urban vehicles and locomotives, may be because traffic jam causes long distances, and parking is also a big problem.\n\nThe city also has a positive external impact, and the approach of physical distance will help knowledge overflow (English: Knowledge spillover), which helps personal and enterprise exchange information, producing new concepts [7]. The thick labor market also allows companies and individuals to have better skills. The high population density also helps to share infrastructure and production facilities, but if the population density is too high, the crowd and waiting time will bring other negative impact [8].\nAnother positive external impact of the city is because people of different backgrounds have gathered together in the city and have created more social opportunities. The larger city has a wider social attention and activities, so people with different backgrounds can find interested, what they want to participate.\n\nCity planning\n\nUrban planning\n\nUrban planning management "}