{"chinese_title": "Chinese music ", "chinese": "Diet - Apparel - Architecture - Cultural Relics - Festival - Folk - Education\nScience - Five-Trim (Medical - Surgery) - Wushu\n\nChinese music, according to the current archaeological discovery, Chinese music can be traced back more than 9,000 years ago, the ritual system is given the function of maintaining social order. The relationship between music and human feelings is greatly attached, \"The Book of Songs\", \"Book of Books, Music\", \"Xunzi · Music Articles\", \"Historical Records,\" Enlightenment role. At the same time, from the Huqin of the Tang Dynasty, Chinese music and the process of absorbing foreign music elements have been constantly developing.\n\n\n\nAncient Chinese poetry, songs are not divided, ie, literature and music are closely related. The poems in the \"The Book of Songs\" in the \"Book of Songs\" in the existing Chinese poetry have been equipped with tunes. It has been singing, and this tradition has continued. The official poetry of the Han Dynasty integrates \"Han Lefu\", Tang Poetry, and Song Wan can also sing. Modern also musicians sing for ancient poems, such as Su Shi descriptions of \"Water Song\" in Mid-Autumn Festival.\n\nDuring the government, there are departments specializing in music, used for sacrifices, banquet, etc. The \"emot\" for the noble entertainment is often not recorded, and the famous singer Li Turtle in the Tang Dynasty also often appeared in Tang poetry. The \"Qin Qian\" of the ancient Chinese \"Scholar\", \"Qin\" refers to Guqin, and Guqin Music is often appreciated by the scholar, and their research on Guqin has formed \"piano\". The two generations of the two generations published a lot of piano, the piano book, and the literature is very rich, and a lot of piano is formed.\n\nThe ancient Chinese music belongs to the five-sound order system, five levels of five-sound order are called \"five\", respectively, for the palace, business, angle, sage, feather.\n\nChinese music can be traced back to 9000 years ago. The Jiahu 笛 unearthed in the Jahu site is about 9000 to 7500. [1] It is about 7,000 years, and there are postures from all over the world.\n\nGe Tianshi \"Three people fuck tails, sufficient to sing eight 阕\", visible to the characteristics of the ancient music culture with songs, dances and music. \"Jing Tiandong\", \"Fully Grand Valley\", \"The Total Bad\" reflects the awareness of the predecessor of agriculture, animal husbandry and natural laws. These songs, dances, and music are also in contact with the original clan totem worship. For example, the Huangdi clan once with clouds, his music is called \"Yunmen\". Regarding the original song form, \"Lu Shu Spring and Autumn\" recorded the female \"Waiting\" lyrics only \"Waiter\", but only \"Teller\" is in an intention. This is the germination of music, is a pregnant language.\n\nLegend has it \"Fuxi, Shennong, Qinhe\". Fuxi piano, big arrived in the grass creation, failed to improve, sent to Shennong, Shennong added another research, so the system of Qinsse, becoming the system. [2]. There is also the music rhythm, making songs and dances, Yang extension scores, big capacity, Huang Emperor, 夔 夔, 伦, 将 钟 传 传 传 传 传\n\nThe music dance gradually detached from the characteristics of \"the original clan and dance as the class\". From the content, they gradually left the original totem worship, turned to the song of people who conquered nature. For example, Xia Bazhi, benefiting the people, and has a \"big summer\" who has praised Xia Wei. There is no way, there is no way, the merchant soup, there is a song \"big\". The Shang Dynasty witch is prevalent, so there is a special sacrifice (witch) and 觋 (men), dance, singing, singing, is the earliest person.\n\nThe chieple is happy to dance, and the ancestors will enjoy the feelings of the sensory with the music dance, reflecting the productivity compared to the original era, thus enabling the music culture. Legend has it that there is a crocodile-skinned drum, and the business is a wooden pypet drum, a bronze drum, a chime, and a chick.\n\nTao Hao in 5,000 years ago, from the monosh hole in the time, 2 tone holes to 5 syndrome, can issue 12 cycles of listeners. According to the pronunciation of the Tao Hao, the five-sound order appeared in the late Dynasties of the Neolithic Age, and the seven-sound order is at least in business, and the Yin period appeared.\n\nIn the Western Zhou period, the court was first established a complete ritual music system. Qing Liu Baoan \"The Analects of Confucius\": \"The left ‧ hidden five years\" test the Zhongzi's public will be, the question is in the Zhong, the Zhongzi: \"天子Use eight, princes with six, doctor four, taxi two. \"\" Deliked \"Zuo Zhiyi\": \"The sky is eight eight, the princes, the doctor's four eight, the second eight.\"\n\nThe representative dance has the \"cloud gate\" of the Yellow Emperor, \"Xianchi\", \"big\", \"big summer\", \"big summer\", and time \"Da Wu\", collects \"big dance\" or \"six generations\".\n\nZhou Dong has a survey system, collect folk songs, to watch the customs, and observe the people. I have retained a lot of folk songs, and I have been deleted by Confucius, forming the \"Book of Songs\" in China's first poem. It has a total of more than 500 years from the beginning of the Xi Zhou to the spring and autumn. The classification of the \"Book of Songs\", there is a \"four beginning six righteous\". \"Four\" refers to the first poems of the first poems of \"wind\", \"大雅\", \"小雅\" and \"颂\". \"Six\" refers to \"wind, elegance, 颂,, ratio, Xing\". \"Wind, Ya, Yan\" is the difference between the \"Book of Songs\" in accordance with the \"Book of Book of Songs\", \"Fu, Bi, and Xing\" is the \"Book of Songs\". The climax part of the tail of the song has a special name \"chaos\".\n\nBefore and after the \"Book of Songs\", Qu Yuan's \"Nine Song\" prepared to be originally adapted and processed by the singing and performance of the Civil sacrifies God of Chu, and wrote a poem with elegant poetry. It has a strong Chu culture characteristics.\n\nIn 1978, there were 8 124 instruments, including important Zeng Hou B, Zeng Hou B, and Zeng Hou B, provided a large amount of information on the court music, including musical instrument, performance, and twelve law. Sound name, rotary palace method, etc.\n\nThe natural laws produced by the \"Three-Piercing Law\" as records recorded in \"Pipe ‧\" have issued natural pronunciation, which is a multiplication of frequency, so it sounds a harmonious voice, but it will cause \"Huang Zhong can't restore\" .\n\n\"Yuefu\" began in Qin Han. It inherited the Zhou Dynasty to collect the style, collected, collected and changing folk music, and concentrated in a large number of music work in the banquet, suburban, and asked. These lyrics used to sing, known as Yuefu poetry. Yuefu, later was introduced to lyrics from all kinds of enlightened or unhappy music, even some opera and instruments were also called Yuefu.\n\nThe main song form of the Han Dynasty is \"phase and song\". It sang from the initial \"one person singing, three people and\" gradually developed as a \"phase and big song\" accompanied by silk, bamboo, and the structure of \"Yan, tend to be chaos\", which is against Sui, Tang The song and dance big songs have an important impact. At the time of the Han Dynasty, the northwestern frontier was happy. It constitutes a variety of advocities in a variety of advocities, such as cross blowing, riding, yellow gates, etc. They are played immediately, or played in the way, used for military music etiquette, court feast and folk entertainment. Today's folk is blowing, when there is an inclination of the Han Dynasty. \"Bai Du\" is a program that plays songs and dances, acrobatics, and angles.\n\nThe Act of Han Dynasty is that the Beijing Township will be divided into sixty laws in the Beijing-Branch of profit and loss. This kind of theory is meaningless in music practice, but reflects the fineness of rhythmic thinking. From the theory to achieve the effect of \"53 average\".\n\nThe ancient Chinese Yale has lost his court in the palace in the Eastern Han Dynasty. Cao Cao found the Du Yu, which was proficient in Yale, so that Yare returned, Huang Zhong Da Lu returned to the court. The ritual system is returned.\n\nQing Shangyue, which is developed by the Qing Dynasty and the songs, is greatly developed by the love of Cao Cao's father. The large number of Yuefu poems left by Cao Cao is the lyrics used to sing. When Cao Yu, officially established a Music Institution to settle up to Liang Chen, and set up a clear business office. The war of the two Jin Jin, so that the Qing Dynasty will flow into the south, combined with the Southern folk songs, the West Ring, forming a different kind of business music that is different from the song. In the northern Wei Xiaowen Emperor, the Qing Daxi collected collected, so that China's important music with Ya Mer, Hu Le, is known as \"Huaxia Positive\". Since the Han Dynasty, with the smooth flow of the Silk Road, the songs in the Western Regions began to pass. When I was cold, Lu Guang took the turtle to Tuo music in Sui Tang Yanle to the middle and soil.\n\nGuqin art tends to mature, and the ancient Qun monograph \"Qinyao\" in the Han Dynasty has appeared in the Han Dynasty. When Wei Jin, He Kang, in his book, \"Qin Fu\", has a record of \"Yuci\" in Zhongshan. This indicates that people at the time have known the generation of quotation of the logo on the ancient Qun. At that time, a large number of literati family appeared, such as Cai Wei, Kang Kang, Ruan Ji, \"Guangling\" (\"Nie Zhengteng Qin Wang\"), \"猗 猗 操\", \"猗 操\", \"酒 操\" and other famous piano came out.\n\nThis period of rhythm is an important achievement, including the \"Voice Catalog\" of the Jin Dynasty. In the Southern Dynasties, the Song Song, in the three-point profit and loss method, with an equal difference column, superposition principle, and found a new rhythm near the twelve average law, and initially solved the problem of the three-point damage to the Huang Zhong can't restore.\n\nThe two generations of Sui Tang, the unity of regimes, especially the Tang Dynasty, political stability, prosperity, rulers pursue open policies, constantly absorbing other cultures, plus the Wei Jin, have already gave birth to the music culture integration, finally germination The peak of music art of music art for song and dance is the highest development of music art.\n\nThe music enjoyed by the court feast of the Tang Dynasty, called \"Yan Le\". The seven steps in the Tang Dynasty, and the nine music belongs to Yan Le. They are all nationalities and some foreign folk music, mainly with Qing Shangle, Xili, Gaochang, Kang Guo, Kang Guo Le, An Guole, Tianzhu Le, Gao Li, etc. Among them, the Turtle, and the West is more important.\n\nYanle is divided into situat and standing play, Bai Juyi's \"standing\" poems described the level of sitting schicks is higher than that of colors. The Dangdang Dang Dagu is a unique wonderful song in Yanle. It inherits the tradition of the phase and the big song, combining the essence of the music of each family in the nine music, forming \"diamond, order or shoot, broken or The structure form of dance all. Seeing 46 Tang Daquang named by the \"Teaching Record\", \"said\" Nihang Qi Dance \"is the Tang Xuanzong, and there is also an elegant law style, which is called. Bai Juyi wrote a vivid depiction of the poem \"Niki Patient Dance\" in the Daguate Performance Process.\n\nAffected by the theory of Tu Music, the Tang Dynasty has an eighty-four adjustment, Yanle twenty-eight tune. The reduction spectrum founded by Caoofou in the Tang Dynasty has been used in modern times.\n\nThe last year of the Tang Dynasty prevails a storyline, there are roles and makeup performances, singing and dancing, and singing and dances with singing and accompaniment. Great, walk on the mother, a head, and the arms, etc. This is already a small monotheraday.\n\nTang poetry in the history of literature is to sing. At that time, the songs have been faster than the song famous poems; the poet also spreads their writing levels after their own poems.\n\nThe prosperity of the Tang Dynasty music culture also manifesses a series of music education institutions, such as the faculty, pear gardens, big music, drumping agency, as well as pear garden specializing in young children. These institutions create a batch of talented musicians with tight achievements.\n\nIn the Band in the Tang Dynasty, 琵琶 is one of the main instruments. It has been different from today's pipa shape. Nowadays, there are still some characteristics of Tang Ji in the shape and performance method.\n\nThe development of music culture in Song, Jin and Yuan dynasties is an important symbol of the population of public music. With the prosperity of urban commodity economy, adapt to the \"Vausi\" of the citizen culture life, \"hook\" came into being. In Thaishe, there is a singing, sang, small singing, singing, and other art songs, and singing cliffs, ceramics, drums, and hometown, miscellaneous, and colleges have also emerged. In the sings of the diverting, the two curved structures have a certain impact on the eucalyptus structure of the later generations and instruments. The drum word affects the singing music measuring in the later generation. The Palace is a large-scale singing model in this period.\n\nIn the inclination of Tang Shu's words, the \"Word Music\" of the Song Dynasty was developed. \"Word Music\" can be divided into the form of a word, slow, close, shoot, order. There is \"Breaking\", \"Draw\", \"Stolen\", etc. The South Song Dynasty Jiang Yan can make words, but also in terms of morp, he has 17 songs \"ancient grievances\". These works have expressed the author's mood of humanities, and in depicting clear and sorrowful artistic conception, such as \"Yangzhou Slow\", \"Xi Xi Mei Ling\", \"Apricot Hua Tianying\". Guo Chu Wang's representative made \"Xiaoxiang Shui Yun\" Kaiguqin's first river, and the work shows the authors enjoying the full interest in the mountain river. In the development of the bow stringed instrument, the Song Dynasty has recorded \"Ma Tailuqin\".\n\nThe Song Dynasty was an era that the opera became mature. Its logo is the emergence of the South Song Dynasty. The South Opera is also known as Wenzhou Zi Drama, Yongjia Zi Drama, and its music is rich and natural. At first time, some folk minimos, can not be restricted by the palace when singing. Later, when it was developed as a card with music, a number of phlegles of the organization of different songs have also appeared in the form of \"Collection\" in new songs. The South Opera has a solo, singing, chorus, etc. The three Chinese drama scripts \"Zhang Xie Yuan\" will be seen in \"Yongle\". Drama art has appeared in the Yuan Dynasty as the peak represented by the metamorphic drama. The prosperity of the Yuanzi Drama was originally in the north, and gradually developed in the south and blended the Southern opera. Representative Yuanzi writers about Hanqing, Ma Zhiyuan, Zheng Guangzu, Bai Pu, Wang Duoyu, Joji, Six people. Typical works such as Guan Hanqing's \"Dou Yu\", \"single-knife will\", Wang Shi's \"West Chamber\". There is a strict structure in the metadage drama, and each work is constructed of \"40% off a wedge\". One-fold internal limit with the same palace, a rhyme, often sing, these rules, sometimes there is a breakthrough, such as Wang Shizhen's 20% off. The influence of the Chinese drama on the Southern opera, causing further maturity of Wenzhou South Opera. A series of typical plays have appeared, such as \"Bay\", \"琵琶\", etc. These scripts have been circulated in the past, and it is still present. At that time, the style of South and North Song has been initially established, and the south song dominated by the seven-sound order; Southern Southern Southern Southern Southern. With the development of the incense art of the Dynasty, the earliest summoned drama singing theory has emerged, that is, the \"alonating\" of Yannan, and Zhou Deqing's \"Central Play\" is the earliest rhyme of Northern, he puts the northern The language is divided into 19 rhymes, and the word is divided into four kinds of glory, Yangping, emoching. This has a great impact on the study of post-world rhyme, and the development of opera saying that singing music.\n\nNanjiang, 大略 is formed in the Song Dynasty. At that time, the Quanzhou regional business brigade gathered, humanities gathered, so that Nanban Management with a large song of the Tang Dynasty was booming. The North Dynasty is incorporated into the south, and its impact on the South Tube contains the absorption of tunes, and the maturity of \"a four-section\" song method. From the development of musical instruments, the upper four-tube system of the South Dire has appeared in the Yuan Dynasty. In addition, the characteristics of the Nanoker phase score, that is, the musical instrument is bounced, and it is not as tune with the sauce, and it is also rooted in the North Range [3].\n\nThe three stringed appearances during the Yuan Dynasty is worth noting. The Song Dynasty appeared in Yanlanjo. Early generic spectrum spectrum also appeared in Zhang Yan \"Word Source\" and Shen Kui's \"Mengxi Net Talk\". Modern multi-range ribs direct directive source.\n\nThe development of the social and economic development in the Ming and Qing Dynasties, the increasing development of the citizenship, the development of music culture trends in secularization. The content of the folk songs in the Ming Dynasty is rich, although it is not good, but its influence has reached \"do not ask men and women\", \"everyone is learning\". From this private collection Edit, published small songs, and from folk songs to sing Book, drama, and piano have private journals. Such as Feng Menglong edited \"Mountain Song\", Zhu Quan edited \"magical secret\" and so on.\n\nIn the Ming and Qing Dynasties, the music is coming. Among them, the southern mean words, the number of the number of the northern, and the singing songs of the brand, the music, and the martial arts are more important. The beauty of the South is the most affected by Suzhou mean. The number of the north is important with the Milk drums of Shandong, the wooden board drums, the West River drum, and the Beijing rhyme.\n\nThe brand songs said that there are single strings, Henan high-speed songs, etc .; the piano books say that there is a Shandong Qin, Sichuan Yangqin, etc .; the kindness of the love of Zhejiang Tao, Shaanxi Road, Hubei fishing drum, etc., the ethnic minority has also said some singing Such as Mongolian says the book, the Bai's big song.\n\nDuring the Ming and Qing Dynasties, the song and dance music, such as the Han nationality, the Uyghur Mukam, Tibetan eda, the Zhuang's copper excitement, the Yi's peacock dance, the Dai's jumper, the reed dancing of the Miao, etc.\n\nWith the characteristics of the flow chamber, the Ming and Qing opera music has developed a new peak. The four largest sound cavities in the morning have sea salt, Yuyao, Xiangyang, Kunshan cavity, the Kunshan cavity via Jiangsu Taicang Wei Liang, etc., the tune is delicate and smooth, pronounced words, words, words, and win people's love . The Kunshan cavity has passed the bus of the South and Nishi, which has formed a quarter of the Crow of the drama. The earliest Tunma repertoire is the \"yarn\" of Ming Liangchenfish, the remaining important repertoires \"Peony Pavilion\", Qing Hongsheng, etc. The voyage cavity has an important impact on the dialects of dialects around the country, making the small players in the past, such as various venues. At the beginning of the Ming Dynasty, the northern scorpion cavity represented by Shaanxi Xinqin cavity, which affects the Puzhou scorpion in Shanxi, Shaanxi Tongzhou scorpion, Hebei scorpion, Henan scorpion. This high, the high-spirited, the rumor cavity is in the province of the north. Late Qing Dynasty, the skin yellow cavity consisting of two basic tones of Sipi and two yellow, initially formed in Beijing, resulting in influence throughout the country.\n\nDuring the Ming and Qing Dynasties, the development of instruments was in the form of a variety of instrumental ensembles in the people. Such as Beijing's Zhizi Temple, Hebei Blowing, Jiangnan Silk, Ten Ten Drums, etc. The \"Pingda Sanda\" in the Ming Dynasty, the \"flowing water\" in the Qing Dynasty and the \"flowing water\" and a group of rich piano \"Yangguan San stack\", \"Hu Yu 18 shots\" are widely circulated.乐 乐 自 明 明 明 明 名 名 名 名 名 名 曲.. 曲 曲. 曲 曲 曲 曲 曲 曲 名 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 曲 华 曲\n\nIn the late 16th century, Western music passed the missionaries to China. In the gift list of the Emperor of the Emperor of the Emperor, there is a good piano. It is an ancient piano. [4]\n\nChinese Ming Dynasty musician Zhu Zaun was first proposed for the first time of \"New Mission\" for the first time (see \"Law Ruyi\", \"Law\"), and calculates the ratio\n\n\n\n\n\n2\n\n12\n\n\n\n\n\n{\\ DisplayStyle {\\ SQRT [{12}] {2}}}\n\n The eight-degree sounds are divided into two algorithms, calculated the length ratio of the two half-sounds of the twelve average rhythm, accurate to 25 digits, and the world's first. He also made a musical instrument that complies with the twelve average law and law, which is the world's earliest twelve average law.\n\nAt the beginning of the Qing Dynasty, Professor Xu Richeng, Professor Kangxi, Xuli, the West, and a book with \"Law Ru Zhi\". The five-wire spectrum is also incoming China at this time. When the Emperor Qianlong, I also formed a Western band in the palace. The musical instrument has violin, cello, bass, wooden tube musical instrument, twin butt, xylophone, organ, Guqin, playing Dai Yico [5].\n\nDuring the 1910s to the 1920s new cultural movement, many Chinese musicians who study abroad have returned to China, and they began to play European classical music and started to record new works with the five-wire spectrum. The big city has formed an emerging symphony orchestra, mixed European classical music and jazz, very popular in the concert hall and radio. Shanghai in the 1930s reached its heyday. From the Shanghai Times, the Shanghai Times, the rise of China, became the ancestor of China's pop music.\n\nThe folk musician created a new stage for the development of Chinese musical instruments, and Liu Tianhua made two erhu to improve the performance, and created 10 Erhu mono. A Bing Created, \"2 Shu Ying Ying Moon\", \"Listen\", \"Large Wave Tour\". Despite the moment of death at the time, Chinese national music has a great development in solo and band ensemble.\n\nDuring the Northern Expedition War, China's musicians made a lot of revolutionary songs in the National Revolutionary Army, and some were directly equipped with foreign liberal songs.\n\nIn the war period of the Anti-Japanese War, the musician created a large number of anti-Japanese songs. The \"Yellow River Chorus\" in Xing Xinghai reflects the spirit of the national anti-Japanese anti-Japanese. Nie Er made a movie \"The Volunteer Army\", became the army song of anti-Japanese military and civilians, and after the founding of the People's Republic of China, the RMM will carry the national anthem.\n\nAfter the Yan'an Conference in 1942, the Communist Party rewrites the folk songs of the control area into a revolutionary song, such as Shaanxi folk song \"Oriental Red\". The purpose of rewriting is to spread communist thinking in most of the population of illiteracy.\n\nDuring the Cultural Revolution, music is monopolized by politics, and musicians are not obeying politics, which is accused of perseverance with various crimes. Western music is not legal, and the revolutionary songs that are launched and the so-called \"quotation songs\", \"model play\" are all political color and position. At the banquet of US President Nixon, the band played the American song \"Turkey on the grass\", the cultural minister at the time was protest to the prime minister. Chinese music enters a trough period.\n\nAlthough the \"Sample Opera\" is a political product, and the theme is single, but in the syllabus of the Peking Opera in the Orchestra, it has highlighted the music characteristics of Beijing Opera, and it is also a kind of Chinese and Western development.\n\nMinority music in the layout of the People's Republic of China has rich variants and content, such as Tibetan music, Mongolia music, Zhuang music, etc.\n\nTibetan is a nationality that can sing, and their songs are beautiful and vast, and they are turning. Tibetan music can be divided into Buddhist music and folk music. The most famous of the Buddhist music is the lama of the lama singing.\n\nTibetan folk songs are bright, and the tunes are melodious, mainly in five sounds. The song and dance form has \"fruit harmony\", \"fruit\", etc.\n\nIn terms of formal drama, it has now been excavated to perform the performance of Tibetan traditional opera \"Gesar\".\n\nChina's Northeast and Beijing is the gathering of Manchu. The most famous folk instruments of Manchug include are from the octagonal drums of the Qing Dynasty. Manchuria's cradle \"Flemet\" and other works are often covered with modern Chinese.\n\nMongolian folk songs \"long-term folk songs\" and \"short-tuning folk songs\". \"Long-tuning\" has many meaningless homophonic words to draw a chamber, with a style of grassland. The feature instrument is a horse-headed, a stringed instrument, because the piano is generally engraved on a horse head decoration, so it is named.\n\nZhuang people 's hometown in Guangxi is the hometown of folk songs, and men and women often have songs. Some people even say that the time of the Zhuang people sing is longer than the speech. The Zhuang folk songs and the Han music style are basically similar, mainly in five sound order. The lyrics have obvious confrontation formats, and the content is expressed in symbolism, metaphor, etc., based on communication in life, sometimes the lyrics also quote Chinese classical stories and allusions.\n\nDai Music and South Asia, Myanmar, Thailand's musical style, tunes are gentle, typical instruments are gourd and like a drum.\n\nNaxi Ancient music is a music played in the middle of the Yunnan Lijiang Naxi old man. It is said to be introduced from the Ming Dynasty. Due to the inconvenience of local traffic, it is very small in communication, and the Ming Dynasty music is reserved. Now there is only a group of old people. It can be played and is cultivating the successor. It is the activated stone of China's 14th century music, and is widely concerned by the music world.\n\nThe Yi people \"big song\" is the only folk song system in China, which is basically a singular chorus for the female voice. It is very harmonious by the sound of the voice of the sounds. It has caused a sensation in the international, and many awards.\n\nThe Uyghur music is basically a Central Asian musical style. It is very important to make a rhythm. Dozens of different rhythms can be made with a drum. The instrument is mainly customized. The traditional music of the Uyghur \"Twelve Mikam\" includes the source of many folk music.\n\nTajik Music and Han Music have a large difference, which is good at using half of the cycles, and the melody is multi-change. Lei Zhenbang is a song with a movie \"the guests on the iceberg\", which uses the melody of Tajik folk songs.\n\nThe Korean music and North Korea / Korean music are basically the same. The main instruments have long drums and gamsticks. Gahaqi is similar to the ancient Chinese ancient Chinese, smaller than the modern zither, and it is not the same, it is placed on the knee sitting on the disk. bomb.\n\nBeijing music and Vietnamese music are basically the same, and the main instruments have a stringed piano.\n\nChina's drama curve is one of the more popular arts in China. The Chinese opera is mostly high-profile sing cavity. There are more than 600 local drama varieties. The representatives of the opera music from all over China are: Kunqu, Peking Opera, Hebei Scorpion, Yu Opera, Event, Yue Opera, Cantonese Opera, Qin, Huangmei Opera, Chao Opera, Drama, Galant play and drama. Kunqu is called the source of China's opera and is listed by the United Nations as the world oral cultural heritage protection catalog.\n\nAfter the establishment of the People's Republic of China, the pop of the Soviet Union was translated into Chinese. It also establishes a symphony group, playing a new work of classical music and Chinese composer. Eastern Europe's orchestra has repeatedly goes to Chinese performances, and the Chinese Orchestra has also played abroad. Chinese musician uses Western musical instrument methods writing music with Chinese flavors, and there is a successful \"Liang Zhu Violin Concerto\".\n\nThe Oriental Song and Dance Troupe, special learning, singing the third world of folk songs and music, from the third world, the music begins to have an impact on Chinese music.\n\nThe midst of the Chinese national band, the ensemble is also fundamentally, producing a lot of successful national symphony.\n\nThe Chinese New Year Concert in Vienna Golden Hall every year.\n\nQianlong set up China's first orchard, but it is limited to personal preferences. In the 1900s, Beijing established China's first copper tube orchestra. Founded in 1913, Jinling Women's University has a music department, which has played a big role in spreading Western music. In 1927, National Music Special Sciences was established in Shanghai. In the 1930s, Shanghai established China's first symphony orchestra.\n\nThere are many Chinese people win in the international piano, violin, vocal music, opera singing competition, and Chinese musicians have created a lot of music and works with Western instruments.\n\nChinese music has already mastered seven sounds and twelve average laws, but preferences in five sounds, pursues melody, rhythm changes, despise and sound. Western music has gradually developed from ancient Greek five-sound order, until the twelve average law; from the mono portion to the use and sound.\n\nSince the reform and opening up in mainland China, pop music first enters the mainland from Hong Kong and Taiwan. Taiwan's campus folk songs and Dunlijun's singing are popular in mainland China. The first public Hong Kong song performance in mainland China is Zhang Mingmin, \"My Chinese Heart\" present in China CCTV Spring Festival Gala, and has been greatly reverberated in mainland China. Since then, the popular songs in mainland China began to absorb all kinds of music in the world.\n\nIn recent years, Chinese pops with Chinese and other regions have continued to communicate, starting with mutual integration. Started with the overall title of \"Global Chinese Popular Music\", the release and preparation of major pop music lists overseas began to pay attention to the mainland market.\n\nAmong the popular music in mainland China, the music of the folk, their typical representatives are the campus folk, urban folk, military camp, these folk music places a place in the pop music, and the folk songs, the popular lyrics have moved many people.\n\nAfter the reform and opening of the mainland China, the mainland people began to contact rock and roll, and set up a band to imitate and create.\n\nOn May 9, 1986, the commemoration of the Beijing Workers 'Stadium \"' 86 International Peace\" China Hundred Singer Concerts, Cui Jian Sucked \"One None\", for the first time in China's first rock, the first time.\n\nAt the end of the 1980s, the Tang Dynasty, the Black Leopard, Removal, Overload, Compass, Beijing 1989 and other bands have emerged in the late 1980s.\n\nIn 1994, Hong Kong held the \"China Rock Force\" concert, and the performances were all rock bands from mainland China. Dou Wei, Zhang Chu and He Yong were called the Magic Rock Triple.\n\nSubsequently, all kinds of Chinese rock and rolling winds appear: popular Zheng Wei, Xu Wei and zero, the low-fledged punk band Pangu, the wheat field of the British route, the wake-up, the folk rock of rock (now the name \"爻 爻 子\") And second-hand roses, as well as flies, Zuo Xiaozu and Wang Lei, Flower, new pants, etc. Modern sky, Jingwen Records, and Entertainment Company have launched a new monk and band, and there are many attempts to hold concerts.\n\nChina's religious music can be divided into Taoist music, Han Chuan Buddhism, Tibetan Buddhist music, and other religious music. "}