{"chinese_title": "computer Science ", "chinese": "Computer Science (English: Computer Science, Sometimes Abbreviation for CS) is the theoretical basis of systematic research information and calculations and how they implement and apply practical technology in computer systems. [7] [8] It is often described as a systematic study on the algorithm processing of creation, description, and conversion information. Computer science includes a lot of branches; some emphasizing calculations for specific results, such as computer graphics; and some are to explore the nature of computational problems, such as calculating complexity theory; there are also some fields to implement how to implement calculations, such as program language theory is research Description of the calculated method, the program design is to apply a specific program language to solve specific calculation problems. Human-machine interactions are focused on how to make computer and calculations become useful, easy to use, and anytime, anywhere.\n\nSometimes the public will mistake computer science is a business that solves computer problems (such as information technology), or is just related to experience using the computer, such as playing games, internet or text processing. In fact, computer science is concerned, not only to understand the nature of similar games, browser, but also create new programs or improve existing procedures through existing knowledge. [9]\n\nAlthough the name of Computer Science contains computers, the number of computers is actually involved in computer itself. Therefore, some new names are proposed. Certain key colleges are tended to calculate science in terms, with accurate emphasis between the two. Danish scientist Peter Naur recommends using the term \"Datalog\" to reflect this fact that science disciplines are processed around data and data, and do not have to involve computers. The first scientific institution using this term is the Datalog College, the University of Copenhagen, and the college was established in 1969, and Peter Naur is the first professor. This term is mainly used in Nordic countries. At the same time, in the early stages of computing technology development, \"ACM Communications\" suggested terms for the terminology of calculation field: Turingineer, Turologist, Flow-Charts-Man, Applied Mathematician and Applied Epistemologist. [10] After three months, Comptologist was proposed, and the second year became Hypologist. [11] The term Computics has also been proposed. In Europe, the name originating from information (Information) and math or Automatic is more common than the origin of computer or computation, such as Informatique, Informatik (German), Informatika (Slavic).\n\nThe famous computer scientist Azhel Daxterra has pointed out: \"Computer science is not just about computer, just like astronomy is not just about telescope.\" (\"Computer Science is no more about computers Than Astronomy Is About Telescopes \") Design, deploy computer and computer systems are often considered to be a non-computer science discipline. For example, research computer hardware is considered to be part of a computer engineering, and research and deployment for commercial computer systems is called information technology or information systems. However, it is now increasingly increasing the ideas of various types of computer related disciplines. Computer science research is often cross-compared with other disciplines, such as mathematics, engineering, cognitive science and economics.\n\nComputer science is considered to be more close than other science disciplines and mathematics. Some observers say calculations are a mathematical science. [12] Early computer science is affected by mathematics research results, such as Kurt Gothe, Allen Tuling, Lusha Peter (English: rózsa péter), Alu Zuqi, etc. Research, these two areas are in some disciplines, such as the logic, category theory, domain theory and algebies, and constantly have beneficial ideological exchanges.\n\nEarly computer scientific foundation is dating back to the invention of recent electronic computers. Those machines that calculate fixed numerical tasks, such as abacus, have existed since an ancient Greek period, and algorithms for speeding up calculations are extensive before the abacus is invented by ancient computing instruments such as abacus.\n\nWilhelm Schickard designed the world's first mechanical calculator in 1623, but did not complete its construction. [13] Blazuse Pasca is designed in 1642 and built a mechanical calculator in the world. Pascaline. In 1673, Leibniz began the construction of stepper calculator (English: Stepped Reckoner) and was completed in 1694, and he was also considered to be the first computer scientist and information theoretist because of recorded a binary system. Edda Lovles assists Charles Babacc to design differential machines in Victoria [14] [15]. Around 1900, the punch came [16]. However, these machines are limited to only a single task can only be completed, or at the same time is a subset of all possible tasks.\n\nIn the 1940s, with the update more powerful computing machine (such as ABC computer, electronic numerical integral computer) was invented, the term \"computer\" started to refer to those machines instead of their ancestors. [17] The concept of computer has become more clear, but it is not only used for mathematical operations, in general, the field of computer science has also expanded to the calculation. From the early 1950s to the early 1960s, computer science began to be established as different types of academic disciplines. [18] The world's first computer science site was established in 1962 in 1962. [19] With the emergence of practical computers, many computing applications have gradually changed into different fields of research in their own way.\n\nAlthough many people don't believe that the computer may become a scientific research, it has gradually been recognized by the academic in 50 years. [20] IBM is one of the participants in the computer scientific revolution in that period. In that stage of exploration, IBM 704 published by IBM (interNational Business Machines) and the IBM 709 computers were widely used. \"However, it is still a very frustrated thing to use IBM computer. If you make a mistake in a command, the program will crash, and you have to come back from the beginning.\" [20] In the late 1950s, Computer Science disciplines are still in the development stage, this problem is a very common thing at the time.\n\nOver time, computer science technology has significantly improved in availability and effectiveness. Modern society has witnessed the computer from the major transformation accepted by the majority of users. Initially, the computer is very expensive, to effectively use them, and some extent must be completed by a professional computer operator. However, as the computer has become popular and inexpensive, it has almost no need to assist in the assistance, although at some time aid is still there.\n\nAlthough computer science is considered to be a short history of a formal discipline, it has made many fundamental contributions to science and society. In fact, computer science is the same as the foundation of the information age, and the information revolution. The driving force is considered to be the third significant leap in the advancement of human technology after the industrial revolution (AD 1750-1850) and Neolithic Revolution (8000-5000 BC).\n\nThese contributions include:\n\nPeter Wegner (English: Peter Wegner) proposes computer science into three areas: mathematics, engineering, science. Amnon H. Eden proposed three paradigms to various fields of computer science: [31]\n\nAs a subject, computer science covers the limit of the theoretical research and calculation of algorithms to how to implement computing systems through hardware and software. [32] CSAB (previously called Computing Sciences Accreditation Board), representatives of Association for Computing Machinery (ACM) and IEEE Computer Association (English: IEEE Computer Society) (IEEE COMPUTER SOCIETY) (IEEE-CS) [34], established 4 major areas of computer science disciplines: calculation theory, algorithm and data structure, programming methods and programming languages, and computer composition and architecture. CSAB has established other important areas such as software engineering, artificial intelligence, computer network and communication, database systems, parallel computing, distributed computing, human-computer interaction, computer graphics, operating systems, and numerical and symbol calculations.\n\nGeneralized Theoretical Computer Science includes classic calculation theory and other focus on more abstract, logical and mathematical calculations.\n\nThe algorithm refers to a good calculation process, which takes one or a set of values ​​as input, after a series of defined calculations, get one or set of outputs. [35] The algorithm is an important area of ​​computer scientific research and is also the basis for many other computer science and technology. The algorithm mainly includes data structures, calculating geometries, charts, etc. In addition, the algorithm also includes many miscellaneous, such as mode matching, partial number theory.\n\nAccording to Peter J. Denning, the most fundamental problem of computer science is \"What can be effectively automated?\" [12] The research of calculation theory is to focus on answering this fundamental issue, and to be calculated, to implement these calculations How much resources need to be used. In order to try to answer the first question, the recipient test is solved in a variety of theoretical computational models. Calculating complexity Theory is used to answer the second question and study the time and space consumption of calculation problems to solve different purposes.\n\nOne of the famous \"P = NP?\" Issues, one of the millennium prizes, [36] is an open problem for calculating theory (English: open problem).\n\nInformation Theory is related to information quantification, created by Claude Shannon, used to find the fundamental limit of signal processing operation, such as compressed data and reliable data storage and communication. The encoding theory is to study the nature of the specific application of the code and their applicable. Coding (CODE) is used for data compression, cryptography, forward error correction, and recently also used for network encoding. The purpose of the study coding is to design more efficient and reliable data transmission methods.\n\nThe programming language Theory is a branch of computer science, mainly processing programming language design, implementation, analysis, description, and classification, and their individual characteristics. It belongs to computer science, which is affected by mathematics, software engineering and linguistics. It is a recognized computer scientific branch, and it is also an active research area, and the research results were published in many academic journals, computer science and engineering publications.\n\nThe formal method is a particularly mathematically based on the form specification, development and verification of software and hardware systems. In terms of software and hardware design, the use motivation of formal methods, such as other engineering disciplines, is the expectation of the reliability and robustness of the design by appropriate mathematical analysis. However, the use of formal methods will bring high costs, meaning that they are usually only used for high reliability systems, and secure or security in this system is most important. The best description of the formal method is the application of various theoretical computer science, especially computer logic calculations, form language, automatic machine theory and form insemination, and has type system, algebraic data type, and software and hardware Some problems in the norms and verification.\n\nComputer system structure, or digital computer organization, is a conceptual design and fundamental operational structure of a computer system. It mainly focuses on internal execution and memory access addresses in the CPU. This area often involves computer engineering and electronic engineering disciplines, selection and interconnect hardware components to create computers that meet functions, performance and cost objectives.\n\nThe operating system is a computer program that manages computer hardware and software resources, and is also the core and cornerstone of the computer system. The operation system needs to handle the management and configuration memory, determine the priorities of the supply and demand of system resources, control input and output devices, operational network and management archives systems, etc. The operating system also provides an operating interface that allows users to interact with each computer device.\n\nConcurrence is a nature of the system, which can perform multiple calculations that may interact with each other simultaneously. Some mathematical models, such as Petri nets, process calculations, and PRAM models are established for universal concurrent calculations. The distributed system extends concurrent ideas to multiple computers connected by network. Computers in the same distributed system have their own private memory, which often exchange information to achieve a common purpose.\n\nComputer networks are computer scientific branches that manage networks connected throughout the world.\n\nComputer security is a branch of computer technology, which includes protection information from unauthorized access, interrupts, and modifications, while maintaining system accessibility and availability for the expected user of the system. Cryptography is the practice and research of hidden (encryption) and decryption (decryption). Modern cryptography is mainly related to computer science, many encryption and decryption algorithms are based on their calculation complexity.\n\nThe database is to organize, store, and retrieve a lot of data more easily. The database is managed by database management system, stored, created, maintained, and search data through data models and query languages.\n\nComputer graphics is a study of digital visual content, involving synthesis and operation of image data. It is closely related to many other areas of computer science, including computer vision, image processing, calculation geometry and visualization, and is also used in special effects and video games.\n\nScientific calculations (or computational science) is to focus on building mathematical models and quantization analysis techniques, while simultaneously analyzing and solving scientific issues. In actual use, it is usually used in the form of computer simulation and computing, etc. in various scientific disciplines.\n\nMultimedia technology refers to integrated processing and management of multiple media information such as text, data, graphics, images, animation, sound, etc. through a computer. User users can use a variety of sensory and computers to perform real-time information interaction, also known as computer multimedia technology.\n\nThis computer scientific branch is designed to create a computational problem, as well as artificial systems that think like animals and humans. Whether it is in theory or application, It is required to have meticulous, comprehensive expertise, such as applying mathematics, logic, symbolics, motor engineering, mental philosophy, neurophysics, and social intelligence, or is used to promote intelligent research fields or Other disciplines, such as financial or physical sciences are required for calculating understanding and modeling. The artificial intelligence is beginning to become officially stem from Alan Turing this artificial intelligence pioneer proposing a map spirit test to answer such an ultimate question: \"Can the computer think?\" [37]\n\nSoftware Engineering is a research, implementation, and modifying software research to ensure high quality, moderate price, maintenanceability, and fast construction. It is a systematic software design method involving engineering practices to software.\n\nThe relationship between computer science and software engineering is a controversial topic. Then, what is \"software engineering\", how to define computer science has made the situation more confusing. David Parnas has enliminated from other engineering and scientific disciplines, claiming that the main focus of computer science is the nature of research, and the main focus of software engineering is specific calculation design to achieve practical purposes, so Two independent but complementary disciplines have been constituted. [38]\n\nSIGIR (Special Interest Group on Information Retrieval)\n\nKNOWledge Discovery and Data Mining\n\nAAAI (The Association for the Advance of Artificial Intelligence)\n\nACL (Annual Meeting of The Association for Computational Linguistics)\n\nNaaCl (The North American Chapter of The Association for Computational Linguistics) is a North American Branch for ACL\n\nEMNLP (Conference ON Empirical Methods in Natural Language Processing)\n\nIJCAI (International Joint Conference On Artificial Intelligence)\n\nSome professors' universities in computer science [which \"? ] The research on calculation and algorithm reasoning. These include calculation theory, algorithm analysis, formal method, parallel theory, database, computer graphics, and systematic analysis. Usually also professors, but only it is regarded as a medium supporting other fields of computer science, rather than senior research focus.\n\nSome other colleges, universities, middle schools, and vocational training [which \"? The computer science course focuses on training advanced programming, not algorithm and calculation theory. These courses focused on probing skills for software industries. Computer programming processes like this is often called software engineering.\n\nHowever, despite the increasing computer science major to the US economy, computer science education still does not exist in most US K-12 courses. October 2010 was jointly published by ACM (Page Archive, Saunched Internet Archive) and Computer Science Teacher Association (CSTA) (Page Archive Backup, Saved to Internet Archive). The report of To Teach K-12 Computer Science In The Digital Age reveals that only 14 states have adopted meaningful high school computer science education standards. At the same time, there are only 9 states to count high school computer science courses as the core discipline of graduation requirements. With \"Running On Empty\" article, a new non-party publicity alliance: Computing in the core (cinc) is established to influence federal and government policies, such as Computer Science Education Act (page archive backup, existing internet archives) ) Require government funding to formulate plans to improve computer science education and support computer science teachers.\n\nIn China, \"Computer Science\" or \"Computer Science and Technology\" is the secondary professional under the engineering (first class). Generally, it can be divided into three majors: "}