{"chinese_title": "energy ", "chinese": "Energy refers to energy source. Use energy through control and adaptation enables it to become a key development in human society. Can not be used in any society to avoid the use of energy. In industrialized countries, the development of energy resources in agriculture, transportation, garbage collection, information technology and communications are prerequisites for developed society. Since the industrial revolution, there are more and more energy use, and it also brings some serious problems, some of which, such as global warming to currently have potentially serious risks in the world. In addition, due to economic activities, such as intensiveness, energy efficiency, dependence, security and price, etc., such as manufacturing and transportation industries.\n\nEnergy resources in human social context: energy resources as synonyms of energy, generally referring to metrics, such as fuel, oil processing products and electricity. These are all available source of energy because they can easily convert to other energy sources for specific use.\n\nIn nature, energy can take several different forms: heat, electricity, radiation, chemical energy, etc. Many of these forms can be easily converted to another, such as using devices; batteries used from chemical energy to electrical energy. But most of our existing energy comes from the sun. Great potential energy elaboration can be represented by the famous formula E = MC2.\nModern energy can generally be divided into two categories: renewable energy and alternative energy sources.\n\nThe production and consumption of energy resources is very important for the world economy. Whether it is producing goods, transportation, allowing computers and other equipment to function properly, all economic activities require energy resources, which can be said to be one of the important production materials in the industrial age.\n\nBecause energy supply shortages or prices affect the economy. This usually involves shortages of oil, electricity or other natural resources. Economic and political instability may also lead to an energy crisis, like 1973 oil crisis and 1979 oil crisis. When the global oil mining rate reaches the highest (ie, petroleum peak) may contribute to another energy crisis.\n\nEnergy Forum in Developed Countries established in 1974. Composed of 23 countries such as Australia, Canada, Belgium, Denmark, France, Germany. The Member Government cooperates to coordinate energy policies and share energy supply in the incident of the oil crisis. And use development alternative energy sources to solve supply and demand issues and environmental issues in energy structures.\n\nNuclear power generation is the main application of nuclear energy. From the late 1950s to the 1980s, the world nuclear power began to develop rapidly. It is technique for heating and power generation using a nuclear fission released. The nuclear industry will generate radioactive waste, and low-order radioactive waste should be monitored for about 300 years. After the radioactivity is gradually reduced, it can determine its safety stability; and high-order radioactive waste, the radioactive high-order radioactive waste, requires a long-term proper management and disposal. To stand the extent to which the radioactive attenuation is comparable to the background radiation. [1]\n\nSolar energy, wind energy, geothermal energy, biomass energy, tidal energy, and water energy. In addition to biomass, all are non-combustion energy, also known as clean energy or green energy.\n\nIn general, energy comes from three ways: 1, solar radiation. The pathway is embodied in the Earth's surface by sunlight, plant energy, fossil fuel, surface temperature difference, moon reflective, water vapor evaporation cycle. The total energy of the sun radiation is limited. At present, the current extraction of such energy exceeds energy supplement; 2. Earth rotation. This route typically includes geothermal, magnetic, and wind energy, water flow, and tidal, etc., usually renewable energy. The atrivol is dissipated during the Earth's mutation, and occasionally manifesse as an explosive volcanic eruption or earthquake destructive situation; 3, nuclear fusion, nuclear fission. This route includes renewable energy in the traditional sense. The radiation energy can also be generated while generating a by-product. "}