{"chinese_title": "Mechanics ", "chinese": "Mechanics is a branch of physics, mainly studying energy and strength and their relationship between balance, deformation or exercise of objects.\n\nPeople use leverages, water appliances, etc. in daily labor, and gradually understand the ability of objects, and balance. The ancient Greece Aquary has been balanced, the objective position of the object, the center of gravity, and the object of the object in the water, etc. Aristotle also proposes the action of motion, that is, the object is not stressed, will stop.\n\nAfter the revival of the literary revolution, the scientific revolution raised, Galileo's free falling movement law, and Newton's three major sports laws laid the foundation of kinetic. Mechanics began to become a science. Since then, the establishment of the basic equation of the elastic mechanics and fluid mechanics makes mechanics to gradually depth from physics and independent disciplines. By early 20th century, in fluid mechanics and solid mechanics, the actual application of the actual application and the math theory, so that many new theories were found, and there was also a large number of key issues in engineering technology.\n\nMechanics can be divided into classical mechanics and quantum mechanics.\n\nIf you find the time to find it, classical mechanics have been discovered earlier, starting from the three major sports laws of Newton, quantum mechanics is founded by many scientists in the 20th century.\n\nClassical mechanics mainly study low speed or stationary macro objects. Cople, Galileo, especially Newton is the founder of classical mechanics.\n\nQuantum mechanics applications are wide, but it is mainly for microscopic substances. According to the corresponding principle, quantum number of quantum number can correspond to behavioral mode in classical mechanics, so that quantum mechanics and classical mechanics will not conflict. Quantum mechanics can explain and predict a number of behaviors of molecules, atoms, and basic particles. However, for generally common giant gains, if the quantum force learns to be complex to handle interaction between particles, the gauge system is still more appropriate to treat through classical mechanics.\n\nQuantum mechanics extends mechanics to the range other than classical mechanics, while Einstein's broad relativity and narrow relativity will also extend the mechanics of Newton and Galileo to a larger range. When the object speed is close to the light speed, the effects of the object will lead the behavior of the object due to the relativity, and the speed will not exceed the light speed. Quantum mechanics also need to be corrected with relativism, quantum field theory is the combination of quantum mechanics and narrow relativism. However, quantum field theory and broad relativity are still unable to integrate, which is a problem that the big one is hoped to overcome.\n\nIn mechanics, it is common to use a term \"object\". Objects may be quality point, generals, spaceboats, stars, certain fluids, some solid, some machinery or some civil buildings.\n\nSome branches in mechanics are also related to the \"object\" characteristics discussed. For example, the quality point is a small object, which is only considered to have a quality point in classical mechanics. The rigid body has a fixed size and size, does not allow deformation, and the quality point comparison, the rigid body increases some parameters referred to as freedom, such as the direction in space.\n\nObjects may also be a semi-steam having allowable deformation, such as elastomers, or no fixed shapes at all, such as fluids. These objects can be studied by classical mechanics, and quantum mechanics can also be used.\n\nFor example, a baseball is often analyzed using classical mechanics, and the active behavior of the atomic nuclear proton and neutron usually describes quantum mechanics.\n\nIn physics research, it is also useful to describe the behavior of the substance, called the field. Its description and mechanical use are somewhat different, which can be divided into classical fields and quantum fields. However, in practice, the content of the field and mechanics often have a close relationship. For example, the force acting on an object is often produced because of the electromagnetic field or gravity field, and when the object is actuated for other objects, the field is often produced. In fact, if a quantum mechanics, the object is also a field, and can be described by wave functions. "}