{"chinese_title": "management ", "chinese": "Management (also known as management science, English: management science) is a science of studying human management activities and their applications. It employs problems with some tools and methods to address management, such as using operational research, statistical, etc. quantitative analysis. Managers defined as managers and others and programs that are efficient and effectively through others. [1] Previous management science mainly uses operations to solve the problems encountered in management. In the past ten years, management science has developed very quickly. It is not only used to analyze some specific issues, but the comprehensive cross science of natural science and social sciences is used to analyze the operation management, human resource management, Risk management and uncertainty decision, complex system evolution, emerging, adaptive, self-organizing, self-similar mechanism, etc. It is no longer able to work. Since all organizations can be considered a certain system, management can also be seen as a human behavior, including design, and promotion systems better production. This view is \"management\" itself creates opportunities to develop, and you can manage your own prerequisites before managing others. Some people [who? ] I think management should be classified into natural science, and others [who? ] Is considered to be classified into social science.\n\nThe definition and scope of management includes:\n\nThe term \"managing\" in ancient French explanation is \"leadership, art\"; \"Leadership\" in the Latin explanation. In modern, \"management\" can be included in the leadership and management of all organizations; through organizational, scheduling and use a variety of human, financial, raw materials, entities, knowledge, assets or other intangible resources (including planning, decision making, organization, leadership and control) ), An organizational goal is reached in an efficient and effective way. Since management encompasses organizational organizations, it suggests that management needs effective communication; corporate environments (not just physical, mechanical environment) suggest that people's incentives have suggest effective progress or systematic output. Management can exist in legal or illegal environments or enterprises. In summary, personnel, communication, and active career directions are essential elements. Plan, measure, psychological incentive tool, target, economy, such as profitable, can be available in management. At the beginning, management can be seen from a functional point of view, such as quantization metrics, adjustment plans to achieve goals. This is also applicable in some cases that do not appear. As a result, Henry Fargoney [4] believes that management has six major roles:\n\nMary Follett, the early 20th century, Mary Follett, gives another view from the perspective of the philosophy, that is, the management is defined as \"articles that make people do things.\" [5]\n\nOther people think that this definition is too narrow. The words \"management is what people do\" \"\" is widely circulated, pointing out the difficulties in defining, defining nature changes, and management of backbone and class on management practices.\n\nIt is often called \"Business Management\" to manage management, such as charitable organizations and public sectors. In general, each organization must manage its work, personnel, processes, technology, etc. to maximize efficiency. But people are still accustomed to calling the school-managed schools, \"Business School\", some colleges, such as Harvard Business School, using \"Business School\", and other colleges, such as Yale School of Management, specially uses the word \"management\".\n\n\"Management\" The meaning of this word can also be used to describe organizer candidates, such as legal persons. The management system is a word used to describe a group used to manage a organization, such as a sports alliance. In English, \"Management\" or \"The Management\" is used as a collection noun to describe the management of the organization, such as the company's management. Historically, this is often relative to the vocabulary \"labor\", the latter refers to the managed object.\n\nIn profit organization, the main function of management is to serve shareholders. Typical activities lies in profit (for shareholders), create a reasonable price, valuable products (for consumers), provide employees with job opportunities. In non-profit organizations, manage the willingness to maintain donors. During most management or governance, shareholders elect the board, the latter appoints management high-level. Minorities even apply other ways (such as employee election methods) to participate in managers appointment.\n\nIn the public sector, management's performance is mainly to represent democracy, and participants receive public positions through elections.\n\nHistory of management is difficult to trace. Some people have started from the postmodern view, and they believe that management does not exist before modernization, only the plan (such as prime minister). Other authors trace the development of management can talk to the builders of Sumen and the ancient Egyptian pyramid. The slave owner of that century faced the power of work resistance but many of the early industrial companies use itself to make them don't have to be forced to face management systematic issues. But some innovation tools such as Arabic Digital (5th century to 15th centuries) and complex accounting method (1494) are administered to management estimates, plans and control. Hebrew recorded rich laws and laws in Moses, and a detailed specification for all kinds of government affairs, people, sacrifices, etc.\n\nBefore the industrial revolution, the limitations of commercial operating scales and the lack of mechanized record equipment, the enterprise owners will take the managers of the management of people. But when organizations become increasing, more and more complex, industrial owners (individual, industrial dynasty \"or shareholder group) and daily manager (independent planning, control and other professionals) have become more common .\n\nManagement has existed for thousands of years, and many authorings have become the foundation of contemporary management. [6]\n\nSome of the ancient military artificial policies provide reference for secular managers. For example, in the 6th century, China's General Sun Wushen, the \"Sun Tzu Art\", which is \"Sun Tzu\", is not awkward. [6]\n\nIn ancient and medieval, many people prepared \"King Mirror (English: Mirrors for Princes)\" aimed to advise the new monarchy how to manage the country. For example, India's Ciwi Lie's \"political incident\" (written in 300 years ago), and the \"Monarch\" (C.1515) of the Italian writer Nico Marquia. [7]\n\nClassical economists, such as Adam Smith, John Stewart Mill provides theoretical basis for resource allocation, production, pricing strategy. At the same time, inventors, such as Eli Whitney, James Watt, Matthew Bolton developed production technological factors such as standardization, quality control, cost accounting, interchangeable parts, and production plans. Many of these management have been applied in the US economy in 1861. At that time, there were 4 million people, using the current terms, is the \"management\" of mass production.\n\nIn 1777, Adam Smith wrote a famous \"national rich\", which mentioned the efficiency of tissue production through division of labor. [7] Smith describes how the process improves how to increase the productivity of the head. At that time, a worker could produce 200 big heads, and Schi was analyzed the production steps, and 10 people were divided into labor, which enhanced the efficiency of the large head in a day to 48,000. [7]\n\nAt the beginning of the 20th century, people found that managers have begun to work hard to build their own management theory on its own scientific basis (see only scientificism to understand such instructions). Examples include the management of Henry R · Soup in the 1990s, Frederick Winsli Taylor's \"Scientific Management Principles\" (1911), Frank Gilbrus and Lilian Gilbrus \" Application Action Research \"(1917), and Henry Gantt's Gantti. J. Duncan wrote the first management textbook for universities in 1911. In 1912, Shanganyang has introduced Taylorism in Japan, making it the first management consultant with \"Japan Management Style\". His son's Ueno led Japan's quality assurance.\n\nThe integrated theory of the earliest management appeared around the 1920s. Harvard Business School has awarded the first batch of business management (MBA) degrees in 1921. Henry Fargoney (1841-1925) and Alexandria Chiqi and others describe the different branches of management and their relationships. In the early 20th century, Odevi Did (1891-1973), Walter Sizte and James Muni and others applied psychological principles in management, while others, such as Egypt Paosphero (1880-1949), Mary Parker Ford (1868-1933), Chester Barnad (1886-1961), Max Weber (1864-1920), Lundis Lipt (1903-1981) and Chris Agilis (born in 1923), from the perspective of sociology, it was discussed.\n\nPeter Druk (1909-2005) has written one of the earliest works in application management: \"The Concept of the Company\" (published in 1946). This book originated from Elfred Slur (General Motors, 1956) to entrust it to a study on the company. Druk wrote 39 books again, and many of them still use the same ideas.\n\nDodge (H · Dodge), Ronald Fisher (1890-1962), Tornton C. FRY introduced statistical skills for management research. In the 1940s, Patrick Blackte specialized in the development of the application of mathematics science in operation, and the beginning was to implement military action. Operations are sometimes referred to as \"management science\" (but there is significant difference from Taylor's scientific management), trying to use scientific methods to solve decision-making problems, and can be directly applied to multiple management problems, especially in logistics and operations. .\n\nAs the 20th century manager has been widely recognized as a class, the practitioners in management art / science throwers have begun to have some prestige, so they have opened up the road to the public to sell the road to the public. In this context, many fashion theories of management are more related to mass psychology, rather than management scientific theories.\n\nRecent developments include restrictions, target management, reengineering, Six Sigma and various information technology drivers, such as agile software development, as well as team management theory, such as Cog's Ladder (tooth steps).\n\nBy the end of the 20th century, business management is mainly composed of five parts:\n\nThe observers in the 21st century have discovered that it is more difficult to further differentiate the management team according to the function. More and more processes require several functional items. Therefore, people tend to think about management according to different processes, tasks, and goals.\n\nThe branch theory of management is also applied to non-profit organizations and governments: such as public administration, public administration, education management, etc. Management further extends to civil society, such as non-profit organization management, public welfare entrepreneurship, etc.\n\nIt is worth noting that many assumptions in management have been attacked, such as criticism from business ethics, critical management research (English: critical management studies), anti-company radical movement (English: anti-corporate activism), etc.\n\nOne of the results is that labor democratization (English: Workplace Democracy) is more common, all levels of management in some places or through management. However, these patterns have occurred before all political forms, and there is naturally formed, even earlier than the command level (English: Command hierarchy). All management has access to some form of democracy. In fact, from a long-term perspective, management must obtain support for most employees to operate. Otherwise, the employee either leaves the job to find another job, or organize strikes to protest. Although the management trend is towards democracy, the command-control structure is still in fact (DE FACTO) organizational form. This root deep-rooted command-control structure is that the recent large number of layoffs did not have much impact on management. In some cases, the management has added a bonus to yourself when cutting off the grassroots employees. [8]\n\nBased on leadership competence scholars Manfred Katez (English: Manfred F.R. Kets de Vries), all high-level management teams today are inevitably affected by some degree of personality disorder. [9]\n\nThere are many different functions in management, and the latter is often classified as plans, organizations, personnel, leaders / command, control / monitoring, and incentives. Modern is summarized as plans, organization, leadership, control.\n\nMany organizations have a three-level management: base layer, middle-layer, and high-rise. These managers constitute an entry level and complete different work. In many organizations, the number of managers is pyramid in a pyramid relative to the level. Each level of administrators has corresponding responsibilities and titles. [12]\n\nHigh-level managers include boards (including non-executive directors and executive directors), president, vice president, CEO, and other chief level management personnel. They are responsible for controlling and supervising the entire company, identifying a tone, formulating a strategic plan, corporate policy, and determining the development direction of the company. In addition, top-level managers play a key role in raising external resources and is responsible for shareholders and the public.\nThe Board is usually mainly composed of non-executive directors. These directors have integrity obligations to shareholders, but they don't closely participate in the company's daily activities, this point with the company's type (such as public or private), scale and cultural differences Difference. These directors should be responsible for violating the obligation, usually they will inspect directors and senior staff liability insurance. It is estimated that the world's 500 directors spend a week of 4.4 hours a week to perform the board obligations, in 2010, the median number of salary is $ 212,512. The board of directors determines the company's strategy, developing major decisions, such as important acquisitions and hiring, assessment, and dismissal to high-level managers (CEO, CEO), and CEOs are usually responsible for employing other positions. However, the participation of the board of directors in other executive positions such as Chief Financial Officer (CFO) is also improved. In 2013, a survey of more than 160 CEOs and directors from public and private companies found that CEO's largest weaknesses were \"guiding skills\" and \"Board participation\", and 10% of companies never review CEO. The Board may also hire some employees (such as internal auditors) to report the situation, or directly hire independent contractors, such as the Board (through the Audit Committee), usually choose the auditor.\n\nUseful management techniques for senior management changes with the company's type, but usually include a board of directors that understand competition, the world economy and politics. In addition, CEO is responsible Execute and determine the extensive policy of the company in the board of directors. The supervisor management has completed the daily work details, including: Description of the requirements of the department budget, procedures, and planning; hire middle management personnel, such as departmental managers; coordination between sectors; media and government relations; and communication with shareholders;\n\nThe management of the middle layers consists of the general manager, the regional manager, the department manager, and reports the work of the department to manage the high-level report. They pay more attention to organizational and command, and perform organizational plans according to the company's business policy to complete the goals of the high-level development. The middle management personnel are responsible for conveying the high-level information and decision-making, explaining to the grassroots, and provides guidance and inspiration for grassroots managers to improve efficiency. The main functions of the management of the management include:\n\nThe management base layer includes supervisor, group length, foreman, and more. They focus on control and command, often assigned to employee assignment tasks, guidance, supervision employee's daily work, to ensure the quality and quantity of production, propose suggestions, report issues, and more. Grassroots managers also set an example for employees and provide:\n\nCommon management theory branches are as follows [13]: "}