{"chinese_title": "Asia ", "chinese": "Asia (ancient Greek: ασία; Latin: Asia), referred to as Asia, with an area of ​​44.79 million square kilometers, accounting for 8.6% of the total land area (29.4% of the total land area); the Asian population is about 4.7 billion people, the world The total population is about 61% (2019) [2]; it is the largest area in the seven continents and the most population. Asia is one of the human civilized cradle, and the three major religious Buddhism, Islam and Christian origin, three of the four civilized ancient countries (Cuba Bien, Ancient India, ancient China) is located in Asia.\n\nAsia is located in the eastern part of Asia, most land is located in the east half of the world and the northern hemisphere. The east is the Pacific Ocean. The north is the Arctic Ocean, and the south is on the verge of the Indian Ocean. Asia and Africa are bounded by Suis Canal, across Yard, Mande, Red Sea and Africa. Asian and European divided lines are the Ural Mountains, the Ural River, the Hihai, the Caucasus Mountains, the Black Sea and the Black Sea Strait. The Northeast of Asia and North America is roughly in the Bright Brand. The southeastern Asia is looking forward to Timor Sea with Oceania.\n\nThe four arrivals of the Asian continent (excluding islands) are the most east terminals to Bailing Straits Jayni'ov corner (Western Siya 169 degrees 40 points, north latitude 60 degrees 5 points), the southernmost end is the Malensian Damashi (East 103 degrees 31 points, 1 degree north latitude 1 degree 16 points) [3], the most west end is Turkish Barbajiao (26 degrees East, 39 degrees north latitude), north to the northern end for Russia Cutus Golden Cerem (East Ten 18 points, north latitude 77 degrees 43 points). Crossing the latitude and longitude is very wide, and there is 11 hours. In addition to the mainland, the Asian islands have about 2.7 million square kilometers, only in North America.\n\nAsia's highest peak is the world's first peak, the lowest point of the world, the highest plateau is the world's highest plateau Qing Tibet Plateau. The longest river is the third long river in the world. The biggest lake is the sea, the deepest lake is Baikal Lake The largest desert is the Arab desert.\n\nAsia Names said that the Greeks from the East. The Assyrian also used the term to represent the Oriental, originally only the small Asian peninsula (Anatolia), and expanded to all oriental areas. The other is that \"Asia\" comes from the Phoenic language, the Phoenici people call the Aegean Sea as Ereb, meaning \"the land of sunset\", the east called ASU, meaning \"the land of Sunrise\", Greek plus negative word tail ασία. In the first century BC, ASIA has become a name of an administrative province of the Roman Empire.\n\nThe Chinese translation of Asia was first named in 1582. After the missionary Mission of Jesuit came to China, with the help of the King of the King of the Kunyi, the translator was jointly formed \"Kunyi Wan Guo\" [4]. Since foreigners come in China when foreigners come to China, these translations have strong southern Chinese color. The beginning of the pronunciation is \"A\", \"A\", the end is translated into \"Asia\", and the foreign language is read more. When translating into Chinese, the translator will choose the pronunciation of Chinese characters in the local language. Chinese characters.\n\nAsian two river basins, India River-Gantheng Basin, Yellow River Basin is the development of human civilization, oriental business (about 1558 - about 1046), Zhou Dynasty (first 1046 - prior 256) and Western The Asian Empire of Meso Namia Civilization (first 934- July 605), the ancient Indian 16th and Xiongguang and the Dai Dynasty (the first 424 - first 322), the Kingdom of the Grand Iran (The first 678-553) and Persian (the first 553-334) were developed into a large-scale country, a large number of people in the territory. After the Empire of Alexander Empire, India also established the Peacock Dynasty (the first 322--187).\n\nAfter the Macedonian Empire, the Antiki, the Richmors Kingdom, and the Lixi Makos, which controls Xiao Ya, Sende Ancient Empire and Nummly Tribe League - Pani Emirates Alzak Idea Patty in the first 238 years The Alzak Dynasty (the first 238-224) created after the Patayi language (the first 238-224) was completely controlled by the Syrian in the Syrian, the Syrian, the Syrian, the Syrian, the Syrian, the Syrian, the Syrian, China. The Central Asia and the Siern River between the Mesy Damia and the East East Wushe River; the exchanges between the Eastern and Western economic and cultural exchanges are gradually smooth and strengthened, the Silk Road is from China Luoyang, Chang'an The rivers, the Central Asia Tianshan Mountains and the Kunlun Mountains of the Tarim Basin and the Sierre River and the Sierra River in the Central Asian River in the Central Asia River in the Central Asia River and the oasis areas and passed Grand Iran and Middle East, Yuanda India, Taizi, Babylon, Seea, Annak, Rome, Carthard, Alexander Port. After the rise of the Roman Empire, the territory once included the small Asian peninsula, Mesopo Damia.\n\nDuring the two Han Dynasties, the Huns, the Huns in the mobei (before 209-158) finally defeated with the War of the Han Dynasty, and the Han Dynasty controlled the Central Asian Tarim Basin, a part of the North Huns mute in 158 to the Sierre and The Turlae grassland in the North River in the Central Asian river in the Central Asian river is also aggregated here and the tribe and in 372, the Ural River invaded Europe, and defeated the Alan and Dresvet River. The monarchy of the River River has come to the downstream plains of the Danube, which is considered a \"barbarian\" in the eyes of the West Roman Empire, accelerate the Empire of the West Roman Empire after the Empiria. Part of the Central Asian river between the Sier River between China, Central Asia and the Wulgar River, known as the Namarius (424-557, also saying that this Bai Xun is the Dali King The descendants of Doraro have caused serious damage to the Saan Dynasty (224-1651) in the Middle Dynasty (224-651), and part of the leader in the leader of Roman and Misiiragola. The rest of the precious frost empire. It is also caused serious damage to the Indian dynasty (280 / 320-550) that originated from CaCA (280 / 320-550), but the final Missilagola's army is still defeated by Momoaf and Duo Dynasty coalition forces in 534. A small portion is in 46 years, Wuzheng County, Wuzhong, Wuzhong, Wuzhong County, Dingxiang County, Yanmen County, Shangtian County, West River County, Shangshi, Northern Dish, Anddan, County County, etc. After the chaos of the East King of the West, rudding Xi Jin and leads to the emergence of Wuhu Baiki and two hundred and eighty years.\n\nAfter the Tuoba Fresh Human people occupy Northern China, after the establishment of the Northern Wei Dynasty, it was jejac to the beginning of the 5th century, and established a soft and huge (400-546 / 552), and Yuezi raised the establishment of Hero slave owners. Asia The Political Bureau has a significant impact. Even after the death of Software, a soft Avar (also questioning the Avar is the North Caucasian race) also affects the East Roman Empire and Western European Frank Kingdom.\n\nIn 630, Mecca and Medina in the Arabian Peninsula in West Asia raised the Islamic and Islamic Kingdom of Muhammad, gradually conquered and occupied the Persian Dynasty (224-651) and the occupation of the Tired East Roman Empire in West Asia. Fanter and North Africa's large-scale, Islamic Mashari, the Times of the Miahari, the Times of the West Asia, Central Asia, North Africa and the Iberian Peninsula, and the soldiers fell to the south of the Frank Kingdom, the south, and even once occupied India. India River plain. In the territory of the East Asia, the territory of the Sui and Tang Dynasty dynasty is also expanding to Central Asia and indifferent, and deeply affects the Korean Peninsula, Japan and Vietnam. Both are gradually become an emerging monarchy country. In the middle of the 8th century to the 11th century, South Asia's Indian Polo Dynasty is the last Indian dynasty as the last one with Buddhism; and the Juli Dynasty, the Juli Dynasty, which has gradually reached, and once accounts for Sumatra and Malay Peninsula.\n\nDolly Khan (546/552 - 583), the rise of the East Turk Kaben (583-630) and Xi Junji (583-658) did not cause the Asian political situation in the 6th century The little influence, followed by the rise of the Sui and Tang Dynasty and the rise of the Islamic Harley, the Tang Dynasty walked down the slope after the chaos of the Ai Shi, and the Toyo Khan (744-1840) and the Qinghai-Tibet Plateau (580-) In 877, it was more prosperous, which had a great impact on the East Asian political situation; the Tang Dynasty was in the name of Wang Xianzhi and the yellow nest of Wang Xianzhi and the yellow nest, and finally died in 907, the Liao Dynasty (Daddan) established by the Qidan At that time, the East Asian Political Bureau had a great impact. In the 1990s-22, the Islamic Azhari, which was originally rulled in China, went to decline after Mont; Tari Dynasty in the Great Iran (821-873), Safar Dynasty (861-900 / 1003 Year), the Alafield Dynasty, the Qi Dynasty, the Bai Yi Dynasty (934-1055), the Sadman Dynasty (819-999), the Gair Dynasty (962-1186), the Gur Dynasty (1148- 1215 years), Selzi Empire (1037-194), Huazi Temperature (1194-1220) has held further Islamization in these places in Central Asia, West Asia, South Asia, strengthens the further Islamization of these places, and makes it Economic and cultural technology is more prosperous, and the Silk Road is more open.\n\nIn 19960, the Northern Song Dynasty, the Northern Song Dynasty, established in the first two generations of Emperor, and then the development of ancient China's economic and cultural technology reached a new peak. In 1114, Jin Taizong, which was established by Yan Hao (1123-1135), successively destroyed the Liao Dynasty and Northern Song Dynasty. After 1127 Southern Song Dynasty, China once again appeared the situation in north and south. During the Song Jin Ding period, economic culture was restored. However, in 1206, with the rise and rapid expansion of the Mongolian Empire, conquer the vast number of Central Asia, East Asia, West Asia, Eastern Europe, but there are countless ancient civilizations in this process, and the overall civilization of the entire Asia is moving towards decline. . At the same time, in 1206, the Islamic Sudanese country in India was ruled, and gradually expanded to the south of Deggie Plateau in the south of Deggie Plateau in the Kargun Dynasty and Turku Dynasty, making India. The Mongolian Empire was divided into the Half Dynasty and the four sweats in the middle of the 13th century. After the 14th century, the North dollar lost to the Ming army in the 1888 fishing, the Ming army caused the Northern Yuan Monarch to take off the ancient thought The child is also sure to assassinate, and the Northern Yuan crack is to fight and fight. In addition, in the Capsuki, December 31, 1242, 1241, January 30, 1242, which passed the most advanced gunpowder weapons in the world into Europe, and also made European army's gunpowder era. In the end of the 13th century, the full of Southeast Asia is the sustained power of Southeast Asia at the time. In 1369, Tumer Empire established by Tumer During the 1360-1405, the territory expanded the territorial domain to Punjab, Shu, and Delhi, Central Asia, West Asia, and Economical Southern and India. In 1526, the Losuka Caber was crossed in India to defeat the Delhi Sultan in India, and built the Mohed Empire. This Mughal Empire was reached until 1707 Oranu was going to decline.\n\nIn 1299, the Ottoman Empire was established. In the 1308, the Roms Sudan is destroyed; 1354 dispatching army spends over the Heles of Heles, which has become a confidant, and makes the Byzantine Empire become its attache, Jianbu Burhae, in Baye The Territory of the Osman Empire of the Juti Times, the Toros Mountain Peninsula, the south of the Toros Mountains, the south of the Danube, the south of the Danube, and the Nikopolis battle defeated the last Cross Army, and the name is similar, although at 1402 At July 20th, the Akala campaign lost to Tumber, which led to the throne of the throne (1402-1412), but eventually resuscited and returned to the 1453 death in the Muhammad II, occupying the Carterstand Dingbao has made it a capital of its capital. After the Osman Empire, the Southeast Ou, the Middle East, the Soutya and North Africa, the Sudan (Emperor) of the Ottoman Empire, inherited the Lord of the World, inherited the Roman Empire and Islamic culture, things Civilization is integrated in its hands. The Ottoman Empire is located in the intersection of the things, and masters the land transport line of the things civilization for six centuries (1400-1922). In its existence, it is more than once, and it is impossible to implement Islamic and modern reforms, so that the boundaries of things civilization have become more vague.\n\nAfter Dongji, after four short-term ban on the ban, 1370, the Ming Taizu established the Ming Dynasty to carry forward this sea-ban policy. Although there is Zheng He's Western Yual, it will maintain a sea-ban policy. Although Ming Muzong Lung Qingqing Near China (1567 - 1572) Implementation of Open Sea, Ming Dynasty, and the economic and cultural exchange of East and West, the Qing Dynasty continued to ban the policy of catching the ban, and caused the shrinking of Eastern and Western economic and cultural exchanges and the stagnation of China's development.\n\nHowever, due to geographical discovery during the 16 to 17th century, Europeans have come to the Far East to develop trade and mission until the Japanese lock country, after 1723, East Asia is gradually closed. In Northern Asia, North Asia and Eastern Europe, with the tiles of Golden Towers, Moscow's big public, after the Ivan III, occupied Novgorod Republic in 1478, defeated the Khan Guowei (1219-1502) in 1480 (1219-1502) In the year), the shackles of the Mongol were all destroyed in 1502. Then the Terrik Dynasty was self-proclaimed in the Ivan Viée in 1547, claiming to Tsar and destroyed the Mongolian Kazan and Siberia. The Romanov Dynasty's Tsar Russia gradually followed the land expansion of the territory. Its exploration team arrived in the Ye Nii River in the 1620; 1643 to the Heilongjiang River Basin and the Qing Dynasty conflict with the Qing Dynasty, then signed the Sino-Russian \"Ni Bu Treaty\" in 1689. After the True Russia established a Russian North American Governoric region in Alaska in 1733, it constantly occupied Central Asia; this empire has ended until the early 20th century.\n\nSince the 16th century, European colonialism enters Asia, affecting almost all Asian regions, some colonial rules in some regional colonial rules for two or three hundred years, profoundly changed the political, social and economic development of Asia, and the impact is still there. In 1600, the UK East India has entered the Indian sub-continent development of colonies, 1858 India officially became the British colonies. In 1602, the Netherlands established the Netherlands East India, started in Indonesia, 1800 Indonesia became a Dutch colonial. After 1511, Portugal, the United Kingdom was starting colonial Malay Peninsula, until 1824, the UK established the hegemony of Malaya. After 1840, the UK launched an opium war in the Qing Dynasty, until the 1900-year-old coalition in invading China, China entered the semi-colonial society. After the 18th century, Russia expanded to Central Asia, Siberia, invaded China and North Korea, and included North Asia into the rule.\n\nAsia's ancient empire destroyed. In 1857, the British colonists flooded the emperor of the Moham Empire, directly ruling India. In 1911, the Qing Dynasty was destroyed. In 1922, the Ottoman Turkish empire destroyed. Before the Second World War, in addition to Japan, most of Asia countries and regions become colonial and semi-colonial land; they were directly occupied as a colonial Accounted for 2/3.\n\nAfter the Second World War, Asia became the test site of the Cold War. The national civil war, the Korean battle, the Vietnam War is the actor's war under the Mei Su. Asian countries have also begun to rebuild, military in China, successfully nuclear, economically Japan, South Korea and Taiwan's economic recovery under the US aid, and began to be highly developed. After the reform and opening up in 1978, China has become the world's second largest economy.\n\nThe colonies of the United States and the United States have independently, but in the Middle East Israel and the conflict in the Arab countries, the intervention of the British and American Soviet Union makes the situation since the Six-Pedica agreement. South Asia continued to be tight after India and Pakistan, due to the issue of religion and territories, and the two countries were fighting three times, and they had nuclear weapons launching capabilities.\n\nAsian geographies are very vast, in the north, the south extends to the south of the Equator, East, North, South, and three sides are on the verge of Pacific, Arctic Ocean and Indian Ocean, west and Europe, southwest and Africa, East, Brandy Brand North America is facing.\n\nBetween Asia and Europe usually use the Ural, Ural River, the Northwest Sea of ​​the Ural, the High Caucasus Swarfs, the Black Sea, Turkey, Aegean. The Twelve Islands of Greece, Northern Aiqinhai is close to Turkey's Aegean Coast, geographically, should be as asia. The Ural Mountains naturally extends to Vaiqi Island in the Arctic Ocean, and Xinji Island now believes that it belongs to Europe, in fact the Asian European lines in the south bank of Kara.\n\nAsia and African boundary lines are the Suez Canal. The Indian Ocean island Seychelles, Mauritius, and Comoros are all in Africa. Yekotra is close to Africa. Asian and Oceanian boundary lines are Weiber line or Riddi line, so Indonesia's Irian Kia is Oceania. The boundary line of Asia and North America is a white strait and a white sea. Each island is divided into two continents in accordance with the US, Russian jurisdiction [5].\n\nOverall, there are three characteristics of Asian terrain [6]:\n\nThe avenue movement of the Third Ji Ji is far from the influence of Asian terrain. Among them, the Eurasian sector and the Pacific plate collide, and the crust on the tape is pushed into the East Asian arc of the East Palace of East China, and it has made it a region in the world's earthquake volcanoes. The Eurasian continental plate is pushed by the Indian sector, forming a hidden papers of the new pleat mountain. The main mountain range is moving towards, the mountain is towering, the terrain is rugged, and is connected to the south of Asia. And mountain sandy plateau and basins, these places are also the birthplace of the Dahe. Siberia in northern Asia is a crystalline ancient plot, which is rich in metal mine, and the terrain is relatively flat. The hormones of the West Asia are dominated by the plateau, and the middle clamping the beauty of the Corosian in the bottom Gris River and the journal.\n\nAsia's main terrain units are:\n\nAsia's main features are complex and diverse climate types, and the monsoon climate is typical and continental. Sanzhong, temperature, hot three strips, and complex and diverse climates make the world's climate in Asia, all kinds of climate in Asia. East Asia Southeast Half of East Asia is a humid temperate and subtropical quarter wind climate zone, Southeast Asia and South Asia are wet tropical season wind climate, Central Asia, West Asia and East Asian inland for arid areas [6].\n\nThe difference in temperature in Asia is significant. The Malay Islands near the equator, such as summer, the average annual temperature is around 26 ° C. In the eastern part of Russia, the average temperature of 7 months in Russia, the average temperature is below 0 ° C, and there is a low temperature record of -71 ° C Oimikikang in the northeastern town, which is the cold pole of the northern hemisphere. [ 7].\n\nSignificant differences in climate also lead to a huge difference in precipitation in Asia. The annual rainfall in the desert area of ​​Central Asia is less than 100 mm, while in South Asia, the water in the wind reaches 3000 mm, the highest record is even 22,860 mm. The typhoon generated in the Pacific Ocean will also bring abundant rainfall in the eastern part of Asia.\n\nThere are two major characteristics of the Dajiang Dafa River in Asia. There are two main characteristics of the river network [6]: First, the rivers have originated from the central plateau mountains, and the ground is radialous to flow around; the second is that the internal flow area is large, such as the middle The Sier River and the Am River were infined in the salty sea, including the Arm River 2540 kilometers, which is the longest intraudio of Asia. Most of the rivers from the central mountain are eventually injected into the Pacific Ocean, the Indian Ocean or the Arctic Ocean. Among them, there are 7 rivers and above, there are 7 rivers and the longest rivers are the Yangtze River.\n\nThe Richai in the western Asia is the world's largest lake. Lake Baikal is the largest freshwater lake in Asia. It is also the world's deepest, the oldest lake, the bottom of the lake is 1295 meters below the sea level. The Lisris River and the Children's River, the Yellow River, the Indian River Basin are the earliest civilizations. The Ganges is Holy River, Hindu and Buddhism. The Mekong River is an important international river, and the basin country includes the People's Republic of China, Myanmar, Laos, Thailand, Cambodia and Vietnam.\n\nAsia's natural resources are relatively rich, mineral types, large reserves, mainly oil, coal, iron, tin, tungsten, antimony, copper, lead, zinc, manganese, nickel, molybdenum, magnesium, chromium, gold, silver, rock salt, Sulfur, gem, etc. The reserves such as petroleum, magnesium, iron and tin are first in all continents, including more than 60% of the world's total reserves [7].\n\nThe total forest area of ​​Asia accounts for 13% of the total area of ​​the world, part of Russia, the northeastern China, North Korea Democratic People's Republic of China, is a wide range of coniferous forests in the world, and has a lot of precious materials. . South Slope of China, Southwest, Japan Mountain, is particularly abundant, except for ordinary broad-leaved tree species, and palm, plaster, fir, flutter, etc. The tropical forests in Southeast Asia are an important position in the world forest, which is known for a constant, rich plant community. Its main tree species is the dragon brain, and there is a tree fern, ginkgo, and 活 铁, etc. [7].\n\nAsia's hydraulic resources are also relatively abundant. The development of hydraulic resources that can be developed can reach 26,000 billion degrees, accounting for 27% of the world's ability to develop hydraulic resources [7].\n\nAsia is the world's most populous, most dense continent, with a total population of 3672 million in 2000, accounting for 60% of the world's total population, with an average of 80 per square kilometers. There are more than 1,000 nationalities in Asia, accounting for about half of the total number of world nationalities [6]. The major nations are Mongolians (yellow people) and Caucasus (Caucasian), and there are a wide variety of people, including most of the language. At present, the population growth rate of East Asia has dropped to 1%, but the average growth rate of population growth rate in Southeast Asia, South Asia and West Asia is 1%.\n\nAsia's main nations include:\n\nIn ancient times, Asia has always been the center of the world economy. At that time, the world's major powers, such as China, India, Arab, and Persia (now Iran) were located in Asia. Asian farming industry can maintain most of the world's population. The main food producing area of ​​the EU's largest Empire Empire is also located in Asia.\n\nAfter the 18th Century Industrial Revolution, European capitalism raised, imperialism policies as other places as colonial expansion and plunder, most of Asia, America, Africa and Australia became European colonial or semi-colonial land. In addition to Australia and North America because local aborigines are almost completely destroyed, becoming a European world. Other Asia, Latin America and Africa have gradually independent in the Second World War, and the economy is also in a very backward situation. But in the second half of the 20th century, Asia is the most rising place in these original colonies. Japan first became among the world, for the first developed country in Asia, the Asian four small dragons (Republic of Korea, the Republic of China, China, Hong Kong and Singapore) have become the development of national or region at the end of the 20th century, and the economic rise of the People's Republic of China has Become Asia's largest economies, the world's second largest economies, second only to the United States. The rapid development of the Indian economy has made it a world's eye-catching place. Due to the large area of ​​Asia, the difference in economic development in each region is large.\n\nAsian resources are absentized in Asia, including Bay Country Saudi Arabia, United Arab Emirates, Iraq, Kuwait, Yemen and Iran, and in Indonesia, China, China, and Russia are also mainly producing oil. Asian part of mainland China and Russia is the highest in the world. Southeast Asia is the main supply of world hardwood and is also a region where tourism resources are rich. In addition to South Africa, the world's diamond production area is only an important part of the Asian part of India and Russia. Asia also includes almost all mineral resources with economic value.\n\nDue to the broad field of Asian, many nations, the diversity of culture is very strong, the difference is very large, and there is almost no unified \"Asian culture\". The three major religions of the world are born in Asia. After the ancient Greek decline, before the 18th century industrial revolution, due to the world's economic focus in Asia, most of the technical achievements of most human technology were produced in Asia. As early as 3,000 BC, Asian people have invented the burning pottery and smelting ore, Asia's Sume people first invented the text and system irrigation project, Central Asian nomad invented saddle, bow and arrow and wheels, Chinese Invented porcelain, gunpowder, compass, papermaking and carving printing, and plant rice. Indians and the Arab people invented the decisor computing technology. Asia's various local pharmaceutical technology even very effective today, but also in many areas.\n\nMany of the west and oriental instruments have the same origin, so they are very similar, such as violins and two Hu, guitar and 琵琶, double arch tubes and 唢呐, almost the same things. In fact, most of these instruments are originated in the Middle East.\n\nAsian national tourism has been very developed in recent years, mainly in the development areas and Metropolitan districts, including: China, Hong Kong, Macau, Taiwan, Singapore, Malaysia, Maldives, Thailand, India, Japan, Vietnam, South Korea, Saudi Arabia (including Mecca, UAE, Emirates, Qatar, Indonesia, Nepal, Bhutan, Iran, Pakistan, Turkey, etc.\n\nThe Asian Games is the largest, high-level comprehensive sports meeting in Asia, representing sports levels throughout Asia. It is the regional large-scale integrated sports meeting recognized by the International Olympic Committee, hosted by the Asian Olympic Council (Olympic Council), every four years. Its predecessor is the Far East Games and the West Asian Games. The first Asian Games were originally held in New Delhi in India in February 1949. Due to the preparations for the host country, it was held in 1951, and the 17th was held.\n\nAsia is divided into the following parts in geographical habits:\n\nEast Asia, it refers to the collectiveness of countries and regions in eastern Asia, with a double significance of geographic and cultural levels. Geography, it is the country and region of the Pacific Ocean in the north latitude of 20 degrees north to north to north to north to north. East Asia can be divided into three parts: Greater China, Northeast Asia and inland areas.\n\nSoutheast Asia includes Central South Peninsula and island in South China Sea and Pacific (collectively referred to as Malay Islands).\n\nSouth Asia includes the North of India to Xindukus Hill, as well as countries and regions in the north bank of the Indian Ocean.\n\nWest Asia is located in the west of Asia. It is a hub of contact Ya, Europe, non-Three continents and communication at the Atlantic, Indian Ocean, including Nankau Caucasus, Xiao Yawaia Peninsula (Anatolia), Iranian Plateau, Li Fante, Arabic Peninsula, Meso Damia plains and other areas. Asian part of West Asia and the Middle East overlap, but West Asia also includes Caucasus three countries.\n\nCentral Asia refers to the inland region of Asian Europe, usually in the five post-Soviet countries that are Tularan Plains to the Pamir Plateau.\n\nNorth Asia with Siberian concept overlaps, was jurisdiction in Russia.\n\nThe continents in the world have a large number of countries, second only to Africa. All territories are located in Asia, the largest and smallest countries are the People's Republic of China and the Islanda Maldives; the smallest countries in Asia are Lebanon.\n\nAsian countries are very complicated and are world hotspots.\n\nAt present, most of the international concern hotspots are also in Asia:\n\nRegional cooperation in Asia is in the ascendant, now the most promising places in regional cooperation are 10 Member States in Southeast Asia, Southeast Asian countries: Wen Rui, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand and Vietnam. The total area is about 4.5 million square kilometers, with a population of about 512 million. There is also an observer country: Papua New Guinea. ASEAN countries have started the three East Asian countries of the People's Republic of China, Japan, and the Republic of Korea, and established China-ASEAN Free Trade Area in 2010 and the People's Republic of China. The current People's Republic of China has started to start fruit and vegetables in Thailand. mechanism. The regional comprehensive economic partnership agreements jointly participated by the People's Republic of China, Japan, South Korea, Australia, New Zealand, and the ASEAN have also participated in the regional comprehensive economic partnership agreement have also signed in 2020.\n\nSouth Asian countries are also tightening the organization, Pakistan and India's relationship between the organization, Pakistan and India. The Gulf States also have regional cooperation organizational Bay Arab States Cooperation Committee, 6 Member States: Kuwait, Saudi Arabia, United Arab Emirates, Bahrain, Qatar and Oman.\n\nIn 1996, the Asian-European meeting held a summit and foreign ministers, strengthened the Dialogue mechanism between the Asian countries and the EU countries, which currently has developed to 39 member states, accounting for 49% of the world's total population. Member States The gross domestic product exceeds more than half of the world. The East Asian Community is an East Asian Union established by the European Community (now EU) established after World War II.\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology and guess continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central America) · South America) Culture Geography: Anguuria / English Americas, Latin America (Iberian America, Spanish) · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate · Vice Patent Climate (Moss Climate · Iceland Climate)\nPalace:\nOther: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate\n\n\n\nBiological distribution area\n\nNew North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories, New Tropical, Antarctic "}