{"chinese_title": "Ethnology ", "chinese": "Ethnology (English: Ethnology, from Greek: ἔ ἔἔος, means \"national, national, race\") is a branch of anthropology. This discipline is compared to the origin, distribution, technology, religion, language and social structure between human groups, race and (or) groups [1].\n\nCompared to nationalizes - through the cultures of direct contact with a single group, the ethnology adopts the contents of ethnographic researchers, and compares different cultures. Ethnographic this name was created by Adam Franz Kollár, 1783. His Published in Vienna Publishing the Comfort Facilities of Hungary Imperial History and Constitution (\"Amenities of The History and constitutional law of the kingdom of hungary.\", Historiae Ivrisqve Pvblici RegNi VNGARIAE AMOENITATES One book, use and define this term [2]. Zara's interest in linguistics and cultural diversity is triggered by several sources, including his hometown multilingual Hungarian kingdom, his origin of the Slovak region of the empire, and by the Emitan Turkish Empire Some of the transitions that are born after gradually retreating in a distant Balkan peninsula [3].\n\nThe goal of ethnographic, including the reconstruction of human history, statement of cultural constant components (such as so-called incest taboors and cultural changes), and the summary discussion on \"human essence\" (since the 19th century, this has been criticized by many philosograms For example, Hegel, Max, structuralism, etc.). Some parts of world ethnology are developed along some independent investigations and education. As cultural anthropology has become an advantageous discipline (especially in the United States), and the development of social anthropology in the UK. The difference between the three terms of ethnology, cultural anthropology and social anthropology becomes more and more blurred. Since the late 18th century, ethnials have been identified as an academic field, especially in Europe, and sometimes identified as a comparative study on human populations.\n\nIn the 15th century, Europeans \"discovered new continents\", playing an important role in the new interest in all ethics, others often have been treated as a barbarian, they are considered a cruel barbarian, some are considered \"noble barbarism people\". Therefore, civilization has been opposed to barbarism in a binarian method, and this classical opposition constitutes more commonly centered, ethnocentrism. Progress in ethnology, such as Li Wei Shi Tuo's structure anthropology, triggered a criticism of certain linear development concepts, or criticizing \"Historical Society\" and \"There is no historic society\", this opposite is over-dependent Sets History as constructed from cumulative growth, this is a limitative view.\n\nLi Wei Shi Tour often explores the articles of Monteclan, regarding an early example of ethnic school. Li Wei Shi Tuo passed a set of structuralism, the goal is to explore the universal ingredients in human society, and he believes that the most important thing is incest. However, this cultural universal proposition has been criticized by many of the nineteenth and twentieth centuries, including Carl Marx, Friedrich Nietzsche, Michelle Four, Louis Pierre. Al Costa and Gil Dellez and others. "}