{"chinese_title": "Taoism ", "chinese": "Traditional religious ritual:\n\nGod\n\nSecret society:\n\nTaoism is the local religion of Huaxia. Taoism thinking is from the Yellow Emperor (Huangdi School \". The earliest founders of the Taoist system is the Zhang Daolu of Five-Buchen (Tianshi). Worship Taoist Laozi is azu, which is the earliest to the primitive social period. The sacrifice, the ancestors and other worship activities, until the Spring and Autumn Warring States Period Absorption fairy, the \"five elements\", \"Yinyang\", etc., the \"five elements\", \"Yinyang\", etc., the \"five elements\", \"Yin Yang\", etc., after the Han Dynasty To the north and south director, through religious reform, gradually evolve into the current Taoist education.\n\nTaoism is a multi-god education that worships many gods. The main purpose is to pursue the longevity of life, and they have to be a fairy, and they will save people. It plays an important role in the traditional Chinese culture in the ancient Chinese, and it is actively developed in the modern world [1]. For the Taoist of the Battle of Warring States, the Taoist theory is just a philosophical theory. Taoism has absorbed its theoretical system with \"moral\" as the core concept, and the philosophers will be deactivated; but until the Han Dynasty is neutralized. Zhang Daoling was in Yizhou (in Today, Sichuan Province), Zhang Dao Ming Mountain was founded to create Tianshi Road, believe in Laozi as Tai Shang Lao, establish twenty-four treatment as a missionary area. The provinces of the north and south dynasties have gradually improved [2]. The Tang Dynasty Taizong Emperor was the same as Li, with the same name as the country, so he was the ancestors of Tang Rong.\n\nTaoism is \"Tao\" as the highest belief, and believes that \"Tao\" is the original Chinese in the Central Plains [3]. Taoism (including Taoist, Warlock, etc.) and Confucianism and Buddhism, \"Three Education\", for the main components of Chinese traditional culture, is to occupy the theoretical learning of the dominant position and seek ways to practice practicing to work [4] .\n\nNow, the Taoism, which is said, is based on the ancient Chinese religious beliefs, and inheritably attacked most of the religious concepts and repair methods such as Fangxiandao, Huang Laodao and folk God, gradually formed to \"Tao\" as the highest belief. [5]. It is mainly the main classics of the Taoist \"Morality\", and the main methods of cultivating the immortality, and the main methods of cultivating the immortals, the main methods of cultivating the immortals, the main methods of cultivating the immortals, and the pursuit of cultivation of the cultivation of the immortals. For the five kinds of food, the fairy medicine, the exemption, etc., refining and guidance, Naddan cultivation, and by the Taoistological instrument and its own law repair, etc., the common gods, the common gods are mostly Netan cultivation and merits into the trainer of the Taoism [6].\n\nTaoism is the religion of China's local soil. Its department and sacrifices can be traced back to the worship of the world, natural and ghosts, from the earliest and ghosts communication, the original religion gradually evolved the sacrifice of the merchant week.\n\nDuring the Spring and Autumn Warring States Period, the original religion has experienced significant evolution and divided into social and cultural knowledge. The hundreds of phones are especially, Confucianism, and the ink is \"the ink\"; the earliest and ghost gods communicate with the 筮 筮 and the original period of worship, the yin and yang of the ghosts, the fairy home, the same time, all kinds of findings and \" The activities of Changsheng Not Old Drugs are commonly seen in history books. During this period, I gradually produced the initial Taoism Thought in Fangxiandao, Huang Lao Road.\n\nAt the end of the Eastern Han Dynasty, Zhang Daoling called the Southeast of the Southern Yizhou (in today Chengdu), \"I was a three-day Zhengfa, and I was a teacher\", thus created a positive or one (also known as Tianshi Road, Wu) ). In the Central Plains, there is also a Zhangjiao Road, which claims to \"the sky is dead, Huang Tian is standing\", and the people will fight against the Eastern Han Dynasty (the historical name of the yellow towel or yellow towel uprising). The appearance of Zheng and Taiping Road, marking Taoism begins to become a teachings with a strict ideological system and organization system. In this social context, the main founding character of the taught scriptures Zhang Daolu comprehensive traditional ghost ghost worship, the fairy thought, yin and yang surgery, and the witchcraft, and the Han Dynasty was gradually integrated. The Taoist Division has also formed at this time, and the Taoist religious form begins. [7].\n\nTaoism teaches mainly integrates from Daojiaology. Taoism and Taoist are different, because the Taoist is learning, no religious form; Taoism is religion, although the old man is the teacher, the Zhuangzi is the ancestral teacher, but his advocacy is not exactly the same, but more thanks to Han The early prevailing of Huang Lao, who is in the name of the Yellow Emperor, Laozi. The other origin of Taoism is to start in the Warring States, the Fangxiandao, which is surrounded by Qin and Han. Fang Xian Dao Branch (including guidance), bait, housing three factions. The airpage is Zun Pengzu, Wang Que, and Zausang is the beginning of the ancestors; the bait is born, and the security is born; the house is to be accomplished, and Zucheng is a representative. In addition, it can also worship the ghosts of Yin Shang.\n\nSome scholars pointed out that there have been many sects before the Eastern Han Dynasty, with the history of the history, the things of Zhang Ling, Zhang Lu, come on the road to teach the three father and son [Note 1], and \"Han Han\" The text is under: \"Zhang Luyi Flag. At the beginning of the grandfather, the passengers were in the middle of the city, and the Hemou Mountain was learned to make the characters to confuse the people. Since the jurisprudence, it is a rice flour, the thief. Mausoleum Heng, Heng Zi Zi, Lu Yuxi, the teacher. It came to the scholar, was named ghosts, the late sacrifice. Savings, the people, the famous people, the name of the people, do not listen Bullying. If there is a disease, but it is the first. All the insults of the sake of wine are passed on the road, the same pavilion, county rice meat to give travel. The amount of the vessel is abdominal, and the ghost can be sick. Crown First add three originals, then execute, do not set up the long, to make a sake of wine, the people's letter. The imperial court can't be discussed, I will lead Hang Ning Taizhong, lead [8]. \"\n\n\"Three Kingdoms · Zhang Lu Chuan\" Liu Song, Yan Song's payment \"略\" [9]: \"平 中 (平 is the Han Lian Nian, 172-77), the demon thief, three auxiliary Wei [9]. \"Guanghe Zhong (light and is the Chinese Emperor of the Han Di), there is Zhang Xiu in the East, there is Zhang Xiu, Hanzhong, and the corner of the people, the corner is the Taiping Road, which is cultivated as the five-buffalo [9]. , The teacher is a nine sticks, which is a congregation (curse) [9]. Teach the patient to smash, because the disease is drinking, the disease or daily heaner, then clouds this person; it or not, then In noticed, the repair is slightly related to the corner, and the calm room is added, so that the patient is thinking [9]; it makes people an argument, sacrifice the wine. Savings, the wine, the Lord, I have learned, the number is Regulatory, for the ghost, the Lord please pray for the patient. Please pray the law, the name of the book, the meaning of the sin, the thirteen, the day, the sky, the mountains; Water; the three official books. Make the patient's home rice five buckets to do, the singles, five bucquettes. It is not good for treating disease, but for the suspension, the little man is fainting, and [9]. The corner was scored, and the Ru is in the Hanzhong, because of its civil service, it is added. Teaching the bureaucrat, with rice is used to stop, and teach yourself, have a small person When the road is a hundred steps, then the sin is sin. It is also \"monthly order\", spring and summer ban, and forbidden wine. The flow moved in the land, did not dare to [10]. \"In\" derived \" In the record, the mist of Zeong Song thought Zhang Xiu was Zhang Heng. No matter whether the name is incorrect; but you can clearly see that the sects at the time is quite a lot; Wuli is the same as Taiping Road. It is only a fault to tributary; at the time of Taoism, not just Zhang Ling Zhang Lu family [10 ]. And said Zhang Ling, or say Zhang Lu, often in the \"Pseudo\" word [11], to attract other sects, it can be seen that it is not only a lot of faction, but also attacks each other. [10]. It also passed the passage of Zhang Daoling, called \"Yunxiao Seven Signs. Volume six fourth \":\" \"Zhengtang\", true one, big big name [10]. \"Zhengyi\", Tianshi is self-transportation: \"I am from too old, teach to be a new The law. The new person, the old, the new, the new, the name is truthful, learn from the evil, still use the old text, undertake the teaching, and there is no transformation. \"Also teach people to learn the fairy, all use the ancient The law. \"Wang Dynasty, after reimcoming the teacher, since the editor, the name\" Zheng a new exuberant \".\" From Zhang Ling's advertised \"new\", it is known that the old Sutra is more solid. Usually the religion is developing to a certain stage, it will be divided into a variety of sects; thereby confirming that Taoism is not invasive from Zhang Ling. Therefore, if the Taoism is not intended to be hitting [10]. Therefore, other Taoist branches are no longer claimed to be \"Taoism\" in order to distinguish it.\n\nTo the north and south dynasties, the Taoist fair has many, and the dismisions of the dismisions are still different. At this time, Daoguan and Buddhist Temple have developed a lot, and Taoism is extremely deeply affected, absorbs a large number of Buddhist astronomical, calculations, medicine, etc., and began to reform. Northern Wei Dao Shiqian absorbs Buddhist wheel back, and the concept of business causality, Zhu Tianshi, etc., and imperatives the Buddhist discipline and the Fa Conference, Trusteo, Tai Shang, the old monarch, has set the Taoist commandment and the smashing of obsessed with the obstacle, abolished \"Collective Yellow Chi\", \"paying five buckets into the road\", \"The surgery of men and women\" [12]. At this point, Taoism has established a more complete teaching group system and the fairy system, and the religious form has matured; Northern Wei Dao said as a national education, marking the state acknowledged that Taoism is a legal religion, and even to the Tang Dynasty Too Taizong Emperor Chongsiao (Liur) is The ancestors of the Tang Dynasty royal family (Li surname).\n\nHowever, the Taoist faction is discrete and has the case of mutuality. According to Wang Changyue, the Qing Dynasty, Wang Changyue said that the Taoist Queen Taoist Taoist Taoist Taoism has another religious reform, which impens a Buddhist five ring, eight rings, and Sham, the Biqiu, Bodhisattva Santan Rings, formulated five rings, eight rings, and the first real ring , The middle rings, Tianxian rande Santan quit, and the clerk must be subjected to the ring, and a Taoist is awarded to be awarded. The whole truth has become a deepest Taoist faction of Buddhism. Its Shenyi system also absorbed Buddhist Bodhisattva. These commandments are also generally complied with the whole Taoist.\n\nFrom the beginning of the Chuangzong, Tian Dynasty, Zhang Daolu, the \"Moral Scriptures\" of Lao Dynasty, will \"Tao\" and \"German\" as the basic belief [1]. Taoism believes that \"Tao\" is the original and master of the universe. It is omnipure. It is not enough, all things come from \"Tao\". And \"German\" is the embodiment of \"Tao\". The three clear gods is \"Tao\" initial personality, which also represents the three important processes of the cosmosphere, that is, the so-called \"Tao life, a life of the second, two students, three, three thousand things\" [13], three cleaning Birth of the world's universe and natural gods, these are called Congenital Respect (Tianzun), which is evolved in the road, which is both in the same day. Humans can achieve and have a realm of moving through certain cultivation methods. These people are called the next day, the highest scrap can also reach Tianzun [1].\n\nIn addition, Taoist Supreme God has other statements in different sectors in history, but the highest belief is still in \"Tao\". \"Tao\" in different ages, the highest god of Taoism. First, the Tianzheng is the highest God with Yu Qingyuan, and the other is the highest God of Qingling Bao Tianzun. The third is to the highest height of the Taiqing morality is the highest God. Finally, it evolved into theology theory of \"a three-clear\" in three integration. According to \"Nine Days God Chapter\", Taoism's theology theory believes that the three clear is \"Xuan, Yuan, start\" three gas.\n\nTaoist the teacher of Taoism, Zun, Lao Jun. Some people are ours in historical facts, and the teacher is called Zhang Daoling [10]. However, the mainstream of the Taoism believes that the teacher has always been a Too Shang Laojun, Yu Qingyuan Shi Tianzun Teacher, Shangqing Lingbao Tianzun representative, Taiqing Morality Tianzun delegation, Taoist teacher is Taoism Samuo, anti-Taoism classics, Yu Qing and Qing has always been the concept of martialization, and has not been entered. Only too clear into the world. In this regard, the teacher is naturally a Taiqing morality - Tai Shang Laojun.\n\nIn terms of self-cultivation, Taoism pays attention to \"People's Day\", \"People's Day\", \"Touching the Treatment, Don't Teach\", pay attention to \"inexhaustible\", \"return to the root\", \"deep root\", \" Long-lived, \"Ideck, I can not humiliate, I can have a long time\", \"\" Take the heave of the earth, and the argument of the hexagle, \"is infinite\", etc.\n\nTaoism is dead to die, and Taoism is reborn, and the pursuit of longevity is not old. It is considered that people's lives can be the Lord themselves, and they don't listen to the sky. As long as people are good at being good at practicing health, they can be long-lived, they have to be immortal. Therefore, many cultural methods are also produced: alchemy, taking, Turning, fetal interest, massage, guidance, room, grain, observoir, service, and chanting [14].\n\nMing Dynasty Taoist Zhang Sanfeng believes that the function of the Tao is \"Slim Person\", Confucian \"Walking Road\", the Buddha's \"Wu Dao\", Taoist \"Tibetan\". Taoist lectures refining fairy road, Zhang Sanfeng is based on the foundation of cultivating immortals, emphasizing only the essentials of Yin and Germany, kindness, and loyalty, Sin, all in humane, and naturally not far from Xian Dao. \"People can fix their body and mind, then really essential God gathered, Daddy's big virtue.\"\n\nTaoist theology can be said to be a mysterious religious student of Taoist ideas. It does not necessarily engage each other, and it is different, and it is quite a taste. However, the ancestors said that the ancestors called old, Zhuang, respect \"Morality\" (ie \"Laozi\"), \"Nanhua\" (ie \"Zhuangzi\") and many other Taoist classics, after all, absorbed the large amount of content of Taoist thought and play. In addition, it also photographed \"Easy\" and Yin and Yam, Confucianism, and the content of the ancient fairy, with the primer.\n\n\nTaoism and \"Taoism\" are often used in use. From a history, these two words have alleged a lot of different content, and they have been mixed into a talk; they still still have two people. However, if the Taoist understanding is created by Laozi, Zhuangzi, and the philosophical ideological geography of the Wei Jin was reinvenited, and the teachings were understood as the gradual formation of the two Chinese, and there were several developmental religions, then, although Taoism is theoretically The large number of elements of Taoist thought, even in the old man as the teacher, but the two still can't be mixed, and the theory of Taoism is the ideology. As a religion, Taoism has its gods and beliefs, there are people and organizations, have a series of religious rituals and activities, and its main faith is roughly clear. Taoism as a philosophical ideology, its thoughts and representative characters should be the most important content it is explained; after the Wei Jin, the inheritance of the Taoist thought, now it seems to be blurred, it is difficult to say, but it's a scholar literati The influence is still fraudless; from this perspective, the narrow \"Taoist\" refers to the pre-Qin period with Laozi, Zhuangzi's philosophical thoughts of the main representatives.\n\nSome scholars believe that Taoist thinking and religion may have a great connection. In the article \"Taoism's spirit\", I pointed out: \"I often have a doctor, the philosophical or metaphysics must have a predecessor, and this predecessor is likely to be a mysterious thoughts, or more specific points. Speaking, a witch. This religion is probably not very different from the later Taoism. Although the form is as completely unimpedied. This unknown ancient religion, we can temporarily call the ancient Tao [15].\n\nIn addition, the so-called long-lived, the Taoist people are not old, pursue into immortals, and they are in the like, and Laozi has not yet. The ideological ideological inside the Taoism is very complicated. There is also a situation in each faction, nor all the pursuit of longevity, pursuing a fairy, and the like.\n\nSee the Taoist character list.\n\nTaoism is a multi-god teacher, the highest god is the three definitions of Daozara (\"a three-clear three clear\"), that is, Yuan Shi Zun, Lingbao Tianzun and moral Tianzun, the moral Tianzun is too old, the old man [16] .\n\nTaoist ancestors believe that the Tianda has the concept of Jade Emperor, Hell and the world has its own concept, the land hall and the ocean as a heaven, and the main god of the three regions of the sky, the land, the sea is the three officials. Taoism has also developed a series of fairy officials in the Queen Government and Longwang Crystal Palace. Local gods series such as four-value Gong Cao, mountain god, city, land god, stove monarch, etc. [16], and absorbed the Xi Wang mother in ancient China ancient Chinese mythology, nine days. The fairy spectrum of Chinese Taoism believes is extremely compacted.\n\n\"Taiping Jing\" is divided into sixth class, Zhang Junfang, \"Yunxiao Qi\" Due, \"Shenxian\" is divided into ten levels, with the book, Taoism's Shenxian spectrum, the highest \"three clear\" \"Four Royal\", the lowest is \"Chenghuang\", \"land\". This is gradually set after long-term evolution [16]. Such as Mazu, Guan Emperor, Yue Wang, Shuangzhong, etc., this is the people of the folk, because the folk beliefs are included in the Taoist gods. Although Taoism is not for gods, but in order to spread the convenience, it will begin to shape the gods to be dedicated. In the large Taoist palace, there must be \"Tianzun Temple\" (or \"Sanqing Pavilion\") and \"Four Royal Temple\", as for other gods, According to the history of the road, the geography is not the same, and the \"three clear\" statues [16]. In addition, Taoist ancestors believe that people are also a small world, so various organs, such as hair, facial features, etc., and there are corresponding mechanisms, such as three corpse and Geng Shen.\n\nMany people in today's \"Feng Shen Bang\", this kind of gods belong to the wild history of novel, with a big difference with Taoism records, so most of them are Lingshan School, all are not orthodox Taoism.\n\nThere are many Taoist internal martial arts, and the names are different due to the dispatch standards.\n\nThere is a positive (Zhu Lingling), the full truth (Wang Chongyang, the ancestral teacher), the whole Southern Nanzong (Zhang Bo, Zeng, Zeng, Zhang Qingzhi), Taiyi (Zu Mo Cave 1) Five major parties, and Tianshi, Queen, Lingbao Road, Qing Tao four schools. There is also morality, congenital, Lingbao, Zhengyi, clear, patent, Yutang, Tianxin Baxi said.\n\nThe most influential in modern times is that the people and Dan Dingpai are divided into pure religions, mainly divided into five factions [17]:\n\nThe official assignment of Taoism is generally considered to be started in Song, Yuan. There is more than 7 big schools in Taoism history [18]:\n\nAfter the Ming Dynasty, Taoism was mainly divided into two orders of the whole truth and the whole truth. All other sects were summarized under these two sects. Now Beijing's Baiyun's view has the \"Trual Party Total Book\", and the listed school is eight7th. In fact, some are only the renewal of the spectrum, not independent. In addition, according to the tutorial, it should be a 36-day education and 72 to teach, with a total of 108 sects.\n\nTaoism, the \"Moral Scriptures\", Zhuangzi's \"South China\" as an important classic, the Taoist Taoist \"Three-hole Scriptures\" in the South-North Dynasties, collecting the books of the past, not only including philosophy and Taoist theory, but also Including works in alchemy, health, treatment, and Qigong. Describe Taoist Records, Zhai.Mw-Parser-Output Ruby.zy {Text-Align: Justify; Text-Justify: None} .mw-parser-output ruby.zy> rp {user-select: none} .mw-parser -Output Ruby.zy> RT {Font-Feature-Settings: \"Ruby\" 1; Padding: 0 0.1em; User-select: None} 醮 (jiào), the classics of the technology, the classics of the practice, \"orthodox Tree\", \"Tang Zang wants\", \"Wanli Continued Tang Tibet\", etc., these places have an impact on the political, economic, cultural and technologies of ancient China. At present, it is mainly widely circulated in the \"Orthodox Tang Tang\" in the Ming Dynasty. The number of Taoist scriptures is very large, and the main classics of all sent are different [19].\n\n\"Zhou Yi ginseng\" is the earliest Danjing, called the ancestors of Dans, and \"Bao Pu Zi\" is also the basic classic of Taoist Dandi. \"Taiping Jing\" and \"Laozi\" are also the main classic in the early days of Taoism. The \"Huang Tingjing\" and \"Shangqing Dalong True Scriptures\" are the main classics of the Shangqing, and Mao Mountainpa is also very heavy. \"Scriptures\" and \"three emperories\" are the main classics of Lingbao and the Sanhuang. \"Yinjing\" and \"Changqing Stilery\" are also very important scribes in Taoism. It is the script of Taoist who must hunt. In addition, \"Yuhuang\" and \"heart screening\" are also one of the daily homework of Taoists [20]. After the Northern Song Dynasty, there was a classic such as \"Wu Zhen\" and \"Jin Dan four hundred words\".\n\nAlthough the Taoist Nanzong is a part, although the Taoist, the nation, the department is mainly, but the Northern Song Dynasty will also advocate the three education and one reason, cultivate NORD.\n\nTaoism Beizong's fullness is more advocating three education, refining the whole god, mindful, combined with the rules, and \"moral scriptures\", \"filial piety\" and \"all kinds of\" \"three classics, advocate\" Filial piety and pure.\n\nTibetan is the total collection of Taoist boutiques. It is a must-have, collects, and organizational structures, and multi-channel books that have arranging many classics. Including the \"San Cave Directory\" in the Nankai, \"Kaiyuan Tang Tibet\" in the Tang Dynasty, \"Da Song Tiangong Treasure Treasure\" in the Song Dynasty (\"Yunxiao Seven Signs\" is the fine version of the \"Wanshou Road\", Jin Dynasty \"Xuan \"\" Xuandu treasure \"in the Yuan Dynasty, the\" orthodox Tang Tibet \"and\" Wanli Continued Treasures \"and\" Wanli Continued Treasures \"and\" Wanli Continued Tibet \".\n\nTibetan classics are divided into three-hole four-proclaimed twelve. The three holes are \"Cave Real Ministry\", \"The Ministry of Cave\", \"Dong Xuan\", all classic internal accommodation is the three categories.\n\nThe earliest, Taoism originally did not have much clearance and discipline, did not ask for vegetarian food, can not help but drink alcohol, you can get married. For example, the Yellow Emperor of Chengxian is drinking alcohol, marry his wife. In ancient times, the sky is used with cattle, sheep, 豕, and drinking, so early Taoism is clearly not banned.\n\nLater, due to the introduction of foreign Buddhism, the Taoism changed, which made some scriptics in Buddhism. Taoist discipline is some guidelines for some binding Taoist ideology. It was founded by North Wei Wei, because the road to Zhang Daoling was not strict. In the Northern Wei Dynasty, the Taoity of the Northern Wei Dynasty was all integrated, and the faculty was mostly the father. In the Royal DPRK, I will abolish the collective yellow red and pay the five bucket. Taoist the commandments have different content in accordance with different sects. Generally speaking, the alliance of the whole faction is strict. The content of the commandment is not to kill, you must not drink alcohol, you must not steal, you must not be evil. The commanders must be observed, and the Queen Sanyi Rings is in the Qing Dynasty Baiyun Guan Gaoxao Wang Changyue in the middle of the \"鉴\", the Qiu Mi's new road taught traditional commandments, which imitation Buddhism Shami, Biqiu, Bodhisattva, the development of the truth, the middle , Tianxian ring. Moreover, there must be a trip to a rings to count the public. According to the ruling, the commandments can be divided into tops, China, the next product. According to the number of \"three rings\", \"five rings\", \"eight rings\", \"ten rings\", \"10th rings\", etc. [1].\n\nIn addition to the quotation, there are also Taoism rules, which is the punishment after the Taoist criticism. The specific regulations are different, and the provisions are different.\n\nTaoism religious activities are very intense, often affecting each other with folk beliefs, so it is also known as \"speaking\" as \"Tao\".\nMainly divided into two major categories [21], Taoist's own practice and Taoist ceremony, including Taoism,,, 醮, 符, 符, 禁, 隐,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, , Pray, housing, gods, grave, feng shui, divination, etc.\nIn addition, there are many tangues. For example, in the past, defending a one, some thinking, the valley, etc., and the effect of health is also classified as Qigong.\n\nIt is generally believed that the mountain (fairy), medical, life, Phase five categories, and the post-three articles are also classified in surgery. The basic composition of the five, it is from the easy to classify, and it is easy to cover the time and space. The universe is all-in-one and the mutual opposition, such as winter to spring, summer to fall, old life, old life and many more.\n\nThe Taoist's own practice became a Taoist, including Netan, Dan Dan, taking food, and room.\n\nNetan refers to the use of gas, guiding, breathing, and refining Dan in the body to achieve long-lived purposes. Old Dan and Naddan have the same language, but the meaning of the referring is completely different, such as a furnace that compares the human body as burning refining Dan Pills, but theory still has communication. In ancient times, Most of the teachers and apprentices, how to be in the mouth, and outsiders are difficult to understand. The Sandanian field of the human body is called \"three yuan\" is the statement of Taoistin's internal Dans. [19]. \"After the chaotic, there is a three-yuan gas of the heavens and the earth, generate people, grow thousands of things. People are also the three focal, San Dian, with health shaped, with god of life [20].\" Yuan \"refers to the fusion, the vitality, and Yuan god.\n\nOld Dan refers to a mineral and drug such as burning alchemy sand, mercury, and the production of people who can make people grow old. Modern science believes that these Dan medicine are mostly poisonous. The ancients also have many examples who take improper death, and the ex-Dan is also considered a pioneer of modern chemistry [1]. In addition, exemptions can also refer to alfine or Taoist spells, Ray, etc.\n\nThe Taoist ceremony is collectively referred to as \"Ramada Ke\", and Zhai is a clean meaning, and it means praying, also known as the road. Taoism sacrifices the gods, because they think that God is clear, there is a bathing dress before the sacrifice, no room, do not drink, do not eat meat, and make fast. The sacrificial activity is called \"醮\", and the Taoist ceremony has learned many Buddhism in the development process (China Buddhist ceremony has also learned many Taoist content in the development process). Taoism believes that through these rituals can go to the disaster. Divination is also part of the ceremony, including filters, lottery, measure word, etc.\n\nAfter the foundation of the northern part of the Jin Dynasty, he went to the current system. The university system is preceded by the whole truth, and there are many highways for their representatives, the most famous people are the Saffie of the Tianshi.\n\nTaoist believers called the CHR (unreasonable), Qingxin, good man's letter, etc., is known as the Sanheng Five Rings, the customs disciples are respectful to each other, the brothers, teachers, Taoists, a couple, the same, the same party, etc. Due to the long-term mutual impact with the Chinese biography, the two teachings are similar or identical.\n\nIf you have more, you will be called more, and you will be honored, the long, Taoist, Taoist (female), Taoist, Daoye, the real person (the Lai Xian class, the immortal, the immortal, the cactus), highway, etc. High, high-spirited, Gao Shi, Dade, Bier, Feather, Feather, Yutu, Huang Crown (Men), Female Crown (or Female Huang, Women), Dry Road (Men), Kun Dao (Women) and Dao Xiao (the young man who has just watched). According to the true truth, the correct Taoist, the whole trao, the height of all sings; the whole Zhai Taoist said the Master, Zhengyi's sideline said it is called the Taoist; some Taoist is married to the wife, and also known as the fire Taoist, commonly known as Lianjiandao; engaged in funeral instruments, said Wu Tao Taoist; all true refining teachers, 师 (unrivated), Master (have been rescued), lawyers (Abba), master (Division).\n\nTaoism hosts the actions to call [22] or abbot, is a meeting with the party (office) as a member of the party; the following general management is the supervisor; the reception believer, the guests call the guests.\n\nZhang Ling and later said that the Tianshi, the whole school also said that he claimed to be a teacher.\n\nTaoism Music is one of the important components of Taoist culture. Daole is not only a long time and secret, but its melody is ancient style, combined with the mutual combination of religion and art [23]. Duo is common in the temple, the day and night class, sing, all kinds of race, Zhongyuan Puru, large legal conference, etc., or believers play on various funeral, worship and daily gods, but also Taoist, Master must have a health, often played in temples, vegetarian shops, tea art hostess, religious art stores daily, and monodies are often used in meditation, practice Qigong Road, improve the realm of the soul [23].\n\nTaoism activities are mainly in the uterus [24].\n\nTaoist religious buildings are known as the uterine, which is relatively late, and it is not too early to come to Tang. Taking the history of forming and evolving, they can see them to adapt to the needs of Taoist organizations and development, and development. It is generally believed that early Taoism religious buildings are mainly Jing (quiet, quiet room) and treatment, and some have a famous room, and it can also be called a museum. The so-called Jingjing or Quiet, the static chamber set up by the home is intended to isolate others in home. \"The home of the house, the Jing room is the reason. It is not even the house. It is clear, no remaining object. Open the door, do not touch. Sprinkle the exquisite, often Fragrance burners, incense lamps, chapters, books. \"It can be seen that it is to distinguish between sacred and general residents, and the boundaries of the priests and customs [24].\n\nIn short, the uterus is an embodiment of Taoist concept and is a symbol of Taoism. It has strong iconic, so that people can know that it is a tributical religious place, with other religions such as Buddhism, Christianity is different [24].\n\nIt can be divided into two kinds: temple refers to the believous of folk beliefs, dedication and ascending place; Taoism is concerned about the contest, offering a variety of religious rituals and living locations, near Mountain Dachuan, and big cities in.\n\nThe three yuan festival is the Daqing Day of Taoism. The three yuan festival is the birthday of the \"Three Emperor\", and the Tianshi Birthday is the Employment Festival. It is a blessing day of the Tianshi. On the day, I want to Pufu Sony; the water official birthday is the next yuan festival, and the day of the water officials, please disaster disaster disaster in the fortune. The Tang Dynasty Three Yuan Festival was banned by the emperor. In the first month of the first month of the first month of the top 10, July 15 is the Sino-Everbright Festival, October 15 is the next yuan.\n\nTaiwan is a Taoist festival with the new year of the lunar calendar. Singapore and other places are Taoist festivals in February 15 (the birthday of Daozu).\n\nTaoism's political, economic, philosophy, literature, art, music, painting, architecture, medicine, pharmaceutical, health, and geography of the Taoist cultural circle have different degrees of impact. In addition, it also has deep impact on the thinking, ethics, ethics, folk, national relationships, cultural characteristics of East Asia.\n\nTaoism has a different degree of impact on all aspects of Chinese culture.\n\nSome sectors in Taoism have passed some martial arts and Qigong, such as the famous Wudangpai in martial arts. It is said that martial arts inherited in Most Taoist mons on Wudang Mountain. Taoist martial arts is different from many martial arts, paying attention to being successful, and the latter manager fully reflects the Taoist Treatment. Among them, martial arts rows like Tai Chi, have gradually become a daily fitness activity. Taoist enthusiasm is also a big genre in China. Many of the cultivation methods of all truths are Qigong, the exploration and development of Qigong, which contributes great.\n\nTaoist health also inherited and developed the content of Chinese traditional medicine \"Yellow Emperor's Internal Classics\". In addition, many people have worked for medical skills, which contributes to traditional Chinese medicine, such as Ge Hong, Tao Hongjing, Sun Si, etc., there is a tree in Chinese medicine.\n\nTaoist alchemy has an important impact on the invention of gunpowder.\n\nMany important cultural characters in history are Taoist. One of the Shengwang Yizhi of the Jin Dynasty is a trust. The big poet Li Bai in the Tang Dynasty was also a devout Taoist, once traveling all over the country, seeking Xian Dynasty, and even refining Dan, and he was accepted. This experience gives him a very important impact on the individuality of poetry creation and even a lifetime. Li Bai has been in Chang'an, and is recommended by the Taoist and beliefs of Tang Xuanzong. In the process of finding the fairy, he swims all over the five mountains and brought him a lot. Material. The idea of ​​\"immortal\" and \"feather\" in his poems are often appeared. Tang Taizong built a \"Tai Shang Laojun Temple\" in Laozi's hometown; Tang Gaozong's respect for the old man is \"the Emperor of Too Tung Xuanyuan\", and believes that Laozi is the ancestor of Li Tangzong. The Tang Dynasty monarch has claimed to be the descendants of Laozi, and also follow the old people as the ancestor, and the sacrifice is a sacrifice, and also to the Emperor of the Tzu. At the same time, the court officials must practice \"morality\", and the \"moral scripture\" Scope of the imperial examination [25].\n\nAlthough the \"Journey to the West\" in the four major classical literature and literature is the story of Tang Yan and other four people to go through the scriptures, but the book uses a lot of Taoist proprietary concepts such as the heart, Itali, the gods, and Yuan god. Wait, I also constructed a Taoist god of the Emperor as the core, an official system.\n\nThe most famous novels, which are completely tongue-based, have to be \"sealed the gods\". The Shang Zhou War I told in the book, which refers to the two religious intercourse and interlimases of Taoism. All roads and magic weapons, which appeared in the book, belong to the intermediary and teachings system.\n\n\"The Emperor\" in China is the god of the Arctic Star. During the Tang Dynasty, Tang Gaozong used the Tiam Emperor's title, and he called two holy days from the heavens. Gao Zong decided to build a montage and sent his daughter into the Taoist Taoist. In other words, Taoism is in the strong implementation of Tang Taizong and Tang Gaozong, it can be said that it has become a national education in Tang Dynasty [25].\n\n\n\nHong Kong Taoism inherited the basic tradition of China's Taoism, and developed some features different from China's Taoism. [26] Compared with the long development history of Taoism in mainland China, the history of Hong Kong Taoism is no longer. Due to the territory of the territory, there are many Luzu Dao Tang in Hong Kong, and the Zhengzi Tao Hall and congenital road hall are incorporated from Guangdong to the Republic of China, and its incoming and development is only more than 100 years.\n\nTaoism has passed to Hong Kong at the Southern Song Dynasty, but the main source of modern Hong Kong Taoism is the folk emerging religion introduced in the late Qing Dynasty. Hong Kong Taoism has risen in the second half of the 20th century, which is the result of jointly organizing the original civil emerging religion. [27]\n\nDue to several transactions of the Chinese mainland regime since the late Qing Dynasty, as well as the cause of war, civil chaos and economic damage, Hong Kong under colonial rule became the harbor of Guangdong people's refuge, and also gave a Taoist group in Guangdong, helping the belief. A rare opportunity for the preservation and development of the scriptures and the CDM. Not only that, the Hong Kong Taoist group not only enters the form of organizational form in Guangdong to Hong Kong, but also develops to become a Taoist organization with modern urban characteristics. [28]\n\nUnder the efforts of more than 30 households, in 1961, the Hong Kong Taoist Federation was allowed to register the community. In 1967, it was allowed to register as a limited company (Responsibility Mission), exemption from profit tax and interest tax, and specialized for \"limited\" \"Word. The establishment of the Hong Kong Towards, improved the status of Taoism in Hong Kong, and aggravated the components of Taoism in Hong Kong society, Hong Kong Taoist entered a new development period.\n\nUnder the efforts of the Hong Kong Road, the Hong Kong Taoist Teggress was held in 2001 to 2010. Most of Hong Kong Daozang is the main Run Zu, followed by the main Guanyin. However, Huang Daxian is the most familiar Taoist god of Hong Kong people. Hong Kong Daochang Lin stands, among the meta colleges, the Punta Xianpu, Qingxiao and the names of the mortar garden are high, and there are four major palays in Hong Kong [26].\n\nHong Kong's Taoist group has spared no effort to contribute to the development of cultural education, social welfare charity, and build a number of schools, clinics, and nursing homes. [29]\n\nJapan is neighboring countries in China, and its ancient civilization starts late, but due to the influence of continental culture represented by China, it is very fast. In ancient China-Japanese exchanges and cultural exchanges, Taoism has also played an important role. Taoism also passed the series of Taoist culture such as Geng Shenxiao to Japan, making the belief system of the Emperor and the establishment of many Taoist elements [30].\n\nWhether Chinese Taoism is incompatient in Japan, there are two opposite opinions in the Japanese academic circles. One is to believe that the Japanese ancient government refuses to teach Taoism, the \"Tang Dahe Shangdong Junchi\" and \"Tang Datong\" and \"Group Book\" in the \"Tang Dynasty\" and \"Group Books\" are clear [Note 2]. Another opinion, \"Taoism as the organization of religion, its academic, Taoist, Taoism, etc., did not come from Japan, about this, currently no history, but Taoism acts as a thought to Japan, you can It is already a fact that it is difficult to negate. \"[32]. Taoism spreads in Japan, there is no teaching group to teach in the form of establishment of Taoism and Taoism. However, in the past 2 century BC, Taoist thought spread from the Korean peninsula from the Chinese character culture circle to Japan.\n\nIn the past 5th century, there were a large number of people in Ren De Tianshi, and there were a large number of people from the centrally located in the peninsula and the Yangtze River Delta region of China, they brought continental culture [33]. In Nara, Ping An Era, Japan uses a \"tray\" similar to folk custom from the Korean Peninsula or the Chinese mainland, and the Tang Dynasty, the Tang Dynasty, the ethics classics that returned to China and study abroad, accepted it. Chinese character idiom or knowledge, in part, in the Tang Song Dynasty, the Taoist beliefs, forming a Taoist form, and the Taoist form of the Yangtze Times has different, to the Yangtze Times, Japan accepts Zen monks, The \"good book\" in the Ming Dynasty and other people are teaching. These \"good books\" are beginning to accept the \"tray\" of Japanese people's national moral awareness, which also have a bumper and a big name support. Due to the development of typography, these \"good books\" continue to publish, and the general public is easy to see. Therefore, the impact on Japanese general society is also different from the past [34].\n\nIt was approximately in the seven century, Taoist Shenxian Changsheng Thought and Square have passed the Japanese. Japanese students have studied Taoism in China and bring Taoist classics to Japan. From the peace era, Taoism defending believes in Japan is quite popular in Japan [35]. \"Ancient Missions\", \"Japanese Book Ji\" also recorded ancient Taoist thought, Japan's earliest history book mainly explains the \"View\" and \"Emperor\" several terms. The Tianwu Emperor of the Flying Bird Age uses the emperor as the monarch as the monarch. The real words of Japan's awareness of the mountains to practice (the BRO fighters are arrested) and the fourth paragraph 4 of the Bao Puzi (the Lin Bing \"is almost the same [36].\n\nNorth Korea teaches in the 7th century in the Korean peninsula. In 624 (Tang Dynasty, the Seven Years of Tang Dynasty), Gao Rong Rong, who was invited to teach Tang Gaozu hoping. Tang Gausu Li Yuan is in the seven years of Wu De, the criminal department Shangshu Shen Shu An Changjun is Wang Gauli Wang, the Liaodong County, and will still talk about the Tianzun and the Taoist. Thousands of people [Note 3]. In the following year, Gao Ji Rong Li Wang also sent people to the Law of Tang Xuehua [38].\n\nHowever, the Taoism in the Korean Peninsula has not yet formed a teaching group [Note 4], the royal family is mainly regarded as the religion of the country, and the civilian people will be combined with folk beliefs, which is integrated into folk beliefs or others. Religion [Note 5] gradually did not know anything, and people did not think that the Taoism of folk faith was a foreign religion [39]. Before the introduction of China, Taoism has existed the fairy thoughts, the mountains believe, the spirit, the local custom folk beliefs, the spell, astronomy, astrology, the squid predicts, etc., it is believed that these religious cultural forms and China's Taoism has the same Sex or similarity [Note 6]; North Korea does not have a complete Taoist shape like Chinese Taoism; can not regard Korean cultural mid-education cultural elements as a foreign culture, emphasize the research from the main position to study the Korean culture Taoist nature. But no matter what, the historical material can prove Taoism in the spread of ancient North Korea and its impact [40].\n\nAfter the 1990s, South Korea began to organize [Note 7] and established contact with the Chinese Taoist Association [40].\n\nTaiwan Taoism has basically coming to Taiwan with early Han people to immigrate [41], from the Qing Dynasty, which has been enjoying the civil society with high religious freedom, and it is still booming during the period of time. In the early days of the Japanese government, the Japanese government implemented the \"Old Temperature\" policy, that is, respect the old habits of Taiwan and not interfere with traditional religion. In the late birth, due to the mining civilian policy, attempted to change the Taiwanese people's thoughts, Taiwan, Temple, Temple, and the private education group in guardianship and safeguarding people's safety [42], the people in the Temple Will boycott the Japanese government, so the emperor civil policy vigorously enforce the Taoism to change the Buddhist beliefs, which leads to the current Buddhism in Taiwan, but Taoism still has a warm flourishing style. After the war, the era of martial law, the national government banned the gathering parade, so the people can only apply to the government agency with the name of \"Celebrate National Day\", \"Celebration President, Vice President,\". In the Taoist Master, Taiwan's early mountain line is a red head. The sea line is the Taoist, and the Qing Dynasty in the Qing Dynasty in Taiwan has also established the Southern Lingbao School and the Zhengshi, and the Republic of China established the Chinese Republic of China Road Church and Taoism Too many, Taiwan Taoism has changed, but the people don't know how to teach system, the people 's heart has always been the main Taoist, Master and Jianyi and other concepts and customs are more depressed. Although the department is not the same as other places in China, the inheritance of Taoism has been developing in Taiwan.\n\nAfter the Republic of China, the Taoist the leaders advocated the establishment of the Taoist church. Due to the domestic warlords, they did not make substantive altitude, and the Republic of China was in the second year of the Taoism, and the Qing Dynasty, and the Qing Dynasty, the church, the anti-war military And the sleep, the Republic of China, the Sixty-three generations of the Han Dynasty, the sixty-three generations of teachers Zhang Enzhen restructured, and ZHANGANY Tianshi combined in Taiwan for forty years in the Republic of China, Zhao Jiayu, Xiao Tianshi, Ma Wei, Gao Yue, Jiang Zhou, Li Yun step and others set up a Taiwan provincial church, the foreign representative of the church, and after the introduction of Taoist affairs, it was established a national sexy church in Taipei in February 13, May 13, and the name is a church of the Chinese Republic of China. Publicly sixty-three generations of Tianshi Zhang Enzhen is the first chairman, so far to the eleventh. Taoism is now a major religion in Taiwan. On January 28, 2000, the Interior of the Republic of China announced the first day of January 1 to Taoism Festival. It is the only religion in many religions in Taiwan and is also the only religion in the history of the modern Taoist. Big things [41].\n\nTaoism was earlier in the end of the Eastern Jin Dynasty, and the five bucket Sunne had failed in the Jiangnan launched the uprising. And Vietnamese Li Lin helped Lu Tun to attack the city, and went to the water after failure. After Wu Chao, Vietnam has established Ding Dynasty, forever, Li Dynasty, Chen Dynasty, Hu Dynasty, and afterwards. During this time, China and Vietnam's relationships have been closely related, and Taoism is incorporated with immigrants [43].\n\nDing Chaowang is in the second year of China (China Northern Song Dynasty Kaibao for four years, 1997) once gave the leader of Buddhist Second Education, \"Taoist Deng Xuanguang\" [44]. When I arrived at Ding Xian, when I took a troops, I also went to the \"Tianzun Cave\" in Ningping, and the gods of God. Afterwards, the world, change \"Tianzun Cave\" is \"Anguo\". The Emperor of Li Dynasty was in the fourth year of the year (China Northern Song Dynasty, 992), once \"Xuan Huishan Taoist Chen Ms.\" [44]. Mr. Chen means Chen Wei. But according to China's history book, Chen Yu seems to have not arrived in Vietnam. At least the record of the History of Vietnam, Chen Yusheng is spread through the world, and the emperor of Li Dynasty is not called. Li Dynasty Chongxin San Education, Li Taizu is in place, and the Taoism will be honest to the palace, and the priest has a Taoist. When Li Taizong, Li Taizong, Taoist Chen Huilong also made a \"heaven\", got a pet, and gave the Royal clothes. Li Shenzong Tianzhangbao three years (China South Song Shaoxing five years, 1135), Shen Zong once went to Wu Yue Guan, \"Qingcheng Jin Yin Sanzhao\", allegedly recorded the first record of Vietnamese history on Vietnamese Road [43].\n\nVietnam is widely circulating the belief of true Wu Emperor. True Wu Emperor, ie Xuantian God [Note 8]. Xuan Tian God, is sealed by Song, Yuan, Ming and other generations. There are many uterus and gods of the north and central Vietnam. West Lake Scenic Area in Northern Hanoi City has true martial arts. True martial arts, also known as the town of martial arts, also known as the turtle [43].\n\nAfter the 16th century, the south of Vietnam gradually developed. After the Rubrise of Riche, Li Shi's regime fully utilizes the pre-masters of officials and the people who arrived at the evading rule, and rewarded the cultivation. In the future, there will be an overseas Chinese from Fujian, Guangdong, Guangxi and other places to move in Vietnam. In the main city of Chinese gathered in the southwestern part of Ho Chi Minh City, some Chinese grooming halls and Taoist utershings are still continuing. The Suicheng Hall, which was built by the Chinese in Guangzhou, Guangdong, was created in the eight years (1828). There is a main hall for the Hall of Wall, the Dragon Mother, the Golden Flower Niang, the Demoni Dynasty. Since the Sixin Hall is mainly the goddess, it is called \"female temple\" by Vietnamese people [43].\n\nThe Yan'an Hall built by the Chinese in Chaozhou, Guangdong, founded in 1902 (Guangxu 28). The hall has a main hall to serve the Shengdijun, and the Ford's master, Wenchang Emperor, the wealth star, and the Virgin of the World. Since the privacy of the Yi'an Hall is the main male god, it is called \"Men Temple\" by Vietnamese people [43].\n\nTaoism also affects local native religions - Mother Taoism and Gao Taoguan [43].\n\nThe culture of Ryuques is greater by China and Japan. From religion, there are both believers of Buddhism and Ryukyu, and there are many believers of Taoism [45]. Many people teach the gods such as Mazu, Guan Gong, etc. have many believers in Ryukyu, and they are absorbed by Ryukyu.\n\nShuntiang, founded in 1821 (1, 1796) is the earliest Taoist temple in Singapore, located in the buds. Since 1920, China's southern provinces, a Taoist Taoist Taoist Taoist Taoist Taoist Taoist Taoists, and set up aunt and engaged in department. After decades of development, now Singapore's Zhengdui Taoist has Fujian to help (Minnan Help), Fuzhou Help, Xinghua, Guangdong Help, Hakka Help Hainan, which is the most in the number of people in Minnan. It has the greatest impact. Singapore's Zhengdui Taoist has also established a \"three clear church\" in 1979.\nIn March 1990, the Sanqing Road Church jointly formed the \"Singapore Taoism Tourism\" jointly formed with the other 27 Tuancong Temples. Invited Huang Xinyang, deputy president of the China Taoist Association, etc., the whole tribute, many times to travel to Singapore to open the Taoist training class, hosting the Fadie. At the same time, there is a wide range of contacts with the Zhengduo Taoist of China and the Taoist Group of Hong Kong and Taiwan. Singapore Taoist Association was established in 1996, the Taoist festival held on February 15th, the annual lunar calendar. Beginning in 1996, the Taoist actively participated in the blessings and prayers and other activities of the Singapore Religious Friendship Council consisting of nine religions of the Republic of Singapore. At the beginning of the 21st century, the three-Qing Dynasty, the main hall, the main hall for the ancestors, the true Wu Dynasty, Zheng a teacher, Zuo Hall to serve the whole truth Lu Dongbin, Wang Chongyang, Qiu Dongchang three ancestors, the right hall for the sacred people, Reflect the aim of \"three teaching one\". Singapore Road Teaching Institute, and Sanqing Taoism Library, in 2008 at the Sanyue Palace. The Teaching School has cultivated young and has a taught for Singapore. Operation, cultural conservation, can implement the Taoist staff of the Taoistological instrument.\n[46]\n[47]\n\nAuthentic Malaysian roads are still in development. In 2006, they joined the religious advisory Council to become a religion of the officially recognized, [48] [49] [50] The general Chinese people may not be able to distinguish the authentic education, the people's faith, Fortifications and feng shui are different. [51] In order to promote authentic Taoist beliefs, Malaysian Daojiao will order the \"Taoist Festival\" in the Lunar New Year's Eve (Too Old Jun), helping the believers to go to the Chinese Dragon and Tiger Mountain, and the trisum And hold a lecture, exchange meeting, Taoist cultural training class, return to the Zong Dynasties, a chanting class, National Day Prayer Conference, etc. [50] The main national Taoist organizations include the Malaysian Docao Class, the Malaysian Docao Association, Taoist Youth League, Malaysia Sanqing Road Church.\n\nAs early as the Tang Dynasty, Xuanzang Master will translate \"morality\" into Sanskrit spread to Tianzhu (India).\n\nIn the 16th century, \"Morality\" was translated into Western text by Europeans. After the 17th century, with the Western merchant shipped and trip, the \"Morality\" was gradually introduced into Europe, and Westerners took \"Morality\". \"Translated into Latin, French, German, English and other languages, and Laozi 's thought will gradually spread throughout the European continent. It is said that German philosopher Leibniz is originally based on Fuxi, Huang Lao's yin and Yang's yin and Yang, and gave a western name \"Dialectic\" for Taiji Yanyang, of course, this statement did not have effectively confirmed. Over the past few hundred years, the total number of Western translations in \"Tao Te\" has been nearly 500 species, involving 17 European texts, and the \"Bible\", \"The Bible\" is the first, \"Morality\" is located in the world cultural master of foreign languages. Second [52].\n\nTaoism has developed in many parts of Western. [53] [Need better source] As in December 1995, the British Daojiao Association was officially established in London. This is the earliest intersection of Europe. Since 1999, Taoist Tamada Chengyang Road, should be invited by the Madrid University of Spain and the Barcelona Taiji Center, approved by the National Religious Bureau and the Chinese Taoist Association, and went to Spain to lecture, professor local believers. In May 2001, joint local disciples founded the Taoist Association, the winter solstice in the same year, the first road to Europe was completed, and the Spanish government was officially confirmed, and the legal status of the Catholic equality in Spain. This is a milestone in Taoism into the European continent. Current Taoist believers in Europe are increasing. [54]\n\nIn the United States, there is a Mobil Road, New York, has a Tianhou Palace in New York, and San Francisco has a purple root, Hawaii has Taixuan Taoist view. In 2007, under the leadership of Mr. Zeng Yongxiang, a group of Mr. Zeng Yongxiang, president of the Sino-US Cultural Promotion Association, visited the Holy Land, and visited. The American Taoist Association plays $ 20 million in the US Rocky Mountains, the proportion of Wudang Mountain is built in the proportion of Wudang Mountain.\n\nTaoism and Buddhism acts as the main religion of China, both of them absorb each other in mutual competition, making them more applicable to the needs of China's local culture. After Buddhism introduced to China, check the ideology, rituals, sacrifices, etc. of the Ruogao Taoism, so that the small part of China's Religious Buddhism, today, the small department of China's Mahayana, can be said to be a Taoist version of Taoism. Moreover, many of Taoist's texts are referred to in the writing of Buddhist scriptures, and many rituals also refer to Buddhism such as morning and evening, feeding vegetarian. Although Chinese ancient people also have vegetarian people, but they have not strongly advised, but they have passed the country when they arrived. The study of Buddhism is the most obvious thing about the full truth and the whole three altar. If the Sazu flame mouth is written in the Miki Miyou Lama in the Ming and Qing Dynasties, it can also be said to teach the flames of Buddhism. Otherwise, the folks will not say flames, and the Buddha is not fighting.\n\nHan Di Yan Yan nine years (166), there is a statement of \"or the old man who has turned into the Si Di\" of the Di Di \". When I arrived in the West Jin Dynasty, the Buddhist Dao is very big. Tianshi Dao Sacrifice is a challenge to Buddhism. Later, Shamen was killed in time, and I raised Laozi Hu, Buddha, and Different Conversely debate. When the Tang Dynasty, the contradiction between Buddhism is most intense. And the Yuan Dynasty, all the truths and the old things will attack Buddhism, and the monk debate with the Western Region.\n\n\"Taiping Jing\" mentioned \"Laozi to the West 80 years\". \"Three Kingdoms · Wei Shu\" mentioned \"Duo Tu\", with Chinese Laozi, cover the Laozi West, cross the Western Region, to Tiansheng Hu, and the floating disciple, twenty, nine. \"The most famous in history is I firmly believe that Laozi Huang and the representative of the promotion of the sects of the Tang Dynasty to watch the Tang Dynasty.\n\nThe most important point to Taoism is that the most important point of the god is in the \"Note 9]. I believe that everything is spiritual, even the various organs of the human body have the gods; and the road is the world's own source, but not recognized the only one of the world.\n\nThe ideal world of Taoism is different from the heroes of Abraham [Note 10] [55]. There are two ideal worlds in Taoism, one is a secular, one is religion.\n\nThe ideal world of Taoism is to hopes that the world has become a fair, peaceful world, no disaster, no war; Christianity believes that life will gene in the initial original sin, life will slowly try and experience good and bad, and think \"life Full of richness, through gods to transform life, thus affect life with life, let more people return to create the master \"; Taoism does not agree with the original sin, think that people's fate can grasp, life can change , Extended, \"Xi Ri\" cloud \"I am in me is not in the sky\", or \"life can't change, but can be changed\", and it is also a bitter thing that lives in the world, death is also painful. Therefore, it is improving to the world, and the transfers will be transferred to the world. It is the blessings of Yanshou. It is a feathering to the immortality. The pursuit of \"long-lived longitude\" [56], the longevity is not dead, and there are many health methods, such as Qigong. Waiting for the Taoism to be carried forward. [57] Religious ideal world is \"Wonderland\" [58], Taoism pursues to be a fairy, so you can get back to life and death, and live in the fairy. Unlike other religions, Taoism does not think that people can reach Wonderland after death, but believe that people's body can be long-lived in some forms, and they can live in ordinary people in the world of ordinary people. \"I can live in the fairyland. However, because the realm of achieving the immortal is very difficult, then \"corpse solution\" is then appeared [59]. Some scenic places are known as human faiigines because they are suitable for cultivation, such as so-called \"Dong Tianfu\" is some representative places.\n\nThe ideal world of Taoism does not have all the buddhism. Buddhism believes that life is suffering; Taoism is through practice to reach unsatisfactory, and the longevity is not afraid to death. The most important difference between Taoism and Buddhism and the Buddhism is to treat life and death attitude. Taoism conveys the believers, what should people go on the road to life; reaching it is not dead by practicing, and the longevity is not old. The goal of Buddhism is \"Nirvana\" to leave the life and death.\n\nThe same name has a combination of \"Tao\" and the teachings of procurement of Confucianism, Release, Dao, Ye, and return. The central idea has replaced the \"气 天 法\" of Taoism in \"Ruiming Law\", and it is no longer alchemy, fully trending Confucianism [60]. The main god of the concerted centrality is clear God, the missionary venue is called \"Buddhist Hall\", so it is very different from orthodox Taoism [61]. It is still legal religion in Taiwan, but it has been banned in mainland China.\n\n[Edit in Wiki Data] "}