{"chinese_title": "Chinese literature ", "chinese": "Diet - Apparel - Architecture - Cultural Relics - Festival - Folk - Education\nScience - Five-Trim (Medical - Surgery) - Wushu\n\nChinese literature refers to China's local Chinese literature, and history has continued for thousands of years. From the earliest government files to the mature vanile novels that have emerged for entertainment to entertainment to entertainment. In Chinese, the word \"literature\" is the earliest \"Analects, Advanced\". In this festival, Confucius can divide students into four categories: virtue, speech, political affairs, literature, and later, it is called \"Confucius Siki Ten Zhe\". [1] [2] According to the Northern Song Dynasty, Xing Wei is the \"Article Bao\", which means that many ancient and modern literature and learning. In this statement, it is a culture that can be interpreted as awareness or by this. If the literature can be seen in the current narrow statement, literature can be seen in the four schools established by the Song Dynasty in the South Dynasty: Confucianism, Metaphysics, Historiography, Literature. After that, \"literary biography\" acting in the right to act \"is this. However, that kind of literature is only a literature representing the upper class, does not include the mainstream literature like a novel, drama, or modern Chinese literature. Therefore, when we talk about \"Chinese literature\", we should pay attention to the difference in literary concepts between the ancients and modern academics.\n\nIn addition, since ancient times, Chinese literature includes politics, many works are in real life, and there are also a lot of literary works from politics. Just like the famous sayings of Cao Yu in the Times: \"The article, the majority of the country, the immortal event.\" It is pointed out that the Chinese people believe that literature has a strong force, literature and politics have close relationships. Therefore, since the Song Dynasty, the reason why literature from the bureaucrats is also an influence of this idea, which is also a special place in Chinese literature. Affected by the concept of the heavens, there is no obvious boundary between Chinese literature and theology.\n\nSince ancient times, Chinese literature has always been the mainstream of rhyme, especially many of the theme of painting natural scenery and singing friendship, etc. In contrast, although the narrative poems are not developed, the ancient \"Book of Books\", Han Lifu \"Peacock Southeast Flight\", \"Mulan\", etc. from the North Dynasty folk songs, etc. It is also a famous work. If you do not count the articles of history, religion, thinking, etc., the prose literature is initially prosperous in the Tang Dynasty. The theme of the prose, in addition to some exceptions, many works are not purely creation but are reality, and this tradition has been maintained for a long time until the novel period born under the influence of Western European civilization. Also, we must pay attention to the word in ancient Chinese rhyme prose and it is said to be a literary meaning, but it is better to say that it is a name that is in style. In addition, there is a stylist called 骈 文.\n\nIn China's long history, there are many dynasties, and some nations are also sitting on the throne of this land. Although the inflow of foreign cultures also has a certain impact on literature, in general, Chinese literature refers to literature created by Chinese characters and Chinese.\n\nChinese and Han Po also impact on Japanese and Japanese literature.\n\nThe Book of Book was originally named \"Poem\", and he was respected as a poem after the establishment of Dr. Five Classics in the Western Han Dynasty. [3] Since the poetry has a total of 305 poems, [4] takes the approximate number, so the world is also called \"three hundred\". [5] The six righteousness mentioned in the later generations, respectively: wind, elegance, 颂,, ratio, Xing. The top three are the \"Book of Songs\", the last three is the literary technique of the \"Book of Songs\". [6] \"Wind\" refers to folk songs in the fifteen countries and all over the country. According to legend, Zhou Tianzi regular officials went to the folks to collect music, the reason is that folk songs reflect the lives of people, etc., there are many ironic works, which can be seen as a reality of reality; \"Ya\" points \"雅雅 \",\" Xiaoya \", is a movement that is playing when the noble feast;\" \"\" Zhou Yanyu \",\" Lu Yi \",\" Shang Yu \", is the music of the princes. \"Fu\", according to Zhu Xi \"Poetry Collection\", \"people who are in the words\", \"is also a kind of dedication;\" thanks, with the other, \"is a metaphorical method;\" The happiness, first words of others, \",\", \"to borrow other scenes, etc., as the beginning of poetry, play a role. The literary technique in the \"Book of Songs\" is except for the above three, and there is a double sound, stack, top, and so on. Among them, \"Reproduction Law\" is the main characteristics of many of the \"Book of Songs\". In short, a poem is divided into several sections. Each section is basically the same, but it will replace some words, the strong level of the words will be strong than one , Repeatedly, to collect three sighs. In addition, in the poem, especially the national style, a lot of four poems are the earliest four poems in China. The realism thinking in the Book of Songs, many phrase, literature and artistic techniques have far-reaching the future work writers. In the Spring and Autumn Period, Confucius believes that \"the Book of Songs\" \"Wen Jun Towns\", called \"Thinking\", and teaches the \"Book of Songs as textbooks, and the library of the later generations also includes the poetry into the examination range, is the hometown must read One of the works.\n\nMore famous poetry classes have \"Guan Yu\" \"蒹葭\" \"Tao Tao\" \"Moir\" and so on. Many poetry sentences have been quoted many times later, so become an idiom in Chinese, such as \"Sui Book\" (\"Book of Songs, Xiaoyu,\"), \"Hands of the Child, and the Son\" (\"\" The Book of Songs, the wind, the drum, \"\" 不 初 初, \"\" \"\" \"\" \"\" \"\" \"\" \"\"\n\nIn the Warring States era, there is a literary genre with \"Book of Songs\" in the Chu State of the Yangtze River in the south, generally called \"Chu\". The earliest records of the Chu claims are visible to the \"Historical Records and Qu Yuan Chuan\" of Sima Qian in Western Han Dynasty. The main writers of the chief are Qu Yuan (the first 340 - 278 years), in the world of Chu Huai, was exhausted, and when he was a king, There is \"Dai Sao\" \"Day asks\" \"Huai Sha\" and other works. In addition to Qu Yuan, there are also writers such as Song Yu and so on. Sima Qian did not use the name of \"Chu\". See \"Han Shu, Yi Wenzhi\", \"Qu Yuan Fu 25\", \"Song Yu Fu\" and so on, and pointed out that these works can not be sang, but they are deliberately read, calling themselves, etc. . To the Eastern Han, Wang Yi was composed of \"Chu Zhu Zhang\" (the second half of the second century), and supplemented with annotations, the book is today we call \"Chu\". The book mainly explains the work of politics, ethics, with Qu Yuan's life, but Zhu Xi's \"Chu Ring\" tried to jump away from political ethical perspectives and freely explained the saying.\n\nThe characteristics of the song, just as Huang Bisi in the Song Dynasty said in the \"school-oriented church\": \"Gay, Song Sao, all the book, as Chu, Madu, famous Chu, so there is\" \"(See\" Song Wen Jian \"Volume 92) It can be seen that it is created with a lot of the myths, things, dialects, etc. of Chu State. In the work, Qu Yuan has a lot of metaphor, such as vanilla beauty, with loyalty, bovine smell, with a ratio, can be said to be one of the most important romantic works in Chinese literature. \"Nine Songs\" saves the most old literacy of the Chu, and the content is mainly described in the world of the gods and the interaction of people. This is Qu Yuan's Shen Song Dance for the Chu State. \"Nine Chapters\" is the topic written by the distress of Qu Yuan's reality, waves and so on, and there are nine works. In addition to the above short articles, there is still a long, such as \"Day,\" \"Soul\", \"Dour\", etc. Song Yu has a \"nine arguments\" with the theme of sad autumn. Other works such as \"Fight\" \"Buju\" \"Fishing Male\" and so on, some people think it is Qu Yuan's work, but from the content and rhythm, it should be the work of the Han Dynasty.\n\nAmong the chief, the most mature work of the number is Qu Yuan's \"Liu Sao\", a total of three hundred sentences. The contents of the content is not expensive, there is excellent talent, but it is the world of doctrines. Although the protagonist is trying to save your own innocence, because the monarch is listening to the words, he will eventually lose trust. He continued to be self-sorrowful, one day decided to travel to find the ideal country. He roams in the air and myth world, and he continues to travel at sunset. Finally arrived at \"Tianmen\", but the emperor does not allow him to enter. Here, there is still a small person who is flattering. He continued to journey, unknown behind him, has already placed a column of peers. So, when he intends to leave the real world, fly on a high sky, he saw his hometown between the clouds. I feel hard to sit in my horses, and I will not go forward. In the end \"chaos\" part of the poem, I express my political ideals in the reality, I decided to go to Peng Xian 's residents, which also advocated the meaning of Fu Yuan. . From another perspective, you can also see the work as a tragedy of the heroic narrative poem. \"Lai\" is the most influence on the later generation, its name \"The road is long and the road is long, I will go up and down\" \"\" Years are really good, although the nine death is still unsettled \"is often used by the later generations.\n\nIf you open the mythical story of your mouth, China's earliest article is to count the Oracle text of Shang Dynasty and the golden text of the Zhou Dynasty. However, because both mainly describe the divination and simple political records, it can be seen as the origin of written language. If it is said that it is a generic origin of literature or in an immature stage. The origin of Chinese literature in literary prose, is as good as Sui Dynasty, \"The Hard Training · Articles\" pointed out: \"Movie, the original five classics\". Five through the Confucian classic poems, books, courtesy, easy, spring and autumn. Regarding the \"Book of Songs\", Qing Dynasty Zhang Xuecheng \"Wen Shi Tong Poetry\" proposed: \"The text of the later generations, the body is all prepared in the Warring States, people do not know; its source is more than\" poetry \", people don't know.\" Taking the \"Book of Songs\" as the source of prose, that is, the \"Book of Songs\" is an element with poetry and prose. \"Book\", ancient call, \"book\", also called \"Shangshu\", its contents describe the political record of the ancient to Zhou dynasties, the language of the book is more solemn, the following is some Notice issued by Zhou Tianzi to the Demolition of the Yin Dynasty : [7]\n\nThe content is simple, but the vocabulary used in this is \"today\", \"惟\", \"尔\", etc. has a grand and majestic feeling, the purpose is that if Yin Dynasty, the people, the people, the people, the realism and Effect of the style. \"Spring and Autumn\" is the history book of Lu Guo, and the legend is called by Confucius. In the description, the editor recorded the historical events in the age of the record, but the word is implied in the complant, and the content is surrounded by personnel and natural phenomena.\n\nFive words, roughly can inference is originated from the folk songs \"Yuefu\" in the last year of the Western Han Dynasty. Poetry is more fluctuated in five words, compared to the rustic and monotonous \"Book of Book of Books\", which is greatly expanded. There are many five-language poetry in the Lefu, and the content is the story, such as \"Peacock Southeast Flying\" is a total of 357 sentences.\n\nTo the end of the Eastern Han Dynasty, political chaos, social turmoil, and long-lasting five-way poems have been attached importance to the knowledge class seeking new literary genre, gradually applied to literary creation. If the author is unknown, \"the nineteen\" of ancient poems is the results of the five-language creation in this period. [8] Most of the works of \"The Ten Nine\" of Ancient Poems are mainly sorrowful singers, and the sorrow of people who love each other will be sigh. The fear of death, the life is short, such as Eleventh:\n\nThis poem is written by people from old to death until the feeling of death. The sad songs of \"The Ten Nine\" of Ancient Poems and the feeling of time until the Six Dynasties are still the main style of the five words.\n\nDuring the Western Han Dynasty, Sima moved to the \"Historical Record\" book, and the content is narrative, and the history of the Emperor Wu of the Western Han Dynasty is a good historical prose work, and China's first use of the history book of China's first use of the book. [9]\n\n\"Historical Records\" total 130 volumes, [10] a total of twelve cities, ten tables, eight books, thirty family and seventy column. This code is 12 volumes, describing the mains and related history; Table 10 volumes, the chance of spring and autumn, the Warring States, Qin at the end of the princes, 8 volumes, records the evolution of the cultural system; the family 30 volumes, record Since the Spring and Autumn Period, the princes and history; the column of 70 volumes, record the life of a variety of characters, the last one is the mother of Tai Shu, and describes the origin of \"Historical Record\". This history of history is known as \"bobbin\". [11]\n\nIn \"Historical Record\", the biography is the most exciting part of the book, describing the object by military home, politician, scholar, to the rich, ride, funny home, etc., involving people from all walks of life. Sima emphasized the historical abstraction and the history of the history. It also noticed the psychological portrait and personalization of the characters, and the character can be drawn to the character, showing his height expression skills.\n\nAlthough \"Historical Records\" is a historical work, it is often appreciated its literary value, Lu Xun once evaluated it as \"the sings of history\" [12]. \"Historical Record\" is a quite impact on the character in the biography, and Feng Menglong's \"East Weekly\" and the legendary of the Ming and Qing Dynasties are directly taken directly in \"History\".\n\nDuring the Eastern Han Dynasty, Class Guarded another bobody work - \"Han Shu\". [13] Compared with the \"Historical Record\" in the nature of the history, \"Han Shu\" only wrote the history of the history of the Western Han Dynasty. The history of Ban Gu was laid the foundation for the righteous history of the future history series. The book in the book is more meticulous, and the shadow of Han Fu can also be seen during the line.\n\nOne of the representative literature in the Han Dynasty was \"assigned\". This kind of literary body is affected by the influence of the Warring States Period. Liu Wei explained this in \"Wen Xinjun Dragon,\" Merry \": [14]\n\nIn other words, it is to draw the objects to be expressed in many different priests. This style is popular in the palace literati in the Han Dynasty. The author of the \"鵩 鵩\" Jiayi Kai Yiki opened its end, after which the \"seven-year\" is written, the development of the future has a huge impact. To the world of Han Dynasty, the court literati Sima Xiangru wrote a lot of famous works, and the cultivat of Han Duo is complete.\n\nSima Xiang was a famous resignation known as the world, in which the \"Zi Yu\" (\"Wen Choi\" (\"Wen Choi\", \"Yumin\" is the most famous. The borrowing sub-virtual, Mr. Wu is the discussion of the three people as the core of the whole article. At the beginning of the work, Mr. Zuyu, who was born in Chu, carefully, and then, Wu, who had born in Qi, also describes Qi State, and refuting the bustling of Chu State. Finally, I have been silently listening to the death of the two, and the grand scene of Shanglin Yuan and Han Dynasty is a lot of hunting. It is not able to compare the bustling of the Han Dynasty, so that the two people No words can be said.\n\nIn addition, since the \"seven-year\" since the multiply, he has completed the debate of two three characters, plus gorgeous rhetorical skills, forming a stunning arrangement. This kind of rich literary literature can also be seen inherited the characteristics of the \"Zhuangzi\", \"Han Ai\", etc. in the Warring States Period.\n\nSima Xiangru's \"Zi Yu\", the same use of high rhetorical skills to engraise the luxurious grand occasions stated in the three people, and die is the upper pressure shaft of Shanglinyuan. Dead is the river that flows through Shanglinyuan, the fish and birds in the river, the towering mountains, the stream, and scattered the palace in the alleged place, and the trees of the courtyard are described, Show out the vast space of Linyuan. The following part is that Sima Xiangru is borrowing is a male mouth to draw the fish of the river of Linyuan, the waterstock of the waterstock and the flora.\n\nSima Xiangru put many more detailed parts of Shanglin Court as a martial art, presented the panoramic view of the Emperor Court Linyuan's Richtures, readers like immersive.\n\nIt is worth noting that is the principle of writing, and the building space, urban space, etc. of the courtyard palace is to describe the most effective writing skills of the building space, urban space, etc. It is that Sima Xiang is like to play this expression skill to the extreme, and there is no one in the same type of work.\n\n\"Shang Lin Fu\" wrote out of the Queens of Shanglinyuan, in the end, in the end, it is not excessive to the excessive luxury bouting of the court. The traditional views believe that it should be ignorant while showing Richtles, and the so-called \"persuading hundreds of irony\", but this is just the view. In fact, in this work, Sima Xiang is just the responsibility of the court literati, and gives Wu Emperor. Sima Xiangru depicts the wide range of space ruled by Wu Emperor, and it is unparalleled by the power of the property.\n\nAfter Sima Xiangru, Wang Yuli, Yang Xiong is also a famous western resignation in the Western Han Dynasty, but the proportion of works, the rhetoric skills are still not as good as Sima Xiangru.\n\nIt is integrated in the Western Han Dynasty, and the Eastern Han is one of the main literary categories, and similar works are a lot. For example, at the time, Changan and Luoyang, the first-class resignation, and Zhang Heng wrote \"two-section\" and \"second Beijing Fu\". Although the literary achievements of these two works are not inferior to the long paragraph of the Western Han, their techniques are always imitation Sima Xiang, so their work is lost to no personality and tablet. Therefore, in order to break through the pattern of imitation, the two also tried to change the description of the object, write some kind of ideological and inner work, such as the \"Shui Fu\" and Zhang Heng 's \"Sichuan\".\n\nSince then, the theme and ideological content began to change until the end of the six dynasties, a large number of best articles have emerged, and Zhang Heng will evolve the song of songs into small product \"lyrics\". That is to say, with natural little scenes, sorrow is the theme, and use the height rhetoric skills to construct a beautiful world. The style has changed greatly. To the West Jin, Zuo Si wrote \"Sanbu Fu\", the same type of works like the long-term narrative of the Han Dynasty have also been continuously emerged, but the Han Dynasty, the \"Zhaoming Wen Dynasty\" included in the South Dynasty is some lyrics.\n\nFrom this point of view, it is not an orthodox narrative, but this featured to the Eastern Han gradually lose their vitality. This development is never accidental. The Western Han Dynasty, is good at paving the vast space with arguments, and uses vibrant expressions, which is matched with the values ​​of writers who have born in the era of prosperity. However, with the event of the times, to the end of the Eastern Han Dynasty, the social turmoil, the values ​​of writers changed, and they have always written in a good faith to describe the social reality and people's ideological feelings.\n\nThe end of the Eastern Han Dynasty, the world was chaotic, and the group got. In the year of Jian'an, the war was continuously yearned. In the end, China roughly split into three countries in Wei Shu, officially entered the three era. [15] At the time, the focus of China's economic culture was still concentrated in Cao Wei's Central Plains. Cao Cao's employment is only, and it is a time. At the literary world, the Jian'an seven son is represented by: Kong Yong, Chen Lin, Wang Wei, Xu Gan, Yan Wei, Yingyi and Liu Wei. Cao Cao, Cao Zhi, Cao Yu Sanfu Son itself is also more than written, and they work together with Jian'an Qi Sizi, have created a lot of literary works with real emotions and reflecting reality, and the style is generous and cold, and the world is called \"Jianan Feng Bone\".\n\nThe work of Jian'an poet inherits the topic of the Han Dynasty and the theme and spirit of Yuefu, and the form of literature was also transformed from folk songs, and the performance skills also improved. Their works can be roughly divided into Yuefu works along the Han Dynasty story and some point to specify specific objects, including private gift poems in their own. In these gift poles, there is a difference in ordinary emotions with the previous five-language ancient poems. The poetry in this period is relatively distinct, rich in emotion, and is represented by Cao Zhi.\n\nAfter Cao Zhi, after the failure of Cao Yu, the second half has been depressed, and his five words will also reflect the sad anger of his unhane. His works are rich, such as some of the gifts of poems, \"Gifts, Horse,\" is a representative. In addition, there are also some songs, and assignment, such as \"Luo Shen Fu\". Cao Zhi's five words have greatly expanded the theme of the five words.\n\nTo the Wei and Jin Dynasties, Ruan Ji, who influenced the impact of Taoism, brought the five-poo subjects into a new field. At the end of the Three Kingdoms, the power of Wei Guo's rulers gradually fell to the hands of Sima's father and son, and Sima's father and son also used a different conspiracy to give the emperor, killing loyalty. In this political darkness, Ruan Ji wrote 82, expressing his complex flexible emotions and secretly reflected the actual works from the multi-angle. Through the central idea of ​​a series of works, reflecting the poet to disgusting the desire to drive, the red teenager will always be aging, over time, what is the feeling of despair, and the thoughts of the world. This series of works surround this kind of tired thinking, adding some forms of integration above, with the principle, and \"the nineteen of the ancient poem\" is just a bitter caused by an incompetent sense.\n\nStepping into the West Jin, the aristocratic class in the society is basically fixed, poetry is also biased towards the life of the nobles, and the representative of the representative of this period has Pan Yue and Lu [16].\n\nTheir works pay attention to the beauty and rhetoric skills, except for some nobles to sing poetry, there are also some good poems from the inner thoughts. From the perspective of the rheology of Wu Yan, Pan Yue's \"Death Poem\" has an important position. The good written the \"Mourning Poem\" written by the wife's death, and the \"mourning poem\" written down by his wife is full of a high rhetorical skill. The work of the five poetry is until Pan Yue's \"Death Shi\" manifestation is achieved. At the same time, land machine attaches great importance to rhetoric, pay attention to the opponents, and uses the style of unique poems. The landline is a multi-type writer. In addition to the five poems, there are different types of literary works, of which his \"Wen Da\" explored the problems encountered in many literary creations. The poets in the West Jin Dynasty compared to the theme of poetry, they pay more attention to the expression skills of poetry.\n\nSince the \"Nineteen of the ancient poem\", the five poems have been mainly based on the grief style, step into the Eastern Jin, and the style is gradually changed. However, because foreign violations, the Jin Room Nanyu, established the Eastern Jin Politics. At that time, many aristocrats were addicted to the Buddha's thoughts, advocating tags, and the \"Xuan Po\" \"Xuan Xi\" in Fulong Teaching Fairy was prevalent, and the representative was \"14 of\" You Shi Shi \". This type of work topics mainly reflect the poet to leave the world, the fairy world, which is not in the mountains, add some natural scenery. With the prevalence of \"Xuan Yan Poetry\", poetry began to deviate from an intricate real world, and it is naturally subject to beautiful mountains. The subject of the South Dynasty and poems has also begun to transform from Laozhuang thinking to landscape, and the LIU Song's landscape poet Xie Lingyun is representative.\n\nIn East Jin, Tao Solitae has created many poetry. Compared with Xie Lingyun, the landscape poems describing the landscape landscape, Tao Sanks have used some kind of elegant text to sing my own love, and I feel disgusted to the officialdom and the public world. This type of theme and the five words Sorrow is completely different. His literary achievements have not been taken at the time, and they have been officially affirmed by the Song Dynasty. The Qi Liang Chen Dynasty in the South Dynasty was a short-lived dynasty, and poetry also re-turned to describe the noble life. There is a \"palace poem\" and a \"love poem\" describing the woman in a particular object, with a strong decadent tendency.\n\nWith the development of this tendency, the South Dynasty poet is getting more and more talking about expression skills, and it has also begun to pay attention to the rhythm of poetry. Liang Dynasty sinks to comply with this trend, starting to study the sound line, and summarizes the tone of the language into a flat, upper, go, into the four sounds, and puts out the poem to make a balance with the tone. The development of the five words stepped into the final stage in this period, and then could gradually catalyze into the proximity form of the Tang Dynasty. However, because the poets of the South Dynasties pay attention to poetry, the ideological content of poetry is ignored, it is a problem that poems fall into content, and diseaseless. Shen Yao sighed no poet's balance between the poets in the past two hundred years, except Xie Wei. Xie Wei's poems, in depicting the natural scenery, also has personal thoughts and feelings, and this fresh poetry is highly respected by the poet of the Tang Dynasty in the future.\n\nDuring the Wei and Jin Dynasties, the short story was also prevailed. Since the social turmoil is turmoil, the people live in a chaos, many people have lost interest in the world, and they pay attention to strange things, and the \"symbolic novels\" is the product of this era. Although this type of novel is a strange thing, it is not completely fictional. The representative made Dongjin historian peak \"search god\". In addition, since the Buddhism is prevalent, there are also works with Taoism-Taoist immortals, such as Ge Hong's \"Shenxian Biography\", although there is different novels, but in the same theme of the concentration, the theme of the fairy. During this period, the other theme is to include the \"Zhigui Novel\" in the history of famous famous people, and representatives, representatives, Liu Yiqing, edited \"World\". \" Its content narrates the name of the Eastern Han Dynasty to the end of the Eastern Jin Dynasty, a total of 1030 stories, divided into 36 comments. Its thoughts surround the atmosphere of the remarks, and also describe the unique life of the nobles. Like the novels of the novel, you can also see works that do not face the turmoil. Although the novel is simple and short, the structure is not necessarily complete, but it provides a lot of theme for future generations.\n\nBefore Wei Jin, although China did not have a literary commentary, in some literature, some people also revealed some opinions on some literary works. For example, in \"Zuo Zhuan\" \"Analects\", many times will refer to the \"Book of Songs\" to express their opinions, although only some of the words only have the word, but it also reflects the readers' opinion and opinions. In the era of Warring States, some people began to explain this kind of objection to this kind of explanation, such as \"Mencius\", \"said the poet, not in the words, not resignation. Initialism, it is If the words of \"Yunhan\" are said, \"Yunhan\" poem: 'Zhou Yu Ri people, 靡 遗?' Sinus also, it is a week without any remains. \"He believes that if only one word is only a word, I can't master the meaning of the author's whole work. In other words, I understand the author's heart is very important. To the two Han, \"Mao Shi\" and the \"Sep Sea\", \"Lai Zai\", \"Lai Zai\", and criticized the \"Poetry\" and \"Dai Sao\" from Confucianism. For example, for example, some love poems of the \"Book of Songs\" are the teaching poems of the songs of the song, the latter focuses on Qu Yuan's life rather than the work. To the later Wang Yi in its \"Chu Zhu Yan\", try to overthrow the advice, extracted from the value judgment, and directly on the work.\n\nSince then, until the Times, the status of literature gradually come out from other academic classifications, and literature began to re-recognize in literature. During this period, Wei Wenmi Cao Yu's \"Patient Paper\" is an article specializing in literature. He mentioned in the article: \"Cover the article, the country, the big industry, the immortal event\". The \"article\" here is not limited to the narrow literature of poetry, including today's documents, philosophical articles, and more. In this article, Cao Yu did not alone in ancient literature, and commented on the members and their works of Jianan Literature. For example: [17]\n\nAlthough the King of Jian'an Qi Zi is good at resignation, other literary categories are more than Zhang Heng, Cai Yuxue color. This is because each author has its own personality, so it is good at literary types that are not good at. There are different practices in different literary types (play, discussion, book, theory, Ming, 诔, poetry, and foncing). \"Those who can be partially;\" only to prepare their body \", people who will write articles also Have a preference, only a talented person can also make various stories. It is very difficult to say that it is very difficult to completely good at all literary works. In the mastery of the style, he also proposed the congenital \"gas\" concept: \"Wen is the mainstay of gas, the turbidity of the gas is not strong ... Although in the father, you can't take the brother.\" Literary creation It is basically dependent on \"talent\", which is the qualifications that the author congenitally given, is not to reach the day after tomorrow. This type of hen, even if the biological child is impossible to inherit.\n\nAfter the \"Patient Paper\" was launched for more than 100 years, the West Xinluo machine has also written a \"Wen Da\" one, and is one of the representatives of the Wei Jin Dynasties literary comments. This article is written in an excipient, and the content of the literary theory and comments are not written, not to comment on specific writers or works. The text is based on the principle of creative, from the past and the literary theory of literature and their own works and their own works. As in the order: \"The balances are made to have their own intentions ... so they have a literary, with the creation of the ceremony, the interest of the composition.\"\n\n\"Wen Da\" will write:\n\nThat is to say, standing around the center of the Universe, absorbing nutrients in ancient books, after mastering all things on space and time, the author will naturally be changed by the season (time) and the natural parts of the world ( Space) Stimulating, the purpose of writing will come to life.\n\nIn addition, land-machine has different standals to measure different stories in many literary institutions. It is exactly \"having a body, no one thing.\" This article analyzes the poems, bonus, monuments, 诔, Ming,, 颂, theory, play, and say ten kinds. Compared with the \"Patient Paper\", the cultural body proposed by \"Wen Da\" has repeatedly added, and the discussion is also more detailed, but the biggest distribution is the prose of the official nature \"\" discussion \"in poetry Previously, after the latter put this type of style in seven rhymes, this is impressing that the style of direct expression of personal feelings has gradually become the center of literature, and is close to the concept of now. The reason why this article can discuss numerous literary gehe, in addition to the land machine itself is a writer who is good at different literary genre, it is also related to the diversification of the literary world.\n\nAnother feature of \"Talent\" is to analyze the psychological analysis of writers. Although this article did not comment on a specific writer or work, land machine summarizes some literature theory after reading many ancient literary works, and then cooperate with their own creation experience, showing what writer is writing in creation, do not write What and the creation process. For example, in the text:\n\nThis is discussed to the work of the writer who is lacking in the originality and the same as the previous work. If you have created, you have to cut love, this is vividly drawing out the predecessors and their own creations.\n\nIn addition, the regret after the completion of the work is not able to pay attention to what you want (and the six-style bayness, emissory gods), etc. when the work is completed. Distressed, land machine also proposed objective analysis of this type of problem. This style of literary commentary, and after the \"Wen Xinji Dragon\", it reaches the extent of flowering results.\n\nIn the 5th century, the poet Yan Yan, Xie Lingyun and others also published some writings of literary comments, and Jiang Yan and Xie Lingyun were more reflected in their own literary works in their \"simulated poem\", literature. Comments commented in the north and south towns The more prosperous. If the most important thing is the highest, you must not mention the \"Wen Xin Dynasty\" and Zhong Rong 's \"Poetry\".\n\nMore than 50 \"Wen Xin Dynasty\" is a systematic strict literary review of unprecedented cases in the history of Chinese literature. The authors analyze a variety of literary genre and problems from different perspectives. 50 of the books can be divided into two parts, the first half of the first five is the principle of narrative literature. After 20 articles, the literary physiology is divided into 33 categories for detailed analysis, supplemented with the example of this type of work, The origin, characteristics and appearance of class literary genre. 25 second half, the last one as the order \"preface\" article, mainly involving various issues of literature and writers, such as rhetoric, sound, metaphor, individuality, etc. Although the author has a deep Confucian classic foundation, he also believes that there is a place in the literary creation in the literary creation, this is also the total of \"Wen Xinji Dragon\" in the literary creation. A feature among the fitness.\n\nThe view of Liu Wei's previous humanities work is visible everywhere in the \"Wen Xinji Dragon\". For example, to discuss the \"distraction\" article of the public, he issued a discussion on the content of the reviewers from the past generation (\"任 任,,,, \"), It is believed that it should be investigated according to the content of the written content (\" will review the words \"). Along this idea, Liu Wei returns to the characteristics of the song: \"The same is true\", \"The Body\", \"The Biye Water\", \"The Rise\", \"The Words of Bours\") and \"\"异 经 经 \"(\" Signs \",\" Dramatic Talk \",\" Sorrow \",\" Was Sword \"). Although the latter has insufficient places, but overall looks also have high literary and artistic, and analyzes should be calibromally and aggravate.\n\nAccording to Liu Wei, from the specific literary works, he also discussed the difficulties of the works in \"Zone\", which can also be seen as the methodology in Liu Wei's literary comment. The reason why the reader is not able to correctly understand the work is because \"Gui Zi\", \"Chonghe Ace]\" and \"Samoufa\". That is to say, all ancient works think is good works, despise today's work; low standards, but the standards for others are high; they have not known but believe in some ridiculous discussions. In addition, he also puts forward that \"the husband chapter is surrounded, the text is handed, knowing more, people are not round ... will be filled with self, I feel free to abandon\", \"It is said that there are many kinds of literary works and readers. Different views, because everyone's interest is different, the understanding of the work is different, so this comment cannot be neutrophily.\n\nSo how do you understand the literary work correctly? First of all, the reader must read a lot of literary works in a large number, so that it can be \"selfless than the heavy weight, not to bother, then can reason,\" like a mirror. \"\n\nRegarding the specific literary analysis and comment method, Liu Wei proposed to observe from the following six perspectives: \"Body\" (literary genre), \"resignation\" (wording), \"Traditional inheritance and creation),\" odd \"(Orthodoxical and heterogeneous adjustment),\" mature \"(use of allusions),\" palace \"(rhythm). However, in this this, only \"communication\", \"strange\" and \"incident\" are slightly involved in the content, and others just touch the basic expression techniques of literary works. However, Liu Wei believes that the correct understanding of literary works is not a single one from the perspective of expression skills. He also wrote: \"The husband is sentimental, and the vintage is in love,\" due to literature The work is reflected in the text through expressive skills, and readers must in turn to examine the author's thoughts and feelings.\n\nIn addition to the above six angles, Liu Wei also has other chapters, such as \"Listening\", \"Exaggeration\", \"Class\", \"Sound\", etc., etc., the discussion of different literature issues. \"Wen Xin Dynasty\" book discusses both basic literary theory, and also talks about the problem encountered in literary creation, and even how readers should understand the problem of literary works.\n\nCompared with the various literary issues of \"Wen Xinjun Dragon\" in the same time, Zhong Rong's \"Poetry\" focuses on poetry, especially the five-language poetry. The book divided from the 123 poets of the Han Dynasty to the Liang Dynasty into \"super goods\", \"China\", \"following\" a total of nine levels, and discussed, its grade system and the \"nine products\" in the court of the court \" Class, while other art categories such as Sheikh \"Ancient\", \"Book\" and Liang Wu Emperor \"Go Products\" also use the hierarchical system, and you can see \"Poetry\" to a certain level It is affected by this atmosphere.\n\nA large feature of \"Poetry\" is to divide the many poets into the poetry, and the source stream is mainly divided into two major camps of the \"Book of Songs\" and \"Chu\". For the former, the people are related to Cao Zhi, Liu Wei, Zuo, Zuiss, Lu Machine, Xie Lingyun, etc., the latter includes Cao Yu, Wang Wei, Pan Yue, Zhang Zhilong. The poet of the Book of Song is mainly in front of the West Jin, and the church is the Western Jin. According to Zhong Rong's view, he is more affirmative of the poet's poet's poet, which is also related to Zhong Rong's abortion.\n\nIn many poets, Zhong Rong gave Cao Zhi very high evaluation: \"The bones are high, the words, the emperors, the emperor, the body is cultural, and the body is in the ancient, Zall.\" Zhong Rong Xi Chong Cao Zhi is the inner work. Tough ideological feelings and external gorgeous words, these two aspects can also be seen as the standard of Zhong Rong product. With the same angle, he believes that Liu Wei \"True Bone Cream, the high wind, the high wind,\" there is a small number of words, the carving hate is less. However, the following is the following, \"Wang Wei,\" Duxiu, \" ...... Fang Chen Si, more than Wei Wen. \"Liu Yu Chang was\" bone \"but lack\" word \", Wang Wei has\" word \"but lacks\" bone \", so that its status is in Cao Zhi. Throughout the view of Zhong Rong, he gave a review of the poet of the poetry, \"\", \"qi\", etc., and believes that there is strong and powerful ideological emotion in the work.\n\nTang poetry is a poem that created in the Tang Dynasty (618 - 907), or it can be used to refer to poems created by the Tang Dynasty style. The Tang Dynasty was regarded as the highest golden period in China's history, so there is Tang poetry, and the Song Words will be held. After the Tang Dynasty, Tang poetry's option was emerging. Nowadays, the most widely circulated is the \"three hundred\" Tang Poetry \"edited by Dangtang. The \"All Tang Poem\" in the Qing Dynasty in the Qing Dynasty included more than 50,000 poets more than 50,000 poems. The second half of the Tang Dynasty, the economy is rich, the literati is coming from the Baiguan tour, and the 传 传 风 风 风 气After the talents of the treasure, they will follow the disaster of the town, the life is moving, and the love of the depths is available to use poetry.\n\nRegardless of the theme, genre, or style, Tang poet has a major impact on the creation of the poems of future generations. After Tang, some people still have the format of ancient poems and recent poems. In the literature of future generations, Tang poetry is often quoted as an allusion. Tang poetry and the mutual influence of calligraphy, art and music are also closely related to Buddhism, Taoism, and Confucianism, providing important information on the language, history, religion and culture at the time. In the Tang Dynasty, poetry is a project of the imperial examination. In addition, Tang poetry has become an important culture of China, whether it is a literati or a general civilians, will be exposed. In addition to the influence of China's literature and art, the Tang Dynasty also affected Japan, South Korea's poems. In the 19th century, many Tang poetry were also translated into European languages.\n\nIn the early Tang Dynasty, although the Poetry of the Tang Dynasty did not have a beautiful poetry, in this period, it was called Wang Bo, Yang Lan, Lu Zhao, Luo Bin and Chen Zi'an, opened up the theme of poetry and meteorological, poetry content. It is not a feeling of being in a hurry. In the poetry genre, this period gradually established a contractual contrast, such as Wang Bo's \"Tengwang\" final poem:\n\nTeng Wang Guofeng Linjiang, Pei Yuming, Song and Dance.\nThe painting darnilla is in the Jinanpu clouds, and the curtain is rolling.\nThe leisure pool is long, and the thing is shifted for a few autumn.\n\nAlthough it is not working hard, it is also possible to see the prototype of the poetry.\n\nIn the Sheng Tang period, the poems, in the form of, in terms of form: five words, seven words sentence, five-language poetry and seven-language poems. As far as the subject matter, this period has become diversified than the Tang Dynasty, which can be summarized as wishes, pastoral, landscape, romantic, realism, etc.\n\nIn front of the wanderer, the ginseng, high-quality represented, their seven-language ancient poems and Yuefu are the most popular, such as the high-quality \"Yan Song\", the weather is magnificent in the poem, but also describes the long-term service of the exclusions and can't return home. Distressed, the hard work of military service, the complaint of the corruption in the upper one. In addition, Wang Changling is more than seven, which can draw the process of the war with a short-descent condemn, and is called \"Poetry Tianzi\"; in addition, his nephew is very famous, describing a woman's one fell very well. The representative has \"from the military\" \"plug\" and \"闰\" and so on.\n\nThe idyllic style is representative of Meng Haoran, and the content is mainly written by idyllic life, leisurely, but there are some poetry. For example, there is \"Ying Ting's Zhang Yizhen\" has a \"desire without boat, end shame,\", expressing the distress of his stories.\n\nThe representatives of landscape poetry are Wang Wei. The characteristics of his work is to describe the quiet natural environment, natural scenery, and see his poem is like appreciating a landscape painting, such as \"deer\" and \"Zhu Ri House\", so Song Suzhen said His work is \"painting in poetry, poems in painting.\" In addition, his work is sometimes penetrating some Buddha while writing, so he is also known as \"Poetry\". Although his work is biased toward the landscape, he also made a strong sense of success in his young period, which is also reflected in his early works, such as \"old line\".\n\nIf you mention romantic poetry, \"Poetry\" Li Bai is his representative. [18] His characteristic is to express his thoughts with a relatively simple word, such as the famous \"quiet night\", so Du Fu called his work \"Qingshui out of hibiscus, natural to carvings\". His work is mainly concentrated in poetry, ancient poems and Yuefu, and pay less attention to the rhythm. It is some silence, and he does not necessarily be created according to the fixed partner, but it is very musical, which is also in line with his non-choice. He has a lot of famous works, except for the \"quiet nights\" mentioned before, there are also some kinds of enthusiasm, such as \"I will enter the wine\", \"Xuanzhou Xie Yunlou, the book\", etc., there are some penetration Taoism Touring fairy thoughts, such as \"Dream Tour Day],\" Moon Danger, \" Song \"and so on, the content is colorful. [19]\n\nThe representative of realism is \"Shi Sheng\" Du Fu. Du Fu's works have a handline, longer than refining, and genre from an ancient ancient wind to seven law. Du Fu worries the people, this kind of sadness is reflected in many of his works, such as \"Spring\", expressing the grief of \"National Breakfast\"; \"Dengtun\", it is to see a grass One wood, I will feel \"spending near the high floor hurt the customer, the Wanfang is more difficult to see\"; there are many works. Because of the war, I will think of my family, such as \"Moonlight Millennium\", \"Jiang Village\"; satiric is heavy, such as \"soldier car\"; sarcasm, corrupt life, such as \"Li people\"; there are some borrows The past history or the monument expresses his feelings, such as \"Huahui Mission\", respectively describe the historical figures of Wu Xin, Song Yu, Wang Zhaojun, Zhuge Liang and Liu Bei; \"eight pictures\", borrowed the ruins of Glasses To satirize the time. Since his poetry can record the people's livelihood in the time, reflect the true reality, the world is also called \"poetry\".\n\nAnd to the Chinese Tang, although social turmoil, the famous poet has a lot. For example, the Han Yu, who launched ancient sports, he tried to use the text as a poem, and the style is innocent. At this time, there are some poets known for the landscape of the mountains, such as Liu Zongyuan, Wei Ying, representing the works, \"Jiang Xue\" and \"Zhangzhou Xi'an\", etc. Also, Yuan Yizhen, Bai Juyi two people launched a new Lefu in the poetry, and advocated that \"the article is in the same time, the song poetry is in a matter\", reflecting the realism of the society, and the words are simple and simple. The former's self-prophet's \"sent a sorrow\" emotion is sincere, the latter \"New Yuefu\" inherited the tradition of the reality since Han Lefu, and satirized. Bai Juyi also wrote a number of famous ancient poems, such as \"long hatege\", describing the love story of Tang Xuanzong and Yang Guifei; \"琵琶\", borrow a song of self-injury. There are also different works during this period, such as Daxi Talent, they pay attention to the reticle, the poetry is natural.\n\nDuring the late Tang Dynasty, the poetry was in a weak center, and the representative of the characters had Li He. He inherited Han Yu's odd-story, so the world called him \"poem\". [20] Later Du Mu, Li Shangyin, Advanced Large Alcohol, Trivinality, Content Take Personal Help, Love, etc., compare Sheng Tang, Zhong Tang theme is poor. Du Mu wrote a lot of romance, Li Shangyin is longer than seven, his acorpted poetry has a certain position in the history of literature, but also further pushing the poetry at the time to the exhaustion of the slut, until the Popular Sinnaka The body is also the poetry of the Shangrong.\n\nThe extension field can get new development and start with the form of new expression. This is the case with Han Yu, the \"Ancient Wen\" advocated by Liu Zongyuan. Six times, with four-character, six-character sentences, the sound, the sound of the stacking literature, and the 骈文 文 骈 is the mainstream at the time. \"骈 文\" or \"four or six\" These names have not yet appeared before the ancient art. In order to confront the text, Han Yu and others, in order to confront the text, the Confucian concept of the previous ancient freedom of ancient freedom and the sixth Dynasties.\n\nThe ancient language has abolished many of the rules of the text, but also emphasized the Confucian value of the decline in the Six Dynasties, which is a negative attitude towards the south. For example, Han Yu, who is often quoted: \"The book of non-three generations is not visible\" (\"Answer Li Wei\"), it can be seen in the middle. However, as Sheng Tang poetry is born from inheritance and opposition to the southern literature, the ancient text also absorbed the mature expression technique in the formation process. Ancient text is not only resended in the past, and is also a new literary genre formed by the needs of the times.\n\nAbout Han Yu in the history of literature, Japanese Jichuan Hairo has the following opinion:\n\nIt can be seen from here that in the history of literature, or with Han Yu as an opportunity, Chinese literature is transformed from the era of poetry to the era of prose. The language of poetry is less and refined, like ancient times; prose writes in a wide variety of languages, like modern times. There is also that the refining of poetry is to be intuitive thinking. The writing of the prose is more powerful to analyze the thinking, the intuitiveness is the ancient people, analyzing is the things of modern people.\n\nAlthough Han Yong and Liu Zongyuan, the ancient essays have spawned to the results of Han Liu's excellent work, but it still does not change the trend of the mainstream of the American (46 \"), even if they enter the Song University, Still known as \"Times\", prevailing for a while.\n\nThe legend is a short story of the Tang Dynasty, inheriting a literary genre with the development of the six novels. In this period, although it also followed the theme of the north and south chair, the content began to bias from the real material, there were some \"talented\" works that did not \"strange\", [21 For example, \"Yushu\" and \"Li Wazhen\"; and some hero novels, such as \"虬髯 虬髯 传\", hopping the people's expectations in the Chinese Tang Ducheng. From this point of view, the legend of the Tang Dynasty can be regarded as the pioneer of the Chinese venerary literature. In addition to the previous mention, there is also \"Du Zichun\" (short story for the Japanese Mustang Dragon \",\" Du Zichun \"originally),\" Huijiang Bai Bai Biography \"\" Tour Xiu Shu \"\" Pillow \"\" Nan Ke Taishou \"\", \"And so on. \"The\" Tour Xueuang \"once scattered, but reserved in Japan.\n\nThe Song Dynasty began, and the development of poetry was mainly divided into two parts: temple and the poet of the grass. The temple poet is not necessarily powerful in the officialdom, but at least there is official position. Song Ji Poetry Altar is basically in the temple as the center, the poetry is inherited late Tang Yuri's poem. At that time, the knowledge-based Yhan Hanlin Yang Yi took himself and his poetry, the poems of Qian Weng and others were published as \"West Qoon Remarks\". Since then, their poetry is called \"Xunban\", but they are not a poem because of the special creative concept. To the truth, it is still very prevalent.\n\nTheir poems almost completely imitate the late Tang's poem, even if it is also imitated, but it is more simple to take out the old things, and the creation is relatively simple. The Tang Dynasty is not a poet during the Five-generation period during the establishment of the Song Dynasty. However, due to the short-term turmoil, there is no poet worth mentioning in the history of poetry, so the Song Dynasty poetry is directly inherited the late Tang Dynasty. Instead of inheriting, inertia may be more appropriate. However, Xichen Poet did not intend to create inert. They found the beauty of Tang Poetry in accordance with their own pace, and they inherited the development. Therefore, they most advocated the poems of Li Shangyin, Li Shangyin's poetry is to express the dull desperation of the late Due to the middle of the people in the late Tang Dynasty. However, the West Kunfai poet did not have any desperation. They chose to inherit the gorgeous performance skills, which can see the political tools of the Power of the founding of the founding of the founding.\n\nHowever, in the same period, a new poetry has gradually formed. For example, Wang Yizhen has created a poetry of a simple natural body. He itself is a senior official, but there is no influence of the deacon. He excluded the poetry of the Tang Dynasty, in the Tang Dynasty, in the Tang Dynasty, such as the Li Butu Du Fu and the Tang Dynasty during the Tang Dynasty. He did not follow the popular poetry, but with his own judgment, he selected excellent poet and took and inherited their poem.\n\nInheriting this source of the source is Mei Yichen and Su Shiqin. The two are in the officialdom, and the awareness is close to the grass poet. Therefore, their poetry does not have a purple and peace of mind, more is to express their true bitterness and pleasure. From this attitude, Song poetry inherited Tang poetry, and the feeling of poets in the new era and opened its own poetry.\n\nAnd the poems of Renzong Dynasty and Ouyang Xiu are deeply influenced by Mei Mei, inheriting and developing the style of these two people. Ouyang Xiu is both a poet, an excellent essay family, scholar and talented bureaucrat. Since he talented, he gradually became popular in the officialdom, there was a certain position in the temple. At this moment, the poems of the temple change. The grass in the early Song Dynasty was brought into the temple through his hand, and the poems of West Kun since the Tang Dynasty. Since then, the poems of the nobility and pay attention to the characteristics of the gorgeous feature gradually quit the mainstream, and the foundation of Song poetic features and political characteristics. Ouyang Xiu, a proud of the officialdom, is unusual, but the predecessor is lifted for life in the poetry, and has a good old generation. Among the people who were appreciated by him, there were only the opposition of the opposition, and there was also the mountains who were in the mountains in the mountains, the unnamed Sui and their sons Su Shi, Su Shi.\n\nTo Shen Zong, Wang Anshi became the prime minister and vigorously promoted the new law. At that time, even the poetry, he also had a powerful influence and wrote a lot of politics. He is most advocating Du Fu, and evaluates Du Fu is a great poet, which is established by his influence. In this way, the poetry of the temple in the Song Dynasty himself also realized the tendency of the Tang Dynasty's jealousy poetry. Since Wang Anshi is opposed to the political situation, Su Shi has been frustrated in the officialdom. Despite this, he and the door around him, known as the Fourth Bachelor of Summer, Huang Tingjian, 晁 晁, Zhang Wei, Qin Guan and others basically have this tendency. After the new party, the old party retreated. Although the new and old party fights, the temple is still developing this trend. Su Shi is different from Wang Anshi. He is not just to promote Du Fu, but regard Du Fu as one of the great poets. After that, Huang Tingjian in this view is better than Su Shi more pushing Du Fu. The opposition of the political situation did not be brought into the poetry, but in turn, between Wang Anshi and Su Shi, there was a common place in poetry creation.\n\nSu Shi has left a witty outstanding work, which has a huge impact on the development of the poetry of future generations. He has a lot of political ironic poetry, with \"lycheon sigh\" is the most famous. In addition, he also wrote a lot of rich poetry, such as \"Wang Yushan Waterfall\", \"and the child is nostalgic\" and so on. There are many excellent poets under Su Shi, especially Huang Tingjian, he can compete with Su Shi, the world is called \"Su Huang\". Huang Tingjian put forward \"rebellion\" and \"ignition alloy\" in poetry creation, and the great interest in the ideological content of the ancient poems into his poems and show people. In addition, in the rhythm of poetry, he inherited Han Yu, trying to be a rhyme, rhyme, known as \"拗 拗 poem\".\n\nI wrote the \"Jiangxi Zongpai\" in Lu Ben, the alternating period of the Northern Song Dynasty. According to this class spectrum, the ancestors of the poetry is Du Fu. Huang Tingjian is the most exactly inherited Du Fu's poem. In addition, the 26 poets of Huang Tingjian join the column. Lu Benzhong is the Chinese Southern Southern Song, at any time, but because of the opposition to the Lord and School, the owner is at the time of the mainstream color. Since then, Huang Tingjian is formally established for the \"Jiangxi Poem\" of the ancestor. Although Jiangxi is from Huang Tingjian's origin, his poem is not all Jiangxi people, and Huang Tingjian did not realize that he had to build a poetry, which is the class spectrum prepared by Lu Benzhong and his gone. The poem is established. However, regardless of the establishment of Jiangxi Poetry, when the concept of Jiangxi Poetry is established, a huge influence is played in the early poetry of the Southern Song Dynasty.\n\nJiangxi Poetry highlights Du Fu, and also attaches great importance to the \"Monochondrikan\" advocated by Huang Tingjian. That is to say, when you create poetry, you attacked the predecessor's verse, only modify the small part of the new poetry; or the idea of ​​the former poetry, but expressed in additional techniques. Due to the efforts of Ouyang repair and Wang Anshi, I found out the excellent part of the Tang Dynasty poetry, on the one hand, the poet of the Song Dynasty poeted Tang poetry into a giant pyramid that tower in front of himself. Huang Tingjian advocates an interiter of crossing this pyramid.\n\nHowever, in the end of the Jiangxi Poetry, many poets of this sent poet have borrowed the predecessor's poem to modify one or two words, claimed to be new works, and the work is simple. The famous poet Luo Tour in the early South Song Dynasty, Fan Chengda, Yang Wanli, etc., although the poem started from Jiangxi poetry, but in the end their poetry also left the Jiangxi Poetry.\n\nDuring the turmoil of the Song Dynasty, poetry gradually returned to the characteristics of lyrics. This poem is in the Southern Song Song (Lu You, Fancheng, Yang Wanli, Yusu). Among them, behind it is a poem that patriotic poets write a lot of themes, which is more famous is his poems with patriotic emotions. For example, \"Night Reading Book\", he explained himself \"Ping Miles, Gangang Wang. All the words of the war, the shameless wife, \"\" Golden Right \"in the\" Golden Flat Telle \":\" Singing, Chu, although the three households can die, there is a Chinese air! \", Complaining that the imperial court does not think into progress, there is no determination to recover the Central Plains; for example,\" book anger \":\n\nThe landlift night snowwood shore, the iron horse autumn wind is big.\nThe Great Wall is sent to the Great Wall, and the mirror has been first spotted.\n\nHe expressed the wish of recovering the Central Plains and launched his own old age. It was weak for the Northern Expedition; \"In the autumn night, he will be a fence to cool the door\" \"\" The people of the people tears, the south of the people In one sentence, he is not alone in the unwanted progress of the court, but also thinks of the sadness of the people who are oppressed by the people. By the passage is the \"indication\" of his death:\n\nExpressing the day of life can't see the recess of the Central Plains. In addition to patriotic feelings, there are many famous love works, such as \"Shenyuan\":\n\nExpressing in Tang Yu for many years, I still don't forget. There are also the same works, such as \"Dream Tour Shenyuan\":\n\nIt can be seen that although he is old, it is still missing Tang. As for \"spring tour\":\n\nPeach blossoms are still in terms of people. In addition, there are some idyllic, such as \"You Shanxi Village\" and some political satirous poetry. There are a lot of works in Lu You, and sincere, at that time, his poetry is very angry, called \"Xiao Li Bai\". However, landing is not valued by the poem, such as the name \"Sword Men Road, the rain\":\n\nIt reflects that he is unimped to the country, and it is a shame when a poet is a poet.\n\nSince Fancheng became a prime minister, after the middle of the Southern Song Dynasty, the temple was no longer the center of the poetry. Whether the court is the main battle or the Lord, the poet is no longer interested. In this period, a new batch of grass poets appeared.\n\nFor example, in the early 13th century after Yang Wanli and Lu Jo's death, Zhao Shixiu, Weng Zhu, Xu Zhao, Xu Zhu, four poets in Yongjia (now in Wenzhou, Zhejiang Province, known as \"Yongjia Siling\". Singer is praised to have talented beauty on poetry, but there is no name in the officialdom. Although Zhao Shi Xiu and others were in their sorrows, but the official resume was unknown. The reason why they are famous is because they have been appreciative of Ye Shi and his Yongjia School in Yongjia. However, even Yongjia's school is not the official in the officialdom, or when some idle official positions. The reason why they have been taken may be because of the economic policy of the South Song Dynasty, the prosperity of Harbor, Yongjia.\n\nThe same example also has the eastern master of Lin'an Bookstore with Zhao Shi Xiu. Although he is selling ancient books, it also publishes many Tang Poetry. Nature, his bookstore gathered a poet. Chen Qi it also creates a poem. Therefore, he chose the work of the poet who came to his store to repair the \"Jianghu Set\" release. The rivers and lakes are the meaning of relative to the temple. In this poem, a total of 109 people are collected. Although there are poets like Liu Kezhuang to become senior officials, most of them are still the poet of the grass, most of them are the bureaucrats, mountains, including the mountains, and low political status. Little poet. Since then, the name of the \"Jianghu School\" officially appeared, specifically refers to 109 poets in the \"Jianghu Ji\". The development process is the same as Jiangxi, and it is not established at the beginning, and it has been established, and it will naturally call friends. The common point of Yongjia Singer and the Jianghu School is a small number of trivial things around the subject. There is no exhibition of Badal or a warm passion.\n\nSong Shi and Tang poetry, generally, biased towards dull, quiet and reasonable. One aspect is related to the Song Dynasty Social Background, on the one hand, the excellent poet of the Song Dynasty, in front of Tang poetry, the peak of the history of literature, and built its own style.\n\nAt the end of the Southern Song Dynasty, the work worthy of respect is not, but most of the work content lacks the authors from the heart. On the occasion of the death of the Southern Song, the appearance of Wen Tianxiang and Xie Yu, who are famous for the patriotic poetry, and the appearance of people.\n\nThe gold chartered in parallel with the South Song, because it is a constant political power, political and cultural conservative, poetry, the poetry is close to Xun Kun, and the poetry is close to Xun Kun. In addition, there is another famous poet in this period. His poetry creation is Du Fu as an indicator, but this is the promotion of Wang Anshi, not his own claim. Although I didn't deny that I was influenced by Song poetry, he was different from Jiangxi poetry, with another angle to approach Du Fu. He is not confracted to rely on the bones and rebell, not to express the skills, the idea of ​​ideas, and he focuses on the god of poetry. He was an appreciation of Zhao Bingwen, became a door, which was originally an active active. But until 45, Jin Guo was destroyed by Mongolia, and he wrote a lot of poems that mourned the family, reflected in Du Fu, and the name of poetry was also improved.\n\nBefore the Northern Song Dynasty\n\nNorth Song Division:\n\nSouthern Song Division:\n\nIn Ouyang Xiu \"Old Han Wen\" has the following narratives for the prose from the Song University:\n\nYang Yili, Liu Wei and Qianmeng were all the courts of the Song Dynasty, and they cherished the creation of Tang Li Shang hidden and greeted poems (Xunxun), and became the standard style of participating in the subject. However, the strange \"Thasian\" \"of the four or six 骈 文 and the launch of the trend of this trend gradually becoming the need to adapt to the needs of the current social changes. In 1028, Song Renzong had two priests, \"must be realized\". [22] In this case, in the early Song Dynasty, some literati had a negative attitude towards the mainstream of the inventory. In 1011, Yao Wei's \"Tang Wen\", compared to the national cultural undertakings, a total of \"Wenyuan Yinghua\", \"Taiping Guanghua\", \"Taiping Guangji\", \"Taiping\", \"Tang Wen\", \"Tang Wen\", compared to the national cultural undertakings The title is indicated by the name of the work, based on the standard of the editor's own standard. These standards, a look at the works, and only have a civil liberation, and the text is only ancient text. The poem is just ancient poems, the law in the law, the four or six 骈 文, the proximal poem is completely not included. Yao Yu is actually a member of the ecstasy of the Song Dynasty. In the Central Tang period, Han Yong, who was headed by Han, and promoted the extension of the form of freedom of the form of a form of freedom. Only the end of the Tang Dynasty, I went to the early days of Song, Liu Kai, Wang Yizhen, Mu Xiu and Yao Wei re-promoted ancient text, and then successfully subaped Ouyang Xiu, Wang Anshi, Wang Anshi, and Su Shi lay in the form of Chinese prose in the future.\n\nOuyang Xiu has exposed to Han Yu in ancient times in a child and affirmed the value of ancient text. He told Yin Wei and Su Shiqin and other like-minded people to conduct prose reform movements. In 1057, Ouyang Xiu served as a Kangjong (Examinant Examiner), abolished the way to evaluate the ability of candidates in the way, and changed to the ancient texts of the role of the repression of the design. In this imperial examination, Su Shi, Su Shi, Zeng Gong, they also became an excellent essay in the literary world, and raised Ouyang Xiu's propose (ancient text) to carry forward, becoming the mainstream of the literary world. This position is not shaken in modern times.\n\nOuyang Xiu's history of history is expressed by the propose-based prose, China's academics also developed further developed by this new literary physiology. However, traditional beauty is not ugly, such as Ouyang Xiu's \"Cyclony, Qiqi\" 7 volumes in the table, system, notak, check, 敕, 敕, etc., etc. Also use four or six-text way. As a senior official (Hanlin), you must have this excellent writing ability. Many famous prose is also a US instrument, which is related to the use of different stories in response to the use of the article.\n\nThe representative writers of Tang Guwen and Song have added and become \"Tang Song and Song Dynasty\". This is from Qing Shende Lobo to combine eight people into \"Tang Song Dynasty\" 30 volumes. The Song Dynasty writers of Tang Song Dynasty have Ouyang Xiu, Su Wei, Su Shi, Su Shi, Zeng Gong and Wang Anshi Six people. When Su Shi, Su Shi and Zeng Zen are the Jiayou 3-year ceremonies tried in Ouyang Xiu. By. Su Shi's father and son pointed to \"three sis\", everyone got the enlightenment of Ouyang Xiu's encounter. Even if the change is a well-known Wang Anshi, it will follow Ouyang Xiu in the political view, but his talent is the earliest discovery. Six people across two generations, from the mid-Northern Song Dynasty to late, almost the active writers at the same days, China's neighbors' mainstream stories are also laid, mature at this time. Although the six people can say that it is an Ouyang Xiu, there is a little different in their own articles. In summary, it is a representative of the literary and state of Ouyang Xiu, who learns Han, ancient Chinese.\n\nJichuan Ji Lang compared Han Yu and Ouyang Xiu's essay style:\n\nIn the Tang Dynasty, some drama performances or stories are mainly concentrated in the aristocrats and monastery. At that time, in the noble private, the nobles would ask these people to perform entertainment, but they did not open. In the temple, in order to increase the believers, there will be some \"common telle\" in the speech to non-Buddhists. This part is not related to Buddhism. These two places can be seen as the origin of popular novels, but because they are not open, such performances are not prosperous. And the Song Dynasty, the cockroach of the evening is loose than before, plus the development of industry and commerce, and the nightlife has become lively, and the story, theater performance, etc. also walk into the life of the civilians in the aristocratic and temples, which is close to the development of the novels in the Song Dynasty. Relationship.\n\nIn the Song Dynasty, all the people gathered in the streets of the Kaifeng and the South Song Dynasty in the Northern Song Dynasty, called \"Watts\" at the time. In \"Watt\", there is a \"hook\" a type of performance drama, storytelling. In the Tang Dynasty, this performance is only limited to the aristocrats and monasteries, and now you can act as a commodity in the previse. According to the \"Dudicheng Ji Sheng\", in the \"hook\", there is a \"speech\" talk show, this kind of performance is also divided into 4 categories, \"talking four\". Regarding these 4 categories of projects, the people say that the content is roughly as follows:\n\nIn the four categories described above, the most important part is \"novel\". This name later gradually became a synonym of \"speaking\".\n\nIn that era, due to the prevalence of \"speaking\" and the number of literats, people are not only to go to the \"hook\", and there is also the need to turn this \"performance\" into a text. Turn this demand into business opportunities, it is the development of printing at the time. Prior to this, the publishing of books was mainly written by hand; but with the printing of the Song Dynasty, a large and cheap publication can be published in a short period of time. Since the publication of the Song Dynasty has a conditional development commercial publishing, the publication is pour, such as the source of \"Journey to the West\", \"Datang San Tibet and poetry\", according to the book's volume, is \"Zhangjia\" named \"Zhangjia\" in Hangzhou Zhonghua Bookstore published. After listening to the story in the \"hook\", I went to the bookstore near the \"Watt\" to sell the story to the bookstore, and the bookstore will be published according to these intelligence.\n\nJust as mentioned above, listening to the novels gradually developed, and later, the novels they were gradually developed independently. At that time, \"the novel\" \"Novel\", \"said\" words \", long articles\" said \"Ping\", these works, \"Three Kingdoms\" in the future (取 自 讲 讲 讲 \"),\" Water Margin \" \"(Material from\" \",\" rod stick \"),\" Journey to the West \"(from\" Self \")) has a deep origin.\n\nThis speaker of this performance art called \"speaking person\", writing a story \"Talents\" or \"Mr.\" in the scene. These people also belong to their own different organizations, such as \"eloquence\", \"books\", and so on. To Yuan Dynasty, because the readers did not have the opportunity to hide, add to the book, participate in the creation of the drama and the novel. Although the bookcraft created a lot of novels, more is the literary literature of rhyme. In the novels in the Song Dynasty, rhyme poses an important role in the work.\n\nAnother feature of the novel in the Song Dynasty is to accompany the illustration. The novel is not alone is used to read, or you can watch it. Some novels have compared text, publishers spend more mind on the illustration, such as the \"Three Kingdoms\" published by Jian'an, in the end, the illustration is delicate, but the text is rough, which is similar to today's chart or comics.\n\nIn the early days of the Yuan Dynasty, the gold country of the same is the same as the Golden Kingdom of the Ministry, did not pay attention to the culture of the South Gold and Southern Song Dynasty. But near the 13th century, the court began to have a tendency of China. They began to pay attention to Hanlin Institute and Histori, attracting talented talents as an emperor's learning and cultural consultant. Before this, the official position of this class is a reputation and is not easy to grant. Here, they attracted the famous poet Zhao Mengfu, Yuan Wei, Yu Ji, Jieshi, Fan Wei. Yang Zi and others. The last four people are more known as \"Four People in Yuan Poetry\". [23] Although they are temple poets, they have not strongly advocated literary atmosphere in the court. There is also a color poet in Sausu. Although there is no detailed biography, according to his poem, he is a temple poet in the early stage, and later became the rivers and lake poet. His pre-works are mostly rewarded, but they are similar to the later content, and there is no strong opposition to the poems with the grass. In addition, another poet Yang Weizhen, the end of his life is the husky poet, born in Jiangnan, and gave a poetry with the people who loved poetry, and criticized, admissions and guidance on poetry creation. Most of the poems are the business people, not to learn poetry for the creation of poetry.\n\nFrom the birth of the \"Lawbook\" and \"Ping\" born from the bustling area of ​​the Song Dynasty to become a reading, this literature is developed to the Ming Dynasty, and the content and the cultivation are greatly improved, become a high quality literary work. For example, in the Yuan Dynasty published, the article was very rough, but after the end of the last Ming Dynasty, Luo Guanzhong rewritten, the Qing Dynasty Maozonggang also made some changes, making the story more fulfilling.\n\nDuring the Ming and Qing Dynasties, this chapter returned to the novel. This novel divides the entire story into different backs, and the small part of each recording story will leave some of the contents of the listener or look at the next year. From the format of the chapter return novel, we can also imagine the speaker's speech. However, the chapter return novel is not recorded by the speaker's voice. In the early days, such as the Song Dynasty, the text of the novel is relatively rough, but after continuous washing, slowly develop the stylistic cultivation with the vernacular text. The novel used to read officially established also promoted the development of Vernacular.\n\nBefore the chapter of the Ming Dynasty, \"Lawbook\" and \"Ping\" have many rhyme components, but as the objects of the novel become readers from the audience, the proportion of rhyme is increasing, and the proportion is increased. Despite this, although the Ming Dynasty, \"Water Margin\" and \"Journey to the West\" are basically written in the prose of the mouth, but there is also a rhyme, which is a rhyme. This is the previous \"Singing Literature\". trace.\n\nWith the improvement of the novel in the quality and literary status, to the later stage of the Ming Dynasty, the southern literati, etc., the first-class literati at the time is also actively engaged in writing novels. For example, writing \"three words\" (\"Yu Shiming said\" \"Wen Shi\", \"Wake-up\") \"Two Shoots\" (\"First Shooting Surprise\" \"Two Test Case Surprising\") Short Stories of Short Stories Feng Menglong and Ling Mun It is the representative. The two actively agreed to identify the influence of the novel and clearly engaged in novel creation. For example, Feng Menglong said in the \"Wake--Bath\": \"Taking\" Ming \"\" General \"\" Henglean \"is a supplementary history of the Sixth National History.\" Although his novel is still subject to six times and national history, morality History restrictions, but compared to before, they have greatly identified the function of popular literature. He mentioned in \"Yu Shiming's words\": \"Although the\" filial piety \"\" Analects \", his touching is not necessarily, it is also too deep. 噫! Not easy to be?\" That is, Reading \"Filial Piety\" \"Analects\", reading custom literature can affect the public's meaning.\n\nDuring the development of novel literature, when the author realizes the status of the novel is not better than traditional poetry and history, and some authors are separated from moral and historical restrictions, and try to create some novels with pure literature. \"Jin Ping Mei\" is this type of work. \"Jin Ping Mei\" although some backgrounds are self-\"Water Margin\", but with the \"Three Kingdoms\", \"Water Margin\", this works themselves have a direct relationship with the speaker of singing literature. Although the author is unknown, you can affirm that the author is a highly educated and keen observer. He borrowed the form of the society, especially human desires, and criminalists in the form of novels. Because \"Jin Ping Mei\" is not a story, it is not a moral but desire, not good and evil, can be said this is the first realistic novel in the history of Chinese novels.\n\nThe author of \"Jin Pingmei\" is different from the authors of the venue in the same period, and it is not possible to pay rewards with this novel. In this sense, \"Jin Ping Mei\" is a novel, a novel, a novel, a pure literature. \"Jin Ping Mei\" attaches the novel creation direction of personal philosophy, in the \"Dream of Red Mansions\" in the Qing Dynasty, this kind of creation is further enriched. The theme of \"Dream of Red Mansions\", in a sentence, is the author of Cao Xueqin to his life. At that time, if you want to express this topic, you will usually use traditional poems, but Cao Xueqin chose a vernacular novel.\n\nAt the same time as highly literary vita novels, some popular and popular novels still exist. The latter itself has a big relationship with the book, and the content is mostly historical or fighting. Such as \"said Tang Dynasty\" and the \"three-term five sense\" of the protagonist of Judicial Bao Zheng is the representative.\n\nTo the Qing Dynasty, there is only a masterpiece of the pure literature written by \"Red Man Dream\", \"Confucian Foreign History\", also has a popular novel created by mass entertainment, and a variety of novels appear in the literary world. In addition, there are also some novel criticism activities, such as Jin Sheng sigh, regard \"Water Margin\" as a masterpiece, and the epidemic of the novel is unprecedented.\n\nIn addition to the white narrative novel, the Ming and Qing Dynasty also appeared some famous Chinese language novels in Tang Tang, such as the \"Novel Lamp New\" and Qing Dynasty Pu Songling. The former has a great impact on the \"rain month\" of Japanese writer Shangda Chuancheng. Nonetheless, the venue novels are still the mainstream of the novel world.\n\nThe popularity of the novels, in addition to the development of art culture itself, is also related to the booming bookstore for business activities. At the beginning of the Qing Dynasty, there is a \"Book Ship\", and the activities of the rental publication in various places; in Beijing, the Bookstore Forest. These bookstores are generally rules, and there is a description of the imprint of \"Yue Yue Chunqiu\" in the late Qing Dynasty:\n\nDuring the Ming Dynasty, Tang Xianzu wrote a lot of drama works, one of the most important players in the Ming Dynasty. His representative was \"Zi Mi\", \"The Soul (Peony Pavilion)\", \"Naki Ke\", \"Not\". Since the four works are to carry out story plots, it is also known as \"Yushu Tang Fourth Dream\", and \"Yu Mingtang\" is the name of Tang Xianzu. [25]\n\nIn the among the \"still soul\" is the best, this is not alone in the Ming Dynasty, and is also high quality work in the history of the South. The story tells a pair of men and women Du Li and Liu Mengmei understand each other by his dreams, and then Du Li Niang died because of suffering. Later, after many twists and turns, she finally woke up from the tomb and together with the male protagonist. This is a strange story of a dream and reality, born with death, and the author takes a beautiful article to carry out another scene. The rumors have children to commit suicide because they like this work very much. Beautiful Du Li is strolling in the garden, sleeping on a moment due to fatigue. In the dream, she and Liu Mengmei have encountered the \"shock dream\" scene, now still staged and loved, the following is one of them:\n\nIt turned out that it is like this, it seems that it is also paid and broken.\nYushen Tianjing He Tian, ​​who is happy to be happy.\n\nIn addition, he was based on the Kunkun cavity in Jiangnan, which was based on this beautiful tune, and the style of the heavy band returning, and the content of the play is life, and this advocates practice. At that time, the representative of the Wujiang Party of Kunshan cavity Shen Yu was dissatisfied with the ancestors of Tang Xianzu, and triggered the battle. At the same time, agree to the Tang's claim to become a Linchuanpai. In addition to Tang Xianzu in the middle of the Ming Dynasty, there are also Liangchenfish (\"Ying Yingji\"), Shen Wei (\"Yixia\"), Zhou Chao (\"Red Mei Ji\"), high-spirited (\"Yu Yu Ji\") and so on.\n\nMany of them are literati who have been traditionally educated. Everyone also uses the creation of poetry to create the opera. This makes it only to one of the official literature, but it also affects the theme of the opera. Ming Dynasty's legendary half work is a story that surrounded by talents, and the style of the metamorphic drafts and the style of all walks of life. In fact, in the end of the Yuan Dynasty, he wrote \"琵琶\". He itself is also a famous poet, and his \"琵琶\" is also the first drama work that is written by the readers, laying the direction of the development of the Ming Dynasty. His words are some of the gentle words and sentences, which is far from the city of well-life.\n\nSince then, in the Qing Dynasty, the Qing Dynasty, two famous works have appeared in the Kunqu, which are Hongsheng's \"Changsheng Temple\" and the \"peach fans\" of Kong Shang. The Changsheng Temple is written in Kangxi for 27 years (1688), the story tells the story of Tang Xuanzong and Yang Guifei, which is known in Bai Juyi \"Song Song\", a total of fifty. The first half of the narrative is divided by the chaos of Anchi, and the second half is narrative that Tang Xuanzong arrived in Wonderland in order to find Yang Guifei. The last big reunion end. This was published immediately, but the year was staged during the royal family, and Hong Sheng was imprisoned.\n\nAnother work \"Peach Fan\", a total of forty. The story is the main shaft with the true character Hou Fang Domain and Li Xiangjun, which is a historical drama that draws the fate of the people in the big incident of the Ming Dynasty. When this set of dramas, the Emperor Kangxi heard the style of this drama, and also search the drama of this drama. Due to the description of the Dynasties Dynasties, Kong Shang, I felt that I felt anger, I'm eager to evil. But there is also a saying that he left because of corruption.\n\nNow, China continues to stage the classical drama headed by Beijing Opera, but the generation of these drama is not necessarily related to the aforementioned Nanyu. The opera staged by the courts in the Qing Emperor Qianlong period can be divided into \"Ya Di\" from the Ming Dynasty to continue to sing Kunqu, and the \"flower department\" from the local drama and diverse melody. Relative to the \"Ya\" gradually declined, although the formation of Peking Opera has not yet been stated, it is also believed to be the foundation of some of the Kunqu in the \"flower department\", and then the actor is improved. The Peking Opera is compared to the scorpion and the Chinese opera melody, and the number of words is also strictly restricted (uniform). Such operas may have existed when they have earlier, but they have not seen it. In the late Qing Dynasty, Peking Opera gradually replaced a place in literature, prevalent.\n\nIn ancient times, literary works are mainstream in classical Chinese, with a small part of the white-speaking work, and the white-speaking works are generally over the Sui and Tang Dynasties. Because the oral and written have been completed. Go to Ming Dynasty, \"Water Margin\", \"Journey to the West\", \"Dream of Red Mansions\", \"Jin Ping Mei\" became a famous vanish work. Since the Qing Dynasty, Vernacular Works have begun to increase. After the Republic of China, I entered the modernity. After a vernacular movement, in addition, the government promotes the educational education, and the veninge works gradually occupied.\n\nSince 1949, the Chinese Communist Party seized the regime [26], the publishing authority was held by the state. The issuance channel of the book is unified, and the writer is also monitored by the Writers Alliance. The strict review system took effect, and literary works as the \"speech at Yan'an Literature and Art Symposium\" in Mao Zedong as a guiding principle, emphasizing the ideological of the work. This time, there were some criticisms and cooking because they did not meet the principles of literature, such as Hu Shi and Hu Feng. Social realism becomes a established style, which eventually triggered conflicts between government and writers. Before the Communist Party seized the power of the political power, the writer's ironic and revealing the ability of today's society, although he helped to expand the Communist Party, it was no longer supported by the Pigained Communist Party. Some writers have been approved as \"small assets idealism\", \"humanism\", and so on due to adhering to the literary concept of the party. These struggles finally evolved into a hundred flowers (1956-1957). Mao Zedong encourages writers to say new social problems. But due to the lessons learned from antihuy, the initial writers are also very unwilling. Later, some news articles, movies, and literary works have focused on bureaucracy and dictatorships in some levels in the party. Mao Zedong realized that intellectuals were dissatisfied with new regimes, launched the anti-right movement of these intellectuals, many intellectuals were attacked. During the Great Leap Forward, the government strengthened the encouragement of social reality and some so-called revolutionary realism, revolutionary romanticism, etc. Writers can write some works about contemporary China or in the Republic of China, but the big premise is to consistent with the ideal of the party's revolution.\n\nAlthough the writer under the Mao Zedong regime is rude, there are still some quality novels. For example, some new socialist literature, including: Liu Qing's \"Entrepreneurial History\", Yang Mo's \"Youth Song\", Qulo's \"Linhai Snowland\", Liang Bin's \"Red Flag\", Wu Qiang's \"Red Day\", Luo Guangbin And Yang Yi Yan's \"Red Rock\". In the Cultural Revolution, the literary altar was forced by the fourth wife of Mao Zedong. The scope of literary movements continued to narrow, leaving only a small amount of model play and hero novels, such as Haoran. Although there are some writers in secret creation, there is no important work in this period.\n\nIn 1976, with the four-person help of Jiang Qing, [27] passed the reform in the 11th National Congress of the Communist Party of China in December 1978, which enable writers to start creative. Many literary works \"New Period\" explored issues that were seriously abused at the national and regional levels during the cultural revolutionary period. Many writers criticized in this decade to waste a lot of time and heart and complain about China. At the same time, writers express their willingness to contribute to the country. Such literature, generally known as \"scar literature\", with a concern of party and political system. For the enthusiasm of patriotism, these writers cynicizely criticize the political leadership to push confusion to extremes in the Cultural Revolution. Some writers have expanded criticism to the leadership and political system of the whole generation. Putors face a severe problem: How can they make these criticisms to tolerate? When encouraging writers to critical the revolutionary revolutionary revolution, how can these criticisms do not exceed their limits?\n\nIn this period, many novels and short stories were published. The literary magazine before the Cultural Revolution re-enrollment, and the new literary magazine has also successively invited the appetite of the public. Among them, foreign works become the theme of magazines. Linguists are entrusted to translate new foreign literary works, and there are not careful consideration of Chinese readers. Literary magazines dedicated to translation of foreign short story became popular, especially between young people.\n\nThese dramatic changes have made some governments, literature, and art worlds. The new thinking is too fast. In 1980, the government was first responded and promoted against bourgeois liberalism, and the same movement was also re-launched in 1981. Then, these two difficult times are the removal of mental pollution in the late 1983. [28] [29]\n\nAt the same time, writers are still free to write some non-traditional or sensitive works. The spirit of literary trials has been prosperous in the 1980s. The novel writers such as Wang Meng, Zhang Xinxin, Zong Yan and dramatis are trying to create in modern language and description. In addition, some writers jointly launched \"root sports\", including Han Shaoong, Mo Yan, Acheng. They seek to re-contacted literature and culture to the Chinese tradition, this relationship has been cut off in the century of modernization and political cultural innovation. Other writers such as Yu Hua, Gefei, Su Tong trying to have a more avant-garde writing technique to boldly show that they have lost confidence in any form.\n\nWith the outbreak of the 1989 June, the more fierce the market, the more fierce, and the \"Chinese contemporary literature and culture began to biased the commercialization and escape reality. Wang Hao, known as the scorpion, is the most obvious represented representative, although his novel is not a deep theme. Some writers such as Yan Lianke continue to shoulder the responsibility of exposing social issues by literature. His novel \"Dingzhuang Dream\" talks about the distant conditions of AIDS patients [30].\n\nJust like May 4th, female writers are also active in today's China. Many female writers, such as Chen Ran, Wei Hui, Wang Anyi, and Hong Sha will try to explore women's subjectivity in a fiercely changed society. New realistic writers such as Liu Heng, Chi Li, Fang Fang, He Don, Zhu Wen is another trend of novel creation in the novel after the June 4th incident.\n\nThe Press and Publication Administration of the Chinese government is responsible for review all Chinese literary works that will be disclosed. This organ has the right to review and prohibit any form in China's printing, electronics or Internet publications. Since the publisher must obtain the licensing license of this organ, this organ also has the right to deny the rights of the people and the full turnover that does not comply with this organ indication. Therefore, the proportion of genuine books with piracy is 2: 3. According to Zonaeuropa report, there are more than 4,000 underground printing plants in China. Although the Chinese government continues to ban welcoming but believes is \"spiritual pollution\", those criticisms are just focusing on the public's line of sight to the number of soldings and stimulating the number of books. Many new generation Chinese writers are closely looked at the Chinese government. They have re-published their works into English, and there is a good result in the Western book market, such as Zhou Weibi's \"Shanghai Baby\", Zu'an Qi's context Recalling \"Red Azalea\", \"Times magazine\" banned \"Beijing Doll\" and \"Sugar\" of cotton wool in Chun Sue. The online best-selling book \"Ghost Blow\" also has to be overridden before the birthday, and delete the part of the supernatural.\n\n\nAfter the 1980s of freedom, due to the opening of the book, in the 1990s, we can see the literary and strong commercial taste. According to Wu Detrin, these trends are:\n\nHowever, Chinese literature showed a look like a commercial issue like 1980 and 1990 in the early 21st century. For example, Han Han \"His National\" (2009), his critical society's super-realistism hit the mainstream of criticism, but won the first place in 2009 Chinese bestseller.\n\nIn the new millennium, China's online literature is more active than the United States or even the rest of the world [34], almost all books can be found online, and there are millions of readers in the novel, and the average selling price is also RMB 2. Yuan, is one tenth of the average price of print books. The popular writers of online literature have Han Han and Guo Jingming.\n\nChinese literature is also popular in overseas Chinese circles in Southeast Asia, Europe and the United States. China is the world's largest book, magazine and publisher. According to the information distribution of the Press and Publishing Administration, on the publication of a single book, there is already a new title in 128,800 in 2005. There are also more than 600 Chinese magazines in the country. In France lives and writing and insists on the first Chinese to create the first Chinese to win the Nobel Literature Award. In 2012, Mo Yan also won the Nobel Literature Award. [35]\n\nIn addition, some scientific fictions have also caused people's attention. Liu Cixin's \"Three Body\", Hao Jingfang's \"Beijing Fold\" and other works quickly sell well and won the Roofout Award [36] [37] [38]. However, while obtaining achievements, some people have excessively leading proud, touting, and controversial criticism and dispute [39].\n\nRegarding the proportion of ethnic minorities in China, from the National Writer Organization - China Writers Association, in 1986, a total of 3106 general members, and 288 in the minority, more than 9%, higher than the proportion of population. From the perspective of national classification, more than 30 people in Mongolia and Korean are the most membership; second is the Manchu, Uighurs and Hui, each has more than 20 people.\n\nWhat languages ​​use language for ethnic minorities? Generally, they use Chinese and national language to create, such as Uighur, Kazakh, North Korea, Mongolia and Tibetan nationals own their own language and text, and literary traditions written in written language, especially Uighur, Kazakh, North Korea, Big Some of them are created with their own language, and more than half of the Mongolian people use Mongolian, while in both Mongolian and Chinese. About Tibetans, in addition to the Tibetan Autonomous Region, Chinese and Tibetan magazines have also developed Chinese and Tibetan magazines in autonomous states such as Qinghai, Gansu, Sichuan, Yunnan. It can be seen that there are many people who have created with Tibetan. On the other hand, Manchu lost its own language, use Chinese to create; the large number of ethnic minorities have saved their national language, but they have no text, but some authors are also using Chinese to write their works. From 1956 to 58, Zeng Zhuang, Miao, Yi Lang, Yi, Hanni, Scenery, Sword, etc., but due to the confusion of the later national policy, it failed. Even so, these minorities still work hard to create, such as the \"March 3\" creation of Zhuang people in the autumn of 1986, and included the work of Zhuang. The novel of Zhuang language has published more than 200 articles in the next few years. Most authors are the initial young newcomers, and they are not always using the Zhuang language writer created by Chinese.\n\nThe scope of minority literature has always been speechless. Some people think that as long as the author is a minority, the work written is a minority literature; but on the other hand, some writers cannot simply say a few ethnic literary writers.\n\nIf a minority writer uses his own language to describe its own national life, although it can be classified as a minority literature, the writer can be classified as a minority literature, for some How many people have doubtful. "}