{"chinese_title": "economics ", "chinese": "Economics is a social science that studies the production, distribution and consumption of goods and services. The word \"economics\" in Western languages ​​originated from ancient Greek's ἰἰκονομία (English: Wikt: ἰἰκονομμμ) [1] [2], intended to be home management. The word \"economics\" is the earliest seen in the Sui Dynasty Wang Tong \"Wen Zhongzi\": \"All have the economic way, it is said to be National Ji people.\" In 1897, Guizhou academic affairs, please open the economic genus, economics became a phased. Economics pays attention to the behavior of economic practitioners in an economic system, as well as their interaction with each other. In modern, economics textbooks usually divide the research in this area into microeconomics and macroeconomics. Microeconomics View a basic level of society, including individual actors (such as individuals, companies, buyers or sellers), and interaction with the market. Macroeconomics analyze the entire economy and its issues, including unemployment, inflation, economic growth, fiscal and monetary policy. Other comparisals include empirical economics (what is \"what\") and regulatory economics (English: Normative Economics) (study \"should be what\"), economic theory and practical economics, behavioral economics [3] and rational Choose economics, mainstream economics (research rationally - individual-equalization, etc.) and non-mainstream economics (research system - history - social structure, etc.) [4] [5]. [6] Economics analysis is also used in other fields, main areas include commercial, finance, and government, but also include health, crime [7], education [8], law, politics, Social architecture, religion [9], war [10], and science [11], etc. In the early 21st century, economics continued to expand influence in various aspects of social sciences, so that some scholars sat annountened to \"Economics Imperialism\" [12].\n\nThere are several statements in modernity of economics, there are many statements that have distinctly defined because of the development of different fields or theories [13], Scottish philosophers and economists Adam Smith will political economy in 1776 Learning is defined as \"research on the nature and cause of national wealth\", he said:\n\nLet - Batist Sai Yi's independence in public policies in 1803, and defined it as aware of the production, distribution, and consumption of wealth [15]. On the other hand, Thomas Carlare satirically, economics as \"Dismal Science\", but this word was earliered by Malthus in 1798 [16]. John Stewart Mill proposed a perspective of social sciences to define economics in 1844:\n\nAlfred Marshall In his 1890 \"Economics Principles\", the field of economics analysis is extended from simple wealth from simple wealth, and it is not just a society, and it is also an individual's level:\n\nJazz, Robbins, proposed in 1932, is considered \"Economics Definition\" [19]:\n\nRobbins believe that this definition is not focusing on economics \"research some behavior\", but to \"study how the study behavior is limited by the local conditions\" [21]. Some people criticized this definition extensive, and they could not limit the scope of the analysis in research on the market. However, since the 1960s, due to rational choice theory and its theory of competition, the development of economics has expanded, this definition has been widely recognized [22], although there are still some criticisms for this [23] .\n\nIt is often based on economics as an economist for analyzing other field disciplines to think that the ideal economic definition should be \"comprehensively\" maximize behavior, preference stable, and market balance. \"[24]\n\nEconomic behavior of the most basic unit (individual, enterprise) in an individual economics. Microeconomics attach importance to demand and supply, how to affect individuals, reach transactions, and form an equalization price in the market.\n\nMicroeconomics focus on people's decisions and behaviors affecting the supply and demand for goods and services, who is responsible for determining prices, or in turn, how the price determines the supply and demand for goods and services.\n\nMicroeconomics's purpose is to form a market mechanism for forming a wide range of items and services and how these limited resources are configured in different uses, and the efficiency problem here is not the primary. Microeconomics does not attach importance to economic efficiency, because it can get answers from regulating economics. Not only that, microeconomics also analyzes the market failure. Which of the market cannot produce efficient results and describe the theoretical conditions of the market under full competition. The importance of this discipline includes general equilibrium theory, information asymmetry market, game theory economic activity application and economic item elasticity in market systems.\n\nEconomic development is not just an increase in economies and overall growth, as well as these developments have changed in the system, that is, balanced changes and new balance. Economic development is a concept of individual economics and has a close relationship with economic growth. Economic growth can be reached without economic development, but economic development will never lead to economic growth.\n\nIndividual economics is based on economic perspectives to study individual decision makers in the market's behavioral and market form, which includes private, private, public, etc. for decision-making units, and individual economics research these decision-making units interact in the market (assuming transaction) Something has a scarcity existence). A market may be in a trading product (such as apples, aluminum, or mobile phones), or it is also a service in transaction production factors. Individual economics believes that the overall market is composed of many individual buyers and sellers, and therefore, it can make detailed research on the possible price of goods (also supply and demand). Through the interaction study of decision makers on the market, individual economics believe that supply and demand in the market will tend to balance over time.\n\nIndividual economics also also studies the structure of various markets, completely competition refers to a market structure that does not have a price of price without individual participants, and more simply saying that every business is priced at full competition. The acceptor, their buyer, the price of the market does not have an impact. The incomplete competition is completely competitive, and examples include monopoly (only one seller selling a sample), double-head monopoly (only two sellers), olitable (only a few sellers), monopoly competition (There are several sellers selling different products), the buyer monopoly (only one buyer), the buyer is oligon (only a few buyers). Unlike complete competition, the market forces are not averaged under incomplete competition. Therefore, companies under incomplete competition may become a \"standing person\", that is, through their high market share, they may affect the formation of prices.\n\nIndividual economics's research on individual markets is that the behavior of establishing in a single market does not affect other market assumptions, this analysis is also known as local equilibrium analysis (supply and demand), this practice will take economic behavior Above a market. General balance theory is to study various market behaviors. The field of research includes all markets, and research is a change in the market, and the process of balanced process [25].\n\nIn individual economics, production refers to the process of investing into the output, which is a process of creating goods that can be used or transaction through investment. Production is a time-friendly process, which is not immediate, but has produced some quantity of products for a period of time. This process can distinguish between consumer products (food, haircut, etc.) and investment products (machinery, construction, roads, etc.), public goods (police, fire bors, etc.) or private items (computers, bananas, etc.), and national defense production Holdings with private production.\n\nThe cost of the opportunity refers to the economic cost of production. In other words, it is to choose not to produce, and the resource that can be eliminated can be used for the secondary ideal production. Because capital and time are limited, people can only choose from many ideals and feasible scenarios, which reflects the gains between scarce and selection [26]. Since any economic behavior has an opportunity cost, this makes limited resources must be utilized, and therefore, the rational standard for conducting economic behavior is not a certain behavior \"good\", but a certain behavior. \" Is the most valuable choice. \" The calculation of opportunity costs is not limited to money or financial considerations, more factors that calculate actual costs, other production possible losses, and leisure and other factors constitute opportunities [27].\n\nThe investment in production includes the main production elements such as labor, capital (which can be used for production, such as factories such as plants, including natural resources), and other inputs contain intermediate products - 即 即 产品 产品 产品Things used in the process (such as steel required for production vehicles).\n\nEconomic efficiency refers to the effectiveness of an economically producing output product under specific resource input and technology. If the output is increased in the same input, the economics say this is the efficiency improvement, in other words, \"waste\" is reduced. Plato efficiency refers to the case where the efficiency is mentioned in \"highest\", in which case, any change will only lead to the reduction in efficiency.\n\nProduction Curve (PPF) is a way to illustrate scarce, cost, and efficiency. In the simplest example, an economy only produces two items (such as firearms comparison bread). The production probability curve is shown in a chart (as shown on the right), which shows the different outputs generated by the two commodity production under the two commodities under the established input and technology. The point on the arc represents the possible output, that is, if a product is produced, another product can only produce much.\n\nScarce refers to people want to achieve, but existing situations and production conditions that have been achieved under resources are exceeded where the production of possible curve arcs, such as the X point in the figure [28]. If the output of a product is increased, then the output of another product will inevitably decrease, so that the mutual rejection is formed. This is because the investment required to produce a sample will take up resources to produce another product, and therefore reduces the output of another product. The reduction in the additional product output caused by the same product is also called \"actual opportunity cost\". In other words, if the picture of 100 units is produced in the right, the opportunity cost is the production of 100 units. PPF illustrates that on a production curve, choosing more products will result in another product reduction. Under a market economy, with the economic pulse of the production probability curve, it is due to the change of the product's demand.\n\nThe arc of the production probability curve represents the most efficient production state under a certain type of production, if we choose production allocation in the arc, such as the A point in the figure, this is achievable, but it will cause The low efficiency of production (for the waste of putting it), that is, this distribution does not reach the most productive point. This waste of waste includes a high degree of unemployment rate in the boom cycle, or a country's economic policy obstruct producer fully utilizes their investment. As the production state of the arc point is not necessarily the most assigned efficiency (ie Plato efficiency), because it is still possible to be inconsistent with the consumer demand.\n\nPractical economic education is mostly focused on how to enhance an economic efficiency, find out how to adjust social organizations to achieve the most effective resource production, is considered \"Economics\" [29]\n\nSpecialty is a phenomenon that has been considered to be an important source of economic efficiency in economic theories, and different individuals and countries may have different opportunities for various products and services. For example, there may be More high education talents, and another country may have more forests and coal mines. The specialization theory stated that in the absence of the difference in opportunities cost, the parties produced can reach a comparative advantage through division, but make the cost of producing a certain product relatively reduced. It should be noted that even if a country has an absolute advantage in the investment and output efficiency of all products, it can still achieve higher output sums through specializing and trade with other countries. Therefore, even the most efficient and most developed countries, they can still be produced with the least efficient, and then backward countries.\n\nIn observation, many high developments such as Western Europe are still maintaining a lot of trade between mutual trade, which has also made many economics research focused on the scale and gathering of the economics. In order to explain the state of the division, the country that produces different products is how to promote the interests of trade countries [30]. The specialization of specializing can be used in individual, farm, factory, service industry, and even the economy. In these production systems, the extension and interaction of different groups may have their respective divisions, or a similar effect is achieved through different capital or land. [31]. With specializing as an example, a developed country specializing in the production of high-tech products can trade with a country specializing in the production of less expensive labor. The difference in opportunities between the two will make them get more after trading. Large output. Compared with their own production of high-tech and cheap labor products, both can profit from it.\n\nThe market price of investment and output determines how the divisions are allocated, and the cheap input will be used for more cheap output. In this process, the output of output may be due to design or Additional value has improved [32]. This production of division of labor creates the opportunity of trade benefits, making the owners of resources through trade to replace some kinds of investment into more valueful products, and therefore profitable. To measure the interests obtained in trade, it is to increase the increase in income levels from a trade [33].\n\nThe price and supply quantity is considered to be the most direct entry point of the production of products in a market economy [34], the theoretical explanation of supply and demand explains how the price is produced and consumed. In individual economics, this is assumed that it is completely competitive, that is, no other buyers or sellers have enough market power unilateral setting prices.\n\nIn a market, \"demand\" refers to the interactive factors when all buyers should purchase a unit of products at a specific price, demand usually describe the price and quantity requirements in chart (as shown in the right), demand The theory refers to how individual consumers is rationally selecting some quantity of products. This situation is also called \"maximization of interest in limited cases\" (a person's wealth and income is the main reason for determining restrictions). Interests herein refer to how individual consumers do het between many products, and their results will sort the product and purchase it here.\n\nThe demand fixing refers to the quantity of the demand in a market in general. That is to say, the higher the price of a product, the fewer people will want to buy (assuming other situations). With the price of a product decline, consumers will be more willing to buy it, not other more expensive alternatives. In addition, because the price of purchases due to the decline in price, the consumer purchase capacity is improved. Other factors may change demand, for example, income increase enables the demand curve for normal items to expand. In carrying out this analysis, economists assume that other factors remain unchanged.\n\nThe supply refers to the price of a product and the number of products in the market in that price, and the supply can also be described by the price and quantity. Under this model, the producer (such as a company) is assumed to maximize profits, that is, the number of products they will try to produce and provide markets is what they believe will achieve maximum profit. The supply is usually expressed as the relationship between the price and supply quantity (assuming other situations), in other words, a product can be sold by the price, the producer will be willing to provide such a product, such as the right picture . Higher prices make it possible to produce higher profits, such as demand curves, and supply curves can be moved, such as duality or technological innovation of production factors, can cause the supply curve to move. Demand theorem pointed out that if other conditions are not changed, the price increase will result in increased supply, and the price slip will result in a reduction in supply. In this analysis, economists also assume that other conditions remain unchanged, such as replacement prices, production costs, and other many factors that will affect production, assume that it is constant when analyzing.\n\nThe market balance refers to the intersection of the two lines shown in the right image when the amount of supply and the number of demand meet the two lines. When the price is lower than a balance, the product needs will begin to be high supply, which will enable prices to improve. When the price exceeds a balance point, the supply of the product will begin high demand, so that the price is lowered. This model is estimated on the curve of any supply and demand, the price and supply will find a balance point in a price supplied by product requirements, etc., the same, this theoretical estimate When the supply or demand is changed The new price will be produced to reflect the new balance point.\n\nFor any consumer product, the location of the demand curve determines the marginal utility of a product, which determines the cost of consumers to obtain a product [35]. The point on the supply curve represents the marginal cost, which is the cost that the producer provides a product that needs to pay. The price at a balanced point is determined by the supply and demand, and under full competition, the supply and demand will be equilibrated with the marginal cost and marginal utility [36].\n\nIn the supply surface of the market, the factors affecting the production are called production variables, and these variables determine the amount of output in the short term. Some input variables can be easily replaced, such as electricity, original resources, overtime work, etc., other variables are more difficult to replace, such as factories and machinery or important senior employees. For a long time, all inputs can be changed through management. Short-term and long-term respectively constitutes the price flexibility of supply, which is how to deal with the supply or demand for the fidelity and generate a new price equilibrium point.\n\nMargialism describes how consumers reach the most favorable position under different wealth and income levels, and producers will also try to maximize their production under the limitations of their respective production (such as product needs, technology, prices, etc.). interest. For consumers, the maximized position of their interests is that when the marginal utility of a product is to reach zero relative to its price, it is described in a simple way. At this time, consumers have bought the market \"most cost-effective Products, not more valuable choices than this product. Relative, the producer will compare the marginal cost and marginal income of the product (the price of the most perfect competitor), the difference is \"marginal profit\", when the margin profits reaches zero, they will not Will continue to produce a product. The market is moving towards the equalization of the movement and the number of equalization points, the price, and the number of supplies are also conducted on \"marginal\", which means that their interactive relationship is relative, not absolute.\n\nThe application of supply and demand theory contains income distribution accompanying production factors, including labor and capital interaction in the market. Under a competitive labor market, the number of people employed under certain labor prices (ie the salary level) depends on the demand for labor (from the producer) and the labor supply (how many people are looking for work ). Labor economics is the interaction between labor and employers to explain the market and other labor income, labor-liquid, unemployment, human capital production capacity, and changes in other relevant public policies [37] .\n\nSupply and demand is used to explain the market behavior under complete competition, however, it can still be used to compare other markets. It can also be used to explain the changes in the various levels of the economy. For example, this includes domestic production weapons and prices for the overall economics [38]. Economists can also provide allocation resources that the market can be effectively valid through supply and demand. [39].\n\nIt is often not directly traded in the market, but it works and produces through the company. The most obvious company is a company, partnership, and trust. According to Ronald Cos, when the cost of producing the company is below its own production, the individual will choose to produce [40]. The company integrates labor and capital, and can achieve higher scale economies than individual transactions (that is, when the cost of producing a product unit decreases with the increase of production).\n\nUnder a fully competitive research model, producers have many years of production, and there is no decisive impact on market prices. Industrial organization research is the competition between companies when certain producers do have decisive impacts, which contains interactions between markets and companies. Commonly analyzed analysis of market structures, in addition to full competition, there are monopoly competition, and other situations such as olitage, double-heading monopoly [41].\n\nManagement economics is a process of business decision-making in an individual economics. This study is quite dependent on data, such as research on operations, as well as other statistical methods such as no complete information and determinism. Next regression analysis. Its research is the best practice for business decision-making, including how to reduce costs, maximize interests, etc., of course, this is assumed that other situations such as technology and market demand unchanged [42].\n\nUncertainty is economically refers to the essence of future income or loss, no matter whether it is a risk. If there is no uncertainty, the individual's economic behavior will completely detach the uncertainty of work and income, the financial and capital markets will become a simple market stage medium, and the communication industry will completely disappear [43]. Due to many types of uncertainty, there are many different ways in economics to represent uncertainty and economic decision makers to respond to it [44].\n\nThe theory of the game is one of the application of mathematics. Its research is a strategic interaction between different policy makers, which is also a kind of uncertainty. The game theory provides the mathematics roots of the industrial organization theory, which is used to architecture the company's various behaviors. It can be used to study industrial behavior of oligomers (very few sellers), and they can be set in wage negotiations, bar, contracts and The number of other decision makers will be less in the case where they will have a visible impact on each other. Theory theory is a very frequent use of behavioral economics. It assumes that individuals choose the most favorable strategy for them at at least some of the conflicts of interest [45] [46]. Through this analysis, it can seek the individual to seek the maximization of interests to study, such as the model of supply and demand, while also taken into account the uncertainty of information. This study dates back to John Von Nobiman in 1944. The theory of the game has an impact on many areas, including nuclear strategies, ethics, political science, and even evolutionary biology [47].\n\nRisk disgusting will also promote special management risks and provide venture information in a developed economy, such as insurance markets, futures trading, financial products, financial economics, or pure financial markets are industries for risks. This area also also studies the financial market and the company's capital structure, the efficiency and health of the financial market [48], the financial crisis, and the government's control, etc. [49].\n\nSome market organizations will also produce low efficiency because of uncertainty, according to George Aklov's \"lemon market\" theory, one of this inefficient exemplary example is the used car market. Since consumers are uncertainty if there is potential problem, they tend to lower a good price of a good second-hand car than its actual quality [50]. Information is not symmetrical, making the seller even if this is information, and has not motivated the buyer. The problem in this area is reverse choice, that is to say that those who are easy to take risks (and therefore the most easy to do), often those who are most inclined to insure, and thus lead to moral risks, make Insurance is more adventive. These issues may cause the increase in insurance costs, and therefore I expel some people who have originally benefited from this service (incomplete market). Moreover, if it is trying to solve a single problem, such as forced owner's insurance, then it is still unable to resolve, but it will create more moral risks. Information economics is the study of these issues, which in many areas such as insurance, contract law, mechanism design, monetary economics, and health insurance [51]. Research results that can be applied include measures to address or reduce legal and market risks, such as product security, partial insurance, capital restructuring or bankruptcy law, and other management information revealed [52] [45].\n\n\"Market failure\" includes many different problems, many of these issues may conflict with both economics. Although economists have different definitions in market failure, the following classification is often proposed [53]:\n\nInformation asymmetry and incomplete markets may lead to low efficiency of the economy, but this is likely to be corrected through market, law, or other policy.\n\nNatural monopoly or \"technical monopoly\" is an extreme example of a competitive failure. This problem describes how many single costs are produced when producing a product, then it is the most efficient.\n\nPublic goods According to market failure theory, the general market is the lack of supply, the most important feature of this failure is that people can use public goods without having to pay directly.\n\nExternal refers to the external social cost or interests that the market price is not reflected. For example, pollution causes negative externalities, and (government payment) education will create positive externalities (such as higher technical workers). The government often prohibits economic activity taxation or prohibiting economic activity for manufacturing negative externalities, and taxes to positive externalities [54]. In addition, the basic supply and demand theory explains the completion of equalization, but does not explain the time required to reach the balance of supply and demand [55].\n\nSome people advocate the number of viscous prices rather than the price determine the short-term changes in the supply and demand, which is also a standard study of many overall economics. Researchers usually focus on discussing the causes of viscous prices and reaching long-term equilibrium processes. Some economics are focused on the development of market failure, such as public economics, is the intervention of the government to regulate market failures. Solving market failure policies include government management based on cost gain analysis, or providing market incentives to make changes, such as charge tax bills [56].\n\nDespite this, many economists have proposed the theory of challenge market failure. For example, the public selection school proposes an example with the market failure - the government's failure, believes that political economic intervention and special interests are the main cause of market failure [57]. The Austrian economics will further advocate that the low-efficiency monopoly will only form in the leadership leadership, and the low efficiency of the market can only eliminate the spirit of entrepreneurial entrepreneurs in the market, and the government does not make positive impact [58 ].\n\nPublic finances are the development of how the government's public government has budget and taxation, and the development of tax system (those people are paying those taxes), the cost-effective analysis of government spending activities, financial policies, government for economic efficiency and income The impact of allocation. The public selection theory is to study the public industry schools in an individual economics, analyze political individuals that seek interests to maximize the maximization, such as politicians, voters, bureaucrats, and interest groups, and their interaction in the political process [59].\n\nMost economics are empirical-based, focusing on describing and predicting economic phenomena, and regulating economics research economy \"what should be\". Welfare economics is a normative economics, analyzes the efficiency of income distribution in an individual economics, and measures social welfare in society. [60].\n\nThe overall economics regards the economy as a whole, and through the general equilibrium theory with \"from top to\" angle view of the economy, the sum of the economy [61]. These sums include the total investment and output, unemployment rate, and inflation of a national economy, and other small sums include consumption and investment sum. Overall economics also focused on studying monetary policy and fiscal policies.\n\nSince the 1960s, the overall economics has also been introduced into some individual economics, such as analyzing individual rationality, efficiency market hypothesis, and incomplete competition [62], these developments have resolved part of the inconsistency for these areas. Question [63].\n\nThe overall economics simultaneously affects the growth and national income, including capital accumulation, scientific and technological progress, and labor growth [64].\n\n\"Growth Economics\" research is to create economic growth, that is, a country's per capita production output is improved for a long time. The same factor is also used to explain the differences between per capita production outputs between countries, especially why some countries grow faster than other countries, and why some poor countries have a high growth rate than developing countries.\n\nMany factors that have been widely studied include investment proportion, population growth, and scientific and technological change. These studies include theoretical and observed forms (like new classic economic growth models) and growth accounts [65].\n\nThe study of economic depression has prompted the birth of overall economics. In the 1930s economic panic, John Menard Cairns published a book of \"Work, Interest and Money Watrina\", which constructs the main theory of Keynesian. Cairns believes that during the economic depression, the total demand for the product may have insufficient phenomena, resulting in high unemployment rates and possible production capacity loss. He believes that the government should increase the government's activities in the public industry, including the implementation of expansion of monetary policy and fiscal policy with central bank to stabilize the boom cycle [66]. Therefore, a big conclusion of Keynesian is in some In the case, the market itself does not push output and employment to the extent of full employment. John Hicks' IS-LM model is a classic example of explaining Keynes theory.\n\nOver time, the awareness of the boom cycle has gradually increased and expanded to other fields, most of which is a response to Keynes theory. The new classical comprehensive school is a synthesis of Keynes economics and neoclassical economics. Although Keynesian is short-term, new classicism is more explanatory in the medium and long term [67]. The emerging classical economics will take out from the Cairns Jingqi cycle theory. The depression of the market is due to incomplete information, including Milton Fourman, including Milton Funan's constant income and small Robert · Lucas proposed \"rational choice\" theory [68].\n\nIn contrast, the emerging Cairns school preserves the hypothesis of rational expectations, but blames the boom cycle on the market failure. The emerging Cairns school believes that the price and salary are \"viscous\", that is, they will not make adjustments with the economic situation [69]. Therefore, the neoclassical school believes that the price and salary will automatically adjust to achieve full employment, and the emerging Kanes school believes that full employment will only be automatically reached in a long time, and there is also a government and central bank intervention in the short term.\n\nOn the other hand, the Austrian Economics Party with the Cairns School is considered that the boom cycle is due to the release of excessive lending funds through the central bank, resulting in excessive capital lending, thus causing entrepreneurial incorrect investment and capital error distribution, Therefore, a credit foam is formed. They believe that the expansion period in the boom cycle is the abuse period of capital, and the immediate recession is the beginning of economic recovery. The theory of the Austrian School is not valued by the Cairns school or the neoclassical school, but there is still some supporters in the academic circles [70].\n\nThe number of unemployed in an economy can be calculated by unemployment, and how many workers are actively looking for work, retirees, are being educated, or to abandon their finders because other factors are not included in the unemployed. Unemployment can be classified according to several types, and the classical unemployment is that when the salary is too high, the employer is not willing to hire more labor. The reason why the salary is too high may be the minimum wage regulations, or the activities of the trade union. According to the classical unemployment, friction unemployment is the work of the market has the work of the counter, but the labor needs to find and wait for the labor in the process of pairing. [71]. Structural unemployment includes a range of unemployment caused, such as labor skills and market needs of the market [72]. When an economy is undergoing a large-scale transition, many structural unemployment may occur because many labor have different skills and emerging industries. Many structural unemployment may occur [73]. Regardless of the situation where economies are in, some degree of unemployment may continue, but the Cairns school advocates that when the economy stops growing, the periodic unemployment caused by the lack of total demand, Akkenfa is Observation of unemployment rate and economic growth [74]. The original Akkenfifer pointed out that 3% of economic output growth will reduce the unemployment rate of 1% [75].\n\nUnder most market economy, the currency is a tool for use as a trading medium. Assuming that there is no inflation, the currency is more valuable, can be done, simple, and more flow than other forms of trading media (such as seashells, silver bars, gold). The currency contains banknotes and savings held, as well as the Bank and the government's spare funds. The currency is like a social medium like a language. Its value exists in the function of interacting with others. If there is no other trading, then more money is also equal to waste paper.\n\nAs a trading medium, the currency makes the transaction easier, which makes people more simple valuation products and services while also cause savings. Compared with currency is the way of trading, without currency, it is necessary to match the needs of the transaction (such as Apple exchange book) with a more difficult material. Due to the versatility of the currency, it makes the transaction cost of the transaction to decrease, and such a producer can easily change the output to the market universal value, without the need for the secondary transaction. [76].\n\nFor an economy, the currency supply is closely related to the face value and price level of total production, and therefore, the management of monetary supply is an important issue of monetary policy [77].\n\nThe Cairns school believes that the government should adjust the total demand through the fiscal policy, and they advocate that when the total demand is lower than the production potential of the economy, this unused production capacity has formed an output waste. According to this, the government encourages total demand growth through the increase in fiscal expenditure (through deficit spending, taxation, or inflation), so that there is no use potential that is not used. For example, even if there is no practical need, the government can hire unemployment workers to build a highway, so they will play their \"production potential\". And this expenditure has a multi-multiplier effect, which has more business opportunities to cope with expanded fiscal policies.\n\nOf course, this theory is that the foundation does not take into account the hypothesis of the extrusion effect. If the output waste does not exist, the economy is operating in full capacity. If the government involves increasing financial expenditures, it will squeeze into the economic activities of the private industry, and there will be no economic growth. The expansion of the fisherman believes that the extrusion effect will only appear when there is no waste, and the opposing economist believes that this effect is always existing, and pointing out the theory of Li Jia Tu, they advocate the government's borrowing inevitable needs The tax increase is returned, and any demand caused by government fiscal policies will be eliminated because of the savings payable for future high tax rates.\n\nInternational economics research country and the country's trade exchanges, and study international trade can bring trade benefits, important policy research includes tariffs and trade barriers for import and export and economic growth. International Finance is a field of integral economics to study how the capital flows between countries and study exchange rates. The growth of international trade, the enhancement and intensity of the division of labor in various countries is an important source of globalization [78].\n\nDevelopmental economics is the development of developing countries in development in development and research industries, poverty, and economic growth. Unlike other economics, development economics often combines social and political issues as a consideration [79].\n\nThe economic system is a field of economic system differences in economic systems. The focus of research includes differences in economic routes, development strategies, property rights protection, and economic resource allocation. The study of this field is the most basic research unit in an \"economic system\".\n\nIn the contemporary economic system, the two different routes of economic organizations are socialist institutions and capitalist systems. One is based on the national customization economy, and the other is carried out in the free market, and the intermediate route between the two For the hybrid economy. The interaction between economic system and political system is also known as political economics, and the \"Comparison of Economic System\" refers to the economic behavior and growth difference between different economic systems [80].\n\nContemporary economics often use mathematics as one of the research methods, and economists used research tools include calculus, linear algebra, statistics, competition theory, and computer science [81]. Economists in academia generally have the basic capabilities of using these tools, and minority economists focus on the ways of mathematics and other mathematics.\n\nThe mainstream economics theory relies on the priori economic model and has been derived from the middle. These economic discussions typically assume that the focus changes are changed in response to various conditions under \"other cases remain unchanged\". When conducting economics discusses, economists pay attention to finding to be empirically expressing at least at least significantly, and can derive the theory of other research [82].\n\nUnder individual economics, the main research concept is the supply and demand, marginalism, rational choice theory, opportunity cost, budget line, utility, and company research [83] [84]. The overall economics focused on model constructing for overall changes, but with time, this route gradually eliminated, replaced by the study, more focused on the overall study of individual foundation [69].\n\nMany of the individual economics have a major impact on the field of overall economics, such as monetary policy, currency quantity of monetaryism points out that the supply and expansion of currency will cause inflation due to the rational expectation of the market. In the development economics, the development of countries generally predicted will have a small amount of economic growth, because the marginal recycling of capital investment begins with the degree of development, this trend is observed in the development of four small dragons in Asia. . Sometimes these economic hypothesis claims just a \"directional\" or \"trend\", rather than absolute data changes [85].\n\nIn recent decades, rapid expansion in social sciences in the field of social sciences also has a huge impact on economics. Through, for example, Nash equilibrium points as a baseline based on economic individual decision-making, economists can do not rely on actual world data. Analyze and predict many areas [86]. Standards Theory Theoretical Economics Topic First Design a \"Competition\", economist, economist, economist and multi-interaction in the competition, and to study how they maximize the benefits under different rules.\n\nEconomic theory is often verified by observing methods, usually in reviewing economic data through measuring economics [87]. Generally, a common closure experiment is difficult to achieve and rare in economics [88], and therefore, economists often depend on the way they are in a way to test their theory, although this observation of the results of the experiment There is no need to be accurate, it is more likely to be questioned. Despite this, experimental economics is a gradually growing area, and the observations of existing models are also increasing.\n\nStatistical research methods, such as regression analysis, is also common, and users use this method to estimate scale, economic importance, and statistical properties, thereby proposing hypothesis, and controlling the impact. Through this practice, a hypothesis may therefore be supported, although its accuracy is still just the price, rather than absolute, judging the standardization of the study relies on its cashibility and deals. Due to the uncertainty of the experimental results, these observations do not have to make decisive conclusions on their research issues, and even do not necessarily propose major discovery. In the field of practical economics, the research on the output of the output - output model is quite common. In order to study some of the impact on certain policies, economists often pay a large amount of data to computer statistical analysis.\n\nProfessional peer reviews and regeneration of the results can further ensure that observation experiments do not produce prejudice, wrong, or light outline results [84] [89], although many economics are often criticized Unable to rebirth of the results [90]. As purely theory, the use of statistical experiments will also be critical analysis [91], despite this, in the past 40 years, the article is simply declared in the judgment of other research results, which is considered to be The journal attempt to increase its quantity of its reference [92].\n\nExperimental economics also created many studies with closed control experiments. Direct testing is generally regarded as some economics theory of truth, which will shrink traditional economics and natural sciences [93], for example, final The experimental results of the Tongkai competition confirmed that people will refuse to accept unequal allocation.\n\nIn behavioral economics [3], psychologist Daniel Kanaman with Amos Tvoski won the 2002 Nobel Economics Award in 2002 for the discovery of outlook theory and cognitive deviation, in the nerve The economic observation experiment has also confirmed the similar results. Another example is a model of traditional private preferences and a model that can test selfish, beneficial him, and cooperation. [94]. The progress of these research has made some people advocate that economics is also part of \"real science\" [12]\n\nSpecialization in this area of ​​economics reflects the growth of research institutes in this field, and is called \"significant changes in economics from 1900\" [95]. Most of the major universities and colleges have a specialized economic institution and awarded an economics, whether in terms of general education, commercial or other fields, economics courses are often a compulsory course.\n\nThe Nobel Economics Award will be awarded an economist who has a significant contribution to this field according to its expert review. In private companies, economists usually serve as the role of consultants, especially in banking and financial industries. Economists also serve many government departments, such as Treasury, Central Bank, and Statistical organizations.\n\nEconomics is a social science, but also affects academic development in many other fields, such as economic geography, economic history, public choice theory, family economics, and institutional economics.\n\nLegal economics is a way of cutting research law in an economic theory, including the economic impact of economic interpretation law, researching legal help or harmful in economic benefits, and forecasting future economic laws [96]. Ronald Kos advocated in the 1961 article, and the good protection of property rights can overcome the externalities of the market [97].\n\nPolitical economics is a research on economics, law, and political science, targeting interactions between political systems, political environment, and economic systems (such as capitalism or socialism). Political economics research includes the relationship between monopoly and hunting behaviors and externality and government policies [98]. Historians sometimes use the word of political economics to describe how the individual or group of individual or groups in history use political means to achieve benefits [99].\n\nThe sociological branch of economics also develops through economic sociology, mainly in the works of Emier Tulkhe, Max Weber, Glorue Qimier, etc. to analyze economic development and economic phenomena. Influence of social tradition [100]. Important works include Max Weber's \"New Education Ethics and Capitalist Spirit\", \"Monetary Philosophy\" of Georg Qimier.\n\nFor the early study of economics, you can trace back to Meso Namia, ancient Greece, ancient Rome, China, Persia, and Arab civilization. The famous scholar before the 14th century includes Aristotle, Ciwina, Toma Aquarium, Iben Heletown and others. He is inspired by Aristotle, and Aquina has many contributions to their postgraduates 14 to 17th centuries [101] [102], the Salamanca school sent by the philosophy of the hospital has also become the first at the end of the medieval There is a systematic study of economics, interest, and value theory and other economic laws issued by natural law.\n\nAfter the revival of literature, the development of economics began to be dominated by the nationalism and heavy agriculturalism. These two schools have a considerable picture of the development of European economic nationalism and modern capitalism. ring. The Qualistism is prevalent between some businessmen and politicians in the 16th to 18th century. The wealth of a country is relying on cumulative gold and silver, and there is no natural gold ore silver mine can only rely on export products and limit imports. The goods outside the gold are accumulated to accumulate wealth. The businessism advocates the import of cheap original resources to produce goods to produce exports, and targeting competition from foreign products is prevented [103].\n\nHeavy agriculturalism is a group of 18th-century French thinkers, and believes that economies is a circle of income and output constant cycles. They advocate that only agricultural production can produce more cost-effective, and therefore agriculture is all industries. The foundation. They oppose the emphasis on manufacturing and exports and ignore agriculture. Heavy agriculturalists and advocated the elimination of a large cost tax collection system, replacing the landlord's income tax. Compared to the legalism, heavy workers support the policies that are free to let go, and they believe that the government should not intervene in the economy [104].\n\nAdam Smith (1723-1790) is considered to be the beginning of modern economics [105], he has proposed many criticisms in the current businessism, and thinks that he is \"not perfect\", but it is still more close to the economy. School of the truth [106].\n\nAdam Smith is considered \"The starting point of the birth of economics\" [107], this book is deemed to be the three major people to produce land, labor, and capital Elements and the source of producing a country of wealth, and abandoning the theory of heavy agriculturalism that only agricultural activities have productivity.\n\nSchmi discusses the benefits of the division of labor, including the rise of labor production, trade benefits, whether there is a country or urban, or between different countries [108]. His theory believes that the degree of division of labor is determined by the market's needs, which has become the main theoretical source of future generations for companies and industrial organizations [109]. Adam Smith made a wide range of ideas of economic propositions: which is under competition, the holders of resources (whether labor, land, or capital) seek maximum interests, so Equilibrium The holder of all the same resource will obtain the same reward (excluding unemployment) [110].\n\nSthi believes that all of them use any of their capital to increase their own profits and benefits rather than \"society\". [111], this is later called \"Economics the most important paragraph\" [ 112]. Schi and advocate that the motivation of individuals seeking profits is indispensable in the production process, and the profits they receive represent the value they produce [113]. He said this:\n\nTherefore, since each individual will try our capital to support and manage the domestic industry, the production of these industries can achieve the greatest value; each individual must have tried to expand the annual income of society. Indeed, he usually does not plan to promote public interests, and do not know what extent he has promoted this benefit. Because I would rather support the domestic industry and the industry outside the country, he is just a safe safety; his management industry is to maximize the value of its production, and he is just his own interests. In these common situations, he also promoted the goal of his original unintentional. It is not a self-intention that does not mean that society is harmful. By pursuing his personal interests, he often promotes the interests of this society more effectively, and beyond his original expectations. I have never heard of how much good things are achieved by those who have encountered their public interests and intervention trade. [114]\nThe concept of invisible hand proposed by Adam Smith has a close relationship with his emphasis on economic development and economic growth [115]. He believes that economic growth makes the public can carry more more valuable consumption. He is in its mind is \"the only purpose of all production\" [116] [117]. Schmi and with the invisible hand commented on many economics, including the government's restrictions on competition, trade [118], and bank and interest [119], and put forward that he believes is \"the established system\" including \"freedom\" National defense, fair judicial system, some public works that can benefit full society and provide education [120], roads, dams, etc. [121] [122]. Modern economics textbooks often use Adam Smith to explain the most basic concepts of interpretation of economics [123].\n\nTime-Time Thomas Marstes uses remuneration to explain the level of life. He predicts that the human population will increase in geometric methods, but food production will only gradually increase, so that limited land will lead to an increased population labor capacity Reduce the decline, so there will be excessive population that has returned to the living standard [124]. Malthus and questioned the adjustment performance of the market economy, the criticism itself is unable to reach complete employment, and the economy tends to override the excessive deposit, which is lanted later by Cairns.\n\nAdam Smith pays attention to the production of wealth, while David Li Jiatu pays attention to the distribution of income. Li Jia Tu believes that there will be conflict between landlords and capital and labor. He advocates that the limited land will definitely rose, so that the benefits of capital have been reduced, and the wages of the labor. Li Jiatu is the first economist who proposed a comparative advantage. According to this theory, regardless of whether a country is better or behind, the difference in the production costs of the marginal production can be obtained from the international trade. Lee [125]. Comparison to today has been considered by economists to explain the most basic framework of the trade benefits [126].\n\nAt the end of classical economics, some people have begun to question their assumptions, such as John Stewart Mille proposes the issue of market allocation income, and he believes that the market plays two major roles: resource allocation and income distribution. He believes that the market may be the most effective in allocation resources, but it is not necessarily the best allocation income, so the need for social intervention [127].\n\nValue theory is an important part of classical economics. Adam Sterme is often considered to propose a product of a product's exchange value is a person determined by its labor. However, Schi is actually reserved in this regard, such as he said: \" The true value of all things depends on the difficulty of achieving such things. \"Schth believes that the factor other than salary also affects the price of the product [128]. Despite this, many classical economists have begun to propose labor value theory based on St., advocate labor being the main or unique sources of value.\n\nMarxist economics is derived from classical economics, Carl Marx proposes the basic model of its theory. Marx published a book of \"Capital On\" in 1867, based on labor value theory, advocating capitalism production model inevitably produces residual value, which is the exploitation of labor [129]. According to the theory of labor value, the value of a product is determined by the social labor necessary in the production process, and the residual value theory advocates labor salary only constitutes the labor price in the product price, that is, the part of the labor force re-produced, from then on It is considered to have exploitation.\n\nFrom 1870 to 1910, a series of economists began to challenge the assumptions of classical economics, and the transformation of this series was later referred to as \"marginal revolution\" [130]. William Stanley, England, Karl Menger and Switzerland of O'Lon Vallas, respectively, maritimism denying the labor value theory of classical economics, and believes that the value is marginal Utility rather than labor decisions. Marginalism not only solves the diamond and water paradise of classical economics, but also promotes the subjective value of the skeleton of modern neoclassical economics.\n\nThe marginal revolution at the end of the 19th century is a big watershed in economics. Classical economics attach importance to the causal relationship between social activities, such as the production and distribution of wealth, and the distribution structure of different political economies by political economics. With the proposal of marginal utility, the research path of production and transaction is separated from social theory (such as Marxism), and towards \"pure observation and proposing the false saying\" research path. This change enables economics to deviate from the regulatory economics affected by value judgment, from the previous social economy \"what should be\", what is the \"what\" is \"what\", what is the \"what\", which is not very clear, and political Learning [131].\n\nKeynesian economics developed the book of \"employment, interest and monetary theory\" published by John Menard Kase, established an independent field of overall economics [132]. Cairns studied many factors affecting total revenue and production in this book (before, long-term economic balance reaching), he believes that height unemployment may not be adjusted by the market lack of effective demand, and advocates to increase the total Demand, the government should overcome this situation through expansion of fiscal policies. In the environment where economic panic is in the event, Cairns's theory has a significant impact on economics (133].\n\nOver time, two branches appeared in the Cairns school. After the Keynes school pays attention to the development of the elastic lack of the overall economics and the adjustment process, and in the individual economics, in the actual world's observation example, it is used as a research foundation, rather than the model that maximizes the benefits. The main figure of the school has Joan Robinson et al. [134].\n\nThe emerging Cairns school is also derived from the original Cairnsian. This genre agrees that other economists use interest to maximize the model of individual economics, but propose the theory of price and wage stickiness to update the original Cairnsism. Although their support for the original framework has changed to emphasizing its continuous characteristics, not to persist in the essence of its existence.\n\nThe marginal revolution brigted the new classic economics that dominates contemporary mainstream economics, Alfred Marshall put forward the term \"economics\" to describe the research on \"economic science\" to control the previous political economy. This transformation is as influence on the mathematical model at the time [135]. Neoclassical economics will supply and demand as a model for the analysis of the price and supply quantity of the market, and the distribution of output and income. Compared to classical economics, neoclassical attention is the marginal demand of the market [136]. In the 20th century, neoclassical economics stayed away from classical economics as a base as a base as an individual, and the social summary interest [36] [137].\n\nIn individual economics, neoclassicism believes that motivation and opportunity costs constitute the most important benchmarks of decision-making, one is how consumers' theoretical prices (that are, cost) and how income affect demand [36]. In the overall economics, the neoclassical synthesis of Keynesian has become the mainstream of today's overall economics [67] [138].\n\nNeoclassical economics is often referred to as \"orthodox economics\". Most of the modern mainstream economics textbooks are based on new classicism. Although there are also changes in many ways or pay attention to different areas, such as metrody economics, competition The theory of bureau, analyzing the market failure and incomplete competition.\n\nThe stagnation inflation in the 1970s directly challenges the basic hypothesis of Keynesian. According to the Phillips curve, Keynesian believes that inflation makes the price increase, thereby driving the industry to hire more labor to increase capacity, while higher employment will drive demand. However, in 1970 to 1980, there was an inflation and high unemployment rate at the same time, which made the originally dominated overall economics of Cairnsism to be questioned.\n\nIn this context, the Chicago economics and their derived monetism began challenge Cairnsian. According to the Milton Fourman and others of the school, the market economy can adjust the supply and demand in the currency supply. (I.e., there is no excessive expansion or tightening). Based on this theory, the government's role is the number of currencies circulating in economies through central banks. In addition, there is no need to intervene in the free market. The Chicago School and the rational expected theory raised by Little Robert Lucas have greatly replaced the dominance of Keynesian in overall economics. Former US Federal Preparation Council Chairman Bernanke is one of the economists who support Fourman's interpretation of boom [139]. Contemporary mainstream economics were often divided into a freshwater school representative of the University of East coast and the West Coast University and Chicago and other mainlandiars.\n\nMilton Fugerman basically adopted many Adam Smith and other classical economists to make an individual economics concept and will modernize. For example, in 1970, he advocated a company's social responsibility to \"in the free market.\" Under the competition, strive to take advantage of the existing resources to maximize profits, \"[140], this statement and Adam Smith believe that the market can best reach the general interests of society through private interests.\n\nSome economics and research methods other than mainstream economics have also have a significant and continuous impact on economics, such as Austrian economics, Lausanne, post-Cairns school, Stockholm Miscino, etc. The Austrian economics that develops parallel with neoclassical economics is the important humanity of Karl Menger, which is derived from the edge of the world, and many of its research frameworks are also highly overlap with mainstream economics [141].\nThere is a significant discussion in overall economics, and the self-propelled parties also include such as emerging classical economics and supply faculty. In addition, some comparisons are not discussed by mainstream economics include ecological economics, institutional economics, evolutionary economics, dependence, etc.\n\nThe 19th Century Victorian Historians Thomas Carlas Zengrai said economics as \"melancholy science\". Some economists, such as John Stewart Milt, Lyon Varlas, believe that the study of economics should not be mixed with their output, and they believe that the \"socioeconomics\" involved in the latter is the field of political science. [16] [142].\n\nIn the book of \"Guifu\", Adam Smith vigorously slammed the individual or group he believed to be political power to affect the market operation, and these people are often referred to as \"faction\" in Schi, today is today. We are well known, such as political parties, banks, companies, unions, and so on. As part of social science, economics research should be independent of government policy or other decision-making groups, however, policy makers and political figures often use special economic theory or phrase to justify their political agenda. Many times often departure from the responsible field of their public office [143]. Economics theory is often used as criticism and criticism in practice, critics often mixed economics as a role in an academic field or a particular topic or values ​​[144]. Despite this, economics has an influential in the formation of government economic policies, and to some extent it is Branch of political economy. Many academic journals often explore the consensus or mainstream position between economic scholars, hoping to increase the role of professional opinions in political decision-making. In fact, today's mainstream economics circles and some views of political discussions tend to hold a distinct position. For example, trade protectionism is generally circulating between public opinion and politicians, but economists think Free trade is the way to enhance the overall benefits of society [145]\n[146]. According to the survey of the US Economic Society, the topics that have reached a clear consensus between American economists include supporting free trade, supporting large chain stores such as Wal-Mart, opposing the government to enforce employers to provide labor health insurance, allow commercial organs to transfer, open casino , Opposing subsidy biofuels, etc. [147].\n\nOther issues such as the independent operation of the central bank and the government's practices in fiscal policy and monetary policy in central banks [148], and even the overall economics, often controversial focus and sources for mainstream economics criticism [149]. Some scholars, for example, DEIRDRE MCCLOSKey, proposing many economic empirical research through data observations in methods or results [150], this criticism has received a lot of attention in economics, but there are some dependencies. Abandoning an empirical observation as an economic scholar and school of research methods, such as the Austrian economics, an example of [151].\n\nSome people blame economists to accurately predict future economic-treated or economic crisis, for example, in 2007, the global financial crisis triggered many people to criticize mainstream economics textbooks and reality [143]. The International Monetary Fund has published their prediction of a group of economists in 2002, and proposes 97% of economists who have been investigated in the 1990, there is no successful prediction of economic tightening in the next year, and even The predicted person has often underestimated the severity of tightening [152].\n\nEconomics has long been questioned to be questioned to rely on unreal, or if it is unacceptable, or the excessive hypothesis is the theoretical basis, and the question is advocating this simplified process to exempt the economist to provide evidence to mention. The hypothesis often questioned, for example, profit maximization, rational choice, etc. [153] [154]. However, information economics includes behavioral research and behavioral economics to study individuals in this area [155]. Other mainstream economists, for example, Keynes [156] also observed that most of the economic sectors were established through concepts and non-data evidence, and they could not be verified as other natural sciences.\n\nIn recent years, femaleists who criticize new classic economics have also begun to emerge and have prompted the birth of women 's economics [157]. Feministian economics criticize economics generally for empirical and objective assumptions, it is believed that existing models and methods only reflect the preference of male society. The criticized criticism of female vocational economics includes economics ignoring homemaster's family-friendly, family economics and balance of payments [158].\n\nSome scientists from the physical perspective criticize economics, depending on the 19th-century physics hypothesis, such as Niklas Georgescu-Roa (English: Nicholas Georgescu-Roegen) raised the energy economy from thermodynamics Study on entropy theory to distinguish he believes that mainstream economics is based on the theoretical framework constructed in Newton physics. His theory has considerable impact on thermal economics and ecological economics [159].\n\nSome people, for example, Naxim Niclas Tarpeber criticize economics theoretical way, and believe that economic excessive relying on the model research model of Berram, and advocates the result of economic theory errors may cause huge Disaster [160] [161], he questioned many existing economic models with randomness and uncertainty. However, like other criticisms, not all economists rely on the model and assumptions of new classical economics. Some economists also faced the issues raised by Tarreb, such as the Nobelian Economic Award winner Daniel Calneman acclaimed the theory of Toreber [162]. Although the existence of these criticisms, the mainstream economics research institute has developed more and more technological and mathematical research methods [163] [164]. "}