{"chinese_title": "constellation ", "chinese": "Environmental Sciences are specialized in interdisciplinary fields, including both physical, chemical, biological, geological, geographical, resource technology, engineering, also contains social management and protection, demographics, economics, political, and ethics. science. Environmental Science includes disciplines affecting human and other organisms. Nature and human resources are interdependent, and any of the actions, correct or errors made by one party will affect the other side. This discipline was shorter until the 1960s became a formal discipline. In 1960, Rachael Carson has a midburns of ecological book \"Silent Spring\", which makes the theme of the environment becomes hotspots, just like 1969 in the Well-spray oil accident in St. Barbara beach in California, California, and the same year in Ohio. The Kayoa River in Cleveland, which enables the public to rise to the environmental movement, thereby creating the new discipline of the environment. Environmental Sciences until 1960 and 1970, the main reasons extensively active from scientific research are:\n\nDefinition of Environmental Science: One study of interaction between human social development activities and environmental evolution laws, seeking science of human society and environmental synergy, sustainable development pathways and methods.\n\nIn macro, environmental science should study the interaction between people and the environment, to conflue with each other, and strive to discover the law between social and economic development and environmental protection; in micro, it is necessary to study the substance in the environment in organic body The process of migration, transformation, accumulation, and its motion law, the impact of life, and the mechanism of action, especially the pollutants discharged from human activities.\n\nEnvironmental Sciences should explore environmental evolution laws in the world; the relationship between human activities and natural ecology; environmental changes affect human survival; and regional environmental pollution control technology and management measures.\n\nAtmospheric science mainly studies the atmosphere of the Earth, especially the interrelationship between it and other systems. Atmospheric science includes gas diffusion patterns related to meteorology, greenhouse gas, air pollutants [1] [2], and the sound phenomenon related to noise pollution, and even photolorestation.\n\nTaking global warming as an example, the physicist established a computer model of atmospheric circulation and infrared wireless transmission, and chemists have studied chemicals and chemical reactions in the atmosphere. The biologists analyze the changes of carbon dioxide in animals. Active role, some experts such as meteorologists and marineologists deepen their understanding of atmospheric motivation.\n\nEarth science includes environmental geology, soil environmental science (English: Environmental soil science), volcanic phenomenon and crustal evolution. Environmental science in some classification systems also includes hydrazine (including oceanics).\n\nCareful analysis of the cause of the surface runoff by soil scientists as a research example of soil erosion. River biologists assisted in studying the loss of sedimentation of continental water. The physicist will contribute to the change of the transmission of the water transmitted by assessing the transmission of water. Biologists will analyze the follow-up effects of water plants and animals as water.\n\nEnvironmental Chemistry is a chemical research branch of environmental science, and its theoretical research sector includes soil pollution and water pollution. Analysis Themes include degradation of chemicals in the soil, migration in different stages, for example, after the solvent is evaporated, the solvent diffuses in air, which will become air pollutants. In addition, chemicals also affect bioqual.\n\nFor example, a leakage chemical solvent tank falls into a soil that is inhabitially inhabitially perched on an endangered amphibious animal. If you want to obtain the degree of pollution of this soil and the distribution of the solvent in the soil, a computer model method can be used. The chemist can describe the molecular structure of the chemical solvent according to the measured soil type, and biologists can investigate the effects of chemical solvents to other organisms, including soil arthrics, plants, and pond creatures as such endangered amphibians.\n\nEcology refers to the analysis of environmental science knowledge in related fields, and the ecosystem is not affected by not only a stress. For example, water pollution and air pollution caused by highly respected industrial development will affect certain species of the seaport, and ecology can be used to detect these changes. According to this study, biologists will be able to describe the animal and plant groups in detail. How to study how the chemical of the pollutant flows through the swamp, physicists can predict the airborne contamination, and geographicists can help us understand the swamp soil and Bay's mud.\n\n\n\nIn 1969, the National Environmental Policy Law (National Environmental Protection Bureau) put forward specific requirements for the environment of major projects. Most local regulations agree with these instructions, these instructions apply to local activities. The result is a significant increase in the study of literature and environmental influence prior to operation.\n\nTo read the environmental impact assessment cases listed in the National Environmental Policy Law, we can verify the specific content of the environmental science. For example, after the wastewater treatment is upgraded, choose to discharge to San Diego or refurbishment, San Francisco International Airport, Houston underground transportation system Development, the upgrades of the Metro Boston Transportation Police Bureau transportation system and 66 intercontinental buildings through Virginia Arlington Cemetery.\n\nEngland and Wales' Environmental Protection Agency [3] (with the predecessor of the agent) were established in 1996, which belongs to public agencies that protect and improve the environment, and put regulations in local communities and government websites [4].\n\nAccording to the 1995 Environmental Protection, the Environmental Protection Agency was founded as an independent institution, and cooperated with the British government to implement environmental protection regulations.\n\nEnvironmental scientists monitor environmental quality, explain human activities on terrestrial ecosystems and aquatic ecosystems, and develop strategies to restore ecosystems. In addition, environmental scientists also help plan, develop, build buildings, transportation channels, and facilities protecting water resources, considering efficient and beneficial land use planning. Due to the nature of environmental science interdisciplinary, professional team usually cooperates to conduct environmental research or publishing environmental impact assessments. There are also some professional organizations to coordinate launching environmental science research and helping links between different subjects. Environmental Sciences are specialized in interdisciplinary fields, including both physical, chemical, biological, geological, geographical, resource technology, engineering, also contains social management and protection, demographics, economics, political, and ethics. science. Environmental Science includes disciplines affecting human and other organisms. Nature and human resources are interdependent, and any of the actions, correct or errors made by one party will affect the other side. This discipline was shorter until the 1960s became a formal discipline. In 1960, Rachael Carson has a midburns of ecological book \"Silent Spring\", which makes the theme of the environment becomes hotspots, just like 1969 in the Well-spray oil accident in St. Barbara beach in California, California, and the same year in Ohio. The Kayoa River in Cleveland, which enables the public to rise to the environmental movement, thereby creating the new discipline of the environment. Environmental Sciences until 1960 and 1970, the main reasons extensively active from scientific research are:\n\nDefinition of Environmental Science: One study of interaction between human social development activities and environmental evolution laws, seeking science of human society and environmental synergy, sustainable development pathways and methods.\n\nIn macro, environmental science should study the interaction between people and the environment, to conflue with each other, and strive to discover the law between social and economic development and environmental protection; in micro, it is necessary to study the substance in the environment in organic body The process of migration, transformation, accumulation, and its motion law, the impact of life, and the mechanism of action, especially the pollutants discharged from human activities.\n\nEnvironmental Sciences should explore environmental evolution laws in the world; the relationship between human activities and natural ecology; environmental changes affect human survival; and regional environmental pollution control technology and management measures.\n\nAtmospheric science mainly studies the atmosphere of the Earth, especially the interrelationship between it and other systems. Atmospheric science includes gas diffusion patterns related to meteorology, greenhouse gas, air pollutants [1] [2], and the sound phenomenon related to noise pollution, and even photolorestation.\n\nTaking global warming as an example, the physicist established a computer model of atmospheric circulation and infrared wireless transmission, and chemists have studied chemicals and chemical reactions in the atmosphere. The biologists analyze the changes of carbon dioxide in animals. Active role, some experts such as meteorologists and marineologists deepen their understanding of atmospheric motivation.\n\nEarth science includes environmental geology, soil environmental science (English: Environmental soil science), volcanic phenomenon and crustal evolution. Environmental science in some classification systems also includes hydrazine (including oceanics).\n\nCareful analysis of the cause of the surface runoff by soil scientists as a research example of soil erosion. River biologists assisted in studying the loss of sedimentation of continental water. The physicist will contribute to the change of the transmission of the water transmitted by assessing the transmission of water. Biologists will analyze the follow-up effects of water plants and animals as water.\n\nEnvironmental Chemistry is a chemical research branch of environmental science, and its theoretical research sector includes soil pollution and water pollution. Analysis Themes include degradation of chemicals in the soil, migration in different stages, for example, after the solvent is evaporated, the solvent diffuses in air, which will become air pollutants. In addition, chemicals also affect bioqual.\n\nFor example, a leakage chemical solvent tank falls into a soil that is inhabitially inhabitially perched on an endangered amphibious animal. If you want to obtain the degree of pollution of this soil and the distribution of the solvent in the soil, a computer model method can be used. The chemist can describe the molecular structure of the chemical solvent according to the measured soil type, and biologists can investigate the effects of chemical solvents to other organisms, including soil arthrics, plants, and pond creatures as such endangered amphibians.\n\nEcology refers to the analysis of environmental science knowledge in related fields, and the ecosystem is not affected by not only a stress. For example, water pollution and air pollution caused by highly respected industrial development will affect certain species of the seaport, and ecology can be used to detect these changes. According to this study, biologists will be able to describe the animal and plant groups in detail. How to study how the chemical of the pollutant flows through the swamp, physicists can predict the airborne contamination, and geographicists can help us understand the swamp soil and Bay's mud.\n\n\n\nIn 1969, the National Environmental Policy Law (National Environmental Protection Bureau) put forward specific requirements for the environment of major projects. Most local regulations agree with these instructions, these instructions apply to local activities. The result is a significant increase in the study of literature and environmental influence prior to operation.\n\nTo read the environmental impact assessment cases listed in the National Environmental Policy Law, we can verify the specific content of the environmental science. For example, after the wastewater treatment is upgraded, choose to discharge to San Diego or refurbishment, San Francisco International Airport, Houston underground transportation system Development, the upgrades of the Metro Boston Transportation Police Bureau transportation system and 66 intercontinental buildings through Virginia Arlington Cemetery.\n\nEngland and Wales' Environmental Protection Agency [3] (with the predecessor of the agent) were established in 1996, which belongs to public agencies that protect and improve the environment, and put regulations in local communities and government websites [4].\n\nAccording to the 1995 Environmental Protection, the Environmental Protection Agency was founded as an independent institution, and cooperated with the British government to implement environmental protection regulations.\n\nEnvironmental scientists monitor environmental quality, explain human activities on terrestrial ecosystems and aquatic ecosystems, and develop strategies to restore ecosystems. In addition, environmental scientists also help plan, develop, build buildings, transportation channels, and facilities protecting water resources, considering efficient and beneficial land use planning. Due to the nature of environmental science interdisciplinary, professional team usually cooperates to conduct environmental research or publishing environmental impact assessments. There are also some professional organizations to coordinate launching environmental science research and helping links between different subjects. "}