{"chinese_title": "history ", "chinese": "History (Modern Chinese Vocabulary, Classical Classical Chinese Wen), refers to the incidents and actions of human society, and the record, interpretation and research of these incident behavior [2]. History can provide today's understanding of the reference basis for the future act, and the important results of ethics, philosophy and art assignee spiritual civilization. The second meaning of history, that is, the record and research of past events, also known as historics, or \"historical\". Subject to historical or closely related disciplines have an era, editors, family spectrum, and ancient text , Metrody history, archeology, sociology and journalism, see History [3]. Record and research history people called historians, referred to as \"historians\", China is called Histori, the book is called history For historical books, such as \"Historical Record\", \"Han Shu\", etc., the rough points is \"official repair\" and \"private\".\n\nGeneralized history, generally refers to the development process of all things, including natural history and social history [4]: ​​380. Not necessarily contact with human society. In philosophy, this meaning is called historical objects, such as universe history, earth history, world history, Chinese history, etc. Usually only the development process of human society, it is an object of history research; generally, the description and interpretation of history, also known as history [4]: ​​380. The narrow history must be based on the text record, that is, the history of the text has become history, and the previous history is called the prehistoric history. It can also be called human history or social history, and the past events from human society are called natural history. Generally speaking, history is only studying the former, ie social history [2].\n\nThe meaning of \"History\" was first represented by the word \"history\" in Chinese. \"History\" in Oracle is similar to \"things\", refers to incident. Xu Shen, \"Said Words\", said: \"History, Notepad; from the middle, medium, and is also.\" The intention of \"history\" is the intention of the note. Near Jin Jingyun said: \"The archives of the deposit, the people of the people, the history of the people, a referral, a finger.\", From this, the representative is recorded by the host, in other words, That is, all the written things of the text record. Study of the history of the research, called history.\n\nThe word \"history\" appeared later, in the Note in \"Three Kingdoms\", the first time I mentioned the word two words [5] [6]. This noun mentioned in \"South Qi Shu\" is the meaning of history books [7]. Ming Dynasty Jiajing Years Li Ting Machine and Ye Ji Gao edit \"Historical Economics Tong Jian\", is the first book named in China, Yuan's \"historical outline tongue\", explaining history is Refers to history, that is, the meaning of history books [8].\n\nIn 1895, the ceremony of the ceremony was played in the style of the chapter, mentioned the noun of history, as a historical event [9]. In 1896, Piwi Rui \"The Academic History\" published, the history of history, also clearly positioned it as a historical event [10]. Therefore, before and after the 18990, the noun in China began to be clear as a historical event in China.\n\nAfter the Meiji Remnant, Japanese scholars translated English: History, translated into history, making it corresponding to the corresponding words. In the 1870s became a pop.\n\nIn 1902, the Emperor Guangxu received Zhang Baixi, and issued the \"Qin Ding School of Association\", which is a history, and two items. After Zhang Baixi, Wu Xiun went to Japan to study education, 1903, Zhang Baixi, Zhang Zhidong, who was responsible for education reform, and Rongqing recommended to redeem the school stages [11]. After re-redefining the charter, it is regulating the primary elementary school in Japan, and the history, the second sect, renamed history and geography. After that, the noun in history is popular in China.\n\nIn Europe, America, the \"history\" of most languages ​​from ancient Greek: ἱστρρία (Historia), originally \"survey, exploration, knowledge\", ancient Greek writer Histeoria (Historia) Name.\n\nThere are many different interpretations for historical meanings and nature, and below is listed below.\n\nHistory is not classified in humanities, but the bridge between them, combined with research methods in two major areas. Generally speaking, historians are trying to answer questions and historical issues by studying various written characters but are not limited to this. The original information of historical knowledge is divided into three types: text records, orally circulated, reserved historical sites, usually historical people will comprehensively study, and text records are often used as emphasis because it is generally recorded The time of development. This emphasis revealed a new field, prehistoric history, can also be called prehistoric studies, and research is a period without a written record. Since the time of text appears in the world is different, the main difference between history and history is determined according to the specific topics. Scholars are divided into different phases based on the range of human beings in the past. There are many ways to divide the past, including classification, classified according to cultural customs, classified according to different topics. These three classifications often have overlap, such as \"the evolution of Argentine's labor movement, 1930-1945\".\n\nAlthough historical research tends to some special locations, time and themes, historians also care about other ordinary content. For others, history has become a very ordinary word, which is to study all the things in human beings, and even a so-called general history now. The past research history is for the purpose of application or theory, and now there is still a few: That is curious about human past.\n\nHistorians are writing in their own era, and consider how current explains the mainstream thoughts of past, sometimes writing experience for their own society.\nIn the words of Benado Croati, \"all history are contemporary history.\"\n\nBy describing and analyzing past events related to humans, the history development is promoted by forming \"past real words\". [19] Historical modern related discipline is committed to institutionalized production of this discussion. All events in a certain real form of memory constitute a history. [20] The task of history is to identify the most useful information source to make an accurate description of the past. Therefore, the composition of historian files is to limit the more common files by making certain text and documentation (by counterfeiting them to represent \"real past\"). One of the roles of historians is ingenious, objectively utilizing a large amount of information, which is usually found in the file. Creating a narrative process inevitably produces silence, because historians will remember or emphasize different events in the past.\n\nHistorical research is sometimes classified as part of humanities, sometimes being partned as part of social science. It can also be seen as a bridge between the two areas, combined with the methodology of both. Some individual historians strongly support one of them. [twenty one]\n\nIn the 20th century, French historian Fernan Brorsel made a revolutionary change in history by using external disciplines such as economics, anthropology and geography. Traditionally, historians record past events in writing or by oral tradition, and try to answer historical issues by studying written documents and oral statements. From the beginning, historians have used information such as monuments, inscriptions, and pictures. But writing is a sign of distinguishing history and past.\n\nArchaeological is a discipline that helps to deal with buried sites and objects. Once these sites and objects are unearthed, they will help history. But archeology rarely exists. It uses narrative to supplement its discovery. However, archaeological is made up of a series of historical methods and pathways. That is to say, archaeological is not \"filling blank\" in text data. In fact, \"Historical Archeology\" is a specific branch of archeology, often comparing its conclusions to contemporary documents. For example, Mark Lyon (English: Mark P. Leone), US history excavator and interpreters have tried to understand the contradiction between text documents and material records, although there is a \"free\" ideology in written documents, but By studying the entire historical environment, it has proved that the inequality of slave owners and the unequal phenomenon of wealth still exists.\n\nHistoric organizational methods have a variety of, including sequential, cultural, and regional, and according to topics. These divisions are not mutually exclusive and often there is an important intersection. Although modern trends have tended to be specialized, historians may pay attention to very specific and very universal issues. It is known as the field of high history to resist this specialization and look for universal patterns or trends. Historical research is usually for some practical or theories, but it may also be studied for simple curware.\n\nWorld History is the sum of human past experience around the world, and these experiences are mainly stored by words. Relatively speaking, prehistoric refers to the generation of human beings in a region, but there is no era of text. By studying the paintings, sketches, engraving or other workpieces at the time, some information can be obtained without text records. Since the 20th century, researchers began to pay attention to prehistoric research, so as not to eliminate some specific civilizations, such as Saharan Africa and the former Columbus. The historians in the West are not proportional to the proportion of focus on the Western world [22]. In 1961, the British historian Edward Horrete Carl believed:\n.mw-parser-output .templatequote {margin-top: 0; overflow: hidden} .mw-parser-output .templatequote .templatequotecite {line-height: 1em; text-align: left; padding-left: 2em; margin- Top: 0} .mw-parser-output .templatequote .TemplateQuotecite cite {font-size: small}\n\nWhen historical and prehistoric boundary lines, people will no longer live in the present and have interested in their past and future. History begins inheritance, and traditional representatives bring past habits and lessons to the future. The history of past is because in order to benefit future generations [23].\nThe history of this definition includes some of the people who have no text records at that time, but the history of a strong interest in history, like the Maori of Australia and New Zealand, which is in contact with European, although there is no text record, but use the oral pass Historical ways will pass history to the next generation.\n\nA learning, history, or histori, is also known as a history of history, and historical representatives. The essence of historical is actually converting the actual events into historical processes and methods that exist in the form of ideas and text. Discussion on the purpose and method of historical learning, in the west belong to the scope of historical philosophy, the emergence and development of historical philosophy means that history has become a historical interpretation and the exploration phase of historical law. At first, historical philosophy is only concerned about how to improve historical research, but it is considered that the history of research and record is true history. Under the influence of New Kantism and New Hegel, people have a re-understanding process, and philosophers have begun to redefine historical students. Italian philosopher Croati proposed the proposition of \"all true history is a contemporary history\", thinking that the past only played a role in the life of contemporary people, otherwise it is \"dead history\", namely the history. Therefore, the same history will be rewritten during different periods. The British philosopher Collin Wude further believes that \"all history is the history of thought\", that is, history is the reflection of historian thinking, not only vary from era, but also varies from person to person. The historical view of materialism believes that historical events are objective, history is the subjective history of historical history. Due to the subjective limitations of people, the understanding of objective historical events is limited, and subjective understanding cannot be fully equally objective, so there is only the process of continuous improvement, this process is consistent with natural science. This historical is called \"historical science\".\n\nHistorical Compilation (English: Historiography) has many related meanings. First, it can refer to the way history: historical methods and the story of practice (for example, from short-term biography narrative analysis). Second, it can refer to what produced: specific historical works (for example, the medieval history of the 1960s \"refers to the\" Medieval Historical Works in the 1960s). Third, it can refer to the cause of history: historical philosophy. As the element analysis of the past, the third concept can be related to the first two concepts, because the analysis is usually concentrated, explaining the use of world view and evidence or other historian statement. Professional historians also argue whether to teach history as a coherent narrative or a series of mutual competition.\n[24] [25]\n\nHistorians use the following questions in modern work.\n\nThe first four are called historical criticism; the fifth is called text criticism; and external criticism. \"The Sixth and the Last Inquiry\" on the source of the source is called internal criticism.\n\nHistoriological methods include historical technicians to study and write historical technologies and guides using first-hand data and other evidence.\n\nHarry Nasus's Horodod (484 BC 425) [26] is commonly known as \"the father of history\". However, people think that with his concuident Xiki Dece (about 460 - 400 years), with his work \"Belopeon History\" has become the first person to study history with complete historical methods. Different from the Germany and Horodod, thinking that history is the product of human choice and action, and focusing on causal relationship, rather than thinking that history is the result of sacred intervention (although Horodod is not fully committed to this idea) ). [26] In his historical approach, Xirito de emphasizes the idea of ​​era, nominally neutral, and the human world is the result of human actions. Greek historians also think that history is periodic. [27]\n\nThe Augustine, Augustine, has an impact on Christianity and Western thinking in the early Middle Ages. During the medieval and cultural revival, people usually study history through sacred or religious perspectives. Around 1800, German philosopher and historian Hegel introduced philosophy and more secular methods in historical research.\n\nIn the preface \"Historical Intriology\" in 1377, the Arab Historians and early sociologists Iben Heletown pointed out seven mistakes that historians often committed. In his criticism, he thinks that the past is unfamiliar, it is to explain. The originality of Iben Hardown is that the cultural differences in another era must dominate the evaluation of related historical materials, and distinguish between the principles that may try to evaluate, in addition to rational principles, experience in order to assess past culture. Iben Harton often criticizes \"lazy superstitions and non-criticism According to \"As a result, he introduced the scientific method into historical research, and often called his\" new science \". [28] His historical method is also observing the national, spread, publicity and systemic prejudice in history The role laid the foundation [29], so he is considered to be \"the father of history\" [30] or \"the father of history philosophy\". [31]\n\nIn the West, historians have developed modern history methods in the 17th and 18th century, especially in France and Germany. In 1851, Herbert Spino summed these methods:\n\n\n\nFrom the continuous level of our historical sites, they (historians) are hard to collect all colors of bright fragments, like children, pounce on all strange, sparkling and make people laugh on all of their sparkling collectors. Things; at the same time, the pulse of wisdom in this ortho-valuable wreck is completely ignored. Greedily stacked a lot of garbage, and those that should be dug and may be smelted into a gold truth from abandonment and not seeking. [32]\nThe \"rich\" \"rich mine\" said by Spencer refers to the historical theory of science. At the same time, Henry Bacle expressed his dreams of history that became science:\n\n\n\nRegarding nature, it is clear that it is obviously the least upset and incomplete events, and proves that these incidents meet certain fixed and universal laws. This is because of the ability to have patient, people who have been patient and relentless thinking have studied these incidents to discover the regularity of the incident. If the human event is similar, we are completely expected to get similar Result [33]\nIn contrast to Buckl's dreams, the most affected 19th century historian became Leo Pod von Lanko in Germany. He will limit history as \"truly happening\", so that this area is far from science. For Rank, historical data should be carefully collected, and objectively check and combine strict requirements. However, these programs \"are only the premise and premise of science. The core of scientific is to find the order and regularity of the data being checked, and formulate summary or laws on them.\" [34]\n\n\n\nJust as the historians like Langk and many followers followed his followers pursue \"no\", history is not scientific. Therefore, if historians tell us that in view of his practice, it is a science, we must convince him. If he is not doing science, then, no matter what he is doing, he will not be \"do\" science. Therefore, traditional historians are not scientists, according to practices, history is not scientific. [35]\nIn the 20th century, academic historians pay less attention to epic nationalist narratives, and these narratives tend to beautify national or great people's theories, more objective and complex analysis of society and knowledge. One of the main trends in historical methodology in the 20th century is to tend to treat history as a social science rather than an art, which is traditional. The main advocate for historical academics of social science is a variety of scholars, including Fernan Brandale, Ememonte Leurula, Rudy, Hans - Ulrich Weille, Robert Furier, Ludan Fferf, Lawrence Stone (English: Lawrence Stone). Many historical advocates as social science have received attention for its interdisciplinary approach. Brader combines historical and geography. Brekl combines historical and political science, and Fogle combines historical and economics, combining homosexual history and psychology, combining the history and archeology, Weller, Brloch, Fischer, Stone, Fverre, Ravo Ruar, integrates historical and sociology in different ways, and integrates geography, anthropology and economics . However, these multidisciplinary methods have not produced historical theory. So far, only one historical theory comes from professional historians. [36] We have other fields of experts writing (for example, Marxist History Theory). Recently, the field of digital historiography began research using computer technology to make new problems in historical data and generate digital scholarships.\n\nSome opposition to historians regarding history as a social science, such as Hugh Trev, John Lucchen, Donald Clayton, Gtrude Himel Fab and Gädhad Ritt, I think the key to historian work is imagined, so I advocate historical understanding as an art. The French historians associated with the Yearbook School introduced quantitative history, using raw data to track the life of typical individuals, and play a pivotable role in the establishment of cultural history (see Histoire Desmentalités). Knowledge historiologists, such as Herbert Butterfield, Ester Nold, and George Moste's ideological historians to advocate the importance of thinking in history. The incentives of the Affiliates Age, American historians are concerned about race, race, and socio-economic groups that have been overlooked. Another social historical genre in the times after the Second World War is a \"alternative life history\" (AllTagsgeschichte). Martin Broszat, Ian Kershaw and Detlev Peukert and other scholars attempt to study Germany in the 20th century, especially in Nazi Germany.\n\nMarxist historians, such as Eric Hobosbau, Edward Palmer Thompson, Rodney Hilton (English: Rodney Hilton), Herbert Aptheker, Arno J. Mayer (English: arno j. mayer) and Christopher Hill tried to verify Marx's theory analysis history from the perspective of Marxism. In order to respond to Marxism's explanation of history, such as Françoisfuret, Richard Pipes, Roland Mousnier, Henry Ashby Turner (Henry Ashby Turner) and Robert Conquist provide anti-Marxist historical explanation. Feminist historians, such as Joan Wallach Scott, Natalie Zemon Davis, Sheila Rowbotham, Elizabeth Fox-Genovese and Lynn Hunt, are considered to study women's experiences. In recent years, postmodernists have questioned the need of history and historical research, as all history is based on individual interpretation of the source. Richard J. Evans defended the value of history in 1997's book \"Defending History\". Another historical defense of the postmodernism criticism is the \"historical killion\" published by the Australian historian Keith Windschuttle in 1994.\n\nToday, most historians begin to study in the files on the physical or digital platform. They often propose a argument and use their research to support it. John H. Arnold (English: John H. Arnold (Historian) proposes a history of argument, which creates the possibility of reform. Digital information companies such as Google have triggered controversy about the role of network review in information access. [37]\n\nThe historical materialism of Marxism Theory believes that society is fundamentally determined by any given time - in other words, the relationship between people and people is to meet basic needs, such as eating, Clothes, housing, and maintain themselves and their families. Overall, Marx and Engels claim that the five continuous stages of the development of these substance conditions in Western Europe. Marxist Histori has been an orthodox thinking of the Soviet Union, but since Mikhail Corum has been reduced to the academic field since the communist collapse in 1991. [38] Overall, Marx and Engels claim that five continuous stages of these material conditions of Western Europe have been determined. [39] Marxist Histori was once an orthodox thought of the Soviet Union, but since the communist collapse of the Soviet Union in 1991, Mikhail Colom said it has recessioned the academic field. [40]\n\nMany historians believe that history is biased, because the incidents in history can be explained in a variety of ways. Constantine Fassote (English: Constantin Fasolt) believes that history is associated with politics through the practice of silence itself. [41] \"The second common point of connection between history and politics is that historians are often influenced.\" Michelle Rolf Trouillo said, \"MICHEL-ROLPH Trouillot, The historical process is rooted in the file, so the historical part of silence or being forgotten may be part of the narrative strategy, which determines how to remember the historical field. [42]\nHistorical omissions can occur in a variety of ways, and can have a profound impact on history records. Information can also be intentionally excluded or unexpected. Historians have created a number of terms to describe the behavior of historical information, including: \"Silence\", [42] \"Selective Memory\", [43], and \"Erase\". [44] The 20th century historian Guda Len (English: Gerda lerner) put most of her work involving the history of women and their achievements, she explained the negative impact of these omissions on minorities . [43] Environmental Historicist William Croan (English: William Cronon) proposes three ways to eliminate prejudice and ensure true and accurate narrative: the narrative should not be contrary to known facts, they must have ecological meaning (especially In response to environmental history), published works must be reviewed by academia and other historians to ensure accountability. [44]\n\nChina is the most complete country inheritance in the world, and its records of history are not only long, but also precise content. Since the history of the Chinese history, there has been more than 4,000 years since the Huang Emperor of China, and since the Western Zhou Republic (the first 841), history has been accurate to the year, and since the Rubu Gong (before 722), it has been accurate to the month. China's historical records are also known as history or history books, which are divided into different genres such as chronology, album, submission of books. In contrast to historical in Western civilization, China will be one of the four basic disciplines (Cai Ji, Sub-,, \",\" Sik Xiaoyu, etc.). [3] Qiby said: \"History is a Chinese who has been studying in his enthusiasm of his unhearer. Nothing to write his own comprehension, there is no country to save yourself Historical classics. \"[45]\n\nIn the primitive society, there is no text, and can only be recorded through the method such as the knot, the marching, and some historical traces are preserved by \"Legend\". For example, China's ancient legend \"Huang Emperor\", \"female 娲 娲 天\", \"Daxie Governing Water\" and so on. After the state has appeared, it will be the \"witch\" of the sacrifice. They also have relevant functions such as records, drafting documents and handling instruments. It can be said to be the earliest host. Then, with the continuous evolution and development of national functions, there have been independent hosts, specializing in historical events, and During this period, China had the world's earliest history book \"Shangshu\", and the content is a compilation of political documents in the past, and there is no specific historical genre. Since the New Year's Republic (841 BC), China has a year-on-year history, since then has a continuous historical record, and almost a history of history. This is also extremely rare in all countries around the world. Historians in the Spring and Autumn Warring States Period, such as Confucius (the bonding \"Spring and Autumn\") and Zuosu Ming (with \"Zuo Chuan\"), so that history basically gains the influence of theology and religion. [46]\n\nWhen Sima Qian, Western Han Dynasty wrote \"Historical Record\", creating a history of the bobbin, and the scale of \"Historical Record\" is unprecedented in the world. After that, the Eastern Hanban is inquiry \"Han Shu\", continuing the development of \"Historical Records\", which is the history of China's first discipline. These two historical works have laid the foundation of Chinese classical history. Later, historians took the \"Historical Records\" and \"Han Shu\" genre, and the history of each dynasty has formed a \"twenty-four history\". In addition to the history of breaking, China has also had a history, such as Du You's \"General\" in the end of the Tang Dynasty, \"Conduct\" of Song Song Ma Guang, among which \"Conduct\" is a thousands of sarues. The chronicle of the sixty-two years is a wonderful flower in the history of Chinese history. [46]\n\nThe Western History begins in the first 5th century BC. The ancient Greek writer Hondodo recorded the Hebao War between Greece and Persi in the book \"History\" (History of Hippo War). History since then Dramatic and literature out of the disciplines. Hondodo was also called \"the father of history\" by the Roman philosopher Sichzaro. But the real incident in Horodod is mixed with the fictional event, not a pure history. In more than 20 years, the ancient Greek 's \"The History of Bennezi War\" is rigorous, history is informative, is the first \"letter history\" in the West. In the first 2nd century, the Greek historian Poribiba recorded the history of all countries around the Mediterranean coast, all ethnic groups around the Roman Empire around the Roman Empire, and the history of the Roman Empire. A \"world\" pass history. [47]\n\nHistorical philosophy is a branch of philosophy, mainly considering the ultimate meaning of human history. Further, it considers the outcome of the possible purpose of human history. In other words, it is a design, purpose, guideline or foregone in the process of human history. "}