{"chinese_title": "animal ", "chinese": "Animals, or a Metazoan, a group of multi-cell eukaryotes, a classification class that constitutes the animal boundaries (name: Animalia) in biological taxonomy. In addition to a few special exceptions, most animals will consume organic substances, breathe oxygen, movable and sexually reproduction, and their embryonic development begins with hollow cells (blastocyst). More than 1.5 million current animal species have been published, in which insects are the largest groups, about 1 million. The full length of animals from 6994850000000000,000 ♠ 8.5 × 10-6 meters to 33.6 meters. They have a complex interaction with other biological and living environments, forming a complicated food network. Although human beings belong to animals, in the oral language, the word \"animals\" usually refers to animals other than humans. Scientific research against animals is called zoology.\n\nMost of the current animal species belong to both sides symmetrical animals, and the body structure of animals in this evolutionary is symmetrical in biological symmetry. Symmetric animals include inlet animals and rear mouth animals, there are many kinds of invertebrates in front of them, such as arthropods and molluscular animals; the latter encompass ratcinosa and ridges (comprising vertebrate). There is an early animal's life in the front of the Cambrian endage. There have been many marine organisms in the Hui Ji life of Han Wu Ji, who started from about 542 billion years ago, as far as the fossil record, these marine organisms have evolved into many modern animals. The 6331 group genes of all existing animals have been confirmed that these genes may come from a common ancestor of 650 million years.\n\nIn the history of classification, Aristotle divided animals into \"blood\" and \"bloodless\" (English: aristral's biology). In 1758, Swedish Biologist Carl Lindina created the first animal classification system in the \"Natural System\" book. In 1809, - Batist La Mark expanded it to 14 gate classification units. In 1874, Erstri Heker divided the animal boundaries into a multi-cell post-born animal (an animal's abnormality) and protozoa, and single cell organisms were no longer considered an animal. In modern, animal biological classification dependent molecular system genetic analysis techniques, can effectively demonstrate the evolutionary relationship between animal classification units.\n\nIn the process of human development, other animals (meat, eggs and milk) have always been an important source of food in humans, and the skin of animals is used to warm. Some animals are domesticated to poultry, livestock or pets. In addition, they are also an important part of human culture (such as mythology and religion).\n\nThe name \"Animalia\" in the animal industry is derived from Latin \"Animalis\", which means that \"will breathe\", \"with soul\" [1]. Biological definitions include all members of the animal industry [2]. The oral language is due to the impact of human centerism, only other animals other than humans often referred to as human beings [3] [4] [5] [6].\n\nAll members of the animal are all in multiple cellular eukaryotic organisms [7] [8]. Most species of this world belong to a heterodal organism [8] [9] [10], and a small portion can perform an oxygen-free breathing [11], which is different from plants and algae (12). Animals have self-active capabilities in a certain stage of their life cycle [13]. Animals such as sponge, coral, mussels and vine can have activity capacity during the young body, but will gradually lose their power (English: sessility), becoming a solid organism. Most animal embryonic development has cystic periods, this stage is the unique period of animals [14]. In the cystic period, cells can be divided into different tissues and organs [15].\n\nAll animals are constructed of cells, and some of the extracellular matrix contained in collagen and glycoproteins are covered with collagen and glycoproteins [16]. At the time of animal individual development, the plasticity of the extracellular matrix will increase, so that the cells are easy to move and recombine, allowing the cells to form a complex structure. The extracellular matrix may also form a housing, bone and bone needle (English: spicket) and other structures [17]. Expendent cells such as fungi, plants, and algae have relatively strong cell walls, resulting in limited capacity of their cells, so growing slow [18]. In addition, there is a particular cellular structure between animal cells, such as tight joints, gap connectivity, and cell bridges, and the like. [19].\n\nIn addition to sponge animals and flat disc animals, animals have many different special tissues [20], such as muscle tissue and neural tissue, etc., can assist individuals and in vivo signal transmission. In general, animals will also have a digestible chamber, while the digestible cavity can be divided into two kinds, one is only one open cyst digestive system, such as the petrida, the homogeneous animal door and the flat animal door. That is, the other is a tubular digestive system with two openings, and the digestive tract of most two-side symmetrical animals belongs to this class [21].\n\nAlmost all animals are breed through sexual reproduction [22]. They can generate a haploid assiglement by measuring splitting; the size of the space is free to move as sperm, the volume is large, and the egg is not free to move. [23], the two combined for a flowery egg [24], Subsequently thereon into hollow spherical object-blastocysts. Sponges can swim to new locations, fix themselves on the sea, and develop as new sponges [25]. Other young mothers of most animals will experience more complex processes [26], first embryos (English: invagination) into the intestinal embryo, develop digestive chamber and two mutually separated embryo [27]. In most cases, the third embryo-demation [28] is also developed between the two embryo. These endoderm is then differentiated into different tissues, organ [29].\n\nThe anti-close relatives will result in increased hidden defective gene prevalence, which in turn leads to a projections [30] [31]. In order to avoid this situation, animals evolve a variety of mechanisms (English: Inbreeding Avoidance) [32]. For example, Hui Blue and Micro-tailed female will fight with multiple birds, enhance the genetic diversity of future generations [33]. Of course, animals also have a long-term recession [34].\n\nSome animals can have asexual reproduction, and such animal genes are identical to the parent. Severe reproductive manner contains fracture reproduction, sprout reproduction (such as hqmocytosis) and single genital (such as aphids that can be affordable in situations in the case of unmanating) [35] [36].\n\nAccording to the form of intake and consuming organic matter, animals can be divided into several different ecological groups: meat animals, herbivores, eating animals, foodulus animals [37] and parasitic animals [38], interaction between different groups of animals Form a complex food network. The meat animals and eating animals have predated behavior, which is a consumer-resource interaction (English: consumer-resource intertions) refers to these animals (called prey) for food [39]. Predator also led to the evolutionary military competition between predator and prey, making the prey to generate anti-predator adaptation [40] [41]. Multi-cell predator is almost all animals [42]. Some consumers' food is more than one, such as the larvae of parasites mainly organizes the body of the host, and ultimately kills the host [43]; But the adult is mainly with nectar as food [44]. Other animals eating (English: feeding behaviour) can be very special, such as almost only eat sponge (English: spongivore) [45].\n\nMost of the animals are releared in the plant photosynthetic effects, in which herbal animals will directly feed plants, while the meat animals in higher nutrient levels receive energy through other animals. Animals must obtain chemical energy of oxygen molecules through biomolecules such as oxidized, lipids and proteins [46], which can help animals grow and maintain the necessary biological processes (such as motion (English: Animal Locomotion) [47] [ 48] [49]. Animals near the seabed hot springs in deep sea and cold springs are releasing to perform chemical synthesis (via oxidized inorganic, such as hydrogen sulfide, etc.), to obtain energy), and bacteria. [50].\n\nThe animals originated in the ocean, arthropods and embryo plants at the same time in Furong to Oakui (510 billion-471 million years ago). [51]. The vites of Taliliki, such as the meat fin, Taltili, the late stage of the mud pot (53]. [52]. Existing animals can be found in any habitat in Earth, including salt water, submarine hot springs, freshwater, hot springs, swamp, forest, grassland, desert, aerial, or even other animals, plants, fungi or Rock in the rock [54]. However, animals are not thermophilic organisms, only a very small number of species adapt to high temperatures over 50 ° C (122 ° F) [55]. In addition, there is only a very small number of species (mostly nematodes) to be inhabit in the ultimate temperature in Antarctica [56].\n\nBlue whales are the largest animals in the earth, with nearly 200 meters (200 long tons; 220 short tons), 33 meters long (108 feet) [57] [58] [59], the most existing land animals are African grasslands, weighing 12.25 metric tons (12.06 long tons; 13.50 short tons) [57], the body length is 10.67 meters (35.0 feet) [57]. However, there is still a continental animal that is more than the African grasslands. The Argentine Dragon Dinosaur under the foot of the lizard is the most important of 73 metric tons (72 long tons; 80 short tons) [60].\nRelatively, some mucusal animals (the exclusive parasitic of the hikes) are also more than 20 microns [61], the smallest iodus insects are less than 8.5 microns in adults [62].\n\nThere are several animal gates [63] and their habitat and living habits [64] [65] [66]. The data below is based on the estimation of the number of species described so far, but the actual quantity has a lot of exports due to the different estimation methods employed by each document. For example, although the scientists have already described 25,000 to 27,000 lines, but the actual number of nematodes still has not contained, and the actual number is 10,000-2 million, 500,000, 10 million or even 100 million. [67]. As of 2011 (2011-Missing Required Parameter 1 = Month!) [UPDATE], in accordance with the laws shown in the biological classification structure, people estimate that the earth may have a total of 7.77 million animals in Earth [68] [69] [A].\n\n3,000-6,500 [80]\n\n4,000-25,000 [80]\n\nIt is known that the earliest animal fossil is unearthed in the Southern Australian Trezona (English: Trezona Formation), the rock formations 665 million years ago, which is generally considered that these fossils are the prototype of contemporary porous animals [84].\n\nThe earliest animal fossil cluster appeared in the Adikara biotics (580 million to 542 million years ago). Regarding whether the Adqka biotr group belongs to the long-term dispute [85] [86] [87] Diki's jellyfish, the animal lipid cholesterol found in the fossils of Dickens prove that they indeed belong to animals [83]. Scientists believe that animals originate from an oxygen-containing environment and can perform an oxygen breathing, but they have gradually evolved into aerobic respiratory organisms, and oxygen in the environment is required to maintain survival [88].\n\nThe fossil records of many animal categories unexpectedly broke out of the rock formations of Cambrian, which started from 542 billion years ago, and lasted for about 25 million [89]. Among them, Canada's Boyz shale and China's river fossil is a famous fossil discovery place. It has unearthed animal fossils unearthed with molluscular gates, wrist divertes, and claw animal gates. Animals such as animal doors, arthropod gates, and semi-coils, and extensive animals such as ancient cups, caulo animals, and climpts. However, \"big outbreak\" may only represent a large amount of fossil production in fossil production, rather than a majority of animals, the evolution of the same time [90] [91] [92] [93].\n\nSome ancient biologists believe that animals have emerged in 1 billion years ago, far from the annual breakfast age of Cambrian [94]. The crawling traces discovered by the stretching formation showed the mosquity of the ground hole, which may have a three-embryonic layer (English: Triploblastic) worm, a width of 5 mm (0.20 inches), and the exterior is approximately like existing. [95]. However, today's giant single cell native organisms can also produce similar traces, so the fossil traces of drawing disculs are likely to be unrelated to early animal evolution [96] [97]. Scientists discovered some fossil evidence to the same formation, or proved that the occurrence of herbicide-produced laminated stones made of microbial colonies, which may be caused by animal shepherd [98].\n\nThe animal industry is a single group with a common ancestor. It has a relative relationship with the ledwhew caterpillar, which belongs to the bilitary animals [99]. Its group is a porous animal door, a parent-like animal door, a hirpet animal door and a flat disc animal door, and the animal body of these categories is asymmetrical. The relationship between these categories is also controversial - porous animal door or 栉 otter animal gates may be all other animal classification sisters, they are lacking important HOX genes in the formation of body structure [100]. These genes have occurred in a flat discharge display [101] [102] and higher sides of the two-sided symmetrical animals [103] [104].\n\nThere are now 6331 genes in the form of a common animal, which may all come from a common ancestor of 650 million years ago. Among them, 25 groups are the core genome, only in the animal body, and 8 groups are associated with Wnt and TGF-beta signaling pathways, which can affect the body shaft development of organisms, which is likely to be animal body energy from single cell bio Become a key to multiple cellular creatures. There is also a transcription factor [105] [106] [105] [106], which is a transcription factor [105] [106].\n\nThe system of the main evolutionary branch is listed below, and each branching of the molecular clock speculated is given to approximately year [107] [108] [109] [110] [111].\n\nNeck worm\n\nPorous animal door\n\n栉 水母 动\n\nFlat disc anim door\n\nHirns\n\nAbdominal\n\nRidge\n\nTape animal\n\nThere are ratcinous animals (English: scalidophora)\n\nArthropod gates and their close relatives\n\nNeva animals and their close relatives\n\nRotorful door and its close relatives\n\nMao animal door\n\nTether animal\n\nSoft animal door Have a close relative\n\nAssembly animal gates and their close relatives\n\nNon-side symmetrical animals describe animals groups that lack both sides, including porous animal doors (such as sponges, etc.), 栉 水 母 动门, flat discharge display [112] [113], and hiring animal doors (including Water mother, anemone and corals, etc. The porous animal door lacks the complex organ or system of the other animal doors [114], although the cells of the sponge have differentiated phenomena, but there is no tissue and organ [115]. Most of the sponge rely on the small hole of seawater fluid surface to obtain food and oxygen, and exclude waste [116]. Symphony is symmetrical in the anatomy of the nappermother and the hikes. Therefore, early literature referred to as radiocaround symmetry (RADIATA) [117], but the literature in recent years has been used less. The animals of the two doors have differentiated tissues, but the organs have not yet formed [118]. They belong to a double embryo (English: diploBlastic) animal, only having the octoderm and endoderm, and does not have a dermetry [119]. Small flat tray animals are similar, but they have no permanent digestible cavity [112] [113].\n\nConventional biological believes that the original animal lacks symmetry, so that the non-confiratory porous animal door is the oldest evolutionary branch [117] [120]. Thereafter, radiocaround symmetry animals have been developed to develop both signtial animals [117]. However, such views have been challenged in recent years [121]. Some scholars believe that the mothermal animal door is the most group animal evolution [121] [122]. In this way, the origin of animal symmetry will be more complex than traditional cognition, representing the loss of symmetry of sponge is secondary [121]. The debate between the two hypothesis is still continuous.\n\nThe remaining is the vast majority of symmetrical animals, and the following copies are 28 doors, with more than 1 million species. Its body has a tri-embryo layer, and the tissue can differentiate into different organs (English: OrganoGENESIS). The digestion has a mouth, anal two openings, wherein the portion is developed into a body cavity or a prosthetic cavity. These have two sides symmetrical body patterns (English: Body Plan), which tends to move towards a particular direction to distinguish the front end (head), the rear end (tail), and the back side, the abdominal side, so there is also the left and right sides. [123] [124].\n\nThe front end of the animal can be protected from external stimuli such as food, and thus produces a head specialization (English: Cephalisation), and the evolution is a sensory, mouth of the mouth. Many side symmetrical animals have a muscle group surrounded by the body, which can be used to bind the body; and the vertical muscle group with interlaced, which can shorten the body [124]. These muscles make the soft animals having a hydrostatic skeleton in a peristaltic manner [125]. Their digestive tract from the mouth along the columnar body until the anus. Symmetry animals on both sides have many initial larvae can be swim in the field, and their tops have sensory cells. However, these regularities have some unexpected accidents, such as the adult ratcinous animal body type radiation symmetry, and its larvae is large; some of the physical structures of some parasites are extremely simple [123] [124].\n\nGene study reversed the recognition of the relationship between the two sides of symmetrical animals, and most of the transitions were concentrated on both large-in-one animals and rear mouth animals [126]. Through gene analysis, it is also known that the absence of a cavity is a base group [127] [128] [129].\n\nAt the beginning of the initial development, the blastocyst of the rear mouth animal will be radiated, and most of the primary animals (also known as helical) are spiral ovar (also known as ovary) [130]. The origin animals and the rear animals have a complete digestive tract, but the original embryo hole in the original animal ravine will finally develop, and the other end will form anal; and the original embryo hole of the posterior mouth animal is the anus. The other end is developed as a mouth, and it is also named [131] [132]. Most of the primary animals form ambrocrystum and body cavity through a crack method (English: Schizocoly), in both sides of the original, there will be cell divisions in the intersection of the endoderm and the outer endoderm. Between the internal and external endodestrictions The cells developed into a cavity between the middle endoderm in the middle endoderm. The rear mouth animal is formed by the intestinal cavity (English: Enterocoly), and the cellular inner cells on the end of the endoderm is formed, and after the endoderm is detached, there is a cavity between the endoderm. It will develop into a translucent [133].\n\nThe ratcinabal gates and the ridge animal doors are rear mouth animals [134], and the ratcinosal gates live in water, including starfish, sea urchin and sea cucumber [135]. Most of the animals in the chordorine doors are vertebrates [136], including fish, amphibians, reptiles, birds and mammals [137]. Other rear mouth animals include semi-coil [138] [139].\n\nSkill animals are origin animals, as their name, they must grow through the molty [140]. Skill animals include the largest animal door limbs, including insects, spiders, crabs, etc., the body of these animals has part (English: segmentation (biology), and there are more lifmers. The other two smaller doors, claws and sustained animal doors, which are close relatives of arthropods and have similar features. Skill animals also include nematode animal doors, which may be the second largest animal door. Most of the nematodes can only be seen under the microscope, inhabit almost all water-containing ecosystem [141], some species are common parasitic [142]. Clients of the nematode animal doors include linearnesia animals, dynamic animal doors, glow animals and armor animals. The body cavity of the nematode and these near-relatives does not have a body cavity film, also known as a prosthetic cavity [143].\n\nThe spiral is a large class under the origin, develops in the early stage of the embryo [144]. There is still a certain dispute with system development of spiral animals, but it is currently consisting of a large-acting branch-crown wheel animal head, as well as some smaller doors such as cascades (including abdominal and flat animals). These categories belong to the crown wheel (English: PlatyTrochozoa). The crown wheel animal has a strip-shaped animal (English: Gnathifera (Clade)), which contains rot animals [145] [146].\n\nClassification of genus underrrotoma has a mounted animal door, a link animal door, a wrist animal door, an anal gantry [145] [147] [148]. Among them, the soft animal door is the second door of the animal industry, including snails, clams and tube, and the linkage consists of a baffle, including 蚓, sand and grass. These two groups of animals are considered to be close relatives because they have the form of larvae in the larvae stage [149] [150].\n\nIn the classical era, Aristotle score animals into blood (vertebrates generally blood) and no blood in the \"Animal Zhi\" and \"the Chinese: Parts of Animals\". The animals are then arranged by a classification scale, from the human (there is blood, two feet, rational soul) to the life-limpet animal (blood, four feet, sensual soul) to other classification groups such as crustaceous animals (Bloodless, slender, sensual soul), then go down to creatures like sponges (bloodless, legs, plant soul). Aristotle can't determine if the sponge is an animal. Animals should feel, appetite, can exercise, while plants do not know that the sponge can induce touch, if they pull it from the rock It will shrink when it is down, but they will root root like plants and will not move back. [152].\n\nIn 1758, Carl Linna created the first classification classification in his \"natural system\" [153]. In his start plan, animals are one of three domains, divided into worms, insects, fish, amphibians, birds and breastfeeding. Later, people will be classified into a door of the ridge animals, while insects (including crustal and spider animals) and worms are renamed or resolved. Let - Batist La Mark began to resets animals in 1793. He called the worm \"very chaotic\" (French: Une Espèce de CHAOS [D]), dismantling it into three new categories: worm, spine Class and water clams (including corals and jellyfish). In 1809, Ramac divided animal into 11 categories: vertebrate (this part he still divided into 4 categories: mammal, bird, crawling and fish), soft animal, vine class , Link animals, crustaceies, spider types, insects, worms, radiomymids, water, and fiberges [151].\n\nIn the \"animal boundaries (English: le règne animal\" in 1817, he divided animal into four branches from comparative anatomical perspectives (Embranchements, which have different morphology , Substantially equivalent to the door), that is, vertebrate, soft animals, strands (arthropods and loop animals) and plant animals (role leaf referred to as \"radius\", including ratcinous animals, hirns and other forms) [155]. This method of dividing into four categories later obtained embryonic scholars Carl Enster von Bell (1828), Zharid Louis Agas (1857) and comparative anatomists Richard Owen ( Perfection in 1860 [156].\n\nIn 1874, Erne Herkel divided the animal industry into two subcompices: post-birth animals (multi-cell animals, five categories: causal animals, ratcini animals, strands, mollys and vertebrates) and Original animals (single cell animals), and he also clasped the sponge as sixth animal door [157] [156]. Later, the native animal was moved to the previous native biological community, leaving only the recording of the animal industry as the synonym of the animal world [158].\n\nHumans use many other animal species as food, including domestic animal animals, and hunting wildlife (mainly by catching various sea fish in the sea) [159] [160]. The number of species of commercial fishing sea fish is relatively small, and the number of species of commercial farmers is less [159] [161] [162]. In addition, human beings will also hunt or breed invertebrates such as headfoots, crustles, double-shell and abdominal foots as food [163]. Animals in the world are raising chickens, cattle, sheep and pigs as food [160] [164] [165]. Animal fiber (such as wool) can be used to make textiles, animal tendons can be used for kids, and the skin is widely used in the production of shoes. People are hunting or breeding animals to get their fur, used to make things such as coats and hats [166] [167], and even insects can also be used to make dyes (such as Rouge [168] [169] [170] [171 ] And insect rubber [172] [173]).\n\nAnimals such as black gust fly as a model organism play an important role in scientific experiments [174] [175] [176]. In the 18th century, the vaccine was found, and people used animals to make vaccines [178]. Certain drugs (such as anti-cancer drugs made from sea sheel extract (English: trabected) are based on biomolecules such as toxins from animals. [179].\n\nPeople catch up with hound and find the prey [180], using raptors to capture birds and mammals [181], with the fishing of the throat [182]. Arrow poison frogs are used to piruate the tip of the blowpipe darts [183] ​​[184]. From the beginning of agricultural development, animals such as cattle and horses have been used for labor and transportation [185]. A wide variety of animals are treated as pets, from invertebrates (especially insects and gornets [186]) to reptile [187] to birds [188]. However, the most common pets, such as dogs, cats and rabbits, etc., belong to mammals [189] [190] [191]. People also like to conduct animal-related sports (such as equestrian) [192]. However, there is a contradiction between animals as individuals related to human beings and animal rights [193].\n\nFrom ancient times, animals are the theme of art. There are many animal drawings in many murals in the prehistoric era [194], and the earliest people can at least go back to the old stone age before 43,3900 [195] . The famous animal painting includes Albrecht Little \"Little Rhinoceros\" and George Stabss (English: George Stubbs) in 1515 [196 \"[196\" [196 ]. Animals often play an important role in literary works and movies [197], there are also appearances in mythology and religion (such as \"Liangshan Bo and Zhu Yingtai\") [198] [199]. In Japan and Europe, the butterfly is considered the avatar of human soul [198] [200] [201]. The beetle is a sacred animal in Ancient Egypt [202]. In mammals, cattle [203], deer (English: Deer in mythology) [199], Ma (English: Horse Worship) [204], Lion: Cultural Depictions of lions [205], bat [206] , Bear [207] and Wolf (English: Wolves in Folklore, Religion and Mythology) [208] have appeared in mythology, is an object of human worship. Western zodiac and China's twelve zodiac is also an animal-based legend [209] [210]. "}