{"chinese_title": "entertainment ", "chinese": "Entertainment is a great interest and interest that attract audiences, and makes the audience feel happy and satisfied, happy, dispel, relaxation, leisure, etc., and is different from education and marketing activities. It can be an idea, a task, but more likely to be an activity or event. Today, human entertainment has developed thousands of years, and has attracted audience attention [1]. Due to personal preferences, different entertainment is different, but most entertainment activities are considered to have universal appeal. Just like telling stories, music, drama, dance and various performances, general entertainment is almost popular in all cultures, most of them from the palace, develop exquisite and diverse skills, and heard the city well civilians. The contemporary entertainment industry mainly rely on the production and sales of entertainment products, and the development of this industry has rapidly accelerated the popularization of entertainment. In order to adapt to different sizes, entertainment has developed various forms: can be self-selected columns in private music services, or it can be suitable for two people's two banquets, and it can be no different national skin tones, including thousands of audiences, and dance music. International audiovisual feast.\n\nEntertainment is always closely linked to the fun (English: amusement). Although many entertainment forms are serious, such as ceremonies, celebrations, religious festivals, or allegories, but people can often take joy from it, and report to laugh. Thus, there is also such a possibility that these entertainment or can enhance people's insight or intelligence.\n\nThe audience of entertainment is an important aspect of entertainment. The audience is a person who can put his own overcome into entertainment. In the process of watching competitions, opera, or movies, the audience plays the role of passive recipients; in activities that are often interchanged in participants (such as games), the audience can be active. There are public entertainment in real life, and there are also personal entertainment; existing theater art and concerts, the content fixed entertainment, and children's games (English: List of traditional children's games) is not fixed, Spontaneous entertainment. Most entertainment has more than a hundred years of history and has continuously developed with cultural, scientific and trend, such as stage magic. Although movies and video games use new media, it can be traditionally retrosted to tell stories, modern drama, and traditions playing music. Music, movies and dance can create a festive atmosphere, even after the festival is also pleasing.\n\nFor example, disclosure, some activities have been considered to be a kind of entertainment in the past, but it is already far from the public. The fencing or archery is originally a necessary skill to survive, and now it has developed into a professional, professional sports, and has developed an entertainment form of more and more widely attractive. Life behavior such as cooking is also a survival skill in the past, and now it has become a public performance attended by some professional, and some are also on the stage, becoming an international event, spread out in the form of entertainment. So some groups or individual entertainment activities may be a formal job of another person.\n\nThe common form of entertainment can span different media through creative and re-fusion demonstrating unlimited potential. This also ensures numerous entertainment themes, image and structures to maintain consistency and persistence.\n\nEntertainment is different from education and marketing, although the two are well known how to use entertainment attractive to achieve their different goals. The academic community knows the important impact of entertainment [2] [3], and more mature entertainment also affects some academic fields including museums and practical activities in other fields. [4] [5]\n\nPsychologists believe that the purpose of spread entertainment is to \"get fun\" [6]. In addition to \"Accessible\", entertainment usually does not have other effects; the last ratio of the sports competitive entertainment project is removed, and there is no other interest effect. This is compared with the education (to help people learn as a target) with marketing (encouraging people to buy commercial products). However, when education is also trying to \"entertain\", when the combination of entertainment and marketing is gaining the meaning of education, the boundaries between them become blurred. Such a mixture is often known for new words \"educational entertainment\" or \"Information Entertainment\". The psychological theory of entertainment and learning has been applied in the above field. [7] Some \"Impressive\" attempts are the best apps that combine both the longevity [8] [9] Some people will also be happy to have a painful disorder (gloating).\n\nIn addition to giving pleasure, entertainment can also provide some profound experiences for the audience. Entertainment may be delicious to design some universal philosophical topics into its performance, such as \"What is the meaning of life?\" \"What is the meaning of people?\" \"What is what I should?\" \"How do we know us?\" Cognition? \"This kind of problem has spawned a lot of plot bridges, existed in many stories, movies, drama, poetry, classic, dance, animation or game form. Take the drama, in the \"Hamlet\" in William Shakespeare, the characters use poetry to express these philosophy; another \"hacker empire\" [10] in-depth discussion of the essence of knowledge; these works are also Thoughts spread to all over the world [11]. At the same time, a long novel is worried, but also provides a broader perspective for the demonstration of such profound themes [12]. Among them, the \"Galaxy Tour Guide Series\" is adapted to various forms because of its vivid and creative fun exploration of philosophical problems: the initial comedy radio show, because it is too popular and adapted to the novel, movie, TV series , Stage drama, comics, audio books, butter-grain records, adventure games, online games, etc. There are many inferses that are widely circulated. (See \"Galaxy Tour Guide\" Speech), related works have also been translated into multiple languages ​​[13], covering the meaning of life, entertainment ethics, artificial intelligence, multiple worlds , God, philosophical methodology, etc. [14].\n\nMost of the story is still some older techniques, these techniques use words, images, sounds, and gestures to communicate experience, show things. [15] The story is not only a means of inheriting cultural values, traditions and history, but also an important part of entertainment. Despite the changes in years, the form of stories maintains its initial form, such as people still sit around and listen to stories when they are camping, and visitors will listen to those coming from different cultures when they travel. The earliest series of stories has been written in books today, but they have no doubt that they have passed on the ears, and their power is exactly the same as the elements we can also appreciate in today's movies and novels. . [16]\n\nThe story has been evolved toward the \"diversified\" development [16]. Many entertainment activities including stories, especially music and drama, although familiar with people, but have developed various forms to meet the needs of different personal interests and cultural expressions. Many types require other types of support and fusion. For example, storytelling, drama and banquet usually require music to render atmosphere; sports and games will join other activities to increase their fun. Some have evolved into professional and indispensable sports competition items (such as running and jumping). It is said that the struts are high \"may originate from the Netherlands, the Dutch people use long rods to cross the wide rivers, so that there is no wear of wood shoes to take a few miles to reach the nearest bridge.\" It is also believed that the pole may originate from the war to use the struts to the Fortress High Wall [17]. This moving equipment becomes more and more delicate. For example, the initial pole is made from the woods of the trees, the mountains, or the woods. Bottles are used in the 19th century, and the carbon fibers are used in the 21st century [17]. Other activities, such as stepping on stilts, can still be seen in circus performances in the 21st century. The Horn Fighter battle is popular in the Roman era, and is also known as \"Gladia Game\", which is also an example of combining sports, punishment, entertainment elements. [18] [19]\n\nEntertainment will change in the transformation of cultural or historical changes. For example, hunting wild animals are introduced from Carthage to Rome and become popular public entertainment activities, and also driven wild animals international trade. [20]\n\nEntertainment will also be influenced by the social turmoil of war and revolution, evolution into different forms. For example, the revolutionary sample show for the promotion of the Cultural Revolution, there is also the first world war, the Great Depression, and the Russian revolution has also impact enliers. [21] [22] [23] [24] [25]\n\nThe factors such as times, fashion, culture, technology and economies have continued to affect entertainment, and also produce relatively small changes to the form and location of leisure entertainment. For example, a story in dramatic form can be presented in the open-air theater, the concert hall, the cinema and the studio, or by more advanced technical means, such as a tablet. Most of the audiences have a specialized architecture to enjoy entertainment, such as theater, auditorium or stadium. One of the most famous entertainment venues in the Western world, the Roman Boucus, presented a 100-day game in the 80s of the AD, 50,000 viewers \"enjoy\" this bloody stage competition. [26] Shengjing, competition, racing and sports have presented to the audience in such a special building. Nowadays, in order to meet the growing demand for global audience, there is a continuous new stadium began to build.\n\nEmpire royal and courts provide training venues and support for professional artists, different cultures create palace and castle in different ways. For example, in the Mayan civilized city, the stage often plays in the large square in front of the Palace, and the crowd will gather in the view or watch it in a location specified from far. [27] The court entertainment will also span different cultures, for example, Durba is introduced into India by Mughal, and then introduces the Empire of the Empire, and still follows the Indian tradition: institution, title, customs, and is Ceremony with Natai, and so on. [28] In the Korean Peninsula, the court dance as a kind of entertainment started in the court banquet. [29]\n\nCourt entertainment is often the popularity of the court to Pu civilians. This is the case, which is the foundation of the rural shaman education, and eventually become an entertainment form of ordinary people. [30] Another example is the Narbje (English: Nautch) dancer in the Mohed: Nautch, which was only performed in the Hindu Palace Temple. Similarly, there is a change from religious rituals to secular entertainment, such as the ceremony of ancient Korea Dynasty, \"The initial purely religious ceremony is just the secular\". \" [31] The previous court entertainment, such as the medieval spear, and still in children's games.\n\nIn the palace in the Byzantine Empire, especially the upper class entertainment, at least in the Kohun Dynasty, demanding gender: Men and women are strictly separated during some entertainment activities such as receptions and banquets. [32]\n\nThe chartroom ceremony, the court gathering, the grand scene associated with it is not only used, but also used to show wealth and power. Such events can strengthen the relationship between the ruler and the ruler; between the erectors and the universal, \"the differences between ordinary families and rulers are exhibited in the form of drama.\" [33] Whether in the traditional court or in modern awareness, this situation is almost the same, like the 1997 Hong Kong regression ceremony, banquet, carnival, fireworks, holiday performance, and art exhibitions have been concentrated in regular regime. The court ceremony is a typical service to serve the royal family and ministers, and it is also \"for the master and the high official official\". [34] The Golden Age, the court will have traditional dance. [34] In Sudan, there is a so-called \"suturing drum\" and \"drum\" and \"drums\" in the palace band of power. They are used to make music; \"speaking\" in the ceremony; Record the community's big events; send long distance information; there is also a call for people to hunt or war. [35] [36] [37]\n\nThe court entertainment also shows the complex relationship of performers and audiences: Individuals may have the identity of the entertainment and audience, and sometimes their identity will be interchanged in entertainment. In the hall of Versailles, \"Thousands of ministers, including men and women who live in, all the roles of the performers and bystanders in the daily ceremony, and protect their identity. [33]\n\nA court entertainment that is involved by royal family, such as the coronation and wedding, providing opportunities for collecting aristocrats and people at the same time. For example, it is excellent in 1595 Elizabeth, the tournament, gun competition, and other such activities, not only present, not only in all the court collectors, but also in a good day. The event and thousands of Londen people who are hungry. This day, a series of activities in the hillion of the White Hall Palace, priced twelve coins. \"[38]\n\nAlthough most entertainment has migrated over time, some of the forms of past have been accepted by the public. For example, in the early centuries of European, observing or participating in punishing criminals or homeless executions is an entertainment for the public and more popular. In the past, there were many people who were humiliated behavior and provided some entertainment for the public to a certain extent. Even some of themselves such as hackers or beheads, although it is actually a public warning for the public, many cases are also seen as a kind of entertainment. There is also a longer duration of duration, such as stone punishment and mount, has become a larger public entertainment. As historians described: \"Syngense is a carnival, whether unemployed, citizens, bourgeois or curious nobles, can watch from carriages or rent a house.\" [39] As an entertainment Activities, the public prison has been continuous until the 19th century, and \"some grand public snired activities have been disgusted by some literaryists or philosophers.\" [39] Including Charles Dickens and William Meksbis Saclai wrote articles about New Gente prisons in 1840, hoping to \"teach a broader public, identifying the reality is an entertainment \". [39]\n\nChildren's main entertainment activities are playing, which is significant for their growth and learning. Adults can also provide or teach some entertainment activities to attract their entertainment, such as parcels, clowns, mime and cartoon. These are usually liked by adults. [40] [41]\n\nChildren are always playing. Playing is not only a kind of entertainment, but also helps their physical and mental development. The painter old Peter Bruger completed his painting in 1560 \"Children's game (English: Children% 27s_games_ (bruegel)\", this is a famous oil painting showing the content of children. According to the content of the painting, it is probably able to know what games are playing in that age. Among them, there are some games, such as bubbles, hide and seeking, and \"ride pigs (English: Piggyback_ (Transportation))\", etc., it has continued to this day.\n\nMost entertainment can be more adaptable to children's needs and meet children's interest. Since the 20th century, people believe that children's psychological development is divided into different stages, and their abilities and adults are different. This understanding begins in Stanley Hall, letting Chiajie have done a deeper Research and development. Hall \"promotes the establishment of the research and psychology laboratory of the development theory\", [42] Although there is always a criticism of Hall's knowledge and theory, his knowledge and theory have still important in the field of psychology. Status; Piajie \"found that the process of cognitive development is similar to the process of physiological development.\" [43] Based on the theory of this type of psychology research, people began to create stories and activities for children's audience, and are applied to books, movies, and video games. In the context of digital entertainment, some countries responded to the special needs of children's psychological development, formulating related industry standards such as TV grading systems, to better guide the public and entertainment industry.\n\nIn the 21st century, like adult network products, many online entertainment can be available for children's tentacles. This more than the previous era has formed a major change. Children have a longer playing time in the interior. In the outdoor contact, there is less time, this phenomenon attracts people's criticism to network entertainment, people think that online entertainment is cultivated to children's imagination, adult cognition And mental health has a negative impact. [44] [45] [46]\n\nFrom ancient times, the banquet has been an entertainment. Until the 21st century, some traditional roles were still kept in the banquet - a good impression on the guests.\n\nFormer visitors, especially those important guests (4, 6, 9); hospitality (2, 3, 4, 8); entertainment activities such as music or dance, or both (2, 3). In the court in the court, it is an indispensable part (3, 4) to help artists temper their skills (2, 3), and become an important part of the celebration. Wedding (7), birthday (10) Political events (5) and military activities or victory (6) Religious obligations (1). In modern, the banquet is commercial, for example, in a restaurant (10) and combined performance dinner theater (English: dinner theater). Professional chef cooking has also become an entertainment form, that is, cooking performances, to a certain extent, a way to entertain, better than the method country, a world cooking contest (English: Bocuse d'or).\n\nMusic is the basic component of most entertainment activities and one of the forms of expression. For example, music is used to enhance the emotion of narratives, in dancing (1, 4) and theater, are not indispensable, often used in drama or drama movies. [47]\n\nMusic itself is also a common and popular entertainment, it is also a way of expressing, such as concerts (2, 4, 5, 6, 7, 8, 9). According to the rhythm, musical instruments, expressions and styles, music can be divided into classical, jazz, folk (4, 5, 8), rock, pop music (6, 9) or traditional music (1, 3). Since the 20th century, singing music is only available to the audience that can pay the performance of the performance, and the entertainment industry provides play or pre-sale services to individuals.\n\nRegardless of the player (6), the choir (2) or the orchestra (5, 8), whether there is any post-production (6, 7, 9, 10), all kinds of expressions belong Music scope (3). These venues used in live performances have a small, expensive, and indoor and outdoor, and also lead to different expectations of artists and their roles. For example, some viewers like quiet and enjoy music, and they will connotation (5, 8). Other viewers like the atmosphere of live performances and will be happy (7, 9). Most of the time, the audience chooses to entertain (10) by appreciate the pre-recording music.\n\nMusic can be divided into vocals (2, 6) and instrument (1, 3), or acoustic music (4, 5, 7, 8). Regardless of sound or instrument, artists can play alone, or participate in performances in a part of the group; contrary, the audience may be alone (10), passers-by (3), a few people (1, 2) or a large group of people (6, 7 8, 9). Although some forms, especially no accompaniment chorus and flunel do not accompany, general songs have musical instruments. Modern concerts often use a variety of special effects and related performances, accompanied by song and dance performances (7).\n\n\n\nThe game is usually for entertainment, but sometimes playing games is also to obtain a sense of accomplishment or substance. According to different gameplay, the game can be played alone, play with others, but also online; whether amateur players or e-sports players can play games together. Players can also watch games as bystanders, such as watching international chess championships.\n\nGame appliances are different from games. Like a chessboard game, such as Go, Chess or Western Chess, etc., there is a chessboard and chess pieces. At present, the oldest board game is known, is the ancient Egyptian LaOmmond, Sertite. Card games such as poker, bridges and Wheasted (English: WHIST), come back to the evening entertainment between friends, and these games only need a pangrack. Other games, such as Bingo, require special organization, and bystanders can participate in the game by betting. There are also many children's games, but the children can play outdoors, including hulls, hide and seeking or blind, and touch people (English: BLIND MAN's BUFF). The type of ball movement is quite wide, including baseball, grass and color bombs, and many ball sports projects. These game methods exercise skills to meet fitness needs. Sports games can improve sports skills and enhance physical fitness. The puzzle game like a digital game and the Rubik's cube can develop players' intelligence to a certain extent.\n\nVideo games use controllers and screens to interact with players. Some video games can also be played online, and the player is remotely involved. Starting from the second half of the twentieth century, the number of such games has increased, providing new entertainment methods for players around the world. [48] ​​[49] The video game is very popular in East Asian countries such as South Korea. [50]\n\nReading for a long time is the source of people's entertainment, compared to other forms, it is relatively cheap, more easily obtained. As Bacon said, \"Reading can be pleasant, you can be long, you can\" \"Even if there is some serious work, readers can learn from it, solve the troubles in life. And many stories and information are inherited by speaking or language performance; but over time, the text has become a better inheritance [53]. The production of printing, paper, further reducing the cost of reading, and also improving the attraction of the public. In addition, with the development of technology, the quality of books is getting higher and higher, the typography, printing, and binding are more refined, so \"Reading is no longer the painful understanding process, turning into a pure fun \". [54] By the sixteenth century, the fun of reading has been deeply rooted in Europe.\n\nSome literary genre is rare, some or all of them serve in entertainment. For example, five lines of oil poetry use their rhythm format to make humor and entertainment. In addition, interactive game books like \"thrilling intersections\" allow people to participate in writing entertainment.\n\nCartoon comics is a literary genre with painting and image as a carrier. It is usually equipped with a story of some entertaining. [55] Many contemporary comics are full of fantasies, from some companies under the entertainment industry; there are some comics unique to their authors created a more personal, philosophical worldview, showing some problems in people. Super hero genre comics, such as superman comics, belong to the former. [56] The latter has a popular comedy \"Peanut\", which is made from Charles Shuzi to 50 years, [57] [58] describes the character relationship between children; [59] There is also a weird comic cartoon made by Michael, Michael Leunig, has also caused social disputes. Japanese comics is different from Western parties in their diversified genre, facing the theme of all age groups. The irony is the use of iconic entertainment, which not only gives laughter, but also adversely improved social consciousness by ridiculing some morality of the characters.\n\nComedy is both a kind of recreational art. Whether in order to please people, as a unique serious work, it gives people a laughter, providing people with fun. It is also an important part of many entertainment forms, existing in literature, drama, opera, movies and games. [60] [61] In the Royal Court, such as the Byzantine Court, it may also be in the rich family. \"The Merma is being carefully planned, and it is expected to be forced to take care of everyone, even emperors and Other royal members can't help. This high-level temptation, the character needs to have humorous words, such as laughing, joke, insulting, laughing, can also need to be ignorant and non-words humor, such as the farce and prank on the scene of the audience. [32] In the Middle Ages, all the types of comics related to Yue, Madi, Hump, Gnome, and Knitting, are \"considered homogeneous,\" about fool \", not necessarily ridiculous, but all represent\" individual Disadvantages. [62] [63]\n\nThe 17 comedy of Shakespeare contains many techniques that are still used by comedies and actors, such as jokes, double words, imitations, words, observed gimmicks, or unnecessary ironic effects. [64] [65] Dragoth show and ironic are also used in the comedy effect of literature. In the farce, it is a major purpose.\n\nOver time and the change of culture, the meaning of the word \"comedy\" and the audience have changed. [66] Simple action comedy, such as farce, most of the ages are entertainment. However, with the increasing culture, its forms and allusions may have a subtle difference due to different countries: better than English humor, in a cultural interesting thing or even possible in another culture, I can't understand it. . [67]\n\nOn-site performance in front of the audience is a major entertainment form, especially before the audio and video inventions. Various forms of performances, including drama, music and dance drama. In the 16th and 17th centuries, the European Court presented a full of complex drama covered with dance, singing and performance. Opera is also a high-aspirated performance form, and it is still popular. It combines three performance forms, requiring high levels of music technology and stage skills, collaborative and supercomprerates like a false drama.\n\nThe audience generally uses applause to express their appreciation of entertainment performances. However, all performers are unable to attract audiences, thus can't entertain the public's risk. The dissatisfaction of the audience is usually very honest and straightforward.\n\nTelling a story is an ancient entertainment form that affects almost all other entertainment. It is not only a kind of entertainment, but also thinking about the conflict between humanity and contradictions. \" [16] Therefore, although the story can be directly subject to the public, it is also used as an entertainment and makes a part of the work depending on the narrative work, such as movies, drama, ballet and opera. The content carrier of the story is often conferred by the printed technology, such as mud gold decorative hand copy and Japanese ancient scrolls. [69] On the trip, telling the story is still a common entertainment way of an active team atmosphere. Joe said in his literary work in the 14th century \"Canterbury story collection\", just like Wu Yen, the 16th century, in the \"Journey to the West\", showing stories to send time and entertainment travel The role of people. Although there are many travel now, but in the automotive and planes, passengers still listen to the words passing, or the story plays with other technical means.\n\nThe strength of the story is visible. The most famous is the Shan Ruode (English: Scheherazade) saved his life by telling a story. [70] [71] [72] Contacts in different forms of entertainment are often inspired by these different stories, and then reflect in other media; for example, in music, movies or games different forms. Another example: Composer Rimsky-Kazakov, Raewell and Carol Safen have created a new orchestra after he was inspired by Shan Rudod's story; director Pasas Reni has adapted the \"one thousand and one night\" movie; the new video game \"Arab Dream\" also borrowed this legend. The story may not exist in the form of text, and through music, dance or puppet play, such as the Java traditional wow, the Java traditional wow accompaniment, or similar Pan Interest (English: Punch and Judy) )Performance.\n\nEpic, poetry, legend and fables tell the legend of these excipients, which inspires a variety of entertainment. For example, Hinduism, \"Luo Mama\" and \"Maha Bhara Rondo\"; Homer's epic \"Odyssey\" and \"Yilian\"; the first Arab novel \"Hayy Ibn Yaqdhan (English: self-study philosopher)\"; Persian Epic \"Lian Wang Ji\"; Icelandic Legend (English: Sagas of Icelanders) and the famous \"source\". The story set such as \"Green Tale\" or \"Andersen's Fairy Tale\" is also far-reaching. These folk stories published in the 19th century have had a huge impact on modern pop culture, so that their themes, images, symbols and structural elements are used to create new entertainment. [73]\n\nThose who are most appealing, the longest story, some are the most basic stories, also known as the origin of myth (English: myth of origin) or create myth, such as Australian Dream (English: DREAMTIME) myth, Meso Negmia's Gilgamesh Shi Shi Shi [74], or the story of Hawaii in the world. [75] At the same time, these basic stories have also been adapted as books, movies, music and games, which continues the life of these stories and improves their entertainment.\n\nThe theater performance is usually dramatic or music, presented to the audience on the stage, and its history can be traced back to the Greek era. At that time, \"The\" Happy Person of Actor \"in Delphi, Tioli, Epretic\" Poetry The performance of the competition. [76] Aristotle and his teacher Plato have a book to introduce the theory and purpose of the theater art. Aristotle puts forward some problems, such as \"What is the role of artificial figures? What is the members of the ruling class should only watch performances or become a participant in performance? What should I provide for those who don't belong to elite? Entertainment? \"[77] In Egyptian Polesi, there is an ancient drama tradition in Buna Momo, and later, the aristocrats of Rome held a\" more luxurious performance \". [78] [79]\nThe masses have changed changes over time (1) over time. [80] For example, in England in the 18th century, \"the prejudice to the actress disappears\". [81] At the same time, in Europe, generally to go to the theater is \"a more elegant middle class recreation\" [82] In the late 19th century, many popular entertainment activities have been added. The light opera and public concert hall have appeared, Russia opened a new theater, such as Moscow Art Theater and the Russian Souvin Theater. [83] At the same time, commercial newspapers started The aater column and comments are published, which makes the theater become the \"theme of intellectuals debate\" in the ordinary discussion of art and culture. [83] The masses began to gather together, \"Appreciate artistic achievements, these 'star' is sought after and welcome. \"[83] Song dance juggling performance and concert hall are very popular in the United States, England, Canada, Australia and New Zealand, but they are finally replaced. [84]\n\nDrama, [85] musical, [86] universal show, mime, and poetry reading is part of the long history of theater, these performance types are commonly referred to as single comedy. [87] In the 20th century, radio and TV often live live broadcast, Continuing the form of a series of drama traditions in form innovation.\n\nThe air land set to the audience in front of the stage and the stage constitutes a theater. What kind of seats are there, what kind of stage, including the temporary treasted stage (2, 3, 6), temporary construction stage (2), carefully designed stage (9), or a long-lasting stage (5, 7). It is also possible to divide (2, 4, 6) in accordance with the indoor stage (3, 5, 9) and the open stage. Techniques for managing, organizing, and preparation of stage performance are called \"stage technology\" (10). The audience's entertainment experience is affected by their own expectations, stage technology, stage type, and seating type and standard.\n\nThe film is a major entertainment form, but all the movies are entertaining as their main purpose: such as documentary usually in order to record certain deeds or disseminate some information, [88] Sometimes these two destination coexist. This media is a global business at its beginning of its birth: \"Lu Miji brothers took the lead in assigning photographers to go to the world, let them take everything that may make people interested.\" [89]\n\nIn 1908, the Baidi Film Company issued a news movie, [89] In the first World War, the public entertainment has a huge demand for the movie. \"In the 190s, there were some fictitious plots and news movies in some movie programs.\" [89] \"Americans first created a way to create visual motion illustratively through continuous screens.\" However, the French people convert this scientific invention into a profitable business performance. \" [90] So the film has become part of the entertainment industry from the early days of its appearance. More and more complex technologies are used to entertain the public in the movie media. For example, the role and object movement in cartoons are rapid, and this technical technique is strongly attractive to small audience. [91]\n\nThe emergence of computer imaging (CGI) technology in the 21st Century makes people with a lower cost to make a grand scene and spectacular effect. These production effects and scale are the filmmakers in the era of Sepil Demir can't imagine. [92] The mass media existed between the 1930s and 50s has only movies and broadcasts, but since then, in the 1960s, the technical innovation, economic decision-making, risk avoidance, and globalization have caused film production. The quality is reduced, and the range is reduced. [93] Complex visual effects and CGI technology instead of live performances, not only used to create lifelike characters, landscapes, (realistic subjects, and fantasy works), but also in animation production, such as Lao Games or toys in real life create an animated movie. [94] \"Lego Movie\" production team \"I hope that the audience thinks that they have been placed on the desktop, take the real Lego building blocks filled with the camera, let the audience unable to identify a lot of scenes in the actual movie is made by the computer Made of music highlights digital images. [94] Computers and movies have created new entertainment rendering, and new technologies also allow some conditional people to use the family theater to broadcast movies, and they can enjoy the quality and experience of public theater in private venues. This is similar to those of the previous aristocrats in the past few centuries, or build a stage in the big house, the practice of organizing the drama performance is very similar.\n\nSome movies are new entertainment contents for other entertainment, such as stories, books, and drama, and re-creation. [95] \"Movie History\" is a documentary about \"Movie\", and the film leads the audience to overcome the film medium to achieve the achievements and innovations made by the world, as well as the innovation of the film production concept. In the film, although there are some movies, especially traditional American movies, it usually combines \"realism and popular dramatic\" [96], intentionally communicates with the world, but there are some movies. It is intended to let the audience have a more profound thinking about movies. For example, the theme of \"Hara\" (Xala (English: Xala)) is the government's corruption. Charlie Chaplin's movie \"big dictator\" is a bold and innovative funny movie, and its theme is related to politics. Some stories that have thousands of years have been re-interpreted and moved on the big screen, so there is a movie like Hongjo: Due to death. These films typically use common literary rhetoric, such as fables and antiquacience, and use new production technologies such as CGI to explore some profound themes, such as human limitations, goodness and evil, courage, and despair, Love, faith, and death, these themes have always been the topic of all kinds of entertainment forms. [97]\n\nLike other media industries, all kinds of awards have a variety of awards, including the APEC film, including the Asia-Pacific Film Award, and awards issued by American Film Arts and Science Societies, British Movies and TV Arts, France.\n\nA variety of dances are different, and those who have different cultures provide entertainment. Dance may have a serious style, such as when it expresss cultural history or important historical events. It can also be teasing, and it is also possible to have comedy effect. It is because it combines a variety of entertainment forms, including music, action, narrative, atmosphere, which can demonstrate a variety of combined methods of these entertainment, and how to produce different entertainment effects, entertaining audiences.\n\n\"Dance is a 'cultural expression form', but it is not only involved in dancers, but also people, audiences, sponsors and brokers, etc. from all over the world and people from all ages. [98] from Africa, Asia and Europe Dance, never stop in the influence of political, social, spiritual and art. \"[99]\" Although dance customs may be privileged, the dance is progressing. For example, Africa's' Da Dance ',' Haosa Dance ',' Marseille Dance '. [100] Ballet is a highly developed Western dance form. The main performance occasion of the ballet in the Louis 14th period from the French court to the theater, dancers Become a professional drama performer. [101] Some dances, such as the French \"Four Dance\", known as the \"Square Dance of Napoleon\". [102] Other rural dance [103] I used to be a social relationship like a dance At the party, [104] [105], now, now almost tutaches. On the other hand, many national dances (such as Scottish Highland Dance and Ireland Dance) have evolved into dance competitions, and increase their entertainment by increasing the number of viewers. Value. \"\" The traditional Irish dance steps and music \"Irish dance drama have developed into a world-famous important dance form. \"[106]\n\nDue to the common dance of the \"experience with women's body and women\" [99], female dancers are sometimes considered \"indisperse\", because they \"make a living in their own, rather than covering the body as much as possible.\" [107] The attitude towards the female dancers depends on the culture, history and entertainment industry itself. For example, some cultures regard women's dancing as \"the most shameful entertainment form\" [108], and other cultures have established a casprison, such as stripping clubs, in these places, professional women's strippers perform content in public Taste or hint dance, and the audience is mainly male.\n\nVarious political systems are almost tried to limit or ban dance or prohibit specific types of dances, sometimes blaming the music or clothing used in these dances. Nationalism, power and racism try to ban dance. For example, in the Nazi Germany, the American dance is like swing dancing, and it is considered to be \"completely non-Germany\", \"has become a cultural invasion, it needs to be prohibited.\" [109] In the 1930s, China Shanghai, \"Dance and Nightclub marked the enthusiasm of Chinese society\", and the bureaucrats confused whether both and \"other forms of entertainment activities, such as 娼娼\". However, the ban even makes the dance activities \"more crazy.\" [110] In Ireland, the 1935 public ballroom law \"banned in the crossroads and elsewhere, such as the house and the barn dancing, but did not take effect.\" [106] In the United States, various dances are complicated Or metaphorical performances, [111] or like swing dancing is related to African Americans. [112] \"After the Nort-South War of the United States, African American dancers are often banned in black performances.\" [113]\n\nDances can be carried out by single (1, 4), or in double (2, 3), or groups (5, 6, 7) or even form a large-scale group dance (10). They may temporarily team (4, 8) or have highly organized (1, 2, 5, 10), may also be spontaneous (for example, children dancing, just to please yourself); may have a specific viewer (4) Or pay the audience (2), or publicly ornamental (10) in the world, or only the audience who is interested in this dance (3, 5). These dances may be part of the celebration, like a wedding and New Year (6, 8), or to become a cultural ceremony for specific purposes, like the Dahai Warriors Jumping Harbon Dance (7). Some dances, such as traditional dances in 1, ballet, require high level training skills; other dances, such as Kang Kang dance, need healthy body and strong physical fitness. The entertainment audience is part of the dance purpose, but the dance itself can bring fun to dancers (9).\n\nHuman proven animals for entertainment, there is already a thousand years of history. In order to make music, they will hunt them (rather than seeking food), and some people will hold a performance circus, bullfight, and a monkeys such as a specific day. For example, in an ancient Roman time, ancient Romans often live in the fun of the audience through the play of the animal. They watched \"Lions and bear dance in the music of the flute and the music; the horse is trained into a kneeling, bowing position, dance and performance ... The acrobats are on the wild lion, and jump on the wildlives.\" \"Performance of these violent conflicts with the beasts\", \"\" Over time, it becomes more barbaric and bloody. \" [114]\n\nThose entertainment for human beings, and forming a well-trained daily activities or \"behavior\" animals, including the flea in the circus, the dolphins in the whale fetus, and the monkeys of the street organ players. In ancient times, animals are often stored in the zoo, as an entertainment or a new thing with entertainment value. [115]\n\nMany animal competitions are now seen as sports - for example, horse racing is considered to be a sports and an important entertainment. Its economic influence makes it a global industry. In this industry, Ma is carefully transported to the world to participate in the competition. In Australia, the Melbourne Cup horses the game day is a public holiday, while the public regards this game as an important annual event. Just like horse racing, Tailong needs a human rider, but the game is not available. People feel very interesting to watch animal competitions, whether they are trained, such as horses, camels or dogs, are still trained, such as cockroaches.\n\nEntertainment is usually controversial, especially those that hunting wild animals. Some animal competitions, such as bear, bucket, and cruel games, have been used as public entertainment, which was banned due to some abuse of animals. Other controversies is still controversial. For example, for the game of shooting pigeons, \"the opponents believe this is a cruel, stupid shooting practice, and supporters think it is a kind of entertainment,\" both sides argue in court. [116] As an entertainment that requires horses and hounds, Bull is an entertainment with a strong drama effect, and has their own unique long-term cultural history. They are related to animals and are considered to be a sports, entertainment or cultural tradition. In animal rights protection tissues, some people worry about whether to use animals to entertain whether they are deprived of animal rights. [117] However, \"for many of many animal protection organizations and organizers organized by animals, both parties have their own cultural appeals.\" [118]\n\nCircus described as \"the most shameless entertainment\", [119] is a special drama show, including a variety of physical skills, such as acrobatics and juggling, and sometimes include animal performances. Usually the circus is considered to be in a huge circular tent, and the beginning is fixed at the beginning, and it changes to the tour performance.\n\nIn the second half of the 18th century, Philip Astley is called the founder of modern circus, while French actor Jules Léotard is said to create circus art and almost become a symbol of circus. [120] At the traditional British Expo, Astere's performance \"starts at least from the beginning of the 17th century\" is very common: \"Roll, rope dance, juggling, animal trays, etc.\". [119] Some people claim that there is no direct contact between the Roman Circus and the Modern Circus ... After the \"Roman Circus\" died, Asterley took the foundation of the circular theater before London, it was approximately 1300 curious onlookers gathered on the grass on the grass in the village. \"[121]\n\nThis kind of entertainment is called \"magic\" and is considered a performance, which is based on the tradition and text of the magical ceremony and religion of most cultural traditions since ancient times. (For example, some magic reference materials can be found in the following documents: the Bible, Hermensian, Shero Association, Kabara culture, the mysterious and mason's source.) [122]\n\nStage Magic can perform in front of various media audiences: on the stage, on TV, street, and dispatch or event. It is often combined with other forms of entertainment, such as comedy or music, and performance skills are usually an important part of the magic performance. Magic performance relies on deception, psychological operation, various forms of tricks and tricks to the audience a magician can complete the illusion of impossible things. The audience is amazed in Harry. Hudini's stunt performance and escape, for example, it will think he is a magician. [123] [124] [125]\n\nThe magician has an important role in the literary works of hundreds of years and provides entertainment for millions of readers. Since the 5 and 6th century, the famous wizards, such as the legend of Arthur, wrote an article. In the 21st century, young wizard Harry Potter. When he sold approximately 450 million copies on his book series (cut By June 2011), it becomes a global entertainment phenomenon reading, enters the list of historical bestselles. [126] [127]\n\nStreet entertainment, street performances and \"street art\" have been used in the form of performing the public entertainment needs for centuries. [128] This is \"part of London's life inseparable\" and also created the early 19th century \"full of wonders and recreational\" cities. [129] Wandering artists and bard poets are part of this tradition. Until now, there is still a street performance in the annual street art festival celebration. [130]\n\nThere are three basic forms of contemporary street performances. The first kind is called \"round\". It often gathers a group of people's performances, and performances usually have open curtains and closing ceremonies, bringing together street artists, 傀儡, magicians, comediants, acrobats, juggling actors, and even musicians. This type of performance may be one of the most profitable performances, because there are more viewers may have fun from the performance, so there will be a bigger amount of gift. A good street artist controls the crowd, so that the order of the sidewalk is not affected. The second form, \"bard\", there is no clear start or end. Usually, street artists will create a foreign atmosphere, usually use a singular instrument, while the audience may not stop listening or gathering to watch. But sometimes the tourists will incur a large-scale onlookers. The third form is \"station\", mainly in restaurants, bars, pubs, and cafes. This type of performance occasionally uses a public transport station as a performance site.\n\nThe cruise is usually held for a variety of purposes. Regardless of the cruise atmosphere, it is a public activity designed to attract attention and activities, which will inevitably affect the traffic order, but it also brings entertainment value to people. The horse team and its modern variant, the team, is an example of a tour. Some people who viewed or participating in the parade may be specially present, while others attend are purely casual. Regardless of the atmosphere, why is the purpose, parade attracts the audience and entertain them. Occasionally, the parade will happen in the temporary planned place (such as 5 in the ceremony), the audience is mainly sports audience, while the global audience can watch live broadcast.\n\n\"Kaixuan\" is one of the earliest paradis. At the triumphant ceremony, people show the shocking large number of foreign treasures and trophy bringing by the Roman generals from the victory. Everyone celebrates their victory; people will also show the conquered people and the nation to show themselves. The glory of victory. In the first 46th AD, Yulius Caesa chooses to hold a grand ceremony in the different days of this year to celebrate our four victories, and each ceremony can often grow up to one month [131]. In Europe, from the Middle Ages to Baroque Art, people welcome the official visit of a city, during the city streets, and various performances and exhibitions in various corners of the city. The annual London Mayor Parade (English: Lord Mayor's Show) is also an example of urban parade from the Middle Ages.\n\nMany religious festivals contain a yearly-forward recreational event under its serious connotation, such as the Holy Week Parade (English: Holy Week Process), which is also characterized by catching people and enjoying joy. Indian Houli Festival. Sometimes some traditional religious rituals have evolved for people's daily recreational activities, such as the Savior of Venice and the Salvation Dynasty (English: Festa Del Redentore). However, there is such as Christian Sheng Yama, Islamic Dynasties and Hindu Taoist Pilgrims may be a street demonstration show for outsiders, and for participants, the opposite is true, it belongs to its personal Spiritual tour, can't be called its entertainment. Therefore, the relationship between the audience and participants of such activities is completely different relative to the general entertainment. Taking the entertainment in the big pot is an example.\n\nCruises usually have gorgeous colorful performances to attract people's attention (7, 10). Sometimes there are commemorative activities (5, 8) or celebrations (1, 4, 6, 8, 9). Sometimes there will be serious main purposes, such as parade (1, 2, 5) of the military background (1, 2, 5) and even some of them have deterrent; there are some paragraphs of religious backgrounds, audiences can participate in some roles (6, 7, 10) ). Some activities have the latest technology elements, the ornamental distance is far (9), which may still have strong appeal to outsider and bystanders, and can be entertaining.\n\nSince the 17th century, fireworks have been part of many public entertainment and become the main characteristics of major celebrations, and have been welcoming. The gunpowder was originally used in ancient China, and ancient Europe was used in military use. The fireworks are most popular in the 18th century. At that time, people often pay high compensation for people with fireworks manufacturing, especially the Italians who were summoned to other countries due to manufacturing skills. [133] [134]\n\nFireworks and dramas are an important performance link in the court. Sudden noise, smoke symbolizes the brilliance of power, this kind of emotion thinks of his sovereignty, his prestige, and in his strength There is an irreplaceable sense of glory: \"A fear of others to show his glory, birthday, name day, wedding day, can come to provide others to celebrate the opportunity to celebrate the\" [135] Celebrating the Austrian throne inheritance war A fireworks ended were a fireworks that were \"famous\" in history, and the performance triggered a fire; [136] But the Han Del Torn \"Royal Fireworks\" for the accompaniment also became famous for the performance. In addition to the role of military victory, court performances, and individual celebrations, fireworks are also used in some religious ceremonies. For example, in Hindu History Poetry, \"Medica\", \"Dashavatara Tour\" in the Dashavatara Tour in the Temple, in the song and dance and fireworks \"[137].\n\nThe \"flame, 霹雳, and smoke\" of fireworks are still an important part of public celebrations and entertainment activities. For example, the fireworks show is one of the necessary sections of the world to celebrate the millennium: When the bell rings in the middle of the night, the new millennium comes, as the time zone across the local area, people use fireworks performances and open-air pairs to welcome New year arrival. Carefully organized a well-planned fireworks performance meets the world's all over the world, such as Sydney Harbor Bridge, Giza Pyramid, Athens, Moscow Red Square, Roman Vatican City, Berlin Brandenburg, Paris Eiffel Tower, London Large Warm building.\n\nSports is always a way in people's entertainment. Different from athletes, sports competitive viewers are often referred to as audiences. With the improvement of stadium conditions, the design of the audience and the emergence of live broadcasts, the scale of sports audiences is more and more, and the ornamental movement is also more popular. The world's most popular two sports are football and crickets, and their international competition International Football Association World Cup and cricket counterparts are widely sought after. In addition to direct participating athletes participating in the competition, sports competition is a major entertainment project in millions of viewers around the world. [138] The global charm of the charm bicycle race is a lasting competitive sports event. It is unusual to other competitive sports. It is not in the stadium, but in the country game. [139]\n\nIn addition to the world's attractive and competitive sports, there are Olympic Games. Its entertainment value also involves the national and its sports culture. For example, in American baseball and basketball is a popular entertainment form, Bhutan's national sports is archery, and New Zealand Dan's football is full, and in Iran is free wrestling. The pest to Japan contains a ritual element derived from a long history. [140] Sometimes, such as International Running Group Hash House Harriers, participants bring their integration and entertainment. And as a viewer's participation is large, its sociality is stronger than competitive.\n\nA event has gradually become moved, and it has evolved into an entertainment activity that is also affected by local climate and conditions. For example, modern sports surfing and Hawaii are associated, while skiing is more likely to develop in Scandinavia. Although these sports entertainment is widely spread in the world, the origin of the country is still known in the event. The climate can be created, and the Ice hockey in Canada is adapted to the climate.\n\nThe market and exhibitions have a long history. The market is often used to show the treasure, creative and exchange of goods. It is also existed while providing specific entertainment projects. [141] Whether it is in the Mediterranean market or in a small shop, \"Shopping can always provide some form of pleasure, let people stay away from everyday life.\" [142] However, in the modern world, \"marketing means become New Entertainment Form: Rotate the glowing sign, heavy music, ..., big screen, interactive computer booth, daytimetric day, ... cafe. \"[142]\n\nIn the nineteenth century, art, manufacturing, and commercial exhibitions have become international behaviors. They are not only popular, but also affect international concepts. For example, in 1878 Paris Expo (English: Exposition Universe (1878)) promotes international cooperation in concept, innovation and standards. From 1851 in the 1900 Paris, \"More than 200 million visitors have stepped into London, Paris, Vienna, Philadelphia, Chicago World Expo, and other small exhibitions around the world [141] [143].\" Second After the Second World War, there is a far exceeding 5 million visit to the revolving door of the Expo [144]. As a magnificent, an entertainment form, \"from the building, to the globalization model, then to the fundamental human identity\" [144] \", these exhibitions have nothing. \"The rise of the market, special store, and the art museum [145]\" has contributed to this world that emerging consumption and entertainment industry.\n\nSome entertainment activities such as large festivals (whether religious festivals or cultural traditional festivals), concerts, clubs, delegates and celebrations involve a lot of people. Starting from the earliest era, the people in the entertainment venues will face danger, especially when entertainment and consumer alcohol. For example, ancient Greeks have a wine (English: Dionysian MySteries), and Romans have pesticides. The consequences of excessive and people may lead to violation of social behavior, sometimes even cause injury or even death, such as at Altamont's free concert, an unexpected outdoor rock music festival. The serious things happened by nightclubs include casualties caused by stepping accidents; terrorist attacks, such as Balinese bombings for the night club; fire require special attention. After the fire in Rhode Island, the survey conducted in the United States showed that the lessons learned from early incidents (such as Cocoanut Grove Fire (English: Cocoanut Grove Fire) did not necessarily lead to continuous effectiveness. Change [146]. The efforts to prevent such events include appointing professionals, such as Misto, English: Lord of misrule, or staff in modern times, and controlling the work of people in crowds; and continuously improve the relevant standards such as construction safety. Tourism now believes that the safety protection of the entertainment venue is an important management work [147].\n\nAlthough national heads, rulers and powerful people can always provide them with entertainment costs, and in many cases, they will usually entertain or participate in on-site performances. The technical development of the 20th century means that the production of entertainment products can be independent from the audience, and the entertainment industry is packaged in commercial form. [148] [149] The industry related to the entertainment industry is called the entertainment industry, and the industry relies on business model to make, sell, spread. Or use other ways, even cover all types of performances [150]. The industry has become very complex, so that its economics become an independent field of academic research [151].\n\nThe film industry is part of the entertainment industry, including the Hollywood and Bollywood movie industry, as well as all of the British cinemas and European cinema, including France, Germany, Spain, Italy, etc. The sex industry is another special part of the entertainment industry, and the same form and media on the basis of the business are applied to the development, propaganda and sales of sexual products.\n\nAmusement park provides tourists with a roller coaster, a train, water-playing motor game facility, and Diablo, English: Dark Rides, other activities and related attractions. The park usually divides different regions in accordance with the theme of the project and equipment. Sometimes the entire amusement park is based on one topic, such as some ocean world parks, these amusement parks are the theme of marine life.\n\nThe development of the entertainment industry has created more types of employment opportunities. Although the work like writers, musicians and composers is like previously, people who are engaged in this work may be hired by the company, but will not look for opportunities as they used to. The new position has appeared, such as the lighting engineer or special effects of the movie industry, and the waiter in the amusement park.\n\nThere are many awards (English: List of awards) in a variety of entertainment branches. For example, there are excellent music, games (including video games), comics, comatures, theaters, TV, movies, dances and magic. But the sports awards depend on objective results and skills, not entertainment value.\n\nThe special building is used as an entertainment venue to accept the audience, which has produced many famous, innovative buildings, the most famous of which is theater. [152] For ancient Greeks, \"The theater reflects the importance of architectural design, which focuses on social community, in terms of work in the theater architecture, and in the theater architecture The details of the details are particularly obvious. \"[153] The Romans have built an elliptical stadium known as a beet. In modern, some large entertainment buildings have brought a famous gas for their city and designers. For example, the World Heritage Sydney Opera House; London's entertainment area o₂, including the indoor stage, music club, cinema and exhibition space; Germany's Bayer Festival Theater is designed and built for some specific music works.\n\nThe venue design is considered a large number of audiences when the two most important buildings are export speed and security. The speed of the Qingfang is very important for comfort and safety, because a large number of people take a long time to disperse from the poor venue, thereby producing safety risks. The Hillsburg tragedy is an example, indicating that bad architectural design may cause the audience to die. Line and acoustic is also an important design consideration of most theaters.\n\nIn the 21st century, entertainment venues, especially sports venues, \"It is likely to become one of the main architectural types\" . However, they need \"new ways\" for design because they need to be \"complex entertainment center, multiple experience places, can be enjoyed in a variety of ways.\" So architects must now design \"there are two distinct features Such as sports and entertainment centers host the audience, as well as the viewing and listening needs of the remote audience as a sports and entertainment studio.\n\nArchitects who challenge or constructing the ultimate architects sometimes have entertaining buildings, they are exceeded by public and customer expectations, and have excellent aesthetic value. The Bilbao Guheheim Art Museum, such as Frank Gale, is a building, which is both a tourist resort, and an important worldwide museum. Other seemingly useful buildings are actually stupid, deliberately constructed for decoration, and have not been considering practicality.\n\nOn the other hand, some buildings are designed for entertainment, also trying to cover their functionality. In the tourism industry, there are some buildings that are newly refurbished, which is actually unable to use their use. They are only redesigned in order to add a cultural experience of tourists. Buildings, history, and even some sacred spaces will also be made to purchase cultural goods. Such a deliberately designed tourist attractions cutting buildings and its original historical phase, leading to \"the difference between authentic historical history and the entertainment venues or theme parks\" [154]. The example of this category has a Toledo Castle Reserve in the history of serious civil war, which is converted from the slave bunker to the Ghana Coast Castle, and the indigenous culture of Libya [155]. Some special build buildings in the amusement park often reflect the theme of the amusement park itself, it is difficult to show and play a corresponding function.\n\nBy the twentieth century, the development of electronic communication media will provide entertainment products to the Global Volkswagen. The technology enables people to see, hear and participate in all entertainment forms, such as stories, drama, music, dance, where they are.\n\nWith the continuous development of miniaturization, the evolution of data storage devices such as card tape or disc can also promote the rapid development of entertainment technology. The development of computerization and barcodes also makes the ticket purchase easier and is no longer limited to the region.\n\nIn the 1940s, the radio is an electronic medium that is home entertainment and information. [156] [157] [158] In the 1950s, as a new medium, TV was rapidly popular in a global scale, and gave people visual entertainment; with only black and white TV at the beginning, it was derived from color TV. [159] In the 1970s, video games appeared; then, people began to play video games on portable mobile devices; in the 1990s, large online games gradually became popular.\n\nThrough entertainment products, people have been able to personalize the traditional entertainment. Not only can you choose your own entertainment products, such as a song, a movie, or a game; more you can choose when and where you can experience it. \"The portable media player is gradually popular, and the computer has become a more mainstream film consumption route\", under the common action of these two factors, the mass changes in the viewing method have changed. [160]\n\nThe rise of e-entertainment has produced some significant effects, one of which is a rapid decline in records and storage. The reform of the electronic media has been very rapid. The TV is a good example. In the only generation of people, as a standard medium that receives entertainment products, TV from unknown novelty, gradually spreads into a universal medium, and finally gradually Alternative to other media. [161]\n\nHas been predicted: By 2011, more than 30 percent of the US family will have a Wii game console. Compared with the following, \"In 1953, there are also 30% family with a TV.\" [162] Some people believe that: until the second half of the 21st century, online entertainment will completely replace TV - but this is not the case.\n\nThe so-called \"digital revolution\" has built a multinational market. Everyone wants to keep up with the pace of the revolution, which also has a lot of trouble for government agencies, business institutions, various industries, and individuals. [163] [166] Since then, even the sports venues will compete with TV, through the audience ... provide a comfortable and safe environment, and almost uninterrupted audiovisual information and entertainment content \" Fight for the audience with the TV media. [167] But this transition is affected by some instability, which may include some public places on TV dependence, such as hospitals and sanosium, etc .; in these places, television is considered to be a patient and resident. Or missing entertainment, unless these places have network coverage, TV will not be replaced in such locations. At the same time, the inheritance of the \"professional\" of the entire society has never been broken, which indicates that traditional entertainment is still inherited. [168]\n\nIn the 1910s, digital records (English: Digital Recording) replaced the simulation record (English: analog recording), and all electronic entertainment forms have begun technology fusion. [169] This convergence brings challenges to the film industry. Previously, \"said a film is successful, depending on the performance of the box office in the next weekend. Now, in addition to the box office in theater, a film will also pass a series of other issues, such as DVD, pay TV , Fiber video point is broadcast, in order to achieve its profits. \"[170] A shift in the movie industry is that some movies start to choose a video website as its own starting position. Media integration is more than just technical integration, but also the integration of culture, [171] is \"a decision to protect enterprise, policy institutions and other group benefits\". [160] This fusion leads to globalization and cultural imperialism in the cultural level [172].\n\nThere are also fans culture and interactive stories to tell, cross-media production, and have spawned a series of new trading models. [173] \"Today's audience can receive audio-visual signals, such as ground TV, satellite TV, cable TV, and Internet\", which also affect entertainment revenue, taking the stadium as an example, modern stadium needs Design considerations, how to make the audience and TV viewers can interact to the sports events through a variety of different ways, and in all, the audience can \"watch the wonderful return, view score data\", \"order tickets, purchase derivative products\" Almost \"no stay at night, you can get the resource information of the stadium\". [174]\n\nThe emergence of TV has changed the cost of entertainment products, enriches the content of entertainment products. The quality of entertainment products and its communication methods have also changed. Similarly, the integration of online entertainment has also brought similar changes. For example, in different commercial production, some content products today are customized according to user needs, these \"network audience leads to the recession of program production\". [175] Individuals and companies can spread their own content products on the film sharing website; whether individual independent creation, or the company's commercial production, these entertainment content are accepted and viewed equally.\n\nWith the development of technology, people's demand for entertainment products is increasing, and the speed of the entertainment industry has also accelerated. At the same time, some contents of entertainment have kept stable relatively stable; whether it is story, music, drama, dance, or game, these entertainment forms are inherently different in the form of entertainment in the past few centuries. "}