{"chinese_title": "chemical engineering ", "chinese": "Chemical engineering, referred to as chemical, is the general principle of chemical processes and physical processes in the production process of chemical industry (such as petroleum refining, plastic, metallurgy, food, printing and dyeing industry, paint and chlor-alkali industries) And regular, and use these laws to address engineering and technical disciplines for process and equipment development, design, operation and improvement. It mainly studies large-scale chemical composition and its mechanical and physical properties. Simply define the essence of chemical engineering, it is based on mathematics and a small amount of physical concepts in chemical industries, providing a factory for producing various chemicals or materials. It provides a most cost-effective response process design. Experimental research, theoretical analysis and scientific calculation have become an indispensable three main means of contemporary chemical research.\n\nThe theoretical basis of chemical engineering is mainly chemical, mathematics and physics. Including the branches of the above disciplines, such as:\n\nChemical engineering is based on its most basic concept-unit operation. Most people think George Davis invented this discipline in units, but did not actively develop it [1]. In 1887, he was considered an early pioneer of chemical engineering in the University of Manchester, England. As early as Davis opened this lesson, Henry Edward Armstrong has opened a degree program in the London City Research Institute; however, most employers prefer employ chemists or mechanical engineers. The foreground of the graduates of the course is not optimistic, so failed to return [3]. The relevant courses in the University of Massachusetts, England, and the relevant courses carried out in the University of London have also faced similar situations [4].\n\nLouis Norton has been awarded the first chemical program in the United States in the MIT in 1888 [5]. Norton's courses are all similar to each other, all of which are all similar to each other, all of which have been combined with chemical and engineering. At that time, the initial chemical engineers engaged in the Bank faced the identity problem. They one side like engineers, and on the other hand, it is not only a general chemist [3]. In 1905, William Walker introduced the theory of unit operations in their own curriculum [6]. In the 1920s, the unit operation has become an important part of chemical engineering in the aforementioned school and college [7]. The American Chemical Engineering Society established in 1908 (AICHE) is an important role in which chemical engineering has become an independent science. In addition, under its establishment and promotion, unit operations become the focus of chemical engineering [8]. At the same time, the Chemical Engineering Association (ICHEME) established in 1922 has established chemical engineering as an independent discipline [9] [10].\n\nIn the 1940s, only the unit operation is not enough to cope with the development of chemical reactors; however, units are still in an advantage in the chemical curriculum of the United Kingdom and the US colleges. Until the 1960s, the delivery phenomenon began to receive a large attention [11]. Transfer phenomenon provides a systematic analysis of chemical engineering [12]. The development of chemical industry before and after the Second World War is mainly led by the Petrochemical Industry, but other fields have also developed [13]. In the 1940s, the biochemical engineering and pharmaceutical projects have begun, technology is sufficient to produce hypertrophy, streptomycin, etc. [14]. At the same time, the development of polymer science in the 1950s promoted the rise of later plastic industries [15].\n\nWith the rapid development of computer science, it greatly simplifies the complex process of manual calculation and hand drawn. The completion of the human genome program is not only the progress of chemical engineering, but also is considered a major development of genomics and genetic engineering [16]. The principle of chemical work is also used in a large number of nucleic acid sequences [17].\n\nThe following concepts often use in chemical engineering:\n\nThe chemical engineering field contains control factory procedures and conditions to ensure the best operation of the factory. The chemical reaction engineer uses laboratory data and chemical thermodynamic physical parameters to construct an analysis model or design reactor, and thereby solve problems and predict the performance of reactors. [18]\n\nUnit operation is a physical step in the chemical engineering program, such as crystallization, filtration, drying, and evaporation. These units are combined to operate, and the reaction is prepared, purified and separated, recover the remaining reactants and the energy conveyance in the reactor [19]. On the other hand, the process of one unit and unit operation are chemically equivalent; with a unit operation, several unit processes constitute an overall processing process. Unit process, such as nitriding or oxidation, etc., involving a large number of biochemical, thermochemical transformation methods. Engineers responsible for these are called \"program engineers\" [20].\n\nThe use of delivery phenomena is very common on the industrial line, including fluid mechanics, heat delivery, and mass delivery, etc., further involves moving transport, energy conveying and chemical delivery, and the like. When the promotion of three different levels of different levels of expressions, micro and molecules, etc., the basic equation used is very similar; therefore, when learning and transporting, there is a comprehensive and multi-multimsychochron. [twenty one]\n\nThe chemical engineer specializes in finding and constructing the most affordable production methods, and its consolidation has a focus on cost issues such as raw materials and energy [23]. Chemical engineers use chemical and engineering knowledge to convert unprocessed low-cost materials into high-cost useful products such as drugs, petrochemical products, and plastic. They also focus on pollutant emissions and research. There is a large number of computers to assist in applications and research [22].\n\nChemical engineers may engage in industrial production or academic research; they specialize in design or experiments to find and establish more excellent production methods, pollution control, saving resources, and safety. They may be specially designed and constructed factory project engineers. In the field of chemical industry, engineers use their expertise to choose factory equipment, control the maximum production and cost of production production and cost, and is engaged in the upgrade and maintenance of future continuation factories. [24] The chemical engineer may be employed by the management plant in a lifetime; via, it is also possible to become a professional consultant, handling and assisting chemical related issues.\n\nUsually at least university degree, there is a relevant license to have a different degree effect, such as chemical B, Chemical B, C, C, Chemical prophet, etc.\n\nToday, chemical engineering research is very diversified, covering many fields such as traditional chemical industries, materials science, biotechnology, and NiM technology. "}