{"chinese_title": "archeology ", "chinese": "Archaeological (English: Archaeology or Archeology, from the ancient Greek: ἀἀχαι;; ἀἀχ ῖῖῖς, arkhaīos, \"ancient\"; and -λογ, -logiā, \"learning\"), for the past human society, mainly through reconstruction Analyze the material culture and environmental materials of the ancient people, including equipment, buildings, and biology (English: Biofact (Archaeology) and cultural landscape (English: Cultural Landscapes). Due to the many different research procedures, it can be identified as a science and one-person literature, [1] and in the United States, it is a branch of anthropology; [2] is an independent discipline in Europe; Archaeological is an important part of history.\n\nArchaeological study human history, from the world's earliest stone buffer's development from the past, until modern times. [3] This discipline is the most important historic research discipline. There is no textbook in the prehistoric age for historians, and this era accounts for more than 99% of human overall history, from the old stone age until the writing text appears. [1] Archaeological has a variety of different goals, scope from the study of human evolution to cultural evolution and understanding of cultural history. [4]\n\nArcheology includes a site survey (English: Archaeology Field Survey), discovers (English: Excavation (Archaeology)) and final analysis of the collection of information in order to know more human. As far as the macro vision, archeology lesmunications analysis, subject to assistance from anthropology, historical, genetics, evolutionary biology, biotechnology, art history, classic, ethnology, geography, [5] Geology, [6] [7] [8] Linguistics, Physics, Information Science, Chemistry, Statistics, Guqi, Ancient Zoology, Ancient Biology, Ancient Chinese Botany (English: Paleoethnobotany) and Ancient Plantics .\n\nArchaeological was developed by European Collection (English: Antiquarianism) in the 19th century. From then on, it becomes a discipline throughout the world. From the beginning, the archeology of various specialty has developed, including the ocean archaeological (English: Maritime Archaeology) and archaeological astrictions, and diverse science and technology to assist archaeological investigations. However, today's archaeologists face many questions, including facing pseudo colleges (English: Pseudoarchaeolog), stiishing plunder, and discovered against humanity.\n\nThe archaeological of Chinese comes from Europe, and archaeological in European Chinese comes from the Greek αρχαίολόγί, this word is composed of ρχχαίος (meaning ancient things or ancient) and όγ (intention to science), in ancient Greek Refers to the study of ancient history. In the 4th century AD, Plato used this Greek word to refer to the study of ancient history. This word is rarely used for a while, and is reused in the 17th century to represent the study of antiquities and monologues. In the 17th, 18th century, the main refers to the art in the organs, in the 19th century, it refers to all the antiquities and monuments.\n\nChina has \"ancient learning\" in the 1-2th century (Eastern Han Dynasty), to refer to the study of ancient learning. When I got into the Northern Song Dynasty (11th century), a study of the study of bronze priests and stone carving - Jinshi learning, the predecessor of archaeological. At this time, \"Test\" \"ancient\" is also started. The \"archaeological figure\" of the 1092 year has taken the lead in using the word \"archaeological\", but at this time, it is an ancient writing and ancient article.\n\nCirciaco Pizzecolli, Ciriaco Pizzecolli, 1391 - 1453), many times to record his discovery of ancient buildings and substances. Based on this reason, he is called the father of archaeological.\n\nModern archeology originated in Europe in the mid-19th century, it developed after geological scientific research. Geology is presented, the age of the earth is billion, rather than thousands of years widely approved at the time. Soon after this, 1859 Charles Darwin published a book of \"species origin\", outlined his evolution, and eventually leading to scientists to believe that human beings have millions of years of history, thereby providing a time limit, can flourish Develop archaeological research. At the same time, in the 1836 Denmark Historian Christian, a Ledetraad Til Nordisk Oldkynd, in 1848, it is translated into English, and he proposes to put European prehistors. The historic area is divided into three decades, high stone era, bronze age and iron era, which is based on the materials used in humans. These three concepts, including human antiquities, evolutions and three-decorative systems, often considered to be the cornerstone of modern archeology. [9]\n\nSoon, early archaeologists began to investigate the various regions of the world, and the research of ancient Aegean civilization was stimulated by Heinrich Schuriman in Troy, and Arthur Evans excavated in Crete. John Lloyd Stephens is a key figure that re-founds Mayan civilization throughout China. However, in accordance with today's standards, the methods used by these archaeologists have great defects, often with the prejudice of European centralism, and many early European archaeologists often rely on Edward Burnet Taylor and Louis. The anthropology and nation of the humanology and nation of Henry Moore, thereby comparing the modern \"barbaric\" crowd, such as the European nation of the Aboriginal people in the Americas and living in a similar society in history.\n[10] Soon, this newly founded archaeological spread to North America, excavating the ancient Indian remains by Samuel Huang and William Henry Holmes. [11]\n\nThe archaeological field research method is further developed, and it appeared in the late 19th century. One of the people who blew the ear, was Augustus Pitt Rivers, and he carefully explored the Cranborne Chase in the southern England, stressed that it should be recorded, not only a beautiful or valuable project, but also Included secular items; therefore he assisted archeology from Antiquarianism. In the late 19th century and early 20th centuries, several other important archaeologists further improved this discipline, they were Flinders Petri (he excavated in Egypt and Palestine), Motomo Whele ( Sir Mortimer Wheeler, India, Dorothy Garrod, in the Middle East, Max Uhle (Peru), and Alfred Kidder (Alfred Kider, Mexico). [12] In the whole 20th century, archaeological further adaptation and innovation, especially in the 1960s, when Georg Bath promoted maritime archaeology, urban archaeological (Urban Archaeology), with many European urban renewal development More common, rescue archaeology] is incorporated herein by increasing business development. [12]\n\nArchaeological purposes are more about the facts about the past society and human development. Human has more than 99% of history in prehistoric history, and the human beings did not use text, so they did not leave a record of their own text for us to study. Under the resource that is lacking such a writing text, the only way to understand the prehistoric society is archaeological. Many of the major development of human history occurred in prehistoric history, including human evolution in the old stone era, at the time in Africa, the people came from the southern part, and eventually became contemporary wise people. Archaeological also identifies the evolution of many human technology, such as the ability to use fire, the development of stone, the invention of refining, the source of religion, and the creation of agriculture. If there is no archeology, we have no understanding of the evolution and technology changes in humans without writing text. [13]\n\nArchaeologists are not fully served with an archaeological theory orientation. When archaeology began to develop in the late 19th century, the first archaeological theory orientation is a cultural history archaeological (English: Cultural-History Archaeology). It has the goal of explaining why culture changes and adjusts, not only emphasizes these cultures. The fact that has been generated, therefore emphasizing historical specialory. [14] In the early 20th century, many archaeologists have studied the past society with existing society (such as the Societies, Siberians, Chinese Americans), they followed the direct historical orientation (English: Direct Historical) Approach, compared to the continuity between the past and the contemporary ethnic group and cultural population. [14] In the 1960s, an archaeological movement led by the American archaeologist and Fu Can Rui (English: Lewis Binford) and Fu Can Rui (English: Kent Flannery) against an archaeological movement, which was archeologted at that time. [15] [16] They proposed a \"new archaeological\" with more scientific and anthropology, with hypothetical testing and scientific methods, which was later called the process archeology. [14]\n\nIn the 1980s, a new modern movement was raised by British archaeologists, including Michael Shanks (English: Michael Shanks (Archaeologist)), [17] [18] [19] [20] Christopher Tilley (English : Christopher Tilley, [21] Daniel Miller (English: Daniel Miller (Anthropologist)), [22] [23] and Ian Hoven, [24] [25] [26] [27] [28] [29 ], This later referred to as post-processor archeology. It questioned processism's demand for scientific trials and impartiality, and emphasized the theoretical reflection of self-criticism. However, post-processism is criticized by processism as a lack of scientific enthusiasm, and scholars still argue with the effectiveness of processism and post processism. At the same time, another theory \"Historical Processualism\", seeking to integrate a focus, placed in the process and postpartial archeology, stressing and historical. [30]\n\nToday's archaeological theory has been borrowed from a wide range of theoretical ideas, including evolution, phenomenology, postmodern, structural and ability, cognitive archeology (English: Cognitive Archaeology), functional, gender archeology (English: Gender Archaeology ) And femaleist archeology (English: feminist archaeology), and archaeological system theory (English: systems theory in archaeology, etc.).\n\nAn archaeological survey often contains several clarity, and each stage is a unique research method. Before any actual archaeological work, archaeologists must first consensus on the clear goals you want to reach. After doing this, an archaeological field survey on a site (English: Archaeological Field Survey), and discovers information about this site and its surrounding area as much as possible. Second, launch an excavation work to collect any archaeological characteristics burying underground; third, study the information collected from this excavation and assess whether to reach the original set of research objectives in archaeologists. These information is then published so that the use of other archaeologists and historians, and scholars determine this is a good act, even if it is sometimes ignored. [31]\n\nAs most disciplines, there are many branch disciplines in archeology. Some ways are somewhat based on specific research methods or material types (such as: stone analysis (English: lithic analysis), prehistoric music (English: prehistoric music), archaeological plants Learn (English: Archaeobotany), geographic or era (eg Near East Archaeology (English: Near Eastern Archaeology), medieval archaeological (English: Medieval Archaeology), other themes (such as: Ocean Archeology (English: Maritime) Archaeology, Sport Archaeology (English: Landscape Archaeology), Battlefield Archaeological (English: Battlefield Archaeology), or a specific archaeological culture or civilization (such as: Egypt, India, Hanology).\n\nHistorical archaeological research has already had a culture of a text.\n\nIn the UK, archaeologists have discovered some medieval village sites, they were discarded after the 14th century crisis, and found the layout of the 17th century flower garden, and later people no longer use this layout due to the changing style. . In New York City, New York City, archaeologists have explored the 18th-century African-American cemetery, now becoming the African Cemetery National Monument (English: African Burial Ground National Monument).\n\nNational archeology is an archaeological study on the current population. [32] [33] [35] [36] [37] This orientation emphasizes the theory of mid-course in the 1960s, which is a feature of the process of process.\nEarly national archaeological research will focus on hunting or search society. National archeology continues to be a strong component of the post or other contemporary archaeological research orientation. [38] [39] [40] [41]\n\nThe national archeology uses national grams to improve their ratios, and then use these ratios to interpret the archaeological records. In short, the national archeology is to use national grams to use in archeology. [42]\n\nExperimental Archeology (English: Experimental Archaeology) is an observation of experimental methods to develop more highly controlled to analyze those processes that create and affect archaeological records. [43] [44] [46] [47] In the case of logical trial, process theory has a scientific enthase of the scientific entity in an archaeological understanding, and the research method becomes important. Inference in improving interpretation of archaeological records Face, experimental technology is still an important component.\n\nAlthough archaeological can be a pure science, it can also be an application of science, namely the archaeological site to face the development plan. In this case, the archeology has become under the management of cultural resources, and a funded research activity is called cultural asset management in the UK (HERITAGE MANAGEMENT). [48] ​​Today, cultural resource management covers most of the archaeological research in the United States and Western Europe. In the United States, since 1966 passed the National Historical Maintenance Act (National Historiic Preservation Act) (NATIONALIC PRESERVATION ACT) (NHPA NHPA), cultural resource management archeology became focus on focus, and most taxpayers, Scholars and political figures believe that cultural resources management assist US preservation history and prehistoric history, avoiding loss with the expansion of the city, reservoir and roads. In addition to other laws, national historical maintenance law enforcement, plans to be implemented on federal land or programs involving federal funds or ratings must consider the impact of this plan for each archaeological site.\n\nCultural resources management in the UK scope of application is not limited to government-funded plans. Since 1990, the plan policy policy shall be planned: Archaeological and Plan (English: PPG 16) [49] Requires archaeologies to be considered an consideration factor decided to decide the new development plan (English: Material . Therefore, there are many archaeological organizations to install the cultural heritage to reduce the cultural heritage and reduce the cultural heritage, according to the principle of pay fees, according to the principle of contaminants. Part of the cultural relics must also be preserved to avoid damage.\n\nThe object of archaeological research is the real thing. Mainly the remains of material, or is the relics and remains. These remains should be left behind by ancient human activities. Archaeological research focuses on past research, including the various materials left by the past culture. So its research object is an ancient times before a certain period of time. such as\nThe British archaeological lower limit is Normans' invasion (1066),\nFrance is a destruction of the Gallolin dynasty (987),\nAmericas are Columbus discovering new mainland (1492),\nChina is generally the lower limit in the DPRK (1644).\n\nIn recent years, the Medieval Archaeology (Medieval Archaeology) in the UK has advanced the time limit to 1640. Industrial Archaeology in the Americas, Industrial Archeology, studies the relics of the early in the modern industrial industry. With the advancement of the times, these lower limits will naturally go backwards.\n\nSome disciplines commonly used in archeology:\n\n第 地 学报 - 体 学报 - 古 动 动 - 古 动 - 古 - Physics - Chemistry - Ethnology - Folk - Sociology - History - Religious - Linguistics - Natural Science - Art History - Architecture - Strati "}