{"chinese_title": "Electrical Engineering ", "chinese": "Electrical engineering is based on physics branches such as electronics, electromagnets, covering an engineering in the field of electronic, electronic computer, power engineering, telecommunications, control engineering, signal processing, mechanical electronics. Since the second half of the 19th century, with the commercialization of telegraph, telephone, electricity in supply and use, the discipline has gradually developed into a relatively independent professional field.\n\nThe motor engineering covers branches in this field, but in some places, the meaning of \"Electrical Engineering\" (English: Electrical Engineering) sometimes does not include \"Electronic Engineering\" (English: Electronic Engineering). In this case, \"Electric Engineering\" refers to a power system involving a large energy (such as electricity transmission, heavy motor machinery and electric motors), and \"electronic engineering\" refers to the electronic system that handles small signals (such as computer and physical circuitry). ). [1]\n\nAnother difference is that the power engineer focuses on the transmission of electrical energy, and electronic engineers focus on the use of electronic signals. The range of these subsequators will sometimes overlap: For example, power electronics use power electronic components to convert and control electrical energy; another, such as smart grid detecting electrical energy suppliers and general homes' electrical use And according to it, the power consumption of the home appliance is adjusted to achieve energy, reducing loss, and enhance the reliability of transmission network. Therefore, the motor engineering also corresponds to the expertise in the field of electronics engineering.\n\nSince the beginning of the seventeenth century, the phenomenon of electricity has become a scientific exploration topic. William Gilbert is probably one of the earliest motor engineers. He first designed an electrostatic electrostatic electrostatic electrostatic electrostatically existing in electrostatic charge, and the first clearly distinguish between magnetic and electricity, and the term \"electricity\" Name [2]. In 1775, Alexandrovolites Make a scientific experimental improvement improvement of the electricity (Electrophorus) that can be used to make static charges. In 1800, he succeeded in developing a volt pile capable of continuously generating a relatively stable current, and is the earliest chemical battery. [3] However, related studies have been officially launched until the 19th century.\n\n\n\nIn 1827, the Ohge's law proposed by Glorue Oim indicates the quantitative relationship between the current, voltage and resistance in the circuit. In 1831, Maiki Farah found electromagnetic induction. In 1873, James Maxwell integrates the previous people in the book \"Electromagnetic Unit\", and proposes the Maxwell Equation Group to open the classical electric mechanics [4].\n\nSince the 1830s, all kinds of efforts made to electromagnetic knowledge are finally achieved, that is, telegraph technology. In the 19th century, due to the emergence of land-line, the seabed cable and the 1390 wireless newspaper (Wireless Telegraphy), fast communication finally achieved, and the whole world's communication construction is also changed.\n\nIn order to ensure that it does not encounter difficulties and misunderstandings in terms of application of electromagnetic theory, it is especially necessary to develop a simple and convenient scale standard unit. Research on this area has prompted the setting and adoption of international standard units, such as volts, ampere, Coulomb, Farah and Henry. This international standard system reached a consensus in Chicago in 1893, [5] thus laid the foundation of various industries for the future progress of the standard unit system. Many countries immediately legislate to recognize that these international standards are valid. [6]\n\nIn these decades, motor engineering catenarily was classified as a branch field of physics. In 1882, the University of Damsta Agent University in Germany set off the world's first motor engineering professor seat. In the same year, the Physics Department of the Massachusetts Institute of Technology began to launch a bachelor's degree program in the direction of motor engineering. [7] [8] In 1883, the University of Damsta Technology established a motor system to create a university in the world. [9] In 1885, Cornell University became a university in the United States. [10] In 1885, the University of London founded the first \"motor technology department\" in the UK. The first director is John Fleming, and has changed to the motor engineering department in several years. [11] In 1886, Missouri University has also established a system of motor engineering. According to some literature, Missouri is the first American university [12] very quickly, including the University of Georgia Institute of Technology. Establishing a motor engineering system.\n\nAfter decades of development, the application field of motor engineering is sharply expanded. In 1882, Tom Mas Edison built the world's first large power network to provide a DC electricity of 110 volts to 59 people in New York Manhattan. In 1884, the Sir Charles Parsons invented the steam turbine engine. Now, the use of turbine engines conversion from a wide variety of thermal energy, with a total of 80% of the world's energy usage.\n\n\n\nIn the late 1880, two civilized confrontations of different power transmission methods were witnessed. Original DC-current mode uses direct current to transmit electrical energy, newly occurring AC-like communication uses AC power to transmit electrical energy, this triggered a so-called \"current war\". [13] AC power generation technology is excellent in power transmission technology, especially the AC allows the use of transformers to increase or decrease (this is a large lack of direct current). In addition, the use of high voltage alternating current is greatly extended, and the transmission of electrical energy transmission is greatly expanded, and the safety and efficiency of power transmission is boosted using transformers. Due to the above advantages, the AC power supply is gradually replaced by DC power supply.\n\nDuring the development of radio technology, many scientists and inventors have contributed to radio and electronics, respectively. In the classic experiments made in 1888, Heinrich Hertz transmits and receives radio waves of the wireless wave band using motor equipment to confirm radio waves. In 1895, Nikola Tesla was launched from the New York West Point from the New York West Point from the New York Laboratory. [14].\n\nAt 1897, Carl Braun began to assemble the cathode ray tube in the oscilloscope, and the cathode ray tube also became the key zero component of the television [15]. In 1904, John Fleming first invented the diode. Two years later, Robert Von Lieben and Li Decrest independently invented a vacuum tube capable of magnifying current Body (also known as \"Pragmators\") [16].\n\nIn 1895, Goleier Maribi further improved Hz's radio transfer method, extending the transfer distance of the wireless telecommunications number to 1.5 miles (2.4 km). In December 1901, in order to confirm that he has mastered the technology of more advanced transmission radio waves, he can not be affected by the Earth's curvature. He launched the wireless telecommunication number from the UK Cornwall launching station, crossing the Atlantic Ocean. On the other side, Canada Newfoundland St. Johns, actually received the signal, between 2,100 miles (3,400 km) between two places! [17] In 1920, Albert HULL invented a vacuum tube-magnetron that generated microwaves (Magnetron). In 1945, the PERCY SPENCER has successfully developed a microwave oven [18] [19]. In 1934, under the guidance of Harry Wimperis, the British Army began using microwave technology to develop radar in Bowdsey, and started to operate in August 1936 [20] .\n\nIn 1941, German scientist Kangrad Chuze showed the world's first full-featured programmatic computer, ie Z3 system. In 1943, Tommy Flowers designed and made a dummy computer, which is an unprecedented, fully utilized fixed procedures made of electronic components, can be used digital computers. [21] [22] On February 15, 1946, the US Army was developed by US Army Investment in the Second World War, in the Pioneer John Mauchly, John Iraq Under the supervision of John Eckert, it was born in Pennsylvania University. ENIAC is generally considered to be the first \"general use\" electronic computer in the world, and its invention is an important milestone in the history of modern computer development [23].\n\nIn 1947, William Xiaochli, John Pudding and Walter Bourdon, working in Bell Laboratory, invented solid state crystals. This is one of the most important inventions in the twentieth century. The electrosphate has the advantages of volume production, miniaturization, low cost, and the like, and almost all modern electronic products require electrical crystals. Because \"research and discovery of the semiconductor\", Xiaokeley, Patin and Bamon won the 1956 Nobel Physics Award.\n\nIn 1958, Jack Kilbe and 1959 Robert Nuis independently invented the actual circuit [24]. Applying a physical circuit technology, a large number of microelectric crystals can be integrated into a small wafer, providing a possibility for the occurrence of microprocessors. Intel Corporates Intel 4004 microprocessor in 1971 is the world's first microprocessor, which is designed with his team with his team with his team. It can perform 4-bit operations in the United States Hoff. In 1973, Intel was also designed to successfully eight-bit microprocessor Intel 8080, and an Intel 8080 was configured inside the first personal computer Altair 8800. [25] The current single large-scale integrated circuit chip can integrate more than 1,000,000 transistors. [26]\n\nMotor engineers usually pass through \"motor engineering\", \"electronic engineering\" or \"power electronics\" famous education. Although the focus of various degrees is different, they are mostly required to learn a series of common basic courses. Completion of schools generally take four or five years. Since the nature of the school is different, students may be granted by bachelor, Bachelor of Science, Bachelor of Technology (Bachelor of Applied Science) after completing the school. Journal of Bachelor Of Technology Science. Master's bachelor's degree in motor engineering requires students to learn physics, mathematics, computer science, etc., complete one or more project designs related to professional knowledge applications, and elect other courses related to motor engineering. These preparation courses will allow students to learn the basic principles and basic practical skills of motor engineering. Subsequently, students can choose one or more sub-disciplines according to their own focus and interest until graduation. In many schools, electronics engineering is included in motor engineering, others believe that the academic knowledge of the two governments is wide enough and can be developed. [27]\n\nSome motor engineers choose to continue the graduate phase after graduation, strive to obtain graduate degrees, such as Master of Engineering, master's degree, or specialist in Ph.D. Engineering Doctorate degree. Master of Motor Engineering consists of course operations, studying both or one of them. The doctoral course is more focused on topic, often is considered to be the starting point of the academic career of motor engineers. In the UK and some European countries, engineering master's degree is often considered to be a smaller extension of undergraduate degrees, rather than graduate students in strict sense. [28] [29]\n\nIn many countries, the bachelor's degree from the engineering discipline represents the first step in professional certification, and the bachelor's curriculum itself needs to be certified by a professional institution. After completing the certification course, engineers must meet a series of requirements (including the requirements of work experience) to eventually obtain the corresponding professional certification. Engineers can get registered engineers or other similar certificates (licenses). For example, in the United States, Canada, South Africa, these engineers can officially become the \"Professional Engineer\", which is called \"European Engineer\" in the European Union.\n\nIn different regions, professional certification will bring different degrees of benefits to engineers. For example, in the US and Canada, only certified engineers can issue public or private projects. [30] In many countries, government agencies have made this provision in the laws of state and provincial, such as Quebec's Engineers ACT. [31] In other countries, there may be no such mandatory regulations. However, most professional certification agencies have set a series of rules and regulations to constrain engineers, and they are likely to be removed if they violate them. [32] In this way, the industry organization plays an important role in the standardization and standardization of engineering professional fields. However, even in the professional certification jurisdiction, engineers must still abide by the contract. In some cases, engineers' work failure may be considered faulty and even play. They must also consider the influence of engineering in environmental protection during operation and follow existing laws and regulations.\n\nThe electronics engineer learns is one of the most authoritative professional institutions in the field of motor engineering. The association claims that academic literature related to motor engineering is from its members. It has 430000 members worldwide, holds more than 300 academic seminars per year. [33] Another famous organization of the UK Engineering Technology Association (IET) published 21 academic journals, with more than 150,000 members worldwide, claiming to be Europe's largest professional engineering organization. [35] [36] In the field of motor engineering, professional knowledge update is very frequent. In order to maintain work efficiency, engineers usually choose to participate in various professional organizations, regularly pay attention to new trends in the industry, and participate in continuing education - this is quite necessary in the industry.\n\nIn Australia and the United States, motor engineers account for approximately 0.25% of total labor force. As of 2006, 300,000 employees in the American motor engineering related fields, this number is 17,000 in Australia (2008), which accounts for about 0.2% of the labor force. Australia reported 96% of its domestic male motor engineers. [37] [38]\n\nMotor engineers have made important contributions to many modern science and technology products, and the crystallization of motor engineering can be seen everywhere in modern technology products such as global positioning systems to power generation systems. Engineer design, development, testing and monitoring motor systems, installation and deployment of electronic equipment. For example, they Participate in the design of the telecommunications system, the operation and maintenance, building lighting and power supply system of the power plant, the power control of household appliances and industrial machines. [39]\n\nThe basis of motor engineering is physics and mathematics, and these two basic discipline help engineers obtain quantitative and qualitative descriptions of electrical system work. Today, most engineering disciplines involve the use of computers, computer-aided design is also very common in design and testing of electrical systems. Despite this, for engineers, the initial idea is still crucial.\n\nAlthough most motor engineers can understand the most basic circuit analysis knowledge (such as related resistors, capacitors, diodes, transistors, and inductive components), the theory of applications is still different. For example, quantum mechanics and solid physics are more important for engineers engaged in large-scale integrated circuit design, and more focused on signal processing and related mathematical knowledge (such as discrete Fu Li). Leave transform) and relatively basic circuit analysis knowledge. The expertise of different branch disciplines is distinguished, but in general, mathematical computing power, basic computer technology, and understanding of industry terms are also valued by each branch discipline.\n\nFor many motor engineers, technology is just part of their daily work, they often discuss, plan project budgets and project progress with customers. [39] Many senior engineers will manage a technical team. For them, project management capabilities are quite important. Many factory technical projects involve a record and writing of a variety of documents, so good writing, communication skills are also not ignored. The working environment of the motor engineer is distinguished according to their professional focus.\n\nMotor Engineering has many branch disciplines, which are listed below. Several most widely known disciplines. Many motor engineers work only focus on one of the branches, and some will involve overlap of multiple branch disciplines. Some areas, such as electronics engineering and computer projects, are considered relatively independent disciplines.\n\nPower electronics mainly involves several steps of energy generation, delivery, distribution, and some related equipment design. These devices include AC-DC converters (rectifiers, choppers, inverters and inverters), transformers, generators, relays, special high-voltage applications and other power electronics devices. Most government will invest and maintain the power transmission network system to connect each large generator and power users. By connecting the electrical appliance to the grid, the user can obtain electrical energy in the form of a commodity without the need to purchase generator power generation. The work of power electronics engineers is mainly designed and maintained for power grids and connected power systems. This \"Internet\" facility gives additional electrical energy of the grid, or will consume electrical energy, or combine these two operational capabilities. Another type of power system known as \"down network\" is superior to the \"Internet\" system in some cases, for example, on a travel vehicle that cannot be connected to the grid. Using satellite control power systems is one of the directions of power electronics research, with a real-time feedback system, it can avoid power fluctuations and reduce the probability of power outage. For example, China's Beidou Satellite Navigation System provides a unified timing system for automation scheduling, fault accelerry, relay protection, monitoring system, and power plant unit automation, so that each subsystem can be accurate and unified. Standard stability work. [40] [41]\n\nControl engineering is mainly focused on modeling of complex dynamic systems and design controllers to promote dynamic systems to evolve according to ideal. The control engineering is widely used, such as the flight system of civil aviation aircraft and promotion system, car cruise settlement system, etc. Developing excellent control theory is one of the premise of improving industrial automation. Engineers will use electronic circuits, digital signal processors, microcontrollers, and programmable logic controllers to implement embedded systems. With the development of technology, the control system itself is getting smaller and smaller, and the power loss is getting lower and lower, but the function is constantly improving. [42]\n\nControl Engineers will often use feedback on this concept when designing control systems (Control System). For example, a car with cruise speed function continuously monitors the speed of the car, and reports to the control system, then control the system to adjust the output power of the internal combustion engine according to the current vehicle. If the control system can get feedback regularly, the appropriate response can be made in accordance with the control theory.\n\nThe scope of electronics engineering covers the design and testing of electronic circuits composed of electronic components such as resistors, capacitors, inductors, diodes, electrostatics. Basic analog circuits, digital circuits are basic elements that form any modern electronic information system. [43]\n\nBefore the Second World War, the research scope of electronics engineering is only limited to various communication technologies, radars, commercial radios, and early TV technology. After the war, as consumer electronics began to be developed, this area quickly expanded to modern TV, radio system, computer and microprocessor. In the second half of the 1950s, the term \"electronic engineering\" has gradually replaced \"radio project\".\n\nBefore the integrated circuit was invented in 1959, the electronic circuit was also manually mounted by the discrete electronic component. The disadvantage of these discrete electronic circuits is that the occupied space is large, low electrical energy efficiency, limited speed, but still usage in some special application areas. The integrated circuit can integrate a large number of microelectronic components (mainly microelectric crystals) to a small wafer of approximately coin sizes. This also provides possibilities for manufacturing high-function computers and other electronic devices that are visible everywhere today.\n\nMicroelectronics mainly study the design and microfabringation of extremely small size circuits in the integrated circuit. This minimal size circuit can also be individually used as a general electronic device. The most common microelectric devices include semiconductor transistors, resistors, capacitors, and inductors, which can be processed to microscopic sizes. NACT is more advanced, and the research range also turns to the feature size to reach the nanometer-level device. Modern electronic devices have reachedana-level, 100 nano-process technology has also become industry standards in 2002.\n\nThe manufacturing process of the microelectronic device requires physical and chemical processing of silicon (in high frequency occasions) wafer for physical and chemical processing of compound semiconductor such as arsenide, indium phosphide, and other compound semiconductor) wafers. Transmission and current control (in the microelectronics, the higher the higher). When studying these manufacturing processes, many chemical, material science knowledge is required, and the quantum mechanical effects of electrons must be considered under low feature sizes. The base semiconductor device includes a diode, a bipolar transistor, a metal oxide semiconductor field effect electric crystal, and a metal semiconductor field effect tube. [44]\n\nSignal processing refers to the analysis and control of signals. The signal can be divided into an analog signal and a digital signal, where the former is continuously changed with the real information, and the latter changes based on a series of discrete quantities representing real information. Analog signal processing generally involves an audio device amplifying or filtering audio signals, telecommunications devices modulation, and demodulation telecommunications signals. The analog signals and digital signals can transform each other by analog digital converters. As the foundation of modern multimedia technology, digital signal processing often involves data compression, error correction, error correction, especially linear, unchanged system theory, Fourier transform, and other basic theories. [45] [46]\n\nSignal processing involves many mathematical theories and a large number of mathematical operations. With the development of communication, control, radio and television, power electronics, biomedical engineering, etc., the application range of signal processing is continuously expanded. Although many simulation systems have been replaced by digital systems with digital system, the analog signal processing is still an indispensable part of many control systems.\n\nDigital signal processing can be achieved on site-programmable logic gate arrays, special application primary circuits, microprocessors. Integrated circuits with digital signal processor functions in many modern electronic systems and electronic products, such as standard definition television, high-definition television, radio and action communication devices, high-fidelity audio equipment, Dolby sound Running algorithm, global mobile communication system mobile phone, digital audio player, camera, digital camera, car control system, silent headset, digital spectrum analyzer, smart rocket navigation, radar, a variety of image processing, Video Processing, voice processing, etc. [47]\n\nRemote communication mainly pays attention to the transfer of the channels of coaxial cables, optical fibers, free space, and the like. In order to realize the transmission of information in the free space, the information encoded injection frequency is required to be used in the carrier of the transfer, which is called a change. Commonly used simulation modulation techniques include amplitude modulation and frequency modulation. The choice of modulation technology affects the cost and performance of the system, and usually engineers need to measure the pros and cons of these two factors from many ways to achieve the best results.\n\nOnce the information propagation characteristics of the communication system are determined, the communication engineer can start designing a transmitter (Transmitter) and the receiver. Sometimes, these two devices can form a two-way communication system, while implementing the functions transmitted and received, this system is called transceiver. When designing a sender, you need to focus on power loss, and this parameter is closely related to its signal strength. If the intensity of the transmission signal is not high, the signal is likely to be interfered with the interference, and the required information cannot be reached correctly.\n\nAs mobile phones become a common portable equipment in people's daily lives, technicians have added additional functions other than speech calls, such as SMS, Wi-Fi, making the phone a mobile Internet device. These convenient and fast services are based on the general packet wireless service, EV-DO or 3G such infrastructure technology. [48] ​​Currently, 4G is already in research and testing phases. [49]\n\nInstruments, sensors use objects to measure physical quantity, such as pressure, temperature, and so on using an object to exhibit different conditions under different conditions. Since the electrical signal can be easily handled (analog signal processing, digital signal processing), many modern instruments operate in the principle of electrical sensing. In order to manufacture these instrumentation devices, designers need to have good physical basis knowledge, especially for electromagnetic, material science, semiconductor physics. For example, the radar speedometer utilizes the observer that the frequency of the foreign object is different from the difference (Doppler effect) of its own frequency of its wave (Doppler effect); the thermocouple is measured by temperature difference.\n\nThe control system typically requires information from the outside and gives an external control signal. Taking the car as an example, the cruise settlement system needs to use the speed sensor or speed meter to monitor the motion state of the car, then pass this information to the central processor, the central processor is based on the driver's pre-set target speed and current speed. Differences to determine the state of the engine. Therefore, the measurement technology is an important part of the control engineering, but it is more concerned about the extraction of the physical quantity. At present, the measurement technology is positive to miniaturize, rapid development, and its accuracy is also increasing. [50]\n\nComputer engineering mainly refers to the design of computer and computer systems. It includes a design of computer hardware, portable electronic products, supercomputers, etc. Computer project also involves software software for hardware systems. However, computer engineering usually does not involve application software designs associated with hardware, and those parts are often considered a category of software engineering. With the development of computer engineering, integration of integrated circuits such as special application of active circuits and system chips is constantly increasing, and functions are constantly enhanced.\n\nThe scale of the integrated circuit begins, it is increasing. At present, the design, simulation, and verification of large scale integrated circuits have gradually supported support for electronic design automation tools. The designer can now focus on building a logical function of the circuit system, and completing the cumbersome tasks in the wiring, layout, and layout with computer assistance. [51] The mainstream hardware description language (such as Verilog and VHDL) enables designers to complete complex hardware circuitry in a similar computer programming. [52] Computer engineering professionals need to have a good electronics foundation and should also have certain computer operations and programming capabilities.\n\nMechanical Electronics is in the intersection of motor systems and mechanical systems. This combined system is called Electromechanical System, widespread applications in workers, merchants, defense, and academic fields, such as automation manufacturing systems, HVAC, aircraft, and various branch systems for vehicles.\n\nThe term \"mechanical electronics\" often refers to a macro system. However, future learning experts predict that in the near future, the micro-electromechanical appliance will emerge as the spring bamboo shoots after the rain. This prophecy has begun to achieve a certain extent. The high-function microelectromechanical system has been assembled in the car. It can sense impact, decide from the data read, tell the airbag to begin expanding. The inkjet printing machine reaches the microelectromechanical system to achieve high resolution printing tasks. Engineers hoped to study more advanced microelectronics technology to make minimal implantable medical equipment, or modified optical switch technology. [53]\n\nThe Engineering Science Department is a department that is an integrated motor engineering, information engineering, mechanical engineering, and is commonly known as the \"Engineering Department\".\n\nAnother related discipline is a biomedical engineering, which involves the design of medical equipment. This is roughly divided into two types of fixative equipment and operational equipment. Nuclear magnetic resonance spectroscopy, ECG instruments, etc. are all fixed equipment, while artificial cochlear, rhythm regulators, artificial hearts, etc. are acting equipment. "}