{"chinese_title": "natural ", "chinese": "Nature (English: Nature), or nature, nature, refers to the universe of the universe [1], including two complementary systems of the biological and non-biological boundaries [2].\n\nHuman can understand the natural phenomenon [3]:: the genetic model of the biological industry, the initiative, conscious behavior, social activities and ecosystems, etc .; the angel particles between the universe, the secondary particles, galaxy nebula and black hole white holes, etc. [4] [5]\n\nHumans cannot understand the phenomenon of religious beliefs, soul concepts and gods, known as super nature [6]. From the exploration of supernatural phenomena, to the cognition of natural phenomena, human beings are gradually understanding themselves, adapting to living environment and enriching social activities. [7]\n\n\"Nature\" Ancient text is \"self\", \"burning\" is called \"nature\", showing that the ancients who created this word is known behind the operation, the essence is different from the energy spontaneous form, but not \"gold, wood, Water, soil ... \"is essential.\n\nChinese from Laozi, [8] Among them, \"Nature\" has a total of 5 times, respectively, seventeen, twenty-three chapters, twenty-five chapters, fifty-one chapters and sixty-four chapters. [9] [10] [11]\n\nMain entry: Let's go\n\nWhen Laozi is discussing too much, it quote the vocabulary of \"Nature\". And further discusses the relationship between people, land, days, roads, and nature, restrictions on people, survived by the sky, the constraints of the sky, and the constraints of natural; \"That is,\" human law, earth law, Tianfa Road, Daofa Nature \"[12].\n\nLaozi's view, although the existence of \"Too\" is the benevolent, the wise is witnessed; however, the people use \"natural\" to describe the phenomenon caused by \"Too\". He said: \"Too much, the fear is knew; some people have a worship; some people are far away; some people have done ironic. Because there is not enough evidence to prove the existence of\" too \", I don't believe you. (Too) leisurely , Less words. When the fruit is fruitful, the people are recognized (too) is nature. \"[13]\n\n\"Too much, let's know if you have; second, you will be afraid of; after, he is afraid of; after it is, the letter is insufficient, there is no confidence. Mangi, the people, the people, all the people are natural \"Laozi\" Chapter 17\n\n\"Naturally mixed, innate life. Silent, independence, do not change, weekly, can be the world. I don't know my name, the words, the strong name is big. Big fame, Due to the past, far away. Theft is big, the big, the land is big, and Wang is also big. There are four major in the field, and Wang Jun is right. Human law, the local law, Tianfa Road, the road method is natural. \"\" \" Laozi \"Chapter 25\n\nEnglish Nature from Latin Natura, Italian Wanwu (The Course of Things, Natural Character) [18] Natura Greek Physis (ύύσις) of Latin Translation, the original development of plants, animals and other world faces Inner features, [19] [20] and ύύσις in the earliest literature as plants. [21] As a concept of nature, the physics universe is one of the many explanations that have been extended by the original meaning; ύύσιν first uses the former Socate philosophers mainly, and gradually circulates Open. Her usage is established because the modern scientific method appears before the generation. [22] [23]\n\nNaturally, it is commonly used in people to observe the material phenomena and behavioral conditions. [24] It can be a wide range of universal fields with life and plant species, and partially refers to the related processes of lifeless objects - the types of specific objects themselves, such as the weather and geology of the earth, and forming those objects Types of substances and energy. Many times, it is intended to be \"natural environment\" or \"wilderness\" - wild animals, rocks, forests, beaches and essentially unsuccessful intervention, or even if human intervene is still stocking. This traditional concept of natural objects still flowing to the present means nature and artificial distinction, the latter is understood to be in the human awareness or soul, and is also used in supernatural phenomena. The interaction between artificial objects and humans is not considered a part in common use, unless defined is human or \"nature.\"\n\nThe term \"environmental cluster)\" is used in the \"environmental (object cluster)\" in terms of a collection of physical, state and influence of organisms or their communities. The relationship and interaction between organisms and hazels under biological branches, use the word \"ecology\". [25]\n\nThe earth is the fifth largest planet in the solar system, and the blue planet closest to the sun is close to the sun. It is the only planet with life perched in the universe.\n\nThe most significant feature of the global climate is its vast, two narrower temperate regions, and broad equator tropics and subtropical regions. [26] The precipitation mode varies greatly depending on the position, from a few meters to less than one millimeter. 70% of the earth surface is covered by the salt water ocean. The rest are mainland and islands, most of the human accommodation in the northern hemisphere.\n\nSolid Earth evolved in geology and biological processes and left traces of the original situation. The crust is divided into several sectors, and they gradually move in the geological age, and they are more moving more quickly. The planet maintains an active, thick layer of mulled mantle and the core of iron-filled core.\n\nThe atmosphere of the Earth has created a huge change in the appearance of the living body [27], which has contributed to the ecological balance of a stable surface environment. Although the climate is very different because of the difference between the latitude and other geographic factors, the long-term average global climate during two glasses is still quite stable [28], and the world's average temperature is transformed in history. Ecological balance and geographical significant effects [29] [30].\n\nAccording to today's evidence, scientists reorganize the details of the planet. Earth is estimated to form from the sun and other planets from the sun and other planets from the sun and other planets at 455 billion years. [32]. The moon was also formed soon (about 20 million years after the globe, ie 453 million years ago).\n\nAfter the molten outer layer of the planet, the solid of the solid is formed. The original atmosphere was formed after experiencing the Outgassing activities and volcanic activities. The ice expansion of the comet is formed to form water vapor, and the water vapor is condensed, and the ocean is formed, see the origin of the Earth Water (ORIGIN OF Water On Earth). High-energy chemical reactions are considered to make a molecule that can be copied 自我 (34] before 4 billion years ago.\n\nThe surface of the earth changed its own shape in millions of years, and the mainland is separated and re-formed, and there is a super continent. About 750 million years ago, I have been separated by the earliest super largeland Rodinia. After these continents, it was combined to become a super largeland Panonía, and Panonía was again separated by about 540 million years ago. After that, it was combined to become ancient continent of the super continent, and the Gu Gu mainland was separated by 1.8 billion years ago. [35] .\n\nAlthough the scientific community is still discussing this topic, there is a significant evidence that a serious glacier role in ancient New Yuan ancient times will make a large-scale iceland to cover most of the planet. The above hypothesis is called \"snowball globe\", and \"Snowball Earth\" has also attracted special attention in the explosion of Han Wu Ji, because the multi-cell organisms begin to proliferation (Proliferation) after 5.3-54 billion. [38].\n\nSince Han Wu Ji broke out, five independent large biological clusters have been confirmed [39].\nThe last large biological cluster extinction occurred at 6,000 5 million years ago, when a meteorite hit the earth in the end of the Cretaceous, it caused a non-bird dinosaur and other large reptiles, while some small animals were still like a mammal. Survive. Mammals become more diversified in the past 6 thousand years [40].\n\nIn millions of years ago, one of the African is standing [31]. Postpartum the emergence of human life, the development of agriculture and further civilization allows humans to change the earth with a faster speed than before, affecting the number of nature, other creatures (compared to this Get up, it takes 300 million years to reach the highest point due to oxidation events caused by algae due to algae.\n\nToday, the era is also classified as part of the influence of biological clusters, called the new world, and is carried out in an unprecedented speed [41] [42]. Some scholars, such as the Harvard University of Harvard, Wilson, expect humans, can destroy half of the species in 100 years [43]. This extinction is still in research and discussion of biologists [44].\n\nThe earth's atmosphere is the main factor in maintaining the planetary ecosystem. The thin layer of gas is wrapped in the earth because of the relationship of the stereotropic suction. The dry air includes 78% nitrogen, 21% oxygen, 1% argon and other inert gases, carbon dioxide, etc., but also contains different amounts of water vapor. The higher the sea level, the smaller the atmospheric pressure, the large air standard is approximately 8 kilometers; that is, at an atmosphere of 8 kilometers above an altitude, 0.37 times the surface of the Earth. [45] [46]. 99% of the ultraviolet (UV) in the sunshine in the ultraviolet (UV) in the sunshine in the Earth's atmosphere; because DNA is easily destroyed by ultraviolet, the ozone layer protects the life of the Earth's surface. At the same time, the atmosphere is also not allowed to dissipate heat, and the temperature difference of day and night is reduced.\n\nThe weather on the earth is almost all in the trip to the stream and form a convection system to re-dispersed heat. Ocean flow is another factor affecting the climate, especially the main underwater temperature salt circulation, and she transmits thermal energy from the equatorial ocean to the polar. These foreign flows have temperature differences in winter and summer in the temperate area. In addition, if there is no atmosphere and ocean current to re-allocate thermal energy, the tropical area will overheat, and it will be too cold.\n\nThe weather can bring beneficial and harmful effects. Extreme weather, such as: tornado, hurricane, and cyclone to release a lot of energy along the way, and cause damage. Surface vegetation evolution into seasonal transformations of weather, so when only a few years of sudden change occurs, it will bring a huge impact on plants and animals that depend on their food.\n\nPlanetary climate is a measure of long-term trend. Different factors can affect climate change, including foreign flow, surface reaction rate, greenhouse gas, solar transformation, and planetary orbit transition. Based on historical files, Earth has experienced huge climate transformations in the past, including the Ice River.\n\nThe climate in the region is dependent on different factors, especially latitude. When a similar climate property is formed on the surface of a latitude belt, it becomes a climate zone. There are many of these regions, and by the cold zone of the Tropical climate located in the equator. The weather is also affected by the season, and the season is inclined by the opposite track surfaces of the earth. Therefore, at any time in the winter and summer, the planet will be directly irradiated directly into the sun light. This exposure to irradiation will be alternately alternately alternately alternately alternately moved. Whether at any time, regardless of the season, the northern hemisphere and the southern hemisphere will encounter the opposite season.\n\nThe weather is a chaotic system, which is constantly changing in accordance with minor changes in the natural environment, so the current accuracy of meteorology can only be limited to a few days. In summary, two global phenomena are happening: (1) The average temperature is rising; and (2) regional climate has a significant shift. [47]\n\nAlthough there is no recognized life definition, scientists generally accept life biometric characteristics is organism, metabolism, cell growth, adaptability, reactions and reproduction of stimuli and reproduction [48]. Life can also be simply considered as a biological characteristic state.\n\nThe common nature of organisms (plants, animals, fungi, native organisms, bacteria and bacteria) on earth is composed of cells, carbon and water-based, metabolism, have a growing space, and stimulating Reaction and reproduction. An individual is generally seen as life if there is more nature. But not all the definitions of all life are all necessary. Artificial life may be considered life.\n\nThe biosphere is part of the Earth's housing - including air, land, surface rocks and water - in their lives, and the biological process will also change and transform. From the most widely viewpoint of geophysics, the biosphere is an ecosystem that integrates all lives and their interrelationships around the world, including the relationship between rock circles, hydrological circles, atmosphere. It is now more than 75 billion tons (150 trillion pounds, i.e., about 6.8 x 1013 kg), living in different environments. [49]\n\nMore than nine biomass on earth can be plant life, while animal life is extremely dependent on them to survive [50]. More than 2 million animal and plant biological species are now confirmed [51], and the actual number of existing species is estimated by millions of people to more than 50 million [52] [53] [54]. The number of separate species maintains long-term fluctuations because the emergence of new species and the extinction of other species will occur without [55] [56]. The total number of species today is rapidly decline [57] [58] [59].\n\nThe life we ​​know is now only discovered on the earth. Humans are still a little less than this issue, but she is considered to occur in the original earth in an environment and now in the ancient or now in the ancient times. [60 years \" ]. At that time there was a basic self-replication and genetic characteristics at that time. Since the appearance of life, the evolutionary process has formed a more diverse life through natural selection.\n\nThe species that cannot be adapted to environmental changes and other species competition will be extinct. But many fossils that have protected these long-term species can be used as evidence they have. Now fossils and DNA evidence show that all existing species can track a continuous spectrum to initially original life [60].\n\nPhotosynthesis The emergence of the global base plant life allows the sun to achieve the energy of the sun, thereby manufacturing a case where the complex biological survival is manufactured. Its forming oxygen accumulates at the atmosphere, thereby promoting ozone layer. In large cells into smaller cells, the symbiotic creatures are enerucleotic creatures [61]. The cells in the cluster become more specialized, becoming a true multi-cell organism. Because ozone layer suction\nThe relationship of harmful ultraviolet rays, life begins to colonize in the ground.\n\nThe initial organisms on the earth are microorganisms, while they maintain the only bio-morphological position of the earth until a few months ago. [62]. Microorganisms are single-cell creatures more than humane visible sizes. They include bacteria, fungi, bacteria and native organisms.\n\nThis life can be found in any liquid water in the earth, including earth rock interior [63]. They can breed quickly and a lot. The combination of high mutation rate and gene-horizontal transfer capacity [64] will make them have a high degree of adaptability, or they can survive in new environment, including outer space [65]. They form a necessary part of the planet ecosystem but some microorganisms are pathogens, which leads to health crises for other creatures. The distribution of plants and animals is not obvious, some classified lives are between them. Initially Aristotle is plants in creatures that cannot be moved, they are animals. The above two becomes a plant industry and animal community in the system of Carl Linna. Since then, the fact that the original plants contain a lot of unrelated groups is gradually clear. But those classifications are still considered plants in some cases. Bacterial organisms are sometimes counted as plant phases [66] [67], and part is divided into bacterial flora, from the plant area.\n\nIn numerous plant classification methods, regional zone is different from the purpose of research purposes, can include fossil plants formed at the previous era plant residue. People in many regions and countries are proud of their unique planting, and those plant areas can have a lot of change in global climate and terrain.\n\nRegional districts are generally classified as \"local plants\", \"agriculture and horticultural plants\", which are intentionally cultivated and cultivated. Some \"local plants\" are actually brought by other mainland prior to the past, and become part of the local natural or local composition. The above is an example of a human and natural interrelation, and what is the defamation of nature.\n\nAnother classification of plants is called \"wild grass\" in history. Although this name is officially used as classification \"valuable\" plants between botany, informal \"wild grass\" is used as a plant that describes human and society in changing and shaping nature. Plants can be abandoned. Similarly, the animals are also based on their relationship with human life, will be classified as \"domestic animals\", \"farm animals\", \"wild animals\", \"harmful animals\".\n\nAnimals are classifications with a variety of features and are usually separated from other biological, but scientists are not open from the roots and leaves with their feet or wings. Animals are eukaryotic organisms and are usually multi-cell organisms, such as mucosal animals, with bacteria, bacteria and native organisms. The mucosal animal is a heterotrophic organism, usually digested in the inner chamber to separate them from plants and algae. They also distinguish between plants, algae and fungi because there is no cell wall.\n\nSome animals are exceptional, especially have a sponge, and their body is divided into individual biological tissues. They have muscles that make them shrink and control activities, making them the nervous system that transferred and handles signals, and usually have an internal digestion interior. All animal eukaryotic cells were surrounded by a particular extracellular outer mass formed of collagen and elastic glycin. These substances may calcify the formation of a shell, bone, and spicule, which is a complex structure that can be re-restructured during internal movement and during growth and maturity, and can support the complex structure required for mobile.\n\nAll forms of creatures will interact with their existing environment and other living. In the twentieth century, the assumption triggered the concept of \"ecosystem\" and defined its interaction between organisms and environments in any case.\n\nThe ecosystem is composed of no life and life-threatening, and has been related to each other [69]. Its structure and ingredients are affected by many related environmental factors. Changes of these factors can cause the transformation of the ecosystem. Partially important components include: soil, atmosphere, solar radiation, water and organisms.\n\nEach organism has a continuous relationship with the elements of other forming environments. Species in ecosystems associated with other species in the food chain and relies on each of them and exchanges energy and substances between them and the environment [70].\n\nEach species have to endure the factors that affect their survival, successful reproduction, and continue to grow and continue to interact with the environment. These species will also affect other species, and even all life. [71] Therefore, the ecosystem concept is an important part of research. Through research, it is possible to provide information on how human life interacts to allow different ecosystems to continue, not exhausted or inefficient. Because the purpose of the above studies, small-scale units are called microecosystems. For example, all of the stones and all their lives can be referred to as an ecosystem. A \"macro ecosystem\" can contain a full ecore area (ecoregion) and its watershed [72].\n\nThe following ecosystems are now subject to a centralized study:\n\nAnother classification is caused by the relationship between the community, such as the human ecosystem. The regional combination of different special animals and plants is most adapt to regional natural environment, latitude, height, and terrain are called biological groups. The most broad classification method treats all life synthesis as a biological that is similar to self-maintaining. This classification method is now widely studied and analyzed because its nature and effectiveness are also widely controversial. The above classification method is a theory (informally called Gaia theory) [73] [74].\n\nAlthough human beings can now accounted for only 0.5% in global biomass [49], humans have much more impact on nature. Because people have a large scale, unless the boundaries of natural and artificial environments become vague unless they are extremely cases. Even in extreme cases, the components of the natural environment that are not recognized by the recognizable human beings have gradually decreased in a fast pace, and even some opinions believe that they have completely disappeared [75].\n\nThe technology development of human race allows more powerful natural resources to help alleviate the crisis brought by some natural disasters. Although this progress, the fate of human civilization is still closely related to the environment. There is a highly complex feedback loop between high-tech and environmental transformations, and this feedback loop is only a slower pace gradually learned by the world [76]. People from the natural environment of the Earth's natural environment include pollution, falling forests, such as oil-procedures. Humans lead to the extinction of many animal plants.\n\nHuman uses nature as leisure and economic activities. It is a major part of the world economy system for industrial purposes. Some events are used as a livelihood and leisure purpose, such as hunting and fishing. Agriculture began to develop in the first 9 mils. Naturally, in all aspects of food, energy affects economic wealth.\n\nAlthough early humans collect non-cultivation of plant materials for food and use plants to treat [77], modern human beings are mainly used as plants as agricultural products. It is reduced by a large-scale land as a place for crop growth to reduce the number of wetlands and forests. As a result, many animal plants have lost habitat [78].\n\nWilderness is often considered to be a natural environment on earth that is not subject to human activities. Ecologists believe that the wilderness area is a natural ecosystem (ie, the biosphere) maintained by the planet itself. Wild English \"Wilderness\" originated from the concept of the concept; the other angle is controlled by non-manpower. \"Wilderness\" is from ancient English \"Wildeornes\", which is attached to the \"wildeor\" (Wildeor = Wild + deor = beast, deer) of the beast. [79]. From this point of view, it is because the place is sufficient to become wilderness. It is only the qualifications of human activities without affecting places. Many ecosystems may still be regarded as wilderness in the current or human affected by humans. If the natural process is still not subject to significant human intervention, the area of ​​its operation will also be regarded as wilderness according to the above view.\n\nNatural beauty has long been one of the themes of life and art, and books on natural beauty have occupied a lot of libraries and bookstores. Naturally, the power of many art, photography, poetry and other literary works, expressing many people from natural and their beautiful. What existence is this related? What is the association that contains it? The above problems are studied by philosophy of branch discipline. In addition to some of many philosophers agree, there is a lot of opinions about what is beautiful [81].\n\nIn view of visual art, nature and wilderness are an important topic in different era of world history. Early traditional scenery begins by China's Tang Dynasty Art (618-907). The tradition of expressing nature in the form of \"like\" is one of the purposes of Chinese paintings, and also has a significant impact on Asian art. The artist learned \"nature as a whole, with the basic understanding of the natural truth ... just like the eyes of birds to look at the natural\" view of the mountain water. In the 13th! 83].\n\nThe essence of the wilderness concept in Western culture is in the 18th century, especially in romanticism, starting. John Constims and Joseph Morrod William, the Great British Kingdom, Joseph Morrot William, focused on the beauty of the natural world. Prior to this, the main object of painting is a religious scene or a character. William Words Huss verse expressed its existence to the natural world, and the existence of the past is considered threat. Gradually natural value becomes part of Western culture. [84] The above artistic sports coincides with the super-prosecutive movement at the same time in the Western world.\n\nMany scientists who are more specialized and more organized to study nature are naturally a belief; French mathematician Pangola (1854-1912) pointed out:\n\nA classic thinking of a universal beautiful art contains a word mimesis, an imitation of nature. Another thought in natural beauty is perfect and is symmetrical, average allocation, with other relevant perfect mathematics (THEORY OF FORMS) and insights.\n\nSome scientific subjects believe that nature is a substance that is moving, and it operates in accordance with the basic nature laws of the scientific pursuit. Therefore, the most basic science is considered physics - its name is still considered to be a research.\n\nSubstances are generally defined as physical formation. She constitutes observable universe. The ingredients visible in the universe now believes only 4% of all quality. The remaining components believe that 23% cold dark objects and 73% dark energy [86] are believed. The actuality of those components is still unknown and is intensive by physicists.\n\nThe behavior of the material and energy in the observable universe is to follow the definition of clear physical law. These laws are used as models for making physical cosmology, and those models have successfully explained the structure and evolution of us to see the universe. The mathematical expression of physical law has used 20 physical constants that are fixed on the surface in the surface [87] [88]. Those constant values ​​are taken carefully, but their specific values ​​are still a mystery.\n\nOuter space, is also simply referred to as the universe, refers to space in the universe to vacuum in the air atmosphere. \"Outer\" space is used as a partial emblem with the airspace (and ground location). The earth's atmosphere and space have no clear profile because the atmosphere gradually gradually reaches thinner. The outer space in the solar system is called the Interpersonal Space, which will enter the solar circle after the interstellar material.\n\nThere are still many spaces, but it is far from vacuum. Outer space is filled with organic chemical molecules, and the discovery of those molecules is attributed to Rotational Spectroscopy and the universe microwave background radiation. Those molecules have been left by large explosions, and some have the origin of the universe already exist, and some molecules are universe-rays consisting of ionized atomic nucleus and secondary atomic particles. There is also some gases, plasma, dust and meteor. In addition, now the outer space contains signs of human life, such as from the previous manned and non-carrier, and may be dangerous to spacecraft. Some space garbage will once again enter the atmosphere again.\n\nAlthough the Earth is the only planet that is known in the solar system, today's evidence shows that the surface of the ancient Mars has liquid water [89]. In a short period of time in Mars history, it is possible to form life. But now Most water sources have been frozen. If life is in Mars, they are most likely that there may be in the bottom of liquid water [90]. Other class planets such as Mercury and Venus, in the known situation, it seems that it is too severe to maintain life. But now it is speculated that the fourth large satellite wooden must have a liquid water under a surface and may contain life [91].\n\nRecently, the team of Stéphane Udry, Swiss Astronomer, found a new planet called Gliese 581 C, which is a solar lattice of the Red Dwarf Gliese 581. Gliese 581 C seems to be in the sustained space of the surrounding space, so it may have life in accordance with existing knowledge. "}