{"chinese_title": "Cultural relic ", "chinese": "The word cultural relics, the earliest is the best in China. \"Zuo Zhuan, the second year\" record, \"Ford, Zuo Wei, I have a number, the cultural relics are disciplined, the statement is, and the officials, the official, the official, I am afraid, I don't dare to discipline.\" Today It is called cultural relics that will have historical and artistic values ​​left in the past. But for the exact definition of cultural relics, the current journal has not reached a consensus.\n\nThe emperor and folk cultural relics in the Song Dynasty, Song Huizong himself is an artist, \"the\" archaeological \"of the Qi Lin is\" Archaeological \",\" Xuanhe Palace Expo \", all the Tibetans, for the size of the gift, 500 have\" [ 1]. Zhou secretly called Song Gaozong \"visit to seek book paintings, spare no effort ...\" showing Mai Tuo \"[2]. Mi 芾 \"is fine in identification, and the painting and painting of ancient utensils will be\" must have been \".\" The wind of playing in the middle of the Ming Dynasty. High-spirited \"all over Zhong Ding Yu,\" Painting and Calligraphy Post, Kiln Jade Play, Wen Room \"[3]. Shen Deyi \"斋 斋 馀\" wrote: \"Playing with good things, with ancient, but this is not. Yongle's 红, 德 之 之 之 之 之 与... starting with one or two Ya, appreciating Mo, obscuring a good thing of Jiangnan good things, a great joy of Xin An Ear, 曰 百, 动 相.. \"Chen Mengjia and Wang Shiziang love collecting furniture [ 4]. In 1966, Chen Dynasty was committed to death, and the Hidden furniture was confiscated, and it was treasured by the Shanghai Museum. Wang Shizhen later edited \"Ming Furniture Rewener\", the title page print is: \"Mr. Chen Mengji is only in this book.\"\n\nThe cultural relic value generally includes the historical value, artistic value, scientific value and special commodity value of cultural relics. [7] The value of cultural relics is objective. But the identification of cultural relics is a subjective process. The value of cultural relics produces the role of cultural relics.\n\nThere are many standards for cultural relics, such as:\n\nCultural relics identification refers to identification of cultural relics, and selects the standardizer is the most basic method. By comprehensively summarizing standard equipment features, it is clear that its era characteristics and styles, thereby determining its value.\n\n[Edit in Wiki Data] "}