{"chinese_title": "education ", "chinese": "Education, usually there are broad and narrow concepts. Generalized education generally refers to all social practice activities of human civilization, namely knowledge, skills and social life experience, to promote individual socialization and social personalized social practice, which is produced in the initial stage of human society; narrow educational specialization school Education, institutional education. Generalized education includes all aspects of social treatments, such as tutoring, etiquette and other civilization and society education.\n\nIn school education, teachers directly teach a series of courses, including reading, writing, mathematics, science, history, etc. In the opposite place, only a single professional skills in vocational education. In addition, people can also obtain informal education from other channels, such as museums, libraries, internet, and experience in life. Some new education methods have gradually emerged.\n\nToday, the right to education has been widely considered to be a basic human rights, and the European Human Rights Convention published in 1952 and the International Convention on the International Convention on the Economic, Social and Cultural Rights of the United Nations in 1966.\n\nThe educational process begins to be born and lasts for life has been widely accepted. Some people even believe that education can begin earlier, some parents let the fetus in the uterus listen to music and stories, and hope to have an impact on the development of children.\n\nThe word \"education\" English vocabulary EDUCATE or Education comes from Latin ēducātiō, meaning \"extraction\" [1].\n\nEducation has many functions:\n\nIn addition, society selection talents according to the level of education; people have achieved social status through education. Education is accompanied by the generation of human society, and with the development of society, it has always been a total of human society. The definition of education is different. For example, Dewey in the United States said: \"Education is life.\" Spencer in the UK said: \"Education is prepared for future life.\" Or more specifically regards school education as an enlightenment, participating in democratic elections (Michelli) & Keiser, 2005).\n\nThe words \"education\" in Chinese are all meaning, \"teaching\" the word from the 攴 (pū) from filial piety, 攴 is the shape, filial piety is also a part. \"攴\" of the staggeis is used to use a stick or a whip. \"Education\" word in the oracle shape like a woman. The word \"mother\" and the decoration on the head are under the \"child\" word. From the beginning of the Chinese character, education is a mandatory, guiding, making people in line with social norms.\n\nThe teaching system includes a programming teaching that follows or according to the schedule, which is usually established in the education system, which establishes certain presets. The educational system is usually related to gender, religion, etc., depending on the mental occupation of the educated people.\n\nIn formal education, the course is a series of systems provided by a school or university, a complete course and content arrangement. Some of the educated people have implemented certain social purposes by completing certain courses. For example, children can train them for a mature person. The course is normative or relatively random, which is usually based on a more detailed syllabus, including some topics and knowledge points that need to be mastered, as well as the results or standards required to get a certain level.\n\nA subject is usually a knowledge of a class, or through college education or other methods. A subject usually includes some sub-disciplines or branches, which are often very strict, such as natural science, mathematics, computer science, social science, human science and application science, etc. [2]. Among the secondary education in some countries, education units often provide some courses that meet the university standards as an elective, such as music, dance or opera.\n\nPre-school education refers to school or institutions that provide education that are not full of school-age, usually the preschool education.\n\nPre-school education can provide a child to contact the competitive social and educational environment as early as possible. Children learn to learn some letters, numbers, colors and paintings through pre-school education, and often lead the same age and have not been academically educated when starting standard education. But the real preschool education should provide a child-centric, purpose is to expand the child's intelligence and its own potential. [3].\n\nPrimary education usually includes regular education for the first five or seven years of educators. In general, primary education usually begins with educators or six years old, which is often related to their national regulations. According to UNESCO statistics, 89% of school-age children worldwide are undergoing primary education, and this ratio has an upward trend [4]. Under its \"National Education\" project, most countries have completed all the achievements of the first education. In some countries, such as: the Republic of Korea and the People's Republic of China, the primary education is stipulated as an obligatory education.\n\nThe agency that provides such primary education is widely referred to as \"primary school\". In some countries, the primary education school will also be divided into kindergarten and primary school.\n\nIn most modern educational systems, secondary education includes formal education across educated in adolescents. It is treated as a period of conventional obligational primary education, to the conversion period of competitive higher education or skill education. Based on this education system, institutions engaged in secondary education include ordinary middle schools, primary middle schools, senior high schools, vocational schools. This difference is also distinguishing due to the difference in country, usually includes a stage of seventh grade to the twelfth grade. In the US, Canada and Australia's education system, secondary education and primary education usually collect \"K-12\". The purpose of secondary education is to provide general education to help educators laid the foundation for higher education, or have a purposeful culture to a certain major.\n\nSecondary education has continued to rise in the United States in 1910, which is largely affected by the economy and the requirements of the factory on skill workers. In order to meet the needs of such jobs, all localities have established a secondary school, and their syllabus often focused on the training of work skills to help them better raise the work requirements of white-collar workers or technical blue-collar workers. This has benefited the employer and the employer that helps the employer to increase efficiency and reduce the cost of the employer. In Europe, the popularity of secondary education is more born with ideas such as civic education. China has introduced the concept of secondary education in China with the end of the Qing Dynasty. In some countries, secondary education is still considered a mandatory compulsory education, although it has been impacted by the educational concept of independent learning.\n\nSpecialized education refers to training education for direct or professional training for a certain need or field, such as computer specialist schools. Specialist education is usually accompanied by training, internship, etc., which typically includes craftsmanship, agronomical, mechanical engineering, drugs, buildings, computers or arts to cultivate talents adapt to different markets.\n\nWith the social change, since the late 20th century, the global multinational implementation of education reforms, in addition to the traditional discipline knowledge, it has also begun to pay attention to the skills of the 21st century.\n\nSome parents will choose another kind of education from non-mainstream schools, such as democratic schools.\n\nSome governments regard the only legal model for education as an obligatory education, but there are also some government to allow parents to arrange their children.\n\nIn 1994, Dieter Lenzen, Berlin, said: education can be said to be from hundreds of years ago, or it can be said to establish education from the end of the 1870s (Harpes, Germany, starting to establish education in the late 1870s. Director, start, and Lenzen also believes that it is difficult for scientific education to distinguish between many years of traditional education.\n\nIn the West, the origin of education is affected by religious organizations: the praughters recognize the importance of education and establish a school system. In Europe, many initial universities have Catholic background. The new National Scottish church has been established after the Scottish religion reform.\n\nChina's education can be traced back to Xia Dynasty and began in Chinese classical books, rather than religious organizations. The Emperor Wu of the Han Dynasty was a hundred, and after the exclusive Confucianism, the Confucian classic became the main professor and learning direction of China's education. Ancient China was used to manage the empire after the various selection system, and the subsequent schools used to select officials, and they were established in the Sui Dynasty. After the Tang Dynasty, the Wu Dynasty, the five generations of Ten countries to the Song Dynasty, the Song Dynasty. In the Song Dynasty, the education of the Song Dynasty, Su Shi said in \"Xie Fang She was in the\" Xie Huishe, \"said the pen, ten rooms and nine\". \"地 纪\" records the \"family music teaching, five steps, ten steps,\" \"[5]. When there are inside and outside the Southern Song Dynasty, there are civil and military two studies, relictional, Beijing-based, county, and the rest of the township schools, home, split, books, every miles must have two. The voice of our Laoxiao, often heard \". Ye Shi said: \"Today, Wu, Yue, Yue, Yu, home can hold books, people know the book.\" [6] until the end of the Qing Dynasty officially abolished in 1905, and replaced in Western education.\n\nThe origin of Japanese education is closely related to religion. The school is a temple that cultivates the young people who want to study Buddhism become monks. Later, children who want to learn will go to \"Tera-Koya, intention to temple huts), learn how to read Japanese.\n\nIn the past few decades, the percentage of illiterate populations that were not subject to any school education fell. From 1960, 36% fell to 25% in 2000.\n\nIn developing countries, the percentage percentage of 2000 is only half of 1970. In developed countries, illiteracy also fell from 6% to 1%, and did not fall from 5% to 2% from school educators.\n\nPrivate organizations, such as the Saint Church in the late Jesus Christ, is working to make individuals who have received more education through the Perpetual Education Fund.\n\n\n\nThe school is a place in accordance with certain procedures, have certain places and time, specializing in educating a particular object of the people, teaching knowledge and value systems.\n\nParents involved in children's education is considered necessary.\n\nThe purpose of education is exempt from ignorance. Including enlightenment human rationality, enriches spiritual life, passing civilization, reaching self-realization. [9]\n\nArticle 29 of the Convention on the Rights of the Children's Rights shall be: [10]\n\n[Edit in Wiki Data] "}