{"chinese_title": "faith ", "chinese": "Faith (English: Faith), Latin as Fidees and Old French for FEID, [1] is a person, one thing, one thing, or a concept of convinced and confidence, including a certain ideology Or religion trust and admire. [1] [2] \"Stanford Philosophy Encyclopedia\" [3] Think \"belief\" is a broad term, which appears in the language expressing a variety of concepts; in the most common sense, \"Faith) and The meaning of \"trust\" is substantially the same. However, the narrative and discussion of beliefs in philosophy is almost entirely limited to the religious beliefs of God, and they are both belief in God. And usually, they are dealt with the beliefs in the Christian branches in Abrahamic Traditions, although there is no other faith.\n\nIn the concept of religion, the belief can be divided into two kinds of confidence and trust. [4]\nPeople who believe in religion often take belief as their confidence, they will be clearly self-evident, [5] [6]\nOthers have a tendency to believe in faith and not admit that the existence of the gods believe that belief is a creed with no evidence. [7]\nGenerally in distinguishing between beliefs and confidence, it is such an example. I said that I have one hundred yuan in my pocket. I told me to take it out. It is faith. If you believe me, it is confidence.\nBelief, it is a choice and hold of people to life, values ​​and worldviews.\n\nBelief, for human life, choose the value of the value, lifestyle, and human sense of life.\n\nBelief, whether it is objective with the object of the object of faith. Religion itself is not faithful, but the expression of faith, the form of performance is not suitable as a belief.\n\nBelief is generally considered to be formed by external factors. Most of them are affected by parents, social, political, religious and traditional ideology. Only the process of beliefs must be inherently responded, which takes a personal experience and pursuit of life, thereby choosing a belief that is suitable for you. [Source Request]\n\nBelief can be obtained, can be shaped or abandoned. Although many religions have strict restrictions on the departure of believers, according to the United Nations Declaration of Human Rights, people have freedom and rights to choose religion, or choose not to believe in religion.\n\nFaith (English: Belief, Belief-That), belief is a personal judgment and choosing a truth of the authenticity of things, and the correctness of the belief depends on the personal knowledge level including reasoning.\n\nFaith can be described as an attitude of the correctness or not of the proposition, which is different from belief-in. Belief-IN is more closely related to the concept of trust or belief (Faith) because it usually refers to a human attitude. In many religious traditions, the central role is played, of which \"God\" is the core virtue of its believers (also known as God). [8]\n\nBritish philosopher and logician Nobel Literature Award winner Betland Russell wrote: [7]\n\nChristians believe that their beliefs are good, but other faith are harmful. In any case, they also hold this view in the communist beliefs. I insist that all faith is harmful. We can define \"belief\" as a firm belief that there is no evidence. There are evidence, no one will say \"faith\". We don't say \"2 plus 2 is equal to 4\" is faith, and \"the earth is round\" is a belief. We only talk about faith when you want to use emotions. It is easy to cause conflicts with emotions, because different groups are replaced with different emotions. Christian believes in the resurrection of Jesus, the Communists believe in Marx 's value. Any of the beliefs cannot be rationally supported. Therefore, each belief has to be maintained by propaganda, and it has to pass the war if necessary.\nPhilosopher Valter Arnold Cavman in his book \"The Faith of A Heretic\" defined as: a strong belief, usually expressed as the lack of sufficient evidence, can not convince every rational person's entry Trust [9].\n\nEvolutionary Biologist Richard Daokins criticized all the beliefs that he thinks with scientific evidence in his work \"God Illustration\". Educating children \"belief itself is a virtue\" point of view, actually is truly harmful practices. The reason why belief is especially because it does not need a reason, it does not need to argue. Irrush into the children \"Don't have a trusted faith is a virtue\", which may make them grow up to become the potential fatal weapon of the future, the Crusaders, especially in the influence of certain factors that are not difficult [10 ]. He described belief as a blind letter that has no evidence, an active process of not thinking. He pointed out that this approach will only make anyone only with personal thoughts and possible distorted perception (no need to test naturally); this approach, reducing our understanding of the natural world, There is no ability to make reliable and consistent predictions, and there is no need to comment. [11]\n\n1979 Nobel Physics Award Winner Steven Winberg warned people, the world needs to wake up from a long religious belief; for our scientists, anything that can be done to weaken religious beliefs should be done. In fact, this may be our greatest contribution to civilization. Religion is a cheating than profit. [12] Leg him also believes that no matter whether there is any religion, a good person will do a good job, the bad people will make a bad thing. However, if you want a good person to be a bad thing, you need a religion. [13] "}