{"chinese_title": "drama ", "chinese": "The drama (English: DRAMA) is an example of an actor to perform a story or situation with a conversation, singing or action. The drama has four elements, including \"actors\", \"story (situation)\", \"stage (performance site)\" and \"audience\". \"Actor\" is the most important element in all four. He is the spokesperson of the role. The ability to play, the drama is the biggest difference between the drama and other art is to play, through the actor's play, the role in the script is only Stretch, if the actor's play is abandoned, then the show is no longer a drama.\n\nEven in animations, puppet play, shadow play, no actors appeared in the play, actors are just a place where they are hidden outside the visual visitors.\n\nDrama has a variety of performance forms, common include dramas, opera, dance, musical, puppet play, etc. Due to the difference in cultural background, the form of drama in different cultures often has unique traditions, such as Western drama, Chinese opera, Indian Vananats, Japanese energy, singing and kora, and so on.\n\nThe origin of the drama is not available, and there are currently a variety of hypothesis. The more mainstream views are two: a witchcraft ceremony for the original religion. For example, in the ancient Chinese, \"Witch\", \"Dance\", \"Wu\" three characters may homologous (the ancient Chinese is: / * mA /, / * mAʔ /, / * maʔ /). It is likely to be a conjunction with a witchcraft activity that begging the battle, that is, the original form of the drama. Another imaginary song and dance performance when labor or celebration, this statement is that ancient Greek drama is considered to originate from the gods.\n\nThe concept of modern drama emphasizes all the performances of all performance elements to achieve a comprehensive art effect. Performance elements include an actor, stage, props, lighting, sound, clothing, makeup, and script, director, etc., also include the relationship between the performance and the interaction of the stage (generally referred to as \"viewing\").\n\nLiterary drama concept refers to the script created by the drama performance, or a script.\n\nThe word source of Chinese drama comes from the \"Nanyu North Drama\", the drama is a drama, the drama is a scorpion, which is a political situation in China and the northern part of the South. Different performance arts, the use of the two is the usage of the future.\n\nThe words in the world and the word \"drama\" in the world are not. For example, in addition to the drama in the Indian language, there is also a dance, sports competition. However, the words related to the \"drama\" in the world are almost similar to the \"game\", such as in English, will be called a Play (usually referred to as a drama with a script). \"Drama\" in Chinese, also has the meaning of \"game\".\n\nThe three ancient drama culture in the world, including the tragedy and comedy in Greece, the Vasantan and Chinese opera in India.\n\nThe dawn of the Western drama is generally considered to be ancient Greek tragedy, and ancient Greek tragedy is from the ancient Greek Athens City. In the 5th century BC, at the celebration ceremony of Dai Ourius, held a drama game. . In the ceremonies, people play Dai Oiius, sing \"Dai Shen\", jump \"Sheep Dance\" (sheep is an animal representing Dai Ouxi). The ancient Greek tragedy is a poem, rigorous and elegant, and solemn. There is a song along the performance, and historical real shows that the song is presented in the actor. Regarding this origin, you can also refer to the early philosophical book \"The birth of the tragedy\" in the early philosophy of philosophy.\n\nFive of the five ancient Greek drama writers are very famous. Although their works have only a small part, they remain until today. Escoss's historical tragedy \"Persians\" is the oldest drama, which has a prize in the city's wine in 472 BC, but Escoss has spent more than 25 years ago. [2].\n\nTragedy plays present the four-song way of the drama, usually include three tragedy and a sheep drama. The comedy was officially affirmed from 487 to 486 BC. Even the annihilant writer is in the city of wine (decreased during the War of Bolonnes), it will provide a single comedy. The ancient Greek comedy is divided into \"Old Comedy\" (5th century BC), \"The Comedy of the Middle Comed\" (4th century BC) and \"New Comedy\" (2th century BC).\n\nAthens' drama culture can be divided into three style: tragedy, comedy, and Samat drama.\n\n(1) Tragedy: Exploring the issue of religion, philosophical, and the gods of the gods. Reference: Sophocles \"帕 帕 王\" [3].\n\n(2) Comedy: The old Tourist Opera in the classical period is more important in contemporary society, time affairs and literature, philosophical trend. Reference: Aristophanes \"Lisi Cui\". The new comedy in the Greek period is more realistic, with romantic family entanglement as the subject. Reference: Menander \"The old man of bad temper\" [3]\n\n(3) Samat drama: The aim of the previously staged tragedy or mythical story, aimed at taunting the aristocrat or god of the protagonist through the Sattok team. [3]\n\nThe Greek drama continues to perform throughout the Roman period, marking the beginning of regular Roman drama in the first 240 BC. The ancient Roman time recreational event is quite rich, in addition to the official supported formal play and shape short Yatra, there is also a juggling, racing, horse racing, water war, beast fight ... and I have an entertainment competition that vote for sensory stimulation. On the one hand, these boat, the 膻 activities reflect the taste of the ancient Rome audience, and on the one hand, it also affects the style of formal drama.\n\nIn ancient Rome, through the cancellation of the song and dance team, scattered the music to the full drama, and \"Direct performance\", \"narrative\", \"singing\" mode to the drama plot, so that the dramatic will be further carried out, establish the traditional Western theater drama American. In addition, there is a practice of dividing the drama zone into five curtains.\n\nThe type of drama can be roughly divided into comedy, tragedy.\n\n(1) Comedy: Family entanglement or character is the subject matter, and all drama activities will occur in the street. PlauTus works with a mis-scapement mode, with a large number of languages, approaching the farce style, such as \"Meacaci\"; and Terence's work is in good use of the difference between the two-line structure, the drama is more language Action, can be classified as a romantic comedy, such as \"Brothers\".\n\n(2) Tragedy: Seneca's tragedy is taken from the Greek tragedy, but the algae is satisfactory, rich in moral awareness; the plurality of people often do extreme behaviors under strong motivation, and the drama movements are full of horrific atrocities and day. The vision of human feels, pitting the audience sensory.\n\nFor the definition of the West, China has not \"drama\" tradition. However, when discussing Chinese drama, if it is not divided by strict definition, the ancient Chinese opera should be classified into the big class.\n\nThe roots of Chinese operas can be traced back to the Wu Pre-Qin to the Han Dynasty, but the development of the South Opera of the Song Dynasty has a complete drama text creation. The earliest Chinese ancient drama script is the Southern Song Dynasty. In the Yuan Dynasty, in large, Pingyang and Hangzhou centered, the Yuan Dynasty was shining. The future generation has formed many drama forms, that is, various drama. After the development of Suzhou, the Ming Dynasty was developed, first got the sought after and loved by the Shi Eth, and they won a lot of scripts, and constantly modify the music, and correct the drama theory of Kunqu, and made the legendary scriptures a new mainstream literary form. Subsequently, Kunqu also got the favorite of the late Ming and the Qing Dynasty court royal family, became part of the noble life, became the official affirmative drama art, called \"Ya\"; and the place to play in all parts, widely loved, said \" flower\". So in the Qing Dynasty formed \"Hua Ya Zheng\", it is actually a situation in which the drama is prosperous. This enriches the door class of drama art and also forms their own artistic features.\n\nIn recent years, the drama student in Taiwan has proposed a set of statements. When discussing the origin of the Chinese drama, it should be distinguished \"big play\" and \"small drama\", the big drama is a mature drama, and the small show is the alarm of the drama. The big show is completed after the Jinyuan scorpal, and the previous Song Yilta, the representation of the Tang Dynasty, the drama of the Tang Dynasty. China has a small play before very early.\n\nBefore the cultural contact with modern western, there is no tradition in the \"drama\" (main educational drama) in the West. Chinese traditional drama is a plot, \"song and dance story\", comprehensive music, singing, dance, martial arts and acrobatics, etc., is also drama curved art.\n\nAccording to different classification criteria, drama can be divided into different types:\n\n• According to the length, modern media is generally short dramas, unit dramas, 1 ~ numerical theater, serial dramas that have been played for a few months in the TV station, similar to the network micro-movies with MV or advertisers, and a complete theme awareness and story in the cinema The released movie creation.\n\nHowever, the most basic, using the largest classification is tragedy, comedy and tragic comedy, among which the tragedy appears earlier than comedy:\n\n• Tragedy: Aesthetic value: \"It is destroyed to people with valuable things.\"\n\nValuable drama is through performance, various questions and creations, reflecting or presenting a real life with concentrated content or setting, and profoundly describing the grief of the life of the joys and sorrows or human emotions. , Or to discuss the current social value contradiction, or present a reality to deal with destiny or helplessness, or to try the causal effect or consequences that may or or evolve in the case of not existent or impossible hypothesis can trigger the audience. Movement and provincial thinking ... In turn be a sense of entertainment or reach a considerable degree of entertainment!\n\nThe drama text (ie \"Script\") is a basic element of the drama, a prerequisite for a play.\n\nThe most important script is to be movable on the stage. The drama text is not a completion of art until the stage performance (ie \"Performance Text\" is the presence of the final art. Among the Chinese people, there are also scripts that are not suitable for stage performances, even at all, can not be performed. This type of drama text called the case of the case (also called the Book of Zhai), there is no example in the modern drama.\n\nThe literary book of the drama can be appreciated as a separate literary style without performing.\n\nWith the practice of the Western modern drama in the director and the actor training system, the theory of drama gradually expands from the drama text, and then produces new ideas such as \"scene scheduling\". Among them, the more famous proposal is the concept of British drama director Peter Brooke in the 1970s: \"A actor, walking through an empty stage, this is All of them. \"\n\nNo matter how the drama word is defined, only the following conditions can be considered as a drama.\n\nAs long as it is a space, it can be a place where the drama performance is generally referred to as \"theater.\" Historically, there are many places specializing in the play of drama activities, some are outdoors, some are indoors. These venues specializing in the drama include theater, theater, stage, etc.\n\nIn ancient China, the so-called stage is earliered in the singing and dancing ceremony, and a dancer in the ceremony is a high platform that is backed by soil. As the drama development is gradually maturing, there is a trading, a stage, a trip, hook Wait for the performance site.\n\nThe performance of the Western drama from the Open-air theater of Greece, the ancient Roman's amphitheater (ie \"Corner Field\"), has developed to the \"Mirror Frame\", which is suitable for the \"black box\" performance of the Pioneer Experimental Drama (Black Box; or Black Box, black box), \"Experimental theater, etc.).\n\nAncient theater in Greece\n\nRoman theater in France\n\nCurrently, more actors are called the players in the drama. In Chinese history, there are many named drama performers, such as drama, excellent, 娼 娼, 人, 伶 乐,,,,,,, Means, and \"娼\" called drama performers, although the performer is a singer, but in history, there is a long relationship between the drama performance and 娼 娼.\n\nThe organization of the drama performers is more called the trick. It is more called being a play class, and if it is a family of people, it is a family class, called a family class, home class The Ming Dynasty is generally later. "}