{"chinese_title": "political ", "chinese": "Politics (English: politicals) is a process of collective decisions by various groups, and various groups or individuals have made of specific relationships formed by their respective fields, especially for the rule of social group, such as ruled a country. Also refers to the supervision and control of a country and foreign affairs [1]. Narrow, this word is used to refer to the behavior of governments, political parties, etc. However, sociologists are also used to refer to the relationship between various stakeholders, schools, and religious institutions.\n\nFrom human sociology, politics is a very important social phenomenon in human society, which affects all aspects of human life. This social phenomenon is very complicated, so different cultures, different languages, and different scholars are also different from different scholars. Moreover, the political connotation itself is constantly changing, so the interpretation of politics is also full of disputes, and there is no exact understanding. [2] [3]\n\nPolitical science is a social science, research, political act, and exercise of the theory and investigation of political behavior.\n\nThe word \"political\" in Western languages ​​(French Politique, German POLITIK, English Politics), from Greek πολις, the earliest text recorded in \"Horse epic\" is the initial meaning Castle or theater. The ancient Greece Athens will be built in the mountains of the mountain called \"Aklorbooli\", referred to as \"Boli\" [4]. After the formation of the city state, \"Boli\" became synonymous with political meaning. Politics has become the rule and management activities involved in citizens of the city.\n\nThe term \"political\" in Chinese has been used very often. \"Shang Shu · Bai\" has \"Morality Politics, Ze Run,\" \"Zhou Li, the official,\" \"\" \" At this time, it is generally used to separate \"politics\" and \"governance\", and each has its own meaning [4]. Politics is one of the people's careers, and it cannot be separated from all social life. Therefore, any politics of any country will be closely related to its own traditional cultural national philosophy, and we can reach the territory of deep roots and long-term Changan. 5]: 1.\n\nIn ancient China, \"political\" generally said:\n\n\"Governing\" is generally expressed in ancient China.\n\nThe meaning of these \"political\" in ancient China [3], the \"political\" meaning of Western and ancient Greece is completely different, and it is largely political only a monarch and ministers to maintain the rule of rule, governance.\n\nThe word \"political\" in Chinese. The word \"politics\" created by Chinese characters in the translation of the Japanese. When English politics passed from Japan to China, people could not find the words corresponding to it in Chinese. Sun Yat-sen believes that \"politics\" should be used to translate. \"The government is a matter of people, the treatment is management, the management of everyone is politics.\" [6] His statement is very influential at the time. Sun Yat-Mount believes that \"politics\" is translated into English is politicals, there are three meaning: \"One is a national government, the national affairs in the government; one is a party struggle, the truth is the truth of the party; one is said to be right, it is Family like previously raised. \"[7] [8]\n\nThe politics of ancient Greece is the political in the city. The 20-year-old citizen (excluding women, slaves and Gentiles) are involved in the management and dominance of the city. In ancient Greeks, people are morality, the meaning of life is to practice their virtue. People are born political animals, so people are naturally born with German animals [3]. People fully demonstrate his virtue in public activities. Aristotle said: \"The goal of politics is to pursue good.\"\n\nThe political purpose between the citizens of the city state will reach political purposes. Kennes Miñoger believes that in ancient Greece, \"people are completely equal in political relationship between people, everyone is just obeying the laws of their own, and is turned to do rulers and rulers. [9]\"\n\nThe Polish of the Roman Republic is essentially a city-state policy as ancient Greece [3]. The politics at this time is the activities of the Republic. PUBLICUS (public) in the Republic \"is from Populus (People). At that time, the word meaning is \"the common affairs of the people\". In the politics of ancient Rome, the establishment and maintenance of the Republic is its core.\n\nIn the eyes of Romans, the rule of Wang Rappuan is a slavery. Therefore, the Romans have set up two reliefs and public officials to maintain this rule. In order to safeguard the freedom of the people, the ancient Rome has developed three different powers and two kinds of harmony:\n\nThe political implications of ancient China and Western political implications are very different. The political political in ancient China is very sense is the activities of monarchs and ministers management and rule. [3] This political is preached as a heaven and thus implementing good governance, and the evil government will violate the heavens and will be punished.\n\nChinese ancient politics runs through individual daily lives, morality is the standards for measuring political activities. Under this politics, the lack of institutional norms, and the operation of politics rely on moral specifications. [3]\n\nThe Middle Ages' European politics is in the transformation of ancient political and modern politics. With the death of the West Roman Empire, the city-state system is destroyed, gradually forming a reward and sealing system, and politics is no longer a public activity for all citizens, but has become the activities of the king and ministers. Politics is not intended to achieve justice, and have become a kind of interest politics. The means of solving problems in political activities is made by dialogue and persuasive, and become a violence and war, which has become the relationship between rule and dominated. Political transcendence has not existed. Thomas Aquari is changed from Aristotle's famous sayings to \"human according to politics\". \"People according to their own nature are social animals\" [10].\n\nWith the rise and development of Christian, religious beliefs have become the meaning of life pursuing, not the politics of ancient times. This politics developed from feudal rules have become the origin of modern politics. [Source Request]\n\nModern politics is developed under the national system established in Westphalia and Abida in 1648. Inside the national state, the rise of the civil society has formed a social relationship based on private rights, thus producing political authority has restricted political authority; the secular king or republican regime needs to seek legitimacy and political functions from this economy. It became the development of the maintenance of economic benefits. Therefore, Marx suggested that politics is the economic-based building, which is a centralized performance of the economy, and is the sum of various social activities and social relations with the core. The French Revolution in 1789 is very important for modern politics. Since then, politics have become the general name of various activities of obtaining, holding and seizing power. [3]\n\nIn the same period, in order to protect the respective safety and interests, modern countries will gradually deal with external affairs as one of the daily functions of the government, and international relations have become an important topic of modern politics. In order to manage the growing international affairs, governments jointly establish modern international systems such as diplomacy, international law, and even authorize various international organizations. In addition to traditional security issues, under the trend of economic globalization since geographic discovery, the scope of international politics has gradually expanded to the management of international political economy, as well as other geopolitical affairs.\n\nSince the October 1917, the communist countries established in the world have accepted the political view of Marxism. It is believed that \"all class struggles are political struggles\" [11], \"\" politics is the struggle between all classes, politics is The relationship between the proletariat against the world's bourgeois is \"[12], and the domestic politicism is regarded as part of the global international communist movement, and its internal affairs and foreign policy are developed according to the theory theory. Such a political state has been solved in the Eastern European Communities Group and the Soviet Union in the late 20th century, only in a few countries. After implementing reform and opening up policies in the late 1970s, in Deng Xiaoping Theory: \"Politics is the overall situation of socialist modernization\" [13], will transfer the governance to the country's economic construction service; this \"Chinese characteristics Socialism \"practices, challenge mainstream political theories such as traditional Marxism and modernization, and also affect socialist countries such as Vietnam Socialist Republic.\n\nPolitical parties are political organs for political organizations that have been in ruling or promoting or protecting specific political philosophy, and most of them will participate in political activities such as elections or protests. The political parties generally have their ideology and will also propose their political roots.\n\nPolitical partieships refer to a form of a country to exercise national regimes through political parties. The political parties may be in accordance with legal elections, political revolution or military counseling. Become a ruling party, and in the wilderness party will affect the exercise of national regimes in monitoring or opposition. The public will indirectly affect public policies through political parties to political parties to political parties or vote for their support. According to the political partieship, it can be divided into a party authority, one party advantage system, two party systems and multi-party system.\n\nPolitical spectroscopy is a tool that measures the tendency of personal and political parties' political position (ie, different ideology), which is constructed from one to a plurality of axes. There are many kinds of political spectroscopy, such as political tendency test, political compass, POURELLE (English: Pourcele_Chart), etc., most of them are different from the left (socialist tendencies) and right (conservative tendencies), this is from 18th century France If the direction of the parliament is followed, the terminology of the left, right and middle school is also derived.\n\nSome political spectra add other factors in addition to the left and right, or the Nalan curve is distinguished from the political and economic orientation to distinguish the right right (authoritarian) and the left (liberalism).\n\nPolitical corruption refers to the abuse of government powers for government officials for personal illegal interests. If other reasons are abused (for example, for opponents's political persecution or police atrocities), it is not considered political corruption. Individual or misconduct, if the government has not directly involved, it is not a political corruption. Only when the incompetent behavior of government officials is directly related to their positions, it is considered political corruption.\n\nThere are many kinds of political corruption, including corruption, bribery, interest delivery, lessis, skirt relationship, political privilege, black gold, invasion, and ricotic rule. It is estimated that there is about billion US dollars in the annual world and political corruption [15]. The government's good rule of law, transparency and responsibility system help to avoid political corruption.\n\nThere is no direct statistical approach to determine the degree of political corruption. However, some institutions will release relevant political corruption. For example, the international non-governmental organization transparent international will be based on the impression of experts from different countries, and the four countries in 2012 are announced, the first three in 2012 is Denmark, Finland and New Zealand [16].\n\nDue to the complexity of politics, different disciplines, different scholars' understanding of politics and the definition of their concepts.\n\nIn politics, politics first treated as a study object. Political Science In the United States, politics is understood as a political system represented by the Constitution, legal and official agencies [3].\n\nAfter behavioralism, power has become a major factor in understanding politics. Early behavioralist Laswell believes that \"political science is the research on power and power\" [17]. Robert Doli also believes that the political system is a continuous mode of human relationship involving control, influence, power and authority. \"[18]\n\nAfter the new systemism politics, the excessive concern from behavioralism is repositioned to the study of various political systems.\n\nZhou Bao Song, associate professor, Department of Political and Administration Department, Hong Kong University, believes that many people believe that political essence is a struggle to win Lin, and distinguish between the enemy's class struggle. It is not to talk about the power of the error. It is not pragmatic and unscrupulous to morality. It is impossible to deny that there is such a phenomenon, but it is not equal to that, strive to protect the rights and well-being, to avoid individuals to protect the rights and well-being; from Confucius to Marx, construct political morality to help understand moral judgment and emotion, promote Human social progress; people are not purely self-sufficient, there is willingness and ability to live ingredients with others [19]: 3-4. Political purposes are to find ways to coordinate cooperation, resolve disputes, and establish a stable legitimate political order [20]. Because people are living together, people are multivariate, inevitable conflicts, all people have faith and pursuit, politics will appear [19]: 5. Politics is hoping to establish order through the system, get rid of violence to solve disputes; how politics is not how to achieve power, but how power is just right; need to ensure that the system ensures that the power is authorized to supervise [19]: 6. Rousseau said in the Social Contract, only the country will \"turn to the right to rights, obey the responsibility\", and the power is just [21].\n\nFrom an economical perspective, politics is a functional activity. From classical political economics to Marxism, it is believed that politics is the superior building in a certain economic foundation and production relationship is a concentrated expression of economic relations within a certain period of time. To a certain extent, the World Systems and dependent theoretists are also this view.\n\nModern Western economics regards political relations as an exchange relationship. Most of them examine politics from the perspective of individualism, and believe that politics is a series of calculations and operations that are rational for their utmost benefits. [3]\n\nBucanan is politics from public choice theory, and believes that individuals in the market and activities in the country are all exchange relationships [22].\n\nFrom a social perspective, political organizations, political relations are considered to be the advanced stage of social organization and social relationship evolution. From the perspective of social division, politics is to coordinate the normal operation of society.\n\nIn the eyes of sociologists, politics have become a function of society.\n\nFrom the perspective of law, politics is a legal phenomenon, which is the process of legislation, law enforcement, and law-abiding. Therefore, countries as political cores in some jurists seem to be set for the implementation of the law; and some people think that the country itself is also a legal person. [twenty three]\n\nIn cultural anthropology, politics is seen as a symbol, belief system, symbol. CLIFFORD Gertz believes that \"the politics of a country reflects its cultural format.\" [24] "}