{"chinese_title": "North America ", "chinese": "Northern Meilgasia (English: North America; word source: Armelgo Visphi), referred to as North America, located in the northern part of the West Hemisphere (or Northern Hemisphere). The East is from the Atlantic, the West, the Pacific Ocean, and the south of the Panama Canal is divided into South America. North America also includes many islands in the Caribbean Sea (mainly the West Indies). North America is 242.28 million square kilometers (including nearby islands), accounting for 16.2% of the total land area of ​​today's land, is the world's third continent. The population is 51.8.72 million (July 2008), ranking 4th in the world.\n\nAbout 10,000 years from 40,000 years ago, human beings arrived in North America at the last ice of the ice (now the location of the Branda Straits). The earliest arrival is called ancient indiars. After the arrival of the Americas in 1492, North American aborigines began to contact Eurasian mainland civilization. Today, North America's race and culture reflect the European colonists, North American indigenous, African slaves, and their offspring between their descendants. The northern part of North America is strongly affected by the European colonists, while the southern is relatively more affected by the Aboriginal and African Cultural. Affected by the European colonists, most North American residents speak English, French or Spanish\n\nThe mainland coastline is about 60,000 kilometers long. The northern section of the west, the north and the eastern coast is more twists and turns, multi islands and the fjord; the south half coast is flat. The total area of ​​the peninsula is approximately 2.1 million square kilometers. The total area of ​​the island is about 4 million square kilometers, ranking first in all continents, of which Greenland is the world's largest island.\n\nThe provinces and hills account for about 42% of the total area, with a plateau and mountains of more than 500 meters above an altitude, accounting for about 58%, with an average altitude of about 700 meters. The basic feature of the mainland terrain is that the mountains in the north and the south are distributed parallel to the coast, and the large plains are distributed in the middle. The terrain is obviously divided into three districts:\n\nThe North River is the Labrador Plateau, south of the Apalacian Mountains, the terrain is low, and the altitude is generally 300 ~ 500 meters. There is a narrow coastal plain along the Atlantic on the east side of the Apalacia, and the west side gradually declines with the central plain.\n\nLocated between the Labrador Plateau - Abarachia Mountains and the Rocky Mountains, Northern Hudson Bay, south to Mexico, in the middle of the mainland. Many lakes and rapids in the top of the plains, southern, gains to the river plains. The western part of the plain is a famous large plain of the world.\n\nIt is the northern section of Ciderra, from Alaska to the south of Mexico, mainly including three parallel mountains, from east to west: Rocky Mountains, Alaska Mountains - Canada Coast Mountains - Kasakarten - Nevada Mountains, West Coastal Islands in Western Canada - US Coast Mountains, where Di Na Life in the Alaska Mountains is 6,194 meters above sea level, which is the highest peak in North America. There is a plateau and a basin between the Eastern Mountain and the central mountain, and the Diovasium in the National Park of Death Valley National Park in California is the lowest point in North America.\n\nNorth America across tropics, temperate, cold belt, and climate complex. Since all the mountains are all in the north and south or approximately north-south, the wet air coming from the Pacific is only in the western coastal area; the cold air from the Arctic Ocean can pass through the central plain; the wet air blown from the tropical Atlantic Ocean can also pass through the central plain. Going deep into the north, so the climate in North America is very unstable, sometimes cold in winter, sometimes warm, the subtropical region along the Gulf of Mexico, will also happen in winter.\n\nThe outer stream of North America accounts for approximately 88% of the area of ​​the capital, of which the 48% area of ​​the Atlantic watershed accounts for about 48%, and the Pacific Waters is about 20%. In addition to the St. River, all the rivers originate from the Rocky Mountains. The rivers in the Rocky Mountains have flowed into the Atlantic Ocean and the Arctic Ocean, and the Pacific Ocean is injected in the west river. The internal flow area (including no flow zones) accounts for about 12% of the acrian area, mainly distributed in the Western American Basin and Greenland.\n\nThe Mississippi River is the largest river in North America, which is the fourth largest river in length. Important rivers are: horse growing rivers, Yukon River, St. River and Grand River. On the river in North America, the largest waterfall is about 700 meters away from Diagara Falls, which is 51 meters away from the Niagara Falls and 1240 meters wide.\n\nNorthern American lakes, the total area of ​​fresh water lake is about 400,000 square kilometers, and the first place in all continents. The lake is mainly distributed in the northern half of the mainland. Five Lakes in the central plateau: Lake Subury, Lake Humen, Michigan, Lake Ill, And Ontario, with a total area of ​​245,273 square kilometers, is the world's largest freshwater lake group, with \"North American Mediterranean\". Among them, the Lake Subury is the world's largest freshwater lake.\n\nThe distribution of all-wide population is unbalanced, most of the population is distributed in the southeast and southwestern part of the region. The population is rare in the northern region and the inland region of the United States, and some are even in place. Residents are mainly descendants from European immigrants, including the largest Anglo-Saxon, followed by black, Indians, mixed, and a few Jews, Japanese and Chinese. Mainly believe in the New Teachers and Catholicism. General English and Spanish.\nThere are 8 metropolitan regions in 10 people in North America in the United States.\n\nFigure Figures Are 2011 Census Figure.\n\nAccording to the statistics of the International Monetary Fund 2016, the per capita GDP in North America is $ 41,830, which is the world's highest in China.\n\nBoth Canada, Mexico and the United States have prosperous and diverse economies. The United States is the largest economy in these three countries, and is also the world's largest economy now (2018). According to the statistics of the World Bank, the 2018 US per capita GDP (purchasing force evaluation) reached 57,466 US dollars. The first, second and tertiary industries in the United States accounted for 1.2%, 22% and 77% of GDP. Canada has high-speed services, mining and manufacturing. Canada's per capita GDP (purchasing force evaluation) is estimated to be $ xx, which is the 11th largest economy in the world. The first, second, and tertiary industries of Canada account for 2%, 20% and 80% of the GDP. Mexico is the 15th largest economy in the world. As an emerging industrialized country, Mexico is complicated with traditional industrial and agriculture. Its main revenue comes from oil exports, manufacturing, electronics, heavy industry, cars, buildings, food, banking and financial services. The economy in North America can be divided into three areas: North American Free Trade Agreement (NAFTA), with Caribbean Community and common markets (PDD $ parties), and Central America (CACM). In addition to these large-scale trade agreements, there are still many other national trade agreements.\n\nThere are 23 countries in North America, two of which are located in North America, 8 in Central America (United Nations Geographic Program), part of Mexico as part of Central America [2]), 13 in the West Indian Islands.\n\nIn addition, North America has 22 well-independent overseas territories, which belong to the UK (6), France (6), Netherlands (6), US (3) and Denmark (1), which is affiliated with France Pinton and Nava Siza in the United States are uncommon living in the island.\n\nAll of North America is listed below and its genus:\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central American · Caribbean) · South America) Culture Geography: Angulus America / English Masseari, Latin America (Iberia, Spanish) · · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate · Vice Patent Climate (Moss Climate · Iceland Climate)\nPalace:\nOther: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate\n\n\n\nBiological distribution area\n\nNew North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories, New Tropical, Antarctic\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology and guess continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚 "}