{"chinese_title": "geology ", "chinese": "Geology (French, German: Geologie; English: Geology; Latin, Spanish: Geologia; stem from Greek γῆ and λoγία) is a discipline to explore pressure and time, history and structural research on the origin of the earth. Mainly study the material composition, internal structure, external characteristics, interaction between each coil layer, and evolution history [1]. At this stage, due to the restrictions of observation, research conditions, mainly with rock circles as research objects, and relatively deeper parts under water circles, atmospheres, biospheres and rock circles, and space geology involving other planets and satellites.\n\nThe geological time scale covers the entire earth history [2]. At its starting point, at the beginning of the earliest solar system material, approximately 4.567GA [3], the appearance of the earth is about 4.54 Ga [4] [5], and the youngest geological age is the new world at the beginning. [6].\n\nIf the Earth is born to about 45 billion years to 1 year, the time of Homo Sapiens is only a very short two minutes.\n\nZoom in Zoom in Zoom\n\nThe study of the substance component of the Earth can be traced back to the work of the ancient Greek Thaivlastos \"PERI Lith\". During the ancient Roman Times, Old Principe described some of the commonly used minerals and metals and the correct explanation of amber source.\n\nSome modern scholars (such as the Philin Hudson Garrison (English: Fielding Hudson Garrison) believed that modern geology began in the medieval Islamic world. [8] Bunny is one of the earliest Muslim Geology (English: Geography In Medieval Islam), his works have the earliest story of Indian geological (English: Geology of India), proposing the Indian sub-continent once a ocean Human assumption. [9] Islamic scholars Iben West Double the formation, earthquake cause, and the topic of other modern geography give a detailed explanation, which provides the foundation for the development of future geology. [10] [11] In China, Shen Kuo (1031-1095) proposed the falseness of land formation. He saw it in a mountain from a hundred kilometers away from the ocean, in a geological formation with seashell biological fossils. As a result, he is inferred that the land is formed by the erosion of the mountains and deposition of the silt. [12]\n\nIt used to scattered the knowledge of geology ago. About this knowledge, such as some knowledge of metal, clay, coal and salt from the ground, have long been known for miners and related people, and natural philosophers are mostly separated from these practices, independently form their own thinkatives. Geological theory.\n\nGeology began to become an independent science in the 18th century and reached a mature stage in the early 19th century.\n\nThis period of 1790 to 1830 is called \"heroic age of geology\". During this period, people have done a lot of work in examining minerals and fossils contained in rock formations and rock formations [13] [14]. At this stage, due to the restrictions of observation, research conditions, mainly with rock circles as research objects, and relatively deeper parts under water circles, atmospheres, biospheres and rock circles, and space geology involving other planets and satellites.\n. A major progressive manifestation of the working method is classified by rock formations in accordance with the content of fossil.\n\nThere are three famous arguments in the history of geological schools.\n\nIt is a dispute between the anory and the theory of fire, which happened to the end of the 18th century. The focus of the argument is that the theory of rock formation, one party represents the German scientist Abraham Gotto Vernna, emphasizes the role of water in the rock process; the other is representative of Scotland scientists, emphasizing the role of fire. Nowadays, the rocks are mainly composed of three major categories. In addition to the deposition rocks and fires of water, there is a type of metamorite. The hydrated process and the fire have played an important role in the formation of rocks.\n\nIts two for disasters and gradients (also known as averaging), in the early 19th century. The scholars who have changed the change in disaster have believed that many big disasters have happened in the history of the earth, and the disaster has caused the extinction of the old species and the new species. The scholars who have gradually changed views believe that the driving force of species evolution comes from a weak geological role in the long-term accumulation of the Earth evolution, and it can also occur without relying on large disasters.\n\nThe third argument is the dispute between fixedness and activity. Fixed alarm said that the location of the crust is never changed, and its movement is mainly moving. Traditional ground slots, platform learning is a fixed atrial. The activity aptitude said that the movement of the crust is mainly based on horizontal movement, although the vertical movement exists, but is derived from the level of horizontal movement (such as the horizontal extrusion of the two flops). With the development of the sector structure, the theory has gradually been recognized by scholars. "}