{"chinese_title": "biological ", "chinese": "Biological System Hierarchical Relationship: Biosphere> Ecosystem> Community> Population> Individual\nBiology (Latin, German: Organismus, English: Organism, also known as organism) is an individual that is referred to as a class of life. In biology and ecology, there are about 8.7 million species (± 1.3 million) on the earth, of which 6.5 million species are in terns, and they live in the water.\n\nBiological most important and basic features are two metabolisms and genetics in the organisms. The former will show that all organisms will have synthetic metabolism and decomposition metabolism (both are completely opposite two physiological response processes), and can copy genetics, This is the basis of generic life by self-dividing reproduction or sexual reproduction.\n\nAlthough it is known that biomass is evolved, the origin of life and the exact evolution history still have many details to be solved. Biological classification is challenged by molecular biology in modern times. In general, we divide organisms into three domains: bacteria, bacteria, and eukaryotes. Similar to the trouble of classification of viral and inner symbiotic bacteria.\n\nThe characteristics of eukaryotic organisms are characterized by nuclei and other membrane orgagers (such as grain numerals in animals and plants), which can also be a plant animal power plant, because he can release a lot of energy, as well as plants and algae Chlorophyll), a hypothesis is that the chloroplast and mitochondria are evolved from endosymbiotic bacteria [1]. Multi-cell organisms refers to a creature containing more than one cells, and there is a big outbreak in geology until 50 million years ago.\n\nMetabolism and genetic are two points, but more attributes need to be defined in complex life, but these attributes are not universal, see below. For example, viruses is a very special form of life.\nThere are four common attributes of biology, usually we will include:\n\nThere are other three more unambiguous\n\nThe organism is a complex chemical system that acts in maintaining the survival and development of organisms, as well as the reproducibility. Biochemistry mainly studies the chemical phenomenon in the organism [2]. The phenomenon of the entire organism can determine if the biological can be suitable for its environment, and it is also determined whether the gene in which the genes in which the genes in which the genes in which the genes within the DNA can continue.\n\nThe metabolism of the organism and many other internal functions are related to chemical reactions, especially those related to large organic molecules. The organism is a complex system formed by chemical substances, with interactions with the environment, has a variety of roles.\n\nThe organism is a semi-closed chemical system, although the organism is the unit of life, but the organism and the environment is not completely closed. The biological experience absorbs and releases energy, and the self-recovery bio uses sunlight or other inorganic substances to produce available energy (generally in the form of an organic matter), and the heterotypes are energy in an organic substance in an environment.\n\nThe main chemical elements in organic matter are carbon, and the carbon atom is characterized by strong affinity and small atomic bonds, or other carbon atomic bonds [3], and because of its small size, it can be simultaneous and Multiple atomic bones are therefore the basis of organic natives. Carbon may form a simple molecule (carbon dioxide) of three atoms, and there may be thousands of atoms, which can store the long chain (nucleic acid) of the data.\n\nMolecules that make up the organism can be divided into a polymer (also known as biological macromolecule) and other smaller molecules. These polymers include nucleic acids, proteins, sugars and lipids. [4]. Nucleic acids (especially the oxygen nucleic acid, DNA) use nucleotides sequences to store information. The special sequence of four nucleotides (adenine, guanine, thymidine and cytosine) determines many of the characteristics of the organism. The sequence of nucleotides can be removed into a number of genetic passwords composed of three nucleotides, corresponding A special amine acid [5]. Therefore, the sequence of the DNA corresponds to a particularly protein, and since the chemical properties of the ingredients of the ingredients, the protein will be folded according to the special manner, and a specific function is performed.\n\nHere are the function of known proteins:\n\nThe double layer of phospholipin constitutes a phospholipid dual molecular layer, and is the main structure of the cell membrane, which is covered with an outer surface of the cells to prevent intra-chemical fluid inlet and out cells. Due to the selective penetration of the phospholipid dual molecular layer, only a specific molecule can pass through the cell membrane. In some multi-cell organisms, this can be a method of storing energy and a method of propagating data between cells. Compared to lipid and protein, sugar is more likely to decompose, and more easily converted to energy, in all organisms, sugar is the most common source of organic molecular energy.\n\nAll organisms can be classified as classification units or sorted classification according to biological taxonomy.\n\nThe classification unit is a group in the biological classification class, from the most extensive domain to the finest species, the classification class is as follows:\n\nFor example, Homo Sapiens is a latin of modern human (wise people), and all human belongings can reproduce future generations, but if they are organisms of different species, there is no reproductive ability. The human creature is now only human, and other people who are like the alone, Ni Anders, have been extinct before thousands of years. Finally, it will be based on the gene and structural characteristics of the organism, in this suitable boundary (in this example, for the animal).\n\nAll scientific known creatures can be classified according to this system, so the organisms of the same subject will be closer to the biology of the same section.\n\nBecause the virus is not a biological, the classification of viruses is quite challenging. The earliest virus would be classified according to their host: animal virus, plant viruses and phage, and later the resulting disease classification, such as respiratory viruses. The virus is now classified according to its nucleic acid, the symmetry of the casing and whether there is an envelope.\n\nThe virus is usually not considered a biological because it cannot be independently breed and metabolism. [6]. However, viruses are classified as a microbial category based on the biological weapons and illegal use of UNITED States Code. Since many parasitic animals and endosymbionts lack independent survival, the virus is calculated as a biological controversy. Although virals are enzymes and other organizers, they cannot survive outside the host cell, and the process of viral metabolism needs to participate in the host genetic mechanism. The origin of this parasitic phenomenon is not clear, but it is possible to produce from host.\n\nLife is one of the basic parameters of the organism. Some creatures can only survive, and some organisms can survive for thousands of people, such as some plants. Lighthouse water is a known one of the currently there is currently no life-limited.\n\nCell aging is important when determining the life of organisms, bacteria, and viruses or even prion bodies.\n\nAt present, the scientific community generally believes that there is a large relationship with a special DNA sequence of the end of the cell chromosome - Terminal granules and cells have a large relationship [7]. Normally, the cells will be shorter per split, and the endometers will become short. As the telomere is gradually shortened, the deletion of DNA sequences that are meaningful to cell life activities in the middle of the chromosome DNA are finally caused. Since normal physiological activities cannot be continued at this time, the cells will conduct a procedural death-apoptosis.\n\nIn addition, tumor cells are typically not shortened, which is also one of the reasons why tumor cells can perform unlimited split.\n\nIn biology, the theory of common origin presents all organisms on the earth originated from a common ancestor or ancestral gene base, which can find a common ancestral evidence between all organisms. In the era of Darwin, evidence is completely similar to the common characteristics, such as all birds have wings. "}