{"chinese_title": "physics ", "chinese": "Physics (from ancient Greek: φυσική (ἐπισήήμη), Romanization: Physik (Epistḗ), Literature: Nature's knowledge, from ύύσις, turnover: phýsis, literal translation: Nature) [1] [2] [ 3] It is natural science of the essence and nature of the study of substances, energy. [4] Since material and energy are basic elements involved in all scientific research, physics is one of the most basic disciplines in nature sciences. Physics is an experimental science, physical scholars from observation and analysis of nature-based phenomena based on material and energy. These patterns are called \"physical theory\", which can result in the common physical theory of experimental tests called physical law until one day proves to have errors (negative negative). Physics is made up of these laws. Physics is one of the most basic disciplines in nature science. Theory of chemistry, biology, archaeological and other sciences is the construction of these physical laws. [5]: 1-2 [6]: 2-3\n\nPhysics is one of the oldest academics. [6]: 2 physics, chemistry, biology, etc. Originally attributed to the scope of natural philosophy, until the seventeenth century to the 19th century, gradually grow from the independent academic field from natural philosophy. [7]: 193-194 Physics has considerable intersection with many other cross-domain research, such as quantum chemistry, biophysics, and more. The physical border boundary of physics is not fixed. The founding breakthrough in physics can often be used to explain the basic mechanism of these cross-regional research, and sometimes open a new cross-section research. [5]: 1-2\n\nThrough the creation of new theories and development new technology, physics has extremely significant contributions to human civilization. For example, due to electromagnetic rapid development, new products such as electric lights, electric machines, household appliances have emerged, and the living standards of human society have also been greatly improved. [5]: 1 [8] Because the nuclear physics is getting mature, nuclear power generation is no longer a blueprint concept, but the security issues that have caused people to realize the earth environment, ecological and humans.\n\nThe word \"physics\" is \"Physics\" in English, and it is the first to come to the ancient Greek \"ύύσις\", the original meaning is \"nature\". In Chinese, \"Physics\" can be found in the Warring States Period, \"鹖 鹖 · 鈇 鈇 鈇\" \"I hope to know how to physically physically, I will find\" physical \",\" Physics \" It is all the truth of everything. [9] The three countries, Yang Quan has \"physics\", the earliest title contains \"physics\" one word. [10] The scientists in the late Qing Dynasty were influenced by the West, and the encyclopedia book \"Physical Experience\" was written here. Here, the meaning of \"physics\" has evolved into academic, including natural sciences. Some fields of humanities. [11] [12]\n\nAfter the Qing Dynasty Opium War, Western science was introduced to China. At this time, the translator translated \"Physics\" as \"Gechi\" or \"Geology\". \"The word\" is known \"is derived from\" Book. University \":\" \"I know in the form, the given is known\", say, \"If you want to enhance knowledge, you must be careful, only the reason of the matter, you can enhance knowledge.\" This sentence is pointed out that things are the key ways to enhance knowledge. In physics, you will usage, simulation, experiments, presentations, interpretation, and other methods. Therefore, \"Physics\" translate \"Physics\" or \"Geology\" seems to be reasonable. [13]: 2-3\n\nChinese Warring States philosophers famous Hui Shi, Deng (DANG and Gong Sun Long, and ink home, have worked hard to study all the composition of the universe. Hui Shi has ten propositions, mainly analyzed for nature, some of which contain dialectical elements. He said: \"The big one is not outside, it is a big one; to a small incomplete, it is a small one.\" \"Big\" means that the whole space is big enough, no longer have external; \"small one\" refers to the unit that is the minimum substance, and it is not segmented, no longer there; [14]. The famous ideological contract is dedicated to the representative, and believes that \"Tian and the Geoteles, Mountain and Zip Ping\", all things \"all\" is \"diplomatic\", there is no difference [14]. The post-ink family believes that the material world is composed of micro-non-divided material particles [14].\n\nSince ancient times, people have tried to understand the mystery of nature: Why do things fall into the ground? Why does different substances have different natures? So wait. From the phenomenon of observation and analysis, early people found the style and put forward various theories for these styles, trying to explain the mystery of nature, but most theories they have are not correct. From a modern criterion, the early physical theory is more like some philosophy theory: modern theory needs to have a strict experimental test, and those early theories have not been strictly confirmed. Among the theory of Tobegm and Aristotle, some are contrary to the facts that the daily observed. [16]: 1, 28\n\nDespite this, there are still many ancientists contribute a quite correct theory. Ancient Greek philosopher Tayles (previous 624 - 546 years) once traveled into the Mediterranean, in Mesopoamia Egypt, studying astronomy and geometry, and promoted extended, and promoted. He predicts the yaw of the 585 BC, and it is also possible to estimate the distance from the shore, and the height from the shadow of the pyramid. Tayles refused to rely on nick or supernatural factors to explain natural phenomena. He advocates that any incident has its constant causal causal relationship. [15]: 8-10, 28 [17] The ancient Greek philosopher, the first 5th century BC, led the first to the primary discussion, and believe that all substances consist of not destroyed and indivisible atoms. . [15]: Ancient Greek's thinker Akimid derived a number of correct quantitative conclusions in terms of role, such as explanation of leverage [15]: 65-66.\n\nFrom the Xiyuan 850 to 950, a large number of Greek academics were translated into Arabic. Muslim scientists inherited Aristotle physics from the Greek. In the Islamic Golden Age, they will carry forward these academics, especially emphasize observations, and develop an early form of scientific methods. [15]: 130-131. [18]: 362-363\n\nIben Schal (English: IBN SAHL), KFI, Heishu, Iben Westa gives innovative theory in optical and visual fields. Heshum is firmly refuted by the famous book \"Kitab Al-Optics\" (Kitab Al-Optics \"(Kitab Al-Optics\" (Kitab Al-Optics \"(Kitab Al-Optics\", firmly refute ancient Greek visual theory - launching and giving new theory. Relying on the information on the internal anatomy of the eye, he explained how the light enters the eyes, how to focus and projection to the back of the eye, he thinks the eyes are like \"dark room\", after the light enters a small hole, form an upside down image in the dark room . Obviously, here, he refers to a pinhole camera or a dark box. He also describes how to use darkroom to observe the eclipse. [19]: 6-7\n\nThe achievements of Heshuma in the Arab world have not received their attention. In the twenth century, his work was translated into Latin, and the book was named \"perspectiva). Until the seventeenth century, this work in Europe is an optical standard reference book, which strongly affects the study of Johannes Cipher, Wittro, Roger Peter and other scientists. [19]: 6-7 [20]: 86, 209\n\nClassical physics refers to physics that does not involve quantum mechanics or relativism, such as Newtonian, thermodynamics, Mark Wewei electromagnetics, and more. [21] The period of the classic physics begins in the sixteenth century, the first scientific revolution, and terminates in the end of the 19th century. [22]: 67 [23]: 11 Nikola Coperniced the first shot of the scientific revolution, and he put forward the date of describing the sun system in 1543, this theory overthrew the role of Toller. During 1609 and 1619, Johannes Kelch was published the law of the leading planet, and he used the mathematical equation to accurately estimate the planetary discovery from astronomical observations around the public transfer data from the sun, thus giving the heart to say strong and powerful. Theoretical support. Galileo Galilele made an experimental study of object motion, discovered the law of the law, and showed the importance of experimental methods for scientific research. He relies on the use of experiments or observations, rather than relying on pure reasoning, to confirm any of the correctness of the hypothesis. He emphasized the use of mathematics to describe physical phenomena, and the language of nature is mathematics. If you don't understand mathematics, you can't understand nature. In 1687, the Law of Newton, Bouton and the law of gravitation laid a solid foundation for classic physics. He and Gottfried Leibniz created a solution, giving a new high-functional mathematics. Methods to analyze physical problems. He made a perfect terminator for the first scientific revolution. [24] [22]: 84, 98 Physics showed two single features: using experimental evidence to view physical law, using mathematical language to express physical law. The gradual development of physics has become an independent discipline. [22]: 100 [7]: 193-194\n\nAt the beginning of the twentieth century, physicians found that there was a very serious flaw in classic physics: the zero results of Mike - Mo Li experiments did not meet the prediction of classic physics. The black-body radiation spectrum did not meet the thermodynamic prediction. Classic electromagnetically unable to explain photoelectric electricity. The effects and atomic spectroscopy, the physical properties of radioactive materials are similar to the decision of classical physics. These 疵 brought an unprecedented test to the academic community, completely shake the cornerstone of the old theoretical system, led to the relationship between the two major theoretical systems of the 20th century and the emergence of quantum mechanics, and began the era of modern physics. Relativity and Quantum Mechanics give a reasonable solution to these puzzles. Not only that, physical scholars apply relativism and quantum mechanics to micro-systems like atoms, molecules, etc., and various coagulatory macro systems, thus deepening the working mechanism of nature, and promoting the flourishing of material civilization. [25]: 1-2\n\nAlthough physics has a wide range of studies, physicians often use the core theory of certain physics. These theories have passed many inspections of different experiments, and the prediction of natural phenomena is considered enough accurate, for example, classic mechanics theory can accurately describe the movement of objects, but must meet two premises, one is the size of the object is large At the atom, the second is that the object motion speed is too small and the light speed. [26]: 2 Today, these core theories are still very popular in research. For example, after the second half of the twentieth century, after three centuries of Buffton (1642 - 1727), scholars found and creating chaos theories, revealing the predictability of the mechanics system, is a mistake Concept. [27]\n\nThese core theories are generally included in the field of classic mechanics, quantum mechanics, thermodynamics, statistical mechanics, electromagnetic, narrow relativism, etc., is an important tool for advanced research topics. [28]\n\nClassic physics includes traditional academic branches in the early 20th century: classic mechanics, acoustic, optical, thermodynamics, electromagnetic, and more. [twenty one]\n\nClassic mechanics study the motion of the object. Newton's law is the basic law of classical mechanics. Classic mechanics is divided into static, kinematics and kinetics. Static discussion is in the static balanced object feels the force and torque. Kinematics describes the movement of the object, completely regardless of force or quality, etc. affecting the factors. Dynamics study changes the factors of object motion and object motion thus change. Different in the manner, classic mechanics can be divided into vector mechanics and analytical mechanics. Vector mechanics focuses on the relationship between displacement, speed, acceleration, force, etc., and analytical mechanics analyzes the motion behavior of the object from the Ragrang's daily or Hami at the time of the force of the object. [29]: Introduction [30]: 5-6\n\nAcoustics is an academic field of research, control, transmission, reception and effects. [31] Ultrasonic, biological acoustic (English: BioacouseTICs) and electroacoustic (English: electrocousetics) are some important modern branches contained in acoustic. Ultrasonic studies exceed high frequency acoustic waves in human auditory capabilities, there are many important uses in medical diagnosis and medical treatment. The biological acoustic study involves the sound wave of animals. Electronic acoustic wave study electroacoustic device control. [32]\n\nOptics focus on the nature of light and the physical branch of behavior. [33] Light is considered to be rays in the geometry optics, and it can be changed in line until it encounters different media. Reflection, refractiveness, etc. can be explained by geometric optics. Light is considered to be light wave in physical optics, which can be used to describe diffraction, interference, polarization, and the like. [34]: 149\n\nThermodynamics mainly studies the conversion between heat and mechanical work. In thermodynamics, natural phenomena is generally explained through a macro variable, such as temperature, internal energy, entropy, pressure, and the like to describe the average properties of physical systems. Thermodynamics study these macro variables (such as Maxwell relationship), and their changes in the influence of physical systems. [35]: 51-56 The starting point of learning thermodynamics is the law of thermodynamics. The micro-properties of thermodynamics do not study substances, which belongs to the field of statistical mechanics. From the theory of statistical mechanics, the law of thermodynamics can be derived. [35]: 195 Statistical mechanics applications to study the physical behavior of systems composed of large amounts of particles. Statistical mechanics bridge the micro-properties of the individual atom or molecule to the macrodynamic nature of the bulk material, and the interpretation of the micro-hierarchy is given for these macro properties. These macrological properties can be measured in large-scale experiments. [36]: IX-X\n\nElectromagnetic description with electricity particles and electric fields and magnetic field interactions. Electromagnetic branches include electrostatic, static magnetic, electric mechanics, and more. Electrostatic study of interaction between stationary charged particles. Magnetic Studies All phenomena involving a constant magnetic field. Electrodynamic Studies All phenomena involving acceleration charged particles, electromagnetic radiation, time-variable electric field and time-varying magnetic field. The basic theory of classic electromagnetic is the Markish square formula and LORLLLLLOR [37]. The optical wave is one of electromagnetic waves, and can be generated by an acceleration motion of the charged particles. [38]\n\nClassic physics is usually used to illustrate system phenomena of daily observable size, and modern physics is usually used to illustrate extreme or very large size, very small-sized systems. For example, the minimum size of chemical elements can be identified is the size of the atomic physics or nuclear physics exploration material. The size of the particle physics operation is more small, which is discussed to be a basic particles or particles consisting of essential particles. Since the use of large particle accelerators to produce basic particles requires very huge energy, usually particle physics is also referred to as high energy physics. For the physical system studied by particle physics, those conventional common sense about space, time, substance, and energy are no longer applicable, must be modified. [25]: 269, 477, 561\n\nTwo core theories of modern physics give a new spoiler about space, time, substances, energy. Quantum mechanism The discrete property that occurs in various phenomena of atomic hierarchy and subharmonic levels, and complementary properties of particles and fluctuations in the description of these phenomena. Relativity, the observer in a reference system, observed in another one of the reference lines moving with relative speed. Relativity can also be divided into narrow relativism and general relativity. The difference between narrow and general relativity is whether the problem discussed is involved in gravity (bending time and space), that is, the narrow relativeism only involves problems that have no gravity or gravity can be ignored, and broad relativity is to discuss the topics involved in gravity. [25]: 1-4, 115, 185-187\n\nA major research objective for physics is to discover General Law (English: Universal Law), which has no exception, but it seems that each physical theory is only applicable to certain clear values. [39]: Section 9.1, the law of classical physics can accurately describe a system having a length of large length than atomic scale and a speed of ultra-smaller than a radius. In this application range, the experimental results are not in line with theoretical forecast. The narrow relativeism thoroughly discards the concept of absolute time and absolute space, and is replaced by four-dimensional time and space, thereby accurately describes the system that is close to the light speed, that is, the relative argument system. [25]: Quantum mechanics does not seem like classic physics generally determine the physical behavior of macro objects, but statistically describe the physical behavior of micro-systems, it successfully passed the precision of today's test Complex experiment. [25]: 221-225 [40]\n\nQuantum field theory is unified, quantum mechanics and narrow relativity, is an indispensable basic theory of particle physics. [26]: 2 Electromagnetic interactions and weak interactions have also been combined into an weak interaction. [26]: 338-346 Physicians expect in the shortcomings, electromagnetic interactions, strong interaction, and weak interaction can be converged in the discussion of large-one theory. [26]: 84-85 Generalized relativity extends time and space into dynamic curved time and space, which can describe large-size structures of large quality systems and universe. [25]: 3-4 However, general relativity and other basic interactions have not been unified as a single theory; scientists are still developing several possible quantum gravity theories. [41]\n\nMathematics is one of the tools for studying physical essentials, including geometric, algebra, calculus, and more. To applying these mathematical tools, physicians can derive and calculate many interesting results from physical law. For example, in 1912, Turio Levichvi learned Albert Einstein to explore the relative theory of gravity, he met some setbacks, and he would persuade the Sintean learning tensile amount of calculus. Einstein adopted the suggestion of Levichva, diligent tension, and successfully founded general relativeism in 1915 [42]. Like most Britain's theoretical physics, Roger Panlos read college specialty mathematics, therefore has a deep mathematics, which can introduce topological methods into relativistic research, prove that there is a singular point in the center of every black hole, this It is a famous singularity in cosmology. [43]: 462, 469\n\nThe main role of mathematics in physics is not a good tool for deriving and calculus, and it also plays a more critical role: as an abstract language, it is precisely expressing the physical law. In fact, physical law must be expressed in a mathematical language before you can play the function of mathematical tools. Galileo mentioned in the 1622 book \"Analyst (English: IL Saggietore\" mentioned that mathematics is the language used in nature expressing its connotation. If it is not used, it is unable to understand any sentence of nature [44]. Physics relies on mathematics to give accurate formulas, accurate or approximate answers, quantitative results or predictions [45]. Richard Ferman also has similar sayings in the book \"The beauty of Physics (English: The Character of Physical Law\", he believes that people who don't know mathematics difficult to really understand the beauty of nature, especially the most profound natural Beauty ... If you want to know anything about nature, or want to appreciate the big nature, you must understand the language used in nature [46]\n\nWhile expressing physical law, the mathematical language also expresses the internal mathematical concept. For example, according to the quantum mechanics, there are two basic concepts in quantum mechanics: the quantum state of the physical system is represented by the unit vector of Hilbert, and the observable amount obtained from the observation physical system is to function. Elm operators of these vectors are represented. Once the corresponding mathematical concept of these two basic physics concepts, the theory of the entire linear algebra can be applied immediately to quantum mechanics. This highlights the importance and adaptability of mathematics [47].\n\nMathematical language is filled in mathematics theory, and its accompanying mathematical concept will often point out the road, sometimes even derived experience prediction. This is not just coincidence, but it is precisely in the relationship between mathematics and physics. For example, in 1915, when the broad relativity was originally created, there was no reliable empirical observation foundation. It was the most famous phenomenon that the best in the at that time was the abnormal progress of the Mercury, which was unable to explain. In 1919, the body physicist Jazz, Jazz, Orthesto, 1919, observed the exfolition of light in the sun gravity field (this experiment until 1959 began to quantitatively measured), which is a broad relativity The most powerful support. Today, the theoretical prediction of general relativity has been confirmed by experimental measurement [42].\n\nPhysics is a basic science, not application science [48]. Physics is also considered to be basic science in basic science, as other natural science branches, like chemistry, astronomy, geophysics, biology theory must comply with physical law [49]: 94FF. For example, the nature, structure and chemical reaction of chemical studies (chemical focuses on atom size, which is the main boundary of chemical and physical). The formation of the structure is because the particles are interacting with each other. The energy conservation, calmness, charge conservation, etc. These physical law lead to material properties and chemical reactions, and in the past, chemists can only use various fuzzy concepts to establish a more correct understanding due to the development of quantum physics.\n\nApplying physics refers to physics research on practical use. Applying physics's curriculum rules usually select a course of application disciplines, like geology or motor engineering. Different physics and engineering, application physics does not specifically design certain components or machines, but use physical theory or physics research to develop a new technology or parse a problem.\n\nEngineering applications to many physical theories. For example, before learning the technology of building bridges and other buildings, you must first learn the theory of static learning. Designing world-class concert halls must first learn. Design and manufacturing more excellent optical components must be readily readily reading optics. Flying simulators, video games, movies, etc. designed by various physical factors, will look more vivid, vivid, and lifelike.\n\nThe nature, composition, structure, and variation of chemical study materials. The object of chemical studies involve the relationship between the substance, or the association between material and energy. Traditional chemistry is often regarding two substances contact, variation, a chemical reaction [50], or a substance to become another substance. These changes sometimes require electromagnetic waves, and among electromagnetic waves are responsible for exciting chemical effects. However, sometimes chemistry does not have to have a reaction between substances. The relationship between the spectroscopy study material and the light, and these relationships do not involve chemical reactions. Accurately, chemical research is included in the nuclear-electronic system, including molecules, electrons, ions, atoms, and atomic groups. [51] With the development of quantum physics, chemistry also absorbed quantum physics theory established a more complete theoretical basis.\n\nPhysics use some of the probe sources, and the method of reference can also be used in interdisciplinary fields. Physics or more affects many important academic areas, for example, economic physics applies a large number of physics to analyze economics, which often involves uncertainty or chaos.\n\nScientific approach is a systematic program for answering questions. Through this procedure, you can develop a reasonable explanation for nature phenomena. It often finds meaningful problems from observation of natural phenomena, reading books or discussions. If the problem is too complicated, it must be stripped with an insignificant part, find core ideas, simplify the problem, [52]: 191-192, thereby developing the problem to explain this issue and take the experiment test. After experimental test, it may be necessary to improve or dismiss for hypotheses. This strict process may repeat multiple times, until the prediction of false words can meet the experimental results, this hypothesis can be accepted by the academic community into scientific theories. [53]: 295-297 [54] [49]: 66FF\n\nThe experimental test must have the ability to grasp the scientific theory. Carl Popur emphasized that scientific theory must have documentation. In other words, it is necessary to compare the theoretical prophecy and the experimental results, if the two are inconsistent, the correctness of this scientific theory cannot be recognized. [55] However, in the near future, some chord theory scholars advocated with cosmic scholars, a theory of explanation of an interpretation of related issues and can not pass experimental tests, for example, so far, the string theory is the only four kinds The basic interaction theory, but the additional dimension concept it proposed is unable to be observed. In the universe, multiple universe theory, the agarism theory involves the discussion that cannot be observed. Theoretical Physics Paul Starn Hart said that the theory of universe is not scientific, because all observations will meet its prediction, in other words, it does not conflate fake. Whether these theories are scientific theory, it is necessary to study and debate more carefully. [56]\n\nPhysics research is roughly divided into theoretical research and experimental study. Richard Ferman show the same and different from the two: [49]: 39\n.mw-parser-output .templatequote {margin-top: 0; overflow: hidden} .mw-parser-output .templatequote .templatequotecite {line-height: 1em; text-align: left; padding-left: 2em; margin- Top: 0} .mw-parser-output .templatequote .TemplateQuotecite cite {font-size: small}\n\nTheoretical physicist imagined, deducement and guessing new law, but did not do experiments, and experimental physicians were experimenting, imagined, deducement and guess.\nTheoretical research and experimental study are generally separated, however they are closely related to each other, and it is not possible. The experimental results give recommendations for theoretical development, theoretical forecasting leads to experimental design. [57]: 148\nOver the past few hundred years, the experimental results have driven the progress of theoretical physics. In recent decades, the evolution of physics has been significantly changed, and in the field of physics branches, theoretical prediction drives the direction of experimental physics. In general, when the experimenter discovers a new phenomenon, the known theory cannot explain this new phenomenon, or when the prediction made according to the new theory can be inspected by designing exquisite experiments, paying a bold assumption, be careful Attitude, physics often make progress. [58] For example, various research on large brain colligations perfectly showed the complementary help of theoretical physics and experimental physics. Since the previous theoretical physicist predicts the existence of Higs Classic, the experimental physicians will persist in exploration of their traces. After decades of hard work, the Signs bolts were exactly exactly. Today, theoretical physics is waiting for more practical data to instruct the future theoretical research direction. [59]\n\nExperimental Physicians Design and Complete Experiments to Test the Prediction and Exploring New Physics. [60] Experimental physicians explore the mystery of nature, one is a negative approach, such as astronomical observer practices, because the physical behavior of the universe, the other is a positive way, like particle experimenter, Control particles to demonstrate their behavior and nature. [61] [62]: 1-2\n\nExperimental physics has expanded engineering and technology and is also expanded by engineering and technology. Personnel involving basic research, when doing experiments, often exposure to advanced equipment like particle accelerators or lasers; those involved in application research, often in operation, development like positron emission computer fault scanning Technology, a class of crystal. Sometimes, some very interesting areas, although theoretical physics has not explored the argument, the experimenter will also do experimental test tests. [62]: 30-31 [46]: 157\n\nTheoretical physicist attempts to develop mathematical models, this model must be able to explain the physical phenomenon targeted by it, and the prediction of this model must also match the experimental data. [63]: 9 Theoretical physics should be possible to have the largest, and the least cost base research areas. Theoretical physics advances the basic knowledge of nature, but also spreads precious seeds for tomorrow technology. Semiconductors, solar cells, lasers, global positioning systems, light emitting diodes, nuclear fissures, nuclear magnetic resonances, etc. For human civilization, there are great contributions to the theoretical physicians. [64]\n\nImblegatic Experts strive to explore the intricate integration of theory and experiments; they focus on the complex phenomena observed from the experiment, trying to find the relationship between the complex phenomena and physical theory. Imblegation Experts calculate the forecast of the theoretical model and compare these predictions with experimental data. [65]: 111 [66]\n\nPhysics covers a wide range of natural phenomena, from minimal basic particles (like: quark, microcales, electronics) to huge superb starry groups are research objects. A lot of thousands of variables can be used to make reasonable descriptions and explanations in a more basic phenomenon. Physics is a basic science, [49]: 94FF physicians are committed to chasing the root causes of these phenomena, and trying to find any links. The results of the Physician Strive to Research are roughly summarized as some clear basic laws. Many of many academic areas, like biology, chemistry, geology, engineering, etc., the material systems involved are complied with these basic laws. However, these fundamentals are still incomplete. The description and explanation given by physics for natural phenomena, just approximation, not absolute facts. [67]: 3FF [49]: 66-71\n\nFor example, the ancient Greeks know that the substances like amber, when grinding with fur, will appeal, so that the two abrasives are attracted to each other. [68]: 50 This nature is later referred to as electricality. In the seventeenth century, scholars began to carefully This nature is investigated. [69]: 8 In addition, in the end of the Asian continent, the ancient Chinese observed some stone (magnet), which will attract each other through some kind of obsenerable force. [70] [71] This nature is later referred to as magnetic. In the seventeenth century, scholars began strictly poor their causes. [69]: 8 After the effort, the hard work, the hard work, the physicist finally understood the basic cause of these two natural phenomena - electricity and magnetic. However, in the twentieth century, through a more in-depth study, physicians found that electrical and magnetism were two different performances of electromagnetic interactions. Today, this unified various interacting procedures are still in the ascendants, and physicians believe that electromagnetic interactions and weak interactions are two different performances in electrical interactions. The ultimate goal of the physicist is to find a perfect universal theory that can explain all the nature of nature. [72]\n\nModern physics research is generally classified as astronomical physics, atomic molecules and photophysics, particle physics, coagulation physics, application physics, etc. [73] [74]. Some universities also provide physical education research [75].\n\nSince the 20th century, the more specialized in various fields of physics. Most physicists have only specially designed in a field, like Albert Einstein (1879-1955) and Pev Lang Road (1908) -1968) This whole talent now is now in Morning Star. [Note 1]\n\nParticle Physics Study Composition of the basic particles of the substance, their structure interaction between them [76]. In addition, particle physic scholars design and development require high energy accelerator [77], detector and exploration of distributed processing systems, computer program [78] [79]. Due to the general conditions of nature, many basic particles do not exist, the existence of the life cycle is extremely short or unable to appear alone, and the physicians need to use extremely high energy particle accelerator collision to generate these basic particles, so particle physics is also High energy physics [80].\n\nThe standard model can correctly describe the interaction between basic particles. This model can illustrate 12 known particles (quark and light), which interacts with each other with strong strength, weak, electromagnetic or gravitational force. These particles will exchange specifications of the bicycles (which are gums, photons, W and z-Bangi). The standard model also predicted the existence of Higs. In 2012, the European Nuclear Research Organization announced that Kesius bolts were explored. [26]: 49-52 [81]\n\nAtomic molecules and photophysics focus on studying atomic, molecularities, and light, and studying interactions between substances and substances between substances. It is elucidated the basic law of physics to understand how substances are formed by grouping atoms and molecular hierarchies, understanding the interaction between light and substances, developing new technologies and new devices, which are central targets of atomic molecules and photophysics. Experiments and theoretical technologies for atomic molecules and photophysics, often applied to other scientific areas, such as chemistry, astronomical physics, biology, pharmaceutics, etc. For many other scientific sectors, through the development of methods on controlling and manipulating atoms, molecules and light, or by accurate measurement and analysis of their physical properties, or by developing new methods, the atomic molecules have a certain specific nature. Plays with optical physics play an en functioning role. [82]: 1\n\nThe structure and physical properties of atomic physics research atomic physics. [84] [85]: 148 Atomic physics research is mainly divided into three trends. The first is to study the law of nature, which usually involves high precision measurements. The second is to understand the structure of the atom, as well as the interaction between atoms and light. The third is to study the interaction between atoms and electrons, atoms and ions. [83]: 53\n\nMolecular physics attempts to understand the structure and physical properties of the molecules, how to interact with molecules and molecules, and more complex substances, such as liquids, and the like. Molecular physics is a learning across physics and chemical boundaries, which are commonly used for spectroscopy, diffraction, resonance, molecular beam, mass spectrometry, and more. The main research objectives of molecular physics are: molecular shape and structure, molecular symmetry, molecular energy state, molecular optical properties and electromagnetic properties, methods of detection molecules, in the field of technology and biology and pharmaceuticals . [83]: 88 [86]: 10-13\n\nPhotophysics study light properties, interactions between light and substances, including light generation and detection, linear and nonlinear optical processes, spectroscopy. Optical physics content and application optical, optical engineering is very neighbor. Optical physics focusing on light of light, application optics focusing on application related technologies in other scientific fields, while optical engineering focuses on the design and development of optical devices. Some forward-looking research areas are laser, laser spectroscopy, quantum optical and quantum coherent, femtosecond optical (English: femtosecond Optics), laser cooling, laser capture, etc. [83]: 110\n\nThe macrodynamic properties of condensed physics research materials, such as data obtained from the density, magnetization intensity, conductivity, thermal conductivity, and the like obtained from the measurement material, can be seen for the reaction of the external effect. The interaction between the particles and the particles is the premise of known interactions, and the coagulation physics gives the analysis and the description of the multi-level subsystem to give a working frame. Condensitive physics focuses on multi-particle systems, and the aggregate state is composed of a large amount of particles, and there is a strong interaction between particles and particles. [87]: 1-3 Common aggregate states have solid state and liquid, and these objects will occur due to chemical bonds formed between the atom and atoms. A more rare coagulation state includes superfluid and glass-Einstein condensed state that occurred in very low temperature systems, [89] [90] Superconstruction in the conduction electronics in some substances, [91] in a certain Some magnetic materials inside the dominant material and the anti-ferromagnetic state that occurred in the spin of the atomic lattice. [88]: 85-87\n\nConservation Law and Symmetry Detailed Subject The macroscopic nature of the substance is an important concept of condensed physics. In isolated systems consisting of a large number of particles, the number of particles, energy, momentum, and charges are all conserved. In sufficient high temperature conditions, this system has high symmetry, such as rotational symmetry and translation symmetry in the free space. Assume that the temperature is reduced, a new thermodynamic steady state is condensed, which has increasing symmetry, and therefore, the symmetry will become lower and lower. [88]: 1-3\n\nCondensed physics originated in the development of solid physics and low temperature physics in nineteenth century, today is the largest branch of physics, with chemistry, materials science, and nanotechnology have a considerable degree of overlap. [87] [92]\n\nAstronomical physics mainly studies the nature and structure of the universe. [93] [94] This includes stars, planets, galaxy, nebula, dark star, black hole, etc. Astronomical and Cosmology is its sister academic field, it is difficult to do it strictly. Briefly, astronomical measuring the position, exercise, photometric, etc. The nature of the overall or large scale structure, for example, the mechanism of the big explosion or universe. [95]\n\nSince astronomical physics is a widely learned, astronomical physics usually requires many different academic theories, such as classic mechanics, electromagnetic, statistic, quantum mechanics, relativism, particle physics, etc., these academic theories Applying to astronomical research, such as gerberans, dense double stars, large-scale structures, star kinetics, etc., often get a meaningful answer. [96] [97]\n\nAlthough physics is one of the oldest academics, today, there are still many breakthrough epoch-study in the field of physics, such as in full swing.\n\nIn the field of condensed state physics, certain substances are still superconductivity above 50 k, and physical scholars do not know why this high temperature superconducting phenomenon is [98]. Many aggregate experiments are to make the spin electronics element and quantum computer components [99] [87].\n\nIn the field of particle physics, experimental evidence of physics after supporting standard model has begun to appear. In these results, it is more important that the microbes have a non-zero quality. This experimental results have reasonable solution to the lack of remarkable solar neutrons, that is, some microcales will be converted to the inevitable microboni of the experiment from the solar path to the earth. Physical research with quality microcanons is a very hot theory and experimental topic. It is also an important topic that identifying microcales oscillation and anti-microbiological shock, which can be substances everywhere in the universe, rather than this cosmic puzzle. Many experiments are looking for inert, micro-mousse horses. [100]\n\nHigh-energy large strong collision has begun to detect 14TEV energy domains, exquisite post-standard models of the particles predicted, or about 85% of the cosmic substance, these are all high-stricken collimers. Explore the goal. European Nuclear Research Organization (CERN) announced that the big strong collision has discovered Higs bolts, but the number is limited, and its nature cannot be observed in detail. In the future, the future is collected more data, such as Higs Ballonians. The frequency of the decay pipe is expected to be able to find any physical behavior that does not meet the standard model and find any different kinds of Higs. [101]\n\nIn the field of theoretical physics, theoretical physicians tried to unify quantum mechanics and generalized relativity theory. This study has continued for more than half a century, but it has not been satisfied with the answer. Today, several successful theories are M theory, upper string theory, circle quantum gravity. [102]: 296\n\nIn the field of astronomy physics, many astronomical and universe are still not found, such as ultra-high energy cosmic rays, heavy subsequentity, galaxy rotation issues, etc. [104]: 60, 187-188. [106] Some important topics are listed below: [107] [108]\n\nAlthough high-energy physics, quantum physics, astronomical physics has great breakthroughs, scientists are still a transparent, for many phenomena involving daily generations involving complex systems, chaos, turbulence, etc.. [109]: 30 [111] The phenomenon of earthquake, break, life, etc. will only occur far away from the balance, and the system appears is called a depreciation balance system (English: Far-from-Equilibrium System System ). Many physical behaviors about balancing systems or near balance systems have been known, but physicians only know the basic principles of the leading balance system. [112] "}