{"chinese_title": "clothing ", "chinese": "Clothing (also known as clothing, clothes, clothing) The most general definition of clothing, in addition to covering the body of the tors, including hand (gloves), foot (sock, shoes, sandals, boots) with head (Hat) shield, and extension of clothing accessories. Almost all humans have a culture of clothing. Human wear clothes have social reasons. Many of the items in clothing have some kind of culture, religion and social significance. Certain colors are also related to gender, such as from the First World War, American society habits to boy from the boy, letting pink to join the girl, and the situation before the war is just the opposite.\n\nClothing can protect fragile humans from weather and environmental damage, in some potentially harmful activities (when hiking or cooking) can improve the level of security. Clothing can have an barrier in the middle of human skin and environment, so it is not easy to be hurt in insect bite or plant stab. Clothing allows the body to maintain a more comfortable temperature to avoid over-cooling or overheating. In healthy, clothing can also reduce toxic substances or infection into the body, and avoid ultraviolet injury to humans.\n\nIn addition to human beings, humans also designed costumes for animals. Some as a jewelry as a pet, some for war or specific protection needs. Such as helmets and freezers or space clothes.\n\nIf the population ratio is calculated, almost all human beings today are wearing clothes. But it is difficult to consider when people start wearing clothes. Under natural conditions, ordinary apparel will take decades will decompose, so the archeology is difficult to obtain relevant information. Nowadays, the prehistoric knowledge of clothing is basically based on tools that may be used to make clothing, the original person portrait and even biology research and other indirect evidence. The mitochondrial DNA detection made by the scorpion living in human clothes was shown in the first 21st century, which is more than 7.2 (± 4.2) long-term separated from parasitic in humans in human hair. According to this, it is inferred that the human wealth will wear costumes at 120,000 years ago [1] [2] [3], this time is close to the human entered African origin. According to this hypothesis, it has highly intelligent human beings from Africa from Africa, enters the relatively cold Eurasian area. [4] It is discovered that the tools that may be needed in the first 30,000 years ago, [5] The beasti may be the earliest costume, using the leaves, bark and vines to prepare clothes. Something, as for the use of fibers, it is more complicated with cloth. In various plant fibers, linen is the earliest use to prepare garments. It is known that the earliest linen fiber appeared in Georgia, 36,000 years. [6] [7] The whole textile is more difficult to find\n\nAnd why is human beings put on clothes, but also not so far. From ancient Greece, human beings began to consider this problem, and there is an influential hit from now on: [8] [9]\n\nIn fact, these hypothesis have problems that they cannot explain.\n\nThe most important function of clothing is to protect people in clothes, making it comfortable. When the weather is hot, the clothes can make people not be bothered. When climate is cold, the function of the clothes insulation is especially important. If it is in the room, the warm effect of the clothes is less important. For example, if in the room, people will take out the jacket, hats and gloves, especially when resting or sleep. Clothing is also related to regional and climate, like in a more hot area or more hot, we will wear more ventilated, cool clothes.\n\nClothes also have social and cultural functions, such as express personal characteristics, occupations, gender and social status [10]. Among many cultures, the standards of clothing reflect the terms (English: modesty), religion, gender and social status. Clothing can also see a person's taste and personal style.\n\nClothes can have a lot of different materials. Clothing material (English: Clothing Material) can be leather, fur to natural or synthetic fibers. But not all items covered in the body are called costumes. If it is carried instead of wearing items (such as leather bags, canes and umbrellas), it should usually be an accessory rather than clothing. As for jewelery and sunglasses, although \"wear\" is said to \"carry\" in ordinary speaking, they are often considered accessories.\n\nHumans will also use cosmetics, perfumes to decorate their body; they will make their hair, beards and hair, dyeing and changing, sometimes moving to the skin (tattoos, scars and wear caves). All of these decorations affect the overall clothing model, but it will not become part of the clothing.\n\nIn some special environments, special clothes are needed to protect the human body, and humans also invent many clothing in different environments, such as space coats, protective gear, diving, swimsuit, beekeepers, high energy costumes (English: high -visibility clothing and other protective clothing.\n\nSocial information conveyed by clothing, accessories and jewelry includes social status, occupation, morality and religious relationship, marital status, and sex suggestions. Humans must know that these symbols are identified by identifying messages. If different groups have different meanings for the same apparel or decorative interpretation, the clothes may inspire some of the reactions that they do not expected.\n\nIn many societies, people with high status will keep some special clothing or jewelry to themselves. Only the Roman emperor can wear costumes in dyeing a purple (English: Tyrian Purple); only high status Hawaii can wear feather coats with whale engraving. Only the emperor of the ancient China can wear twelve chapters and jackets. In many cases, some legal systems that suppress waste will manage who can wear. In some other societies, there is no law to prohibit the costumes of low status from wearing high status, but the high price of those in clothing naturally limit the purchase and use of others. In contemporary Western societies, only rich people can afford high-grade garment customization. Worried that it is also possible to limit the choice of clothing.\n\nMilitary, police, firefighters usually wear uniforms, and many employees in many companies are like this: For example, in some Japanese manufacturing companies, they will ask employees to wear uniform clean clothing, generally white; can express the company's product quality Requirements and rigorous style, but also weaken the difference between the same company's middle class. Primary and secondary school students often wear school uniforms, and college students are wearing college costumes. Religious members may wear a monks, robe, and 袈裟. Sometimes it is a clothing or accessory that can communicate a person's occupation and / or class. For example, the top chef hat wearing the chef.\n\nIn many parts of the world, national costumes and clothing style representatives represent some people belong to a village, status, religion, and so on. A Scottish will declare his home world with a plaid; an orthodox Jew will use the side of Sidelock to declare his belief; a French country woman will use her hat (Cap or Coif) Announce her village.\n\nClothing can also be used to express a person's objection to its cultural norms and mainstream values, as well as individual independence. In the nineteenth century Europe, artist and writers will live in Bohemian-style life, and deliberately wear some costumes to shocked others: George Sand Wear male clothing, women's liberation movie wearing short lamp cage pants (Bloomers), male artist wearing velvet vest (Waistcoat) with trendel scarf. The Bohemian, a beatnik, a hippie, a Gothic, and a Trouke continued to conduct this anti-cultural tradition in the twentieth century. In recent years, it has been plagiarized in the street fashion in recent years. This may make the street fashion to lose some of the power of shocked others, but it still motivate countless people trying to dress yourself.\n\nIn the Islamic world and community, it usually requires any requirements for adult women Muslim. Usually, in addition to the face, the hand is required to cover all parts of the body. In addition to covering the head of Hitchca, further covering the whole body.\n\nMany clothing will show the end of the clothes. For example, many Muslim women will wear the head or body shield to show their status is a dedicated woman. Some costumes may have a teasing meaning. For example, a Western woman may wear a very high heel, exposed black or red dress, exaggerated make-up, gorgeous jewelry, and perfume to express its sexual implicit. What kind of clothing is dignified or teasing, between each culture, under the different contexts of the same culture, and the epidemic will have extreme differences over time. What is even more, some people choose to show mixed messages. For example, a Shawi Arab woman may wear a black yarn robe (English: abaya) to express its demon, but choose the luxurious fabric, and cut the black yarn, and then match the high heels and trendy leather bags. . These details are all expressly suggested, although the message on the surface is elevated.\n\nBecause clothing and jewelry often have many links with sex, humans may develop fetches for clothing. They may strongly tend to develop some people who think that they think of sexy and teasing costumes. In Western culture, these milestones may contain extremely high heels, lace, leather or military uniforms. Other cultures have other fetches. In the past few centuries, the male feudal period will generate sexual desire for women tied to the small feet (see wrapped). Male in the Japanese peace era will be eager to cut the parallel Liu Hai and women who put on several rots. The change in clothes is as much as the fashion. Sometimes the clothing itself will become objects of love, for example: some people don't wait for the underwear and shoes of underwear and footwear for others.\n\nClothing materials typically include compilation of various fiber products such as cotton, polyester, nylon, and finally processed by weaving fabric to clothing. Similarly, more materials in modern society have been introduced into the production of clothing materials, such as metal, paper, etc.\n\nCommon clothing materials are:\n\n\nMore uncommon clothing materials are:\n\nDamage of clothing comes from both inside and outside. In terms of inside, the human body falls off, the endocrined grease, the discharged sweat, urine and feces, which will make the clothes vargent. In the outer side, sunshine, moisture, wear and dirt can damage the surface of the garment. The flea and scorpion may also hide in the clothes. If there is no cleaning and repair, the clothing will make the body itchy, looks uncomfortable, or some functional losses (such as the like or zip may be damaged, the fabric is thin or even tear, etc.).\n\nSometimes people will always wear a piece of clothes, not clean until it can't wear it. Leather is not easy to clean, and the bark cloth will dissolve as long as it is washing. People can repair damage, remove the surface of the surface. However, the old leather and bark cloth look old old.\n\nHowever, most of the clothing is made of fabric, while most of the cloth is to wash and repair.\n\nThere are many ways to laundry, from the early stones on the stone next to the river to clean or dry cleaning with electric washing machine (dissolved with dry cleaning other than water). Dry or dry after washing. Some materials will shrink (such as wool, leather) or fading (certain silk products), which can be coated with chemical solvent dry cleaning.\n\nSome fiber materials, if it is only washed, wrinkles will appear, and it can eliminate the wrinkles on the clothes. Some fiber clothing is used for the material (English: Permanent_Press), even if it is not hot, there will be no obvious wrinkles.\n\nIn the past, weaving (English: Invisible Mending) is an art. A careful-wing tailor can not see the broken patch. Today, clothes are considered consumables. Large-scale costumes are lower than the handmade costs of repairing clothes.\nSo many people prefer to buy new clothes and do not want to repair clothes.\n\nThe unabled clothes that can be used can be used to make thin (English: quilt), rag, carpet, bandage, and many other home needs. The old clothes can also be recycled for papermaking. The old clothes are also collected, dealt with, and then transported to poor countries to continue to use after a large number of collections.\n\n[Edit in Wiki Data] "}