{"chinese_title": "music ", "chinese": "Music, broad meaning, means any art composed of sound. The word English Music is from ancient Greek μυσική (Mousike), which means the art of Muses. The Chinese music is two words, Xu Shen, \"said words\" explain \"sound, sound. Born in the heart, there are festivals, the sound.\" Thinking that music and sound is different, the music needs to imagine through people Create.\n\nMusic can be divided into three processes created, played, listened to different cultures and society, have different understandings for music, and their importance, such as in West Africa, everyone is participant, people will not distinguish The identity of composers, players and listeners; but all human culture have music, that is, playing music is a phenomenon in all culturalities.\n\nThe main elements of music have sound, rhythm and tone. Music can be divided into different types, but each type is often ambiguous and controversial, and different types of concert emphasize or ignore certain music elements varying degrees. As for the sound, or the difference between the music and noise, there is no recognized standard, which is also different from culture and social background. Many of the performances of breakthrough or avant-gardid music were criticized as \"non-music\", such as Beethoven's bigger, and early jazz. However, many musicians in modern times do not agree with the traditional understanding, such as the 20th century American composer John Kaji thinks that any sound and silence are music.\n\nMusic can be descriptled with a score, based on score performance, but there are also many music types such as folk songs or jazz is the performance of the player. The music score can only describe the attributes of the sound or the skills required to play the performance, but cannot record the sound itself. Therefore, before the recording technology appears, enjoy the music must be listened on the spot, or participate in the performance. Traditionally enjoying music with specific places, from ancient palace, church, temple to today's concert hall, bar, etc. At the end of the 19th century, the inventive sound of the gramophone can record and copy, change the model of enjoying music; generally believe that the recording, communication technology and mass media are the main factors of pop music formation, from early album, music video and radio, to today The audio and video website or streaming platform is a pipeline that people touch music.\n\nPlaying music requires singing or musical instruments. The generalized instrument includes tools that can make sounds, and people have begun to make the original instrument in the stone era. Today's computers and many electronic music products can make music through MIDI.\n\nMusic is a skill that needs to be learned, and there are music classes in basic education in many countries, and some music colleges provide professional music education. Music is a history of scientific research music, including music theory and music history. In addition, national musical and cultures were studied from all over the end of the 19th century. The music industry also includes many-oriented: creators of music (composers and filling the wrong words), music players (music group music, singer or command), music recorders (including audio engineers), music activities preparators And the vendors of music resources (records or music).\n\nDifferent combinations of music elements have formed a unique personality of each music, making people understand their structures and expressions when listening to different music, and detect which national, regional, era and type music as much as possible. Each country is not the same as the official definition of music elements, but roughly all elements include:\n\nThe sound of different frequencies is issued at different times, form a melody; the sound of different frequencies is issued at the same time or in a very short period of time, forming a string. The speed of the templer, the regular strong shot and weak shots form the beat, the coherence between the notes is described.\n\nCommonly used pitch forms ranging and tunability; to enrich the fabric of music, you can use the actions and acousticization. The opposition is to make a plurality of different melodies lines, and the sound explore multiple chord continuous matching, both of which are relative.\n\nThere are three types of fabric of music. Monophony is the simplest music fabric, only a single melody line, only two factors of melody and rhythm. If there is a main melody that is dominated by different chords, it is the homophony. If there are more than two melodies independent of each other, it is a Polyphony.\n\nFinally, each musical instrument and each vocal have its own unique tone, different tone instruments combine music unique sound effects, emotions, and symbolic meaning; arrange the combination of these instruments called an attachment.\n\nMusic is a symbol, a sound symbol, and what is thinking about it. It is one of the carriers of people's ideas. Music is a purpose, there is connotation, which implies the author's life experience, ideological and feelings. The music is analyzed from sound waves between the noise and frequency constant pure tones, which can bring the emotions of beauty enjoyment and expression.\n\nMusic is a form of social behavior, through music people can exchange emotions and life experiences. This effect is most prominent in the song.\n\nIn ancient Chinese ancients, there is a perfect gift system. The monarch of the ancient sages will pass the 'Le', 'Rich' to return to the people's physical and mental and words and deeds, and reach the role of governance. Confucianism, \"Dale and Tiandi, the same section of the sky, the same section of the world\", people can also communicate through music and the heavens and the earth, thus getting wisdom to improve their physical and mental purification. Nowadie scientists study, classical music has a great advantage to the body and mind of the conditioner, especially Mozart's music, benefit to the brain of people, can also reduce the risk of epilepsy patients [1], so good music pair People will regulate the body and reduce the effects of the disease.\n\nThe ancient Greek philosophers Pythagora, interpreted the music in the expression of the \"number\".\n\nThe creation of ancient great musicians and the popularity of folk songs is basically produced by inspiration. Later scholars are studying these more years of music, gradually summarizing the theory, and future musicians will create under these theories.\n\nMusic theory proves which music can be accepted by most people and make people feel pleasing. Modern and combined with physical acoustic research results, the theory is constantly developing.\n\n\n\nThere are two main forms: the sound of vocal music and music music music, whether there are many combination of music or instruments, such as solo, chorus, singing, solo, concerto, symphony, etc. Both can also be mixed, vocal with musical instrument accompaniment, or mixed into vocals in instrumental symphony.\n\nVocal music is a music form of one or more singers, using instrument accompaniment or not, and vocal is the focus of the work. The music containing people, but the focus is not in it, is generally called the male music (such as the \"Planet Group\" of Gustav Hallste, there is no lyrics. Chorus without musical instruments is often called uncommon chors (A Cappella, also known as Akabara).\n\nFor vocal music, quite a multi-acoustic work (part or all) is to imitate other sounds or pure content abstractions, and use non-language syllables or noise, but the average person pays special attention to the use of lyrics. A small and lyrics that contain lyrics are often referred to as songs.\n\nVocal music may be the oldest music form, because it does not need any instruments, just people can. There is a form of vocalities in a variety of music culture. Language and music purposes are different, all have a common music factor.\n\nThe vocals are divided into the following sects of the following sectors of the following sectors:\n\nThe instrument is relative to vocal, full with instruments, without vocal or vocal music. The played instrument can include all kinds of stringed instruments, wood tube musical instruments, copper tube instruments and filling instruments, and some instruments also apply some people, and there is no lyrics just as an effect, but some composers sometimes join some people, such as Bendo The \"Ninth Symphony\" of Fen Writing is also added to the chorus \"Happy\", but it is correct to do most of the symphony, and it is less for vocal music.\n\nWestern music mainly refers to European music, and many musicians have been funded and protected, so many musicians have developed more perfect music theory. At present, the Western music theory has recognized the world's recognition and composing program in the world's music world in the world.\n\nThe pre-Qin period, the ritual system is given the function of maintaining social order. In Chinese traditional thinking, the relationship between music and human feelings is greatly attached to, especially Confucianism thinks that music has the role of huge nature, this is in the \"Book of Songs\", \"Rites, Music\", \"Xunzi · The music articles \",\" Historical Records · Le Book \"and other works can be learned. Even the \"Lemrao\" in the thirteen has made more deeper instructions on music, and they have been lost.\n\nChina is wide in China, a wide variety of people, and the folk music materials in all parts are very rich. Modern China has absorbed the theory of Western music to organize ancient literature and folk music, preparing the tracks of national musical instruments, making Chinese music a great development.\n\nChina's ancient musicians are not high. There is no effective protection of music, so although it has been invented, many famous works have not been able to circulate, and most of the works that have been circulated are relying on folk artists. Holiday education. On the other hand, the ancient large number of people bureaucrats itself is proficient in music, such as Confucius, Zhou Yu, Ruan Ji, Su Shi, etc. are famous.\n\nChinese music classification\n\nMusic is developed by the evolution of humans since humans, so there are unique music forms and musical instruments around the world. Although music theoretical development around the world is not balanced, but the music style is different. Development path. Modern music has absorbed the musicia materials around the world, and the music around the world has its own contribution to the development of world music.\n\nPop music (different):\n\n\n\nGzuz and Bonez MC\n\nZara larsson\n\nTiesto\n\nInna\n\nSławomir\n\nTimati\n\nThe pop music developed after the mid-20 century violates the theory of classical music, absorbed the local music ingredients around the world, emphasizing the participation of the masses, and the audience is not quietly listening to the listener of music, but a warm participator. . Music returns to the form of the original car dance dance, which can mobilize people's emotions, so they are warmly welcomed by young people, breaking the regional, nation, and national boundaries, wide popular in the world.\n\nMusic for composer creation can spread several media; the most traditional is one of the live experiences as one of the audience or players. On-site music can also be broadcast through radio, TV or Internet. Some musical styles are pronounced to perform, some focus on generating recording and then used for later reverb synthesis, which is never \"live\". On-site performance style music often uses editing and separation functions to produce results that sound \"better\" than actual performances.\n\nBecause of the introduction of protective players, composers, publishers and producers, such as the United States's 1992 Home Recording Act, and Berne specifications, recording, British British BERNE, recordings for protecting literature and artworks. And on-site performances have also become more vary from computer, equipment, and Internet to be used in the form of Music-on-Demand.\n\nIn many cultures, some music performances and listening have no great difference, because everyone is in a group in a group in some way in some way. In industrialized countries, through recording, such as listening to music recording or watching music recording, it has become the form of the most common feelings of live performances, which is roughly in the middle of the 20th century.\n\nSometimes, the live performance has adopted a pre-recorded sound. For example, DJ can use a record to make a wiper effect, while some of the 20th century works are carried out simultaneously with solo or solo performance and prefabricated tape music. Computers and or multi-key instruments can be used to program generation and playing MIDI music. The audience can also become a performance by karaoke, this form is created for the Japanese, which uses video and no sound track, so the performance can add their own voice.\n\nMusic is an important part of primary education. It is an effective tool for cultivating children's artistic literacy. It is generally starting from kindergarten music education around the world. Ancient China regards music as one of the six art talents that the Scholars should have, so that China's formal music education has continued until the end of nine-year compulsory education, that is, graduated from junior high school. Ordinary high school is generally open.\n\nAs a professional music personnel, it is generally necessary to go through special higher music education, but most of them are engaged in professional higher education, most of them have relying on their own talents and self-learning.\n\n[Edit in Wiki Data] "}