{"chinese_title": "plant ", "chinese": "Ring algae, a hybrid rose, a hundred years of blue;\nSmall hairy felt, smash, European pherrid;\nGinkgo, willow, creek;\nAfrican Soviet, Orchid, a moss;\nA fern, purple, noodle fir.\n\nPlants (English: Plant) [2] is the common name of various organisms (learning names: Plantae), there is more variations in history. In the former Lindai era, in addition to the plant-like groups well known, the prokaryotic, fungi and algae cannot actively move or perform photosynthesis, etc., and are also divided into the plant boundary [3 ]. According to the further research of biologists, prokaryotic, fungi and some algae, which are nuclear creatures, fungi and some algae, such as BiMas, Robert Weitik, Lynn Margulis, Tom Mas Carlir-Smith. Plant industry [4] [5] [6]. In recent years, system development and taxonomic research, a commonly used definition is 1981 Toma Caval.-SM. 1981) [6], will be original Pigment organism is regarded as a concept of plant equivalents [7] [8]; another common point of view is defined by Herbert Copeland in 1956, only green plant (Viridiplantae) border ( Plantae Sensu Copeland, 1956) [9] [10] [11] [12].\n\nIt is estimated that there are about 45,000 species in the plant industry [13], according to Qiuyuan's statistics, until 2017, in the vicin plant, 381910 species have been described and named, of which 369,000 quilt plants, 1110 naked plants 1300 stone pine plants, 10,500 chain beam plants (narrow fern) [14]. At the same time, there is also a new species to be found, for example in 2016, 1730 embryonic plants were discovered and named [14].\n\nMiscal split and decreased division is the main proliferative method of plant cells, but silicone variables also have an important role in plant growth and development [15]: 63. Sexual reproduction and generation alternating are important characteristics of plants, but amorphous breeding is also important in reproductive methods [15]: 169.\n\nThe common ancestors of plants have obtained plastics [5] by symbiotic in blue algae, and has photosynthesis. Most plants have inherited this structure and capabilities from the ancestors [5], but there are also a few plants to lose the structure of the chloroplast and photosynthesis, and turn into camp or inrete life [15]: 458.\n\nThe photosynthesis of plants is the main source of plants and the source of energy, and is also an important part of the biological circle substance circulation and energy flow. It is the basis of most ecosystems of the earth [16] [15]: 122. Many plants play an important role in human production and life as food, drugs, building materials, textile raw materials, etc., and plays an important role [14]. It is the important branch of biology [15]: 2.\n\nRegardless of the academic sense or in terms of intelligence, the definition of \"plants\" has spoken, and there are many different, and [17] is briefly narrative in the historical changes of plant range.\n\nPlantae Sensu AMPLO refers to a bacterial, bacterium, fungi, and algae such as brown algae, such as embryonic, bacteria, bacteria, fungi and algae, but only in modern sense. Blue algae without other bacteria is not here), using this definition: Plantae L. 1753, Plantae ENGL. 1886.\n\nIn the Linna Evil, the evolutionary theory of the system has not yet been produced. Therefore, in his border system, a very broad plant concept is used, and all cages are solid, and the photosynthetic biometric is defined as plants. [3] The Engel system inherited Lin Nai's plant industry concept, including algae, bacteria, and fungi, \"Plant score (English: syllabus der pflanfamilien\" published 10 versions in Engel, After the death, Diers and Merseo have presided over a revision, still maintaining the initial plant concept, divided the plant industry into 17. [18] Many modern plants are still explained in the range of bacteria, bacteria, fungi and algae in the range of plant boundaries, and use the 12th Engeller system in the plant industry, so the system There is still a big influence. [19] [20]\n\nWith the invention and application of the microscope, biologists have discovered many organisms, such as naked algae, tolure, and the like. Therefore, German biologist Heter has proposed Plantae Haeckel 1866, Metaphyta Haeckel 1894, and the two names are basically the same, all exclude prokaryotic organisms, macrobes and some algae, and separate them into nativeinal biligers. [twenty one]\n\nFrom 1983 to 2009, under J. Gerloff, K. Walther and Wolfgang Frey, the 13th Engeller system completed the revision and was published in 2012. The system absorbs a large number of molecular biology results in terms of specific programs, objectives, and dividends, but the definition of the overall range of plant boundaries (Plantae W.frey 2012) only excludes bacteria of non-blue algae, still contains fungi and algae. [twenty two]\n\nIn 1959, US biologist Robert Weiti will not be included from the plant industry from the plant industry, proposing a new biological classification system, revised again in 1969, called \"Weitik Five System\" The plant community defined by the system (Plantae Whittaker 1969) excludes prokaryotic organisms, fungi and some algae, and separates them into prokaryotic biligers, fungi and native biological communities, but still contains far from land plant relationship. Brown algae. [twenty three]\n\nIn 1966, Lynn Margulis published a papers, which expounds the famous inner symbiotic theory. Theory believes that the common ancestors of eukaryotes have obtained mitochondria and aerobic breathing through a symbiosis of some kind of good oxygen bacteria. Ability, while the common ancestors of the post-plants have obtained the ability of plasma and photosynthetic effects including leaves through a symbiotic cyanobacteria. [5]\n\nMaurulis defines Plantae as a Vibrant Plant (PLANTAE Margulis, 1967) [Note 1] [5], and later, Margulis also defined her plant in 1971 (Plantae Margulis, 1971, that is, Plantae Sensu Stricto) is changed to have embryonic [25].\n\nThe most significant impact of endocarbody students is that the evolution history of the nuclear genome and the orbal genome is inconsistent under this theory, so it can be judged by the difference between the two. The results of the molecular system across the British Oxford University Tomas Caverle-Smith Study Group show that the original pigment bio (Archaeplastida, including jeachatin, red algae, green algae, wheel algae and embryo) is the earliest Blister groups were symbiotic in cyanoblasts, and the plants of algae were not directly from cyanobacteria, but were indirectly obtained by symbiosis in the original pigment bio, and the study group also put Plantae Caval.-SM. 1981 (Plantae Sensu Lato) is defined as the original chromatin organism. [6]\n\nIn recent years, PLANTAE CAVAL.-SM. 1981 is generally used in the definition of Plantae Caval.-SM. 1981, regarding the original pigment body as a concept of plant equivalents. [7] [8]\n\nSince 2015, Toma Caverle-Smith, Patrick J. Keeling, Alastail GB Simpson, and the research team leading to Fabien Burki Existing plant definitions put forward challenges.\n\nThe results of the molecular system of the top three showed that a class of native organisms embedded in the evolution of the original pigment organism, and the red algae constituted a sister group [9] [10] [11].\n\nThe classification status of the creature creature is not clear, the system tree of Patrick J. Broad and Fabien Burki Study Group shows that creature may be embedded in the original pigment organism, but the specific position is inconsistent; in the former results In the middle, the algae and green plants constitute a single line, and the algae is a bypass group [10]; in the latter results, the cerrgs and red algae are bypass group [12]; and two research The group's system tree shows that the creature creatures may be the outer group of raw color bodies and leather gallbladrge [11].\n\nThese studies have shown that leather gallbladrge and algae are likely to be the descendants of the original pixel bio-co-ancestral ancestors, but their respective abstraction of the ancestors in the evolution process, and then the algae has passed the stomach of the red algae. But the lesion is restored to a heroic life. [9] [10] [11] [12]\n\nPlants are one of the most common life forms on the earth. It is widely distributed in all kinds of habitats, including most of the world's water circles, the surface of the rocky circle, the bottom of the atmosphere, with different types and quantities with different climate zones . Even in an extreme environment such as desert, plateau, polar, etc.. [14]: 8\n\nThe green algae in the plant can form a lichen with the fungi and together in some extreme environments. 6% of the land area is covered by lichens, the land of the Arctic is the main food of the Arctic reindeer [26], some lichens can even resist high-strength cosmic rays and ultraviolet rays, survive in the research station on the artificial satellite [27].\n\nIt is estimated that there are about 45,000 species in the plant industry [13], according to Qiuyuan's statistics, until 2017, in the vicin plant, 381910 species have been described and named, of which 369,000 quilt plants, 1110 naked plants 1300 stone pine plants, 10,500 chain beam plants (narrow fern) [14]. Other groups have not been counted in Qiuyuan's data, and the number of species and reference materials are detailed in the following table.\n\nAt the same time, there is also a new species to be discovered, for example in 2016, 1730 newly discovered organic plants are named [14].\n\n\n\nNewcomer data:\n\nTotal 1110 [14]\n\nAccording to the currently widely accepted research, plants (primitive pigment bio) originated in a symbiotic event [37], of which plastics, mitochondria, etc., can be traced back to the earliest blue algae and good Oxygen bacteria [5].\n\nThe history of blue algae has not contained, the earliest possible record is a laminated stone that is bonded by blood algae, but still controversial [38]. At the latest 160 million years ago, the final common ancestors of plants were served as food in blue algae, but in a lack of food and sunshine, with cyanobacteria, using them for photosynthesis than survived cyanobacteria as food, so plants The ancestral and blue algae have undergone the capacity of the plasma and photosynthesis, and a creature such as a synonyctomy (possibly a military grade, including the types of legion disease), providing the organic substantial transfer Gene [37].\n\nTraditionally, the embryo is the earliest green plant, but in recent years, research points to the analysis of the chemical and geological analysis of the ancient soil, there are land-sized cell algae as early as 1 billion years [39] .\n\nThe embryonic originates from the algae, which was earlier in Otisei Mid [40] [41], and traditional views believe that it originated from marine algae, but also studied that it originated from Lu Sikrain algae [42]; vascular plants appeared When Zhi Li Ji, and it has been radiated when it comes to the mud ball, and is distributed in many different types of land ecosystems [43] [44]; Early seed plants - seed fern and Kuda tree appeared in the late stage of the mud pot When the charcoal is beginning, there is more evolution after two-dimensional discipline and three-fold comments [45] [46] [47]; the quilt plant is the final plant group, evolved from the ancient naked plants during Jurassic Come out, and quickly divorit many species in the chalk, and have been prosperous, it has become the most advantageous group of landed plants [48]; modern naked plants (called end naked plants) are independent single lines with quarterly with quilt plants. Branch, not the ancestor of the sub-plant [49] [50].\n\nPlant fossils include roots, stems, leaves, seeds, fruits, pollen, spores and amber. Plant fossils have found records in terns, lake, rivers and near-sea. Fossils of pollen, spores and algae are used to define the order of the ground rock. Residual botanic fossils is not as common as animal fossils, but plant fossils can have a lot of discovery within many regions in the world.\nThe first fossil, which was categorized to plant, was a native name called Rafatazmia Chitrakootensis (English: Rafatazmia), lived in laminate in India in the Indian laminated stone [1].\n\nThe earliest fossil of Green Plants is some of the micro-fossils of the Roper Group, and their structure is similar to modern green algae in the Australian Lucai Group. It is similar to modern green algae [51].\n\nThe earliest cultiva with a clear relationship with the current group is Bangiomorpha Pubescens, which is a red algae living at 120 million years [52].\n\nThe cell walls of some plants of the lague do be calcified, so it is more likely to leave fossil records than other algae, which can be traced back to the late Dynasties (approximately 41 million years ago) [15]: 356, such as PARKA DECIPIENS) Palaeonitella Cranii et al [53] [54].\n\nThere is an embryonic that is known for the oldest laundry fossil from Otisei, but such fossils are zero crushing. The complete fossil of the remarks is retained, including the \"stabble\" of Shixongmen. After the mud ball, the detailed fossil of the Leti fern was found in this period, and this fossil showed a single cell of its plant tissue. When the mud ball is also considered to be the older trend, such plants have fernous leaves in their trunk, but this fern leaves do not produce spores. [55]\n\nThe coal formation is the main source of fossils of plants during the ancient generation. Coal mine is the best place to collect fossils, and carbon itself is the residue of fossil plants, although the structural details of plant fossils will remain in carbon. In the fossil forest in the Scottish Digdolia Park, there is a trunk of lacododron. [56]\n\nThe roots of pine cypresses and flowering plants, the fossils of stems and branches can be in the midst of lakes and coasts It was found in the new generation. California mahogany, monk, eucalyptus and palm trees are often found. [55]\n\nPetrochemical wood is generally existed in some parts of the world, and most often discovered in acidic and desert areas, because those places are easily exposed due to erosion. Petrochemical wood is usually severely referred to (with organic matter being replaced by dioxide), and reproductive tissue is often stored in a good state. Such samples are somewhat using gemstones to cut and polish. Petrochemical petrochemical forests have been found in each continent. [55]\n\nThe fossils of the seed fern such as the tongue sheep are widely distributed in several continents of the Southern Hemisphere, and this fact supports the mainland drift of Alfrand Weigner [57].\n\nThe earliest fossil quilt plant in no controversial is ancient fruit plant [58] [59] [60]; The earliest and the current fossil quilt plant is Monteseck, which is a group of sister groups with goldfish algae [61].\n\nAnother ancient seed plant, which is unstowered by Pan's real flowers, some scholars advocate them are quilt [62], and some scholars questioned their pine cypress naked plants [60]. Several research on the origin of quilt plants believes that according to the conclusions of the molecular clock, the quilt plants may originate from Jurassic or even three stacks [63] [64] [65], but there is no reliable fossil evidence support [60] According to the analysis, this may be due to the environment where the early quilt plants are not important in ecology, or in an environment in which it lives in the formation of the frying effect [66].\n\nAccording to the current research, the plant industry is a bio-volatile organism> a multi-appellation, its relationship with the system of related groups is as follows [9] [10] [11] [12].\n.mw-parser-output table.clade {border-spacing: 0; Margin: 0; font-size: 100%; line-height: 100%; border-collapse: separate; width: auto} .mw-parser-output Table.clade Table.Clade {Width: 100%; line-height: inherit} .mw-parser-output table.clade td.clade-label {width: 0.7em; Padding: 0 0.15em; Vertical-align: bottom Text-align: center; border-limited: 1px solid; white-space: noWrap} .mw-pace-output table.clade td.clade-fixed-width {overflow: hidden; text-overflow : Ellipsis} .mw-parser-output table.clade td.clade-fixed-width: hover {overflow: visible} .mw-parser-output table.clade td.clade-label.first {border-left: none; border -right: none} .mw-parser-output table.clade td.clade-label.reverse {border-left: none; border-right: 1px solid} .mw-parser-output table.clade td.clade-slabel { Padding: 0 0.15em; Vertical-Align: Top; Text-Align: Center; Border-Left: 1px Solid; White-Space: Nowrap} .mw-pacer-output table.clade td.clade-slabel: Hover {Overflow: Visible} .mw-parser-output table.clade td.clade-slabel.last {border-left: none; bor Der-right: none} .mw-parser-output table.clade td.clade-slabel.reverse {border-left: none; border-right: 1px solid} .mw-parser-output table.clade td.clade-bar {Vertical-Align: Middle; Text-Align: Left; PADDING: 0 0.5em; Position: Relative} .mw-parser-output table.clade td.clade-bar.reverse {text-align: Right; Position: Relative} .mw-parser-output table.clade td.clade-leaf {border: 0; padding: 0; text-align: left} .mw-parser-output table.clade td.clade-leafr {border: 0; Padding: 0; text-align: right} .mw-parser-output table.clade td.clade-leaf.reverse {text-align: Right} .mw-parser-output table.clade: Hover span.linka {background-color: Yellow} .mw-parser-output table.clade: Hover span.linkb {background-color: green}\n\nPlant world Plantae (original pigment bio-archaeplastida)\n\nTaxin door Haptophyta\n\nCentral Mother Worm Centrohelid\n\nInequali flage door heterokonta\n\nPapilica Alveolata\n\nRhizaria with aperture\n\nTelonema\n\nHalf vheneen Hemimastigophora\n\nCotta EXCAVATA\n\nSingle whip creature (developed for animals and fungi) Unikonta\n\nThe systematic relationship between various groups of various groups of plants is not clear, and the main point of view is as follows.\n\n(See the new dispute chapter.)\n\nLeather contact\n\nRed algae\n\nGreen plant\n\nJeapy\n\nAlgae\n\nLeather contact\n\nRed algae\n\nAlgae\n\nJeapy\n\nGreen plant\n\nLeather contact\n\nRed algae\n\nJeapy\n\nGreen plant\n\nAlgae\n\nJeapy\n\nGreen plant\n\nAlgae\n\nLeather contact\n\nRed algae\n\nPlant classification is a historic discipline, an ancient Greek philosopher, scientist Aristotle divides plants into three categories of trees, shrubs and herbs, his students, plant nose ancestors Taauverlastos \"Plant\" (English: Historia_Plantarum_ (Theophrastus)) \"and\" Plant Botrans \"recorded more than 500 plants in these works, in these works, in accordance with reproduction, habitat, plant size, edible, medicinal value, etc. Classify plants [67] [68] [69]. In ancient China, \"Southern Grass\", Li Shizhen's \"Materia Medica\", Wu Wei's \"Plant Familiar Test\", is also based on habitat, living type, ecological, life production and other features Classification [70]. Since the classification system in these works reflects people's understanding and use of plants, rather than the relationship between different plants, they are all typical people. [71]\n\nThe peak of human classification is the nasal ancestors of the modern biological classification system, and in the \"plant species\", based on the results of Caesalpino, Bauhin, John Ray, a double law The Lindany classification method of the classification system is the core, and has proposed a double-famous form in the species known. Lin Nai proposed \"sexual system\", according to the quantity of flower organs, the plant slots, and divides the plants into monetomyto, Double Xiongtui. [3] [15]: 234 [71] [72]\n\nIn 1858, Charles Darwen and Arfrad Russel Wallace proposed a biological evolution. Under this influence, the new concept was introduced into a classification industry, that is, the biological classification system should reflect. The relationship and system of the class group, this phase of classification of mainstream thoughts are evolutionary taxonomy, compared to the \"God creation, Lin Nie\"'s thoughts, there is a thought Great progress. Compared to the human classification of ancient and Linnai era, we will evolve the evolutionary classification as \"natural\" classification, but this main evidence comes from phenotype, less evidence, strong subjectivity, dependence The experience and authority of the family, and it is difficult to exclude the influence of the evolution; and the evolutionary classification faction acknowledges the rationality of the group, and the harmonious group is not a real natural group, which makes evolutionary taxonomy is not a real natural classification. learn. [71]\n\nGerman insectologist Wili Henni put forward the classification of progenial branches in 1965, also known as the branching classification, he advocated that only single group is a natural group, is a reasonable classification group, any classification group It should contain all the descendants of its last common ancestor, in practice, according to the ancestral and determination, according to the simple manner, theoretical relationship is determined, and classified according to this. [71] [73]\n\nWith the production and development of molecular biology and the maturity of sequencing technology, molecular biological evidence has gradually replaced morphological evidence has become the main data source of system trees. Due to molecular biological evidence, the main construction algorithm (adjacent matrix) Law, Bayesi, the biggest simple law, the biggest likelihood method, etc.) The amount of computational amount is large, and the human is difficult to complete, so today, computer software is generally used. [71] [74] [75]\n\nAlgae is traditionally regarded as part of the plant, but molecular biology studies have shown that they are not a natural group. Algae is composed of several groups of different groups that can perform photosynthesis, but most of the algae are not classified in the plant boundary, but is classified in the bacterial community (blue algae), SAR super class (Goldenae) , Brown algae, malagis, algae, methylgae), fixed whitaclock door and venus (naked algae). [9] [10] [11] [12]\n\nEmbryos is evaporated by the algae; the two are well known as chain plants, and the green plants [76] [77] [78] are mixed with green plants [76] [77] [78]. Traditional green algae does not include embryonic, so it is a group of groups, but later because many studies show that there is an evolution of the root gates, some researchers began to be integrated [79 ] [80] [81] [82] [83]. There is a cellulose in the cell wall of these plants, and the plasma is evolved from the inner cyanobacteria, containing chlorophyll A and chlorophyll B, containing algae bilins, such a group of mitosis without central grains, and having a grain body [ 15]: 44, 63.\n\nRed algae has chlorophyll a and phycobiliprotein, similar to most blue algae. Rirtis has typical cyanobic pigments, and its pigment retains the peptide glycan wall of cyanobacteria, called a blue body (Cyanelles). [84]\n\nGreen algae, red algae and algae are the first biological groups that have symbiotic to gain plastics in cyanoblasts, which (including the entire green plant of green algae) therefore is called \"original pigment bio\". Relatively, most other algae plants are wrapped in three to four cytoplast membranes. According to nuclear genome, they are not similar to plants, which may be to symbiotic and red algae to their own cells. Rod. [5] [25]\n\nThe \"algae\" mentioned later, such as non-specification, refers to the part of the original pigment organism to exclude the sedimentation of the green embryo.\n\nThe commonly used continental plants in life are embryed plants. Depending on whether there is a complete vascular tissue, it can be divided into a vicini plant (but the lack of the truly root of the loose leaf fern) and the lack of vascular tissue [15]: 249.\n\nSuch plants have eukaryotic cells surrounded by cell walls such as cellulose, hemicellulose, and pectin, and most of them are used to synthesize nutrients (15]: 249 via photosynthesis. There are also many plants that are not smooth, but parasitic is on other organisms, in quilt plants, parasitic plants have about 4,100 [85]. Embrystocuseplates and algae have different germacionic organs protected by neutralization [15]: 249.\n\nMoss plants, although some species are relatively droughtable, their breeding is not allowed to open the water [40] [41], most of the mossy plants are very small, they do the generation between the two stages: call the ticker The coupled phase of the haploid phase and a dippl based on the spore body. Spore bodies are very short and must live in a female mixture. [15]: 376\n\nVibrant plants have many adaptable types, allowing them to overcome the limits of moss. The keratin layer can help the plant against dryness, while the hubble beam can deliver the moisture to the entire organism. Spore bodies of vascular plants are generally a separate plant individual, and the measuring body is only short-term in the reproductive structure. [44] [43]\n\nThe genus of the seed plant is completely degraded, and the spore body is developed by pollen and develops into a seed in the mother. Seed plants can survive and reproduce at extreme drought conditions, as they can form a pollen tube, and the refined process does not rely on water, nor does it depend on the independent life of the tie. [45] [46] [47]\n\nEarly seed plants were naked plants, and their embryo beads were not formed by a diaphragm, and there was no peel package. Modern naked plants are still widely distributed around the world. [15]: 430-432, 435-437\n\nThe spore bodies of the quilt plants are further evolved, and the tissue is further degraded. The puillat package formed by the carp of the embryo beef is, and the seed is formed by the peel, forming a fruit, has a true flower, and can be bracomatically form a dual-prolet genetic substance. In most ecological environments in today, the quilt plants are the most important groups. [48]: 457-459\n\nPlant morphology is a science of studying plants, constructing, composition, and development (including individual development and system development) [15]: 9 [86]: 837.\n\nPlants as eukaryotic organisms have a common feature of eukaryotic cells: the true nuclear and membrane or membrane or intracellular artifacts wrapped in nuclear membranes [15]: 40.\n\nPlant cells are composed of cell walls and protoplasts, and the protoplast can be divided into cell membrane, cytoplasmic and nucleus. [15]: 42\n\nThe cell membrane is also known as the primary membrane, which is composed of a glycoprotein on which a phospholipid bis molecule layer and a mosained thereon, which separates the protoplast to the external environment, and mediates the substance into and out of protoplast. [15]: 22-24, 42\n\nThe cytoplasm includes cytoplasmic matrix and artifacts, there is a nucleosome such as ribosome such as ribosome in plant cells, and a bilateral membrane or a varnister such as a plasma, mitochondria, a monochriometric membrane or a hydrobiode; The membrane structure of nuclear membrane, endoplasmic network, galvatus, lysosomes, and foaping, together constitute an endometrial system of plant cells. In a living plant cell, the cytoplasm is always movement, and various substances suspended in the cytoplasmic matrix can be observed in an orderly manner, which is referred to as a cytoplasmic circulation. [15]: 42\n\nThe nucleus is composed of nuclear membrane, nucleore, nuclear matrix, chromatin, core fiber layer, nuclear membrane ribosome, etc., which controls cell life activities by controlling how proteins are generated; it stores genetic information in DNA In its chromatin, it is transmitted to the child cells at a cell division. All genetic information stored in the nucleus is called a nuclear genome. [15]: 42\n\nThe plasma (plasma genome) and mitochondrial (mitochondrial genome) also contain DNA, and some genetic information stored. [15]: 42\n\nThe cell wall of plant cells is composed of cellulose, hemicellulose, and fruit colloid, the cell wall can be divided into three layers, the progression layer is the outermost layer of the cell wall, which is a structure of adjacent cells, in the division process The first half is the earliest; the renovation walls are more soft in the interior of the cytokine layer, which can be expanded with cell growth; the secondary wall is formed after the cell volume stops, containing lignin, generally It is seen in cells that support and transport, not all cells have a neutral wall. [15]: 56-61\n\nThe proliferation of cells is called cell division. As the eukaryotes, the cell proliferation of plants is like most eukaryotic organisms, with mitosis as the main body cell division, combined with wire division; to reduce splitting as a split method of germ cells [15]: 62 -63. Plants are mitored and animals, which are open-miter, while fungi and some native organisms (including some non-botanic algae), a closed mitogenic [87].\n\nPlant tissue mainly includes basic tissues, vascular tissue and skin tissue (also known as protective tissues) [15]: 541.\n\nThe basic tissue can also be divided into thin-walled tissue, thick angle tissue and thick-walled tissue [15]: 541, and the latter is often called mechanical tissue [70]. Thin-walled organizations are the most common basic organizations, only have a new wall, play a role in photosynthesis, water storage, transmission, etc.; thin-walled tissue has a completeness, and their healing is also closely related to the occurrence of wounds [15 ]: 541-542.\n\nThick angle tissue and thick-walled tissue support, the former cell wall portion is thickened, often in the stem, leafle, etc., is living cell; the latter cell wall is thickened, with secondary wall, dead cell, by two Class cell composition: fiber and stone cells [15]: 542-544.\n\nViotic tissue includes wood portions and ligaments, wood portions include catheters, cells (minor quilts, naked plants and ferns), wood fiber and wood thin-walled cells, and the toughness includes screen, sieve cells (naked plants and ferns) , Biopsy, doubral fiber and ligaper thin-walled cells; plants are transported upwardly by the wood portion to transport the root from the minerality, and transport the photosynthetic product by the ligament [15]: 544-552.\n\nLeather tissue is also known as protection tissue [70], including epidermal and periphery. The skin is in the outermost layer, which is a newly protected tissue, the surface of the leaves, flowers, fruits, seeds [88] and unripe stems and roots [15]: 553. Tempel is a secondary protective tissue, existed in a mature stem and root, instead of epidermis protection [15]: 555.\n\nPlant organs include roots, stems, leaf three major nutrition organs and flowers, fruits, seeds. The morphology and structures are the research focus of traditional plant morphology, and the related features often use evidence of species in traditional plant classification. Although molecular biological evidence has a broader application in modern, it is not convenient to use molecular biological means, and morphological evidence still has a wide range of applications. [15]: 240\n\nThe roots of plants are usually located in the soil, mainly functional functions such as absorption, instructions, and fixed support, gas roots, storage roots, etc. also have synthesis, storage, breathing and other functions. The real roots were earliest in vascular plants, moss and algae also have similar structures, called fake roots, and only tempered, no other functions. The primary roots of seed plants are formed by germ germ form in the seed. The main root is vertically tied to the soil. After a length of the main root, the main root of the center-column sheath structure produces a side root, and more side roots can also be further produced, in the main root The roots other than the side roots such as stems, leaves, embryo or old roots are called unpacked roots. [15]: 559, 571-577\n\n\nThe stems of the plant are typically located above the ground, connected to the root, upward, with the lifting leaf, flowers, fruit, and instructive, supported functions. The stem has a section and section, and the section is the position of the leaf and bud. The bud can be divided into the bud and lateral buds according to the position, and may be divided into branch, flower buds and mixed buds according to future organs. [15]: 579-580\nThe leaves of the plant are the nutritional organs of photosynthesis, and their main functions are photosynthesis and transpiration. Most of the truly doubles and the leaf of the magnolia can be divided into leaves, leafles and leaves. Most of the monoclastic plants and a part of the trusted pagoders, the leaffriend is enlarged, forming the sheath wrapped in the stem; In the middle, the length of the leaf sheath will extend the length. For most plants, the leaves are the most important part, typically a green sheet shape, which is advantageous to expand the expansion of the sun irradiation area and the gas contact area to facilitate photosynthesis and transpiration. [15]: 592-593\n\nThe metamorphosis and leaves also have other functions, such as potatoes, stems of the onion, the bulbs of the gladiolus have a storage function, the stem of the agave, and the leaf of the scenery of the scenery has a water storage function. [15]: 611-612\n\nThe true stems and leaves were first produced in the stone pine plant, while the structure of similar stems and leaves had already appeared in the bryophyte plant, but because it does not have a vascular tissue, it is not possible to do real stems and leaves. There is only a leaf-like structure, referred to as a \"blade body\", with stem and leaf-shaped structure, referred to as \"a stalky body\". [15]: 368-369\n\nThe roots of the plants, the stems, and the leaves have the toughness and the wooden portion and communicate with each other in each organ. [15]: 604\n\nThe seed is only present in the seed plant, and the flowers, the fruit is only present in the quilt plant. Moss, ferns typically use spores to propagate; and algae is propagated, nutrient reproduction, and reproductive.\n\nThe plant industry is an old and huge population, which evolves many different breeding methods and life history. Most of the history of life of many cell plants has a generation of alternating phenomena, but this phenomenon is different in different groups, and a few will not have generations alternating. Only the nuclear exchange is replaced. The following points are described below.\n\nThe open-type mitosis of the airth is raw naturally, and rational reproduction is carried out by generating a spore (English: ZOOSPORE) or non-moving like apricic acid (English: AutoSpore). No evidence of raw reproduction has not been found. [89]\n\nThe reproduction of red algae has hazardous reproduction, sexual reproduction [15]: 342.\n\nInsessive reproduction, red algae is discharged into water, and if the spore encounters Substrate, it will be attached to the growth [15]: 342.\n\nThe rapid reproductive life history of red algae is more complicated. A simpler life history involves two stages of a single tester and twice spore body, and the male genitals produced by male reproductive structures are Spermatangium, which does not have flagella, and the flow of water; The female reproductive structure of algae is called the Colospore (CARPOGONIUM), which has a protrusion called a trichogyne for receiving sperm. After the sperm is contacted and combined, the male nucleus moves downward to the female and fused, and the formed diploid is fungally, and the fertile egg is mixed to produce fruit cacine (English: carposporE). The colored spores are released from the parental assault into the water, and the spore bodies are generated at a somewhere, and the spore body produces a haploid spore by spore reduction. The haploid spores will develop into a ticker, thereby completing the alternation of the spore body - the structure of the body. [15]: 342-343\n\nMost of the red algae life has three generations of alternating, this main difference between life history and the history of the previous life is that after sperm and egg cells, the fertilized egg does not directly divide the fruit, but by repeated Mark split, produce third generation, CARPOSPOSPOPHYTE. The fruit is not independently, only attached to the parentally fitting body, and the growth of nutrients is mature from the fitting body, and the spore is ripe, and there is a mitosis to produce fruit, and release it from the fruit body to the water, attached to a certain place For the tetraporophyte, the decreased spore is reduced, producing quadrocospores (Tetraspore), and develops a gear. These red algaments have completed the three generations of the tidal-colored spore bodies. [15]: 343-344\n\nThe spore body or quadrocosporioids of red algae and the formation of the ticker are not large, and the fruit bodies are larger than that of both. [15]: 344\n\nThe propagation of the green algae and the pulsation is diverse, there is no reproductive, sexual reproduction, and is different from the single-cell plant, the multi-cell plant, and the reproductive structure is different; it also has a unique reproduction that engages reproduction. the way.\n\nSome single-cell green algae can both increasulent reproduction, and have sexual reproduction, and algae is a typical representative. When natural reproduction, the haploid is bracted, and up to 16 sub-cells are produced in the cell wall. Each cell wall and flagelife are then secreted, and the enzymes of decomposing the parent cell walls are secreted, and these subcaters-swivel spores are released, and their respective agents are developed. When sexual reproduction, methaneous nutrient cells form a matching of the azoine under the deficiencitrogen-deficient conditions, which binds to each other to form a dualoid fertilization egg. A thick cell wall is formed around the fertilized egg. After a period of sleep, the fertilized egg is reduced, and four haplot cells can be divided, and these cells can be divided or mating each other to produce new fertilized eggs. [15]: 348-349\n\nThe stone belly is a multi-cell plant, the algae blade shape, the 莼 莼 莼 营 莼 结构 结构 结构 没有 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限 限Decimal splitting, generating a plurality of haplotypes with 4 flagellas (English: zoospore). After the spore is released, it can germinate the germplasm. In addition to the base and fixation, each cell can form a distribution sac, and a plurality of swivers are generated by a mitogen generating a plurality of swivel azoles (+ distributions and - azooform similarity), and the binding is formed, and a spore body is formed. The spore body and the form of the stone are not different. [15]: 351-353\n\nSome relatively complex species in the lagal doors have a relatively complex reproductive structure: producing a hibor of the sperm and a hibemic device that produces an egg cell. These two structural student are in the festival, and for the male affiliates, 藏 器At the top, the Tibetan Solder is below. In the reproductive structure of the round algae, the reproductive cells are protected by the outer nutrient cell pack, and there are several long and tubular, distorted cells in the outer side of the orthodium, and the outer portion of the hidden inselect is made of several shield cells. protection. Sperm is the only cell with flagella in the life cycle. After the formation, the protective structure of the ovophoresis is combined with the egg into a fertilized egg, and the mean is hibernating and produces four sub-cells, only one development For new individuals. [15]: 356-358\n\nThe photosynthesis exercise of the land plant and algae is almost the initial source of energy and organic substances in all ecosystems. Photosynthetic changes fundamentally changed the composition of early Earth's atmosphere, making 21% of oxygen. Animals and most other organisms are aerobic, depending on oxygen survival. Plants are producers in most terrestrial ecosystems, forming the basic food chain. Many animals rely on plants as their residence, as well as providers of oxygen and food.\n\nThe photosynthesis of plants is an important part of the biological circle substance cycle and energy flow. It is the foundation of most ecosystems of the earth, some plants (such as legumes, etc.) and nitrogen genes, so that plants have an important part of nitrogen cycle. The root of the plant also plays an important role in soil development and preventing soil erosion. [16]: 122 plants are usually the main physics and structures of their habitat. Many types of morphological systems are named in the type of vegetation, such as grassland and forests, etc. They adapt to different environments through genetic differentiation and phenotype plasticity.\n\nAccording to Qiuyuan's statistics, plants and birds have 53% overlap. [14]\n\nMany animals and plants have co-evolved, for example: many animals will help flow to exchange their nectar; many animals will help the plant to spread their seeds when eating fruit and excreted seeds. Appropriate ant plants are a plant that is co-evolved. Such plants will provide ants, sometimes food. As an exchange, ants will help plant defense [[help them with other plants. The ants of ants can also be provided to plant organic fertilizers.\n\nMost of the roots of plants and different fungi have mutually beneficial symbiosis, called the bacteria. Fungi will help plants to obtain moisture and minerals from the soil, while plants provide carbohydrates composed of fungi from photosynthesis. Some plants will provide endogenous fungus, while fungi will produce toxins to protect plants from eating animals. [15]: 684 The roots of plants can also be symbiosis with bacteria, forming a nioma, and is the root tumor projections. Such as legumes, wooda yellow, Rohansong, Yangmei, etc. And nutrients for their growth and development. [15]: 693\n\nMany types of parasitic parasitic in plants are also very common, from half parasitic mistletoe (only some nutrients from its host, but still leave the leaf of photosynthesis) to the whole parasitic and tooth scale (All are acquisition with the joints of the roots of other plants, so there is no chlorophyll). Some plants will be parasitic on the bacteria fungi, called bacteria, and therefore like a foreign parasitic in other plants.\n\nMany plants are an attachment plant, which is long in other plants (usually trees), but not parasitic. An attachment plants may be indirectly hurt their coupons, via the minerals and sunlight obtained by intercepting the accommodation. The weight of a large number of attached plants may be broken. Many orchids, pineapples, ferns and moss are usually attractive plants. Anni Pakistan's attachment plants will accumulate moisture on their leaf axes to form a tree pool, a complex aquatic food chain. [90]\n\nA small part of the plants are reword plants, such as flythal grass and felt moss. They capture and digest small animals to obtain minerals, especially nitrogen.\n\nDue to the large-scale activities of humanity, many global environmental issues, such as greenhouse effects, global warming, etc., making many plants in the danger of extinction. The International Plant Genetic Resources Commission (IBPGB) established an International Genomic Internet of Things Center to store more plant genes.\n\nThe disciplines studying plants to human use are called economic and botany or ethnic plants. Both words are often used as synonyms, but some people believe that economic plants are mainly focused on the use of current role, and national botany mainly study the application of local resources on their local plants. The planting of human beings is part of agriculture, which is the basis of human civilization. Plant agriculture can be divided into agronomics, gardening and forestry.\n\nIn fact, all human nutrient sources rely directly or indirectly on land plant. Most human nutrients rely on cereals, especially corn, wheat and rice, or other staple food such as potatoes, cassava and pods. Other edible plants also include fruit, vegetables, nuts, vanilla, spices and edible flowers. Beverage made from plants include coffee, tea, wine, beer, etc. Sugar is mainly obtained by sugar cane and beets. Edible oil and plant butter from corn, soybean, mustard seed oil, safflower, sunflower, olive, etc. Food additives include Arabic gum, Guur gum, hirginacid, starch and pectin.\n\nWood is used in construction, furniture, paper, musical instruments and sports appliances. The fabric is usually synthetic fiber with cotton, linen or its raw material, such as 嫘 and acetate. Renewable fuels from plants include firewood, peat and other biological fuel. Charcoal and oil are fossil fuels from plants. Drugs from plants include aspirin, paclitaxel, morphine, quinine, lesion, autumn water, hair yellow and Changchun new alkali. Plants are present in hundreds of herbs such as ginkgo, purple cone flowers, anthroposh, and peer joints. Pesticides from plants include nicotine, lavanese ketones, pretty matrix, and destallutrients. Drugs from plants include opium, ancient cocoline and marijuana. Persons from plants include ricin, poisonous ginseng and arrow venom. Plants are many natural products such as fiber, essential oil, dye, pigment, wax, tannin, latex, resin, rosin, alkaloid, amber and cork. Products from plants include soap, paint, shampoo, sesame oil, cosmetics, pine oil, rubber, brown lacquer, lubricant, linseed, plastic, ink, chewing gum and hemp rope. Plants are also the main source of basic compounds in industrial synthesis of a large number of organic compounds.\n\nThousands of plant species are planted to beautify the environment, provide green shade, adjust temperature, reduce wind speed, reduce noise, provide privacy and prevent soil loss. People are placed indoors, dry flowers and indoor potted plants, outdoor set of turfs, shade trees, view trees, shrubs, vines, perennial herb and flowers, plants, are often used in art, architecture, temperament, Language, photo, textile, coins, stamps, flags and armbands. The art type of live plants includes green carving, bonsai, flower arrangement and tree wall. Ornamental plants sometimes affect history, such as tulips. Plants are basically a few billion dollars of tourism industries, including travel to the botanical garden, historical gardens, national parks, tulips, rainforests, and forests with colorful autumn leaves.\n\nPlants also provide basic needs for human spiritual life. Paper used daily is made of plants. Some plants with fragrant substances are made into a variety of cosmetics such as perfume and flavor.\n\nMany instruments are also made from plants. Flowers and other plants are to become ornamental plants in human living space.\n\n[Edit in Wiki Data] "}