{"chinese_title": "calligraphy ", "chinese": "Calligraphy is a method of writing text, a writing art. The calligraphy is longitudinally penetrating two levels: \"Use\" and \"Aesthetics\"; horizontal crossword two levels: \"text\", \"painting\". Calligraphy is a tool for studying writing writers in addition to the main performance and work of Calligraphy home, is also a tool for studying a mentality and character of writing. All local areas have their own calligraphy characteristics in terms of historical and cultural development, and calligraphy is still widely used in life and art culture.\n\nThe definition of contemporary calligraphy:\n\nThe typical concept of East Asian calligraphy is \"ink, holding a brush, writing Chinese characters, and the lines of the lines disclosed in the line. Calligraphy is considered an important art and the most elegant writing form of East Asia. Writing Chinese characters has always been a kind of literacy. It is derived from Chinese calligraphy, respectful by the East Asian civilization society and is widely practiced, including: China, Japan, Vietnam, North Korea.\nChinese characters calligraphy is the most typical representative in East Asian calligraphy. It is also the collective of East Asian calligraphy. Because most of the fonts are mostly Chinese characters, all East Asian calligraphy is also the earliest passed by China.\n\nIn addition to the traditional cultural four treasures, the rise of hard pen calligraphy is more hardware due to the innovation of writing tools.\n\nMongolian calligraphy is Mongolian calligraphy, similar to East Asian calligraphy, Mongolian calligraphy mainly writes into [4]. Mongolian calligraphy uses traditional Mongolian letters, in 2013, Mongolian calligraphy column named represented in the human non-material cultural heritage representative [5].\n\nNepalese calligraphy is mainly written by Lanzu, which is in Tibet, Nepal, Bhutan, such as Lanydza Script, Phagpa Script or Kutila. , Listed, Mongolia, China coast, Japan and South Korea, using the Buddhist scriptures of six words or other derived from Sanskrit or Bali.\n\nThai calligraphy is mainly written in Sanskrit. In history, Thai calligraphy is restricted in the classic sacred text of Bli. The Thai Scriptures appear in the personal banner of Royal Thai members, and the first name will be expressed in Thai calligraphy. Some books have also been printed with a combination of Thai calligraphy.\n\nTibet is part of the Indian cultural circle. It has been a Buddhist heart zone for hundreds of years. Tibetan words originated from Indian text, and its text is very important in religious districts, and Tibetan calligraphy is an important culture. Tibet's aristocrats such as Lama and Pudla Palace are usually good at calligraphy. There are not many parts related to the classic calligraphy, but there is indeed (and some degree is also related to Tibetan Buddhism). Almost all of the documents written by all religious seniors are related to Tibetan calligraphy, including the letter sent by the Dalai Lama, as well as other religious circles and secular seniors. Tibetan calligraphy is particularly obvious on its transferred columns, but these texts are forged, not scratched. Tibetan calligraphy is the earliest use of reed pen, now it is also written in a pointer.\n\nWestern calligraphy is different from traditional East Asian calligraphy. Western calligraphy is rarely written by a brush, but written with a hard pen and paper, and the most famous pen is a goose brush. The early letters were invented about 3,000 years ago. From the Greek letters to Latin letters, the uppercase is developed first, and then the lowercase is developed.\n\nThe first batch of Romans appeared. This batch has only a few folds, and it is done with parchment, and the reed pen is replaced by the Goose Brush. Christian Beliefs will help Western calligraphy development at this time. Because this copy of the Bible and other holy books are very popular. In Ireland, the monks have used Anstale in the past. In Scotland and elsewhere, you will be called this writing method with the \"Island Style\", which is also a full day of mud gold decoration hand.\n\nCharlium then brings the drama to Western calligraphy. He appointed Alqi, the Dean of York Monastery, Alqin came to Charcheman's capital Aachen, and brought the responsibility of all textures. He then also developed new handwriters for Charman's Emperor and named Carlin Grass Book.\n\nGothic letters then appeared in the 11th century, although the letters were not popular, but the name similar to the names became the mainstream of the late Chinese calligraphy. It also has a Dafa Officer (English: CHANCERY HAND) (CHANCERY HAND) and Italian handwritten. At this time, mud gold decorative handwritten fonts have also been affected, so it is prevalent. However, after 15 centuries, John Gitanburg invented the orthodontics that made handwritten and hand-decorated books quickly, but Western calligraphy did not disappear.\n\nAt the end of the 19th century, William Morris and other people of British art and craftsmanship were rediscovered and once again carried forward the beauty of Western calligraphy. There are many calligraphers such as Edward Head Oden (English: Edward Johnston), Eric Jose (English: Eric Gill), has been influenced.\n\nWestern important contemporary calligraphers are Arthur Baker (English: Arthur Baker) with Herman Cheap. As handwriting is increasingly seen in communication behavior, Western calligraphy is gradually seen in special circumstances and activities, most of them use the wedding invitation and notice.\n\nIslamic calligraphy is made with Islam and Arabic. Because of the Arabic letters, some people are also called \"Arabic Calligraphy\", but Islamic calligraphy is a more accurate noun, including a variety of Islamic calligraphy works, and the location from the southern Spain to China.\n\nIn Islamic countries, calligraphy and Western calligraphy are generally the same. Because Islam prohibits idol worship, there is no painting in a large number of religious themes like the Christian world, so use a calligraphy work of Arabic letters into the most important visual art. From Spain to India, calligraphy work written in arabic alphabet is everywhere.\n\nArab pattern like the mosque wall and the ceiling is Islamic calligraphy. The contemporary artists in the Muslim world also inherit the Islamic calligraphy, used on the inscription or abstract pattern.\n\nIslamic calligraphy is the highest realm in the Islamic world, and is also the art of its spiritual world. There is no controversial, and Islamic calligraphy has become the most revered form in Islamic art because it provides links between Islam and Muslims. The Quran has an important role in the development and evolution of Arabic, and also extends into Islamic calligraphy. Scriptures in the proverb and the Quran are still an important source of Islamic calligraphy.\n\nIt is generally considered that Islamic calligraphy performances in the Em Tuman Empire. Islamic calligraphy in Turkey has the most refined and most creative work. Istanbul is a variety of Islamic calligraphy and open exhibition halls in the mosque, fountains, schools and residential inscriptions of Islamic calligraphy.\n\nModern and contemporary Islamic calligraphy, it focuses on Turkey, Egypt and Iraq, represents people with Turkey Hamid Adidi, Egypt's Said Ibrahimi and Iraqi Hashim Muhammad [6 ]. In 1986, the First International Arabic Calligraphy Competition, in addition to Saudi Arabia and Syria, the rest of all medals were included in Turkish Calligraphychers [7].\n\nMaya calligraphy is in Mayan text, and the current Maya calligraphy is mainly used in the seal and monuments of Jukatan, Mexico. Mayan calligraphy is rarely used in the official agency, but in Campeche and Jinsanario, Mayan calligraphy is represented by Latin. Some South Mexico companies will use Mayan calligraphy in their business symbols. Some community and modern Mayan brothers will use Mayan calligraphy as the symbol of the organization.\n\nMost Mexican archaeological sites (like in Caibaya, Labaron (English: Labna), Usmar, Karack Moore, etc.) will have its Maya TX. The stone carving monument is often seen from the ancient Mayan calligraphy.\n\nModern calligraphy is widely used, from functional inscriptions and lettering, to exquisite art abstract handwritten markers, text may be easy to understand, or it may not consider its readability [8]. Classical calligraphy is different from font laying and non-classical handwriting, but calligraphers may be familiar with these parts [9] [10] [11] [12].\n\nCalligraphy is still often used in a wedding invitation, a word type design and font mint, original handwritten letters or word symbol design, religious art, announcement, pattern design and calligraphy art, stone carving inscription and commemorative document. Calligraphy is also commonly used in motors or moving images, recommendations, birth certificates, death certificates, maps and other occasions [13] [14].\n\nEman Empire in Arabic (Western Yuan 1791, Islarm 1206)\n\nShikasta Poscope\n\nNon-words writing (English: Asemic Writing) and abstract calligraphy\n\nCalligraphy display in Tallinn, Estonia Capital Tallinn\n\n[Edit in Wiki Data] "}