{"chinese_title": "mineral ", "chinese": "Minerals refer to a naturally formed crystalline purified purified (single or compound) under geological action. The absolute pure substance is not present, so the pure substance here refers to the relatively single substance of the substance chemistry. Minerals are the foundation of the rocks (like quartz, long stone, and square solutions are common 造 岩), but minerals and rocks are different, and minerals can be expressed in their chemical formations, while rocks are synthesized by many minerals and non-minerals. Nothing Chemical formula.\n\nMost of the minerals are non-organized inorganic compounds, typically solid, organized, but also liquid minerals, such as mercury (mercury). The precise definition of minerals is still controversial, and there is a controversial is the two conditions of non-organisms, and the ordered atomic structure. Like minerals such as brown mines, obsidian, but there is no crystalline, it is called quasi-minerals.\n\nThe natural science of minerals is known as mineralogue. The mineral known in the world (English: List of minerals (complete)) has more than 5,300, of which 5,070 have been approved by the International Mineral Academy (IMA). More than 75% of the crust is composed of and oxygen, so many minerals are silicate minerals. Minerals can distinguish between physical properties and chemical properties, can be divided into several categories according to their chemical composition and crystal structure, and factors such as temperature pressure during mineral formation can affect some of them. The temperature, pressure, and changes in the rocks, will affect the minerals. It is also possible that the main components of the minerals are constant, but the minerals are varied due to temperature pressure changes.\n\nMinerals can be described in many physical properties, and these properties are also related to their chemical structures and composition. Common mineral physical properties include crystal structures and crystals, hardness, gloss, transparency, colors, bar marks, toughness, deconsive, fracture, fracture, and proportion. Further characteristics include reactions, magnetic, odor, or flavors of acid, and radioactivity.\n\nMinerals can be classified according to their primary chemical composition, and the main two classification systems are Strunz mineral classification and DANA mineral classification. The silicate can be subjected to six small classes according to the homogeneous polymorphicity of its chemical structure. All silicate has [SiO4] 4-laves, a silicon atom and four oxygen atoms, is bonded in a four-dimensional manner. The silicate can also be divided into stock salts (OrthoSilicates, no polymerization), silicate (Disilicates, two silicate polymerization), cyclic silicate (cyclosilicates, cyclic silicate), Chain silicate (inosilicates, chain-shaped silicate), laminated silicate (phyllosilicates, layered silicate) and web silicate (Tectosilicates, three-dimensional silicate structure). Other important minerals have natural elements (English: Native Element Minerals), sulfides (English: sulfide minerals), oxides (English: oxide minerals), halide (English: halide minerals), carbonate, sulfate (English) : Sulfate minerals, phosphate (English: sulfate minerals).\n\nMinerals are naturally formed pure substances or compounds, and the chemical constituents are not large, and there is a crystallization structure. Rocks are polymers of one or more minerals, chemical components, usually without crystallization.\n\nThe crystal structure is an inherent structure in the mineral, and the ordered geometric arrangement is performed. The crystal structure is arranged in accordance with internal atoms or ions, and often named in the geometric shape of the crystal. Even if the mineral grains are too small, or seemingly irregular arrangements, the periodic arrangement of its internal radiation can still be seen. [1]. The crystal structure is often described in its symmetry. The crystal structure is limited, and only 32 symmetled points of symmetry, the crystal structure can be further classified, in which the spatial group of the hexalectine is mostly [2].\n\nThe crystal family can be defined by the length of the three crystal axes, the angle between the respective axes, the relationship, corresponding to its symmetry, and the downside is defined in symmetry. The following is a list of the transistors, A, B, and C are crystalline shaft length, α, β, gamma, and the angle angle adjacent to each axis, for example, α is an angle of the b and Cd crystal axes: [2]:\n\nCrystal conformation refers to the shape of the entire crystal. Common crystals such as sputum (English: accicular (crystal habit), blade shape, dendritic (like natural copper), equidine crystal (like natural copper), zeolite (English: natrolite)) Like olivine), the angle column and flat shape extending in one direction. And crystalline shapes, the quality of the crystal surface is also a way of confirming minerals, generally using a rock phase microscope to observe. The crystals of self-shaped (Euhedral and anhedral) have a clear shape, and the ANHEDORAL is not called half-shaped in the self-shaped crystal and his crystal [3] [4].\n\nThe hardness of the mineral is its ability to resist scraping. The hardness of minerals and the chemical composition of minerals and the crystal structure are related. The hardness of the mineral is a function of its structure, and the hardness in each direction is not necessarily a value, and some of the lattice weaknesses will make the hardness in one direction than the other direction. [5]. Like blue stones in parallel [001], the Moth hardness is 51/2, but in parallel [100], the Musk's hardness is 7 [6].\n\nThe most commonly used mineral hardness standard is a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral, a mineral. The surface leaves a scratch. The Mournish hardness gauge refers to the ten minerals, the table is as follows [5]:\n\nWhen the hardness is identified, if there is no more than the above Muosta hardness, other things can be used instead, such as the hardness of the small knife (or steel needle) is about 5.5, the copper coin is about 3.5 to 4, the nail is about 2 to 3, the glass hardness is 6 .\n\nGloss refers to the ability of the mineral surface to light reflection and related to its mineral quality and intensity of light. There are many words describing mineral gloss, mainly divided into metal gloss and non-gold gloss. Metal gloss and high reflectivity of the secondary gloss, similar metals, like square lead ore and yellow iron ore have metal gloss. Non-metallic luster has Diamantine, such as diamonds, glass gloss (vitReous, such as silicate minerals), pearl luster (Pearly, such as talc and fisheet (English: apophyllite), resin gloss (RESinous, such as pomegranate Stone), silk gloss (Silky, fibrous minerals such as asbestos) [7].\n\nThe transparency of the mineral refers to the extent of its light transmissions. When light passes through transparent minerals, its strength will not decrease, such as white mica, some minerals or even transparent to the window. The translucent mineral allows part to pass, but the intensity is lower than by transparent minerals. Like jade and soft jade are translucent minerals. If the mineral is not allowed to pass through, it is called opaque [8] [9] [10].\n\nThe specific gravity is the ratio of mineral weight and the same volume of water, that is, minerals and 1ATM4 ° C pure water density ratio, no unit. For most of the minerals, it is not suitable for identifying minerals with specific gravity. The aravor mineral is mainly based on silicate and carbonate, and its density is between 2.5-3.5 [11].\n\nSome special minerals have a higher specific gravity. If the oxide and sulfide contain atomic mass, the proportion will be heavier, and the proportion of metal gloss or the rock of the golden gloss is more than non-metallic luster. The emphasis of gloss, such as the pre-proportion of FE2O3 of the hematite, and the proportion of PBS of the square lead ore is 7.2-7.6, and [13] is all iron and lead in which high atom quality is contained. The specific gravity of natural metal (English: native metal) is also quite high, such as cone stone is a ferrite alloy that often appears in the iron meteorite, the proportion of 7.9, [14], and the proportion of gold even between 15 and 19.3 [11] [15].\n\nColors are one of the most obvious characteristics of minerals, but it is not easy to use colors to identify minerals [16].\n\nThe bar is the color left by the minerals, which is the color of the mineral powder. The color of the bar is not necessarily the same as the color of the mineral [9]. The way the test bar is friction on the mineral on the barboard, and the strip is generally china, the color is black or white, the color of the bar is not affected by the trace element of the mineral [8] or the surface of the mineral surface [9]. The color like the hematite may be black, silver or red, but the stripe color is cherry red [8] to red brown [9]. However, the stripe test has a certain limit on the hardness of the mineral, and if the hardness is greater than 7, the minerals and strips are rubbed, and the powder of the bar can be left in the mineral [9]. "}