{"chinese_title": "Animation ", "chinese": "Animation (English: animation) is a visual residue of the naked eye (such as 16 per second) by timing, a series of plurality of stationary solid state images (frames) to move (such as 16 photos per second) The illusion - while mistakenly thinks of paintings or objects (picture) activities and their movie technology.\n\nThe method of making the picture, the most common is that hand-painted on paper or cellulin, other production methods also contains clay, models, paper couple, sand painting, computers, etc.\nDue to the advancement of computer technology, there are now many ways to use computer animation software, animations that are produced directly on the computer, or the use of computers in animation production, these have been used in a large number of commercial animations.\nUsually animation is produced by a large number of intensive and boring labor, even if it is currently working in computer animation technology, it is also true.\n\nThe word \"Animation\" animation is from the birthplace of the dynasty, the origin of French inventors, the French inventor, Emir Renault, \"Animated\", refers to an image. Later, people will adapt the books [Note 1], movies, electronic software, music videos, TV advertisements, original and post-system effects, and use animation technology production. The relevant workers in the animation industry are called \"animators\", which is a professional name for dynamic screen. However, animations are also widely used in all walks of life, such as film and television industry, technology, etc., and art and design.\n\n\"Anime\" from the Chinese is an independent name that is derived from the word \"animation\". About the 20th century to the 21st century network developed and secondary creation, using the splicing and other methods to reinterpret the title defined after their work. Later, \"Anime\" was also widely used by people from Hong Kong, Malaysia, Taiwan.\n\nThe word \"Anime\" is only frequently used in Chinese, because the translation is often mistaken to be synonymous with the animation. In today's network, TV, magazine and other media, this term has been widely used, but because some media misuse and demonization, the misunderstanding and controversy of these two vocabulary are also more and more.\n\nFrom civilization, humans use various image forms to record object action and time process.\n\nFrench archaeologist Puerto Horse (Prudhommeau) pointed out that the stone hole in the old stone era of 25,000 years ago, painted a series of bury bull run analysis, and the animals on the mural were superimposed. Multi-legged, used to express a decomposed action, is the earliest evidence of humanity attempt to capture condensation action with a pen (or stone).\n\nThe same example, continuous action exploded in the egyptian tomb, Greek ancient bottle appears. Draw the action that occurs at different times on a picture, this \"simultaneous\" concept indirectly shows the desire of human \"moving\". Leonardo Da Vinci's famous gold proportion of the four arms painted on the body geometry, indicating the movement of the hands up and down.\n\nAnother example is to discover the pottery pots of five drawings with goats in Iran. When you rotate the bowl, you can see that the goat jumps on a pear tree. This can also be considered an example of an early animation. However, in front of the device without a dedicated device, a separate action decomposition image cannot be referred to as an animation in the true sense.\n\nIn the history of Chinese painting, artists have always given a tradition of static painting to life, such as the \"six law\", the charm of the \"Liao Zhai\", \"Liao Zhai\", \"paintings\", the characters go out of the reel, etc. dynamic. True to develop a work that makes the picture on the picture, or is still in a distant Europe.\n\nEarly-prematured equipment included Feneri Miroscope, activity visual mirror (Praxinoscope, also translated into \"practical mirror\"), Hand over the sixteenth century, and China's early Western mirror (Zoetrope). Although these technical means can cause a continuous image to produce a visual effect similar to animation, the animation is not too great to develop before movie photography. Hand over the prototype of the book, this and the concept of animation also have communication.\n\nThe development of animation production technologies has benefited from the development of film photography technology in the 19th century. In this period, due to many people do, they can be classified as animation works, so it is difficult to find a separate person. , As a creation of film animations or inventors. But you can use the means they use to place them with a pioneer of some animation production technology.\n\nGeorg Méliès is a creator for movie special effects, mixing Delivery animation techniques in his movie work. This technology is a great role in his shooting movie, and it has played a lot of effect on the advancement of the animation, and it is also used in a large number of special effects in early movies.\n\nThe oldest Delivery animation advertising movie is a short film in Arthur Melbourne Cooper, which is mixed with fixed animation techniques.\n\nJames Stewart Blackton may be the earliest animation technology in the US movie producer, as well as people hand drawn animation. His works, such as \"The Enchanted Drawing, 1900) combines drawings and videos; another work\" Humorous Phases of Funny Faces, 1906) is usually identified as the world's first Real animated works, and Bulleton is also considered to be the first real animator.\n\nEmile Cohl made a film \"Fantasmagorie\" in 1908, the film's visual style is similar to chalk painting, but it is actually drawn on paper with pencils. Some fragments in the film synthesize a realistic scene. This film uses the production technology that is later known as the traditional animation. The film first draws the plot on the paper, and then filled with each frame to the movie negative film, so the background of this film looks like a blackboard.\n\nIn subsequent time, more artists began to involve the animation field, including Wenr McKai, which is the inventor of detailed animation. This type of animation requires a number of animator collaboration because it takes a lot of time to pay attention to the details of the animation, and the background and roles of each frame need to be precisely heavy, while animation The role of the role is designed with animation. His most famous works have \"Little Nemo, 1911),\" Dinosaurry \"(1914),\" Sinking of the Luchenia \"(1918).\n\nThe first set of sound animations, Walt Disney's motor boat Willy. First set of animated long tablets, white snow princess.\n\nTraditional animation, also known as hand-painted animations, or celluloid animation, is a more popular animation form and production means. In the 20th century, most of the movie animations were made in the form of a traditional animation. Traditional animation expressions and technologies include full motion animation, limited animation (Limited Animation), transforming technology (ROTOSCOPING).\n\nSTOPMOTION is an animation form for the use of photographic techniques to be used in real items. Chinese can be called static animation, or still animation, etc. This animation can be divided into clay animation (CUTOUT Animation), a model animation, animation, and object animation, real movie animation (Object Animation), real movie animation (Object AniMation) Pixilation), Puppet Animation. There is another segment in these types. Delivery animation is different from traditional animation and computer animation, with very high artistic performance and very real material texture. When making, first perform photography, then change the shape position of the subject or replace the object, then perform photography, repeat this step until the end of this scene. Finally, these photos (film) are connected together to form an animation. This animation is also referred to as frame to frame or a postion to post.\n\nComputer Animation, is a technique for making animations with a computer. The popularity and powerful functional innovation of the computer has been produced and expressing the animation. Since computer animations can complete some simple intermediate frames, the production of animations is simplified, which only needs to make keyframes (KeyFrame) is known as \"Pose to Pose\". Computer animations also have a lot of form, but can be divided into two-dimensional animations and three-dimensional animations.\n\nTwo-dimensional animations are also known as 2D animations. Create a modification or editing animation with a computer 2D bitmap or a vector graphic. What is similar to traditional animation is similar. Many traditional animations have been transplanted to the computer. For example, gradient, deformed, onion ski technology, transform machine, etc. Two-dimensional movie animations have a very huge improvement in imaging effects, but the production time is shortened before. The current 2D animation often uses hand-painted and scanned to the computer or directly painted on the computer (considering costs, most of the two-dimensional animation company uses pencil hand drawn), then carry out the work on the computer Color work. Effects, sound music effects, rendering, etc., almost completely use computers. Some software that can make two-dimensional animations include Animate, After Effects, Premiere, etc., Disney began to make 2D animations in the 1990s. And they re-use the previous works.\n\n3D animation is also known as 3D animation. Performance based on 3D computer graphics. Some different animations, three-dimensional animations provide three-dimensional digital space to make animations with digital models. This technology is different from all previous animation techniques, giving the animator's greater creative space. The accuracy model, and the rendering of photos of photos have improved the levels of animations, which also makes it used in modern movies. 3D animation is almost completely dependent on computer production. When making, a large graphic computer work will vary depending on computer performance. 3D animations can achieve a variety of different final imaging effects through computer rendering. Includes realistic picture effects, and 2D animation hand drawn effect. The main production technology of three-dimensional animation is: modeling, rendering, light shadow, texture material, kinetics, particle effect (part 2D software can also be achieved), fabric effect, hair effect, etc. The famous 3D animation studios include Pickers, Blue Sky Studios, DreamWorks, etc. The software includes 3DS Max, Blender, Maya, LightWave 3D, SoftImage XSI, etc.\n\nComputer animation production technology has been greatly extended through a computer. Many technologies are not only used in animation, but also on TV, movies. These technologies include cartoon rendering animation, motion capture, color key, non-photorealistic rendering, skeletal animation, target deformation animation (Morph Target Animation), Simulation, Simulation, Simulated Wind, Rain, Thunder, Electric, etc.). In addition, there is a small animation made from bitmap or vector graphics, and the mainstream format on the Internet is a bitmap GIF.\n\nThe following mainly refers to Japanese animation and American animation industry. Animation production is very cumbersome and heavy work, and the division of labor is extremely meticulous.\n\nThe animation propagation media film industry is rarely produced by people of a country or company, but will be produced to other partnership countries, animation production companies, or to undertake orders. Therefore, the animated film industry is almost all cooperative manufacturing, unless the company is really enough to make the animation work.\n\nDesign department\n\nScript department\n\nDirection department (Direction Department)\n\nAnimation Department (ANIMATION Department)\n\nCG department\n\nArt department\n\nAudio Department\n\nImage department (Visual Department)\n\nDigital Film Mastering\n\nProduction issuance (Film development)\n\nPublicity\n\nMost of Japan and other countries have no big differences in learning, process and content with the United States, and the American animation industry.\n\nBefore the production, also known as the previous production:\n\nProduction:\n\nAfter the system, it is also known as later production:\n\nissued\n\nFor details, please refer to Animation Terminology. "}