{"chinese_title": "the film ", "chinese": "Movies (English: Movie / Film), characterized by sports / moving pictures (English: motion / moving pictures), is a visual artwork for simulation through using dynamic images to convey ideas, stories, perception, feelings, beauty. Or atmosphere experience. These images are usually accompanied by sound, fewer sensory stimulation. [1]\n\nThe continuous picture in the movie is done by a frame of frame of frame, as for the feeling of motion in the movie, because people will cause a series of still pictures because of the vision of the flying phenomen. The illusion. Conventional understanding of motion perception in the film is because the visual is suspended, so that the image will remain in the eye to retain \"video\" about one tenth of seconds. Therefore, the brain feels that the image is \"sports\". However, in the 1916 Psychologist Hugo Münsterberg's \"Movie: A Psychology Research\" in the Third Chapter, \"Deep Sense and Sense\", Hugo Minster Berg proves that the appearance movement is never the result of the image retention (ie, the visionary), but (but not just) a perception of the continuous phase of the movement.\n\nMovie production itself is an art is also an industry (English: Film industry). The movie can be made by the movie camera, and the drawing can also be used to draw the drawing and then take pictures, and even the computer imaging and computer animation can be used. All of the above techniques can be utilized in the movie. Other visual effects. In the early days of the development of film technology, there are various screening speeds, but current movies are mostly twenty-four image of the twenty-four image [2].\n\nLouis Prince on October 14, 1888, using an improved version of the single-lens camera (ie MKII) to shoot the film \"Langdehai Garden Scene\". His Hanslet in Leeds, Hansle, Hansle, and Hitlli Located in Landeham's home - Oakwood Farm exhibited him the first movie.\n\nMovies have become the seventh art, which is the Italian poet and film pioneers Joso Kanu Du (Ricciotto Canudo), he is a \"birthday of the sixth art\" published in 1911 (Birth of The 6th Art), putting the movie behind the architecture, sculpture, painting, music, and poem, and he later joined the dance before the movie, so the movie became seventh art [3]. There are also some statements that will be in the film before the film has been in the film, and the movie will become the eighth art.\n\nToday, many movies still use photographers that can record images on the film. After the film is rinsed, use the projector to run the film. The projector can emit light, through the film, so the image is displayed on the screen. Since the inventions of sound movies, most movies have sound movies. Many movies have been taken with a digital video camera, and when the show can be used, you can use the digitizer to transfer the digital image to the traditional film. This method avoids distortion of the film for a long time.\n\nIn 1895, \"Train Entering\" is a black and white silent document made by the Lumie Brother. This record train arrives at the La Ciott station, which is taken on the platform. The whole length of fifty seconds, describing the steam train into the bus, gradually enter the station from the distance. In the same year, the Lumi Brothers also made the \"departure factory\", and a movie that truly actor's performance appeared, photographing the scene at the time.\n\nEarly movies are \"no sound movies\". However, the film publisher finds that there is a commentator to describe the story when playing a movie, and makes it more attracting the audience more. After a few years, the played movie will be attached to the subtitles so that you can show what he said when the actor is \"speaking\". This makes the coupons of the appreciation.\n\nIn fact, the cinema boss often replaces the judge, please accompaniment when the movie is shown, if the cinema has the corresponding instrument, it is usually a pianist or organ. The accompaniment music should always match the movie's plot.\n\nLater, the advancement of technology allows the manufacturer to create a track synchronized with the movie picture, so that the movie has entered a sound period. The first part of the history is the \"Jazz Singer\" (1927) [8], and the first 100% sound film is \"New York lights\". The recording of the track can be separated from the shooting movie, but the real movie track record, many parts are simultaneous with the shooting screen. After the inventions of the sound movie, the silent movie and the musicians in the cinema quickly tired.\n\nAn important step in movie development is that color movies introduced into the market around 1930, and the world's first recognized color movie is \"华 世界\". In the process of replacing black and white movies in color movies, it is a gradual transformation process. With the improvement of color technology, more colorful movies can be said that there is basically no black and white movies. In addition to individual exceptions, such as Staton's movie \"Schindler's list\", former Soviet movie \"Sentiment here\", 2011 French film \"big artist\" and 2013 Polish movie \"dependent choice \"Wait. This is usually spent on art or drama, deliberately shoots black and white movies.\n\nAt the beginning of the film, the special effect lens of the movie is combined with each technique. To present, the computer has been applied to the film production, and some of the lens actors only need to sit on the special chair, do some expressions and moves, and the background and plots that appear on the screen are simply imaginable, because of the computer Making the work of editing the film replaces a cumbersome step, making the final copy quality and the products that have also been in the same day.\n\nThe purpose of the film theory is to study, develop concise and systematic concepts with movies. The concept of movie is from the form of art origin \"The Birth of the Sixth Art\" of Jono Canu Du (English: Ricciotto Canudo). Rudolf Anheim, Bella Braz and the formalist film theory (English: Formalist Film Theory) stressed the different movies and reality, so it can be considered art. However, Andre Pakan opposed this theory, and believed that the essence of film aesthetics was in the ability to replicate reality, not part of its and reality, which produced realism theory (REALIST THEORY). More recently analyzed is driven by the spiritual analysis of Jacoblaga and the theoretical theory of Fudi South Dude Saussian symbolics, therefore, there is a mental analysis film theory (English: psychoanalytic film theory), structureist movie Theory (English: structuralist film theory), femaleism film theory, etc. On the other hand, it is affected by Ludwig Vitgenstein, from the analysis of philosophical tradition, tried to clarify the misunderstanding of theoretical research, so the analysis of film vocabulary, and its form of life (English: Connectivity between form of life (philosophy)).\n\nMovies have the language it uses. James Monaco (English: James Monaco) has written a classic article in a movie theory. The title is \"How to\" Read \"A Film), which is mentioned. Director Ingma Birman has said a famous word: \"For me, Andre Tarkovsky is the greatest movie director. He invented a\" new language \", loyal to the movie. The essence. An example of this language is a series of screens, one of which is an actor on the left side of the screen, and another picture is an actor on the right side of the screen. The audience can understand this language, know that this represents these two people's dialogue . This describes another movie theory 180 degree rule (English: 180-degree rule), using visual combinations and appropriate clips, movies can make the audience seem to be in the scene and watch the rigid between the protagonist. Classic Hollywood movies include this narrative theory, because in the classic period of the movie, the use of this one has been reversed in Hollywood. Another movie language is to shoot the lens, the picture is silent, then the lens is switched to another actor, which represents another actor, which represents the actor's case, and the movie describes some of the earlier time. thing.\n\nMovie reviews (film reviews) are the analysis of the film and assessment. In general, the film review will be divided into two categories: the academic film reviews proposed by film researchers, as well as magazine movies that are often seen in newspapers, magazines or other media.\n\nMost film reviews on newspapers, magazines and broadcast media will look at many newly released movies. Generally, each piece will only take a look at once, and one day only look at one to two pieces, there is enough time to write movie comments. The film review has a great impact on the movie itself, especially for a movie of a particular film. Generally, the popular taste of the moving film, a horror film, the box office of the comedy film is not too much affected by film comments. The main content of the movie comment is the summary of the plot and the description of the movie. This is also why most people decide whether to see a specific movie. For some classic movies (such as drama films), film comments are quite large, and bad movie comments may destroy a movie and causing economic losses of film companies.\n\nWhether the film review affects the presentation of the box office is still the issue of controversial. Some people think because of movie marketing (English: film promotion) so fierce, adequate funds, film reviewers are difficult to affect movies. However, some heavy programs are not worth worthwhile, and the box office is very poor. There are also some independent production or small cost marketing movies because of the praise of the film review, so in some cases, the film review may still Will affect box office. Some people notice that the positive comments of the film review will let the public noticed some more than well-known films. Relatively, some film companies may not arrange the film review will destroy the impression of film reviews without arranging their confidence in film reviews. However, this will have a counter-effect, and the film reviewers are quite smart. In this case, the masses can be not worth seeing, and often movies are still as good as the film review is expected.\n\nThe method of movie production is different from the content that the film wants to expresses, as well as the device presenting the content. The drain tablets only need to have a series of patterns on the paper roll. The simplest way of making a movie is a person plus a movie camera (which can not bring a movie camera, Moth of Mothlight (English: MothLight)), or thousand actors, temporary actors in Stan Brahag, 1963 And the crew and many props and equipment.\n\nAlmost every movie will need a process of concept, planning, taking film, modification, and distribution. In the production cycle of typical Hollywood movies, there will be the following main steps.\n\nGeneral a movie will take three years, the first year of the first year of development, the second year is the early production and film production, the third year is the post-production and movie release.\n\nMovie release (English: Film Distribution) means that the audience can see the process of movie. It is generally performed by a dedicated film distribution company (English: Film Distributor), they will determine the marketing strategy of the movie, the film will be exhibited or available for viewing, and the decision movie is released (English: film release) time. In addition to the viewing of the movie theater, the film is placed on the consegran, or it is a TV program through the broadcast.\n\nOther ways of distribution include personal purchase or a VHS, DVD, or Blu-ray disc of a mobile phone, is downloaded on the Internet. "}