{"chinese_title": "chemical element ", "chinese": "Chemical elements refer to more than 100 basic metals and non-metallic pure substances in nature; the same chemical element is composed of the same atom, that is, the atomic nucleus in its atoms have the same number of protons, and use a general chemical method to not make it Decompose, and can form all substances. Examples of some common elements have hydrogen, carbon, nitrogen, oxygen,, iron, aluminum, calcium and sodium.\n\nElements (i.e., the elements of lead after lead) are not stable, and the radioactive decay is carried out. In addition, elements (i.e., 锝 锝 鉕) (i.e., 锝 锝 鉕) will not be stable, and the decay is performed. However, even if the number of atomic numbers is greater than 82, there is no element of the atomic core, some may still exist in nature, such as ruthenium,, uranium, and 钸, natural radionuclide [1], in addition, the remaining atoms is less than 99 (鑀) The radioactive element has a small or very small amount of presence in nature. All chemicals are composed of elements, i.e. any substance contains an element. With the artificial nuclear reaction, more new elements will be found.\n\nIn 1923, the International Atomic Committee made decisions: chemical elements are a method of classifying nuclear electricity in accordance with how much the atomic charge is classified, and one type of atom having the same number of nuclear power is called an element. [2]\n\nIn 2018, a total of 118 elements were found, including 98 of the earth (No. 1 Hydrogen to 98), and the rest were artificial synthetic elements.\n\nThe lightest two elements in the chemical element are hydrogen and helium, respectively, and the first 20 minutes formed by the universe [3], the first mass ratio is 3: 1 (the ratio of the atomic number is 12: 1) [4] [5], which also produced very small amounts of lithium and. Almost other natural existence elements are produced by natural nuclear nucleation [6]. A small amount of new elements on the earth is produced by the nucleus (English: Nucleogenic) reaction, or the cosmogenic reaction (eg, cosmic ray dissection). The new elements on the earth may also be radioactive decay products, and the decay process is some radioactive processes, such as α decay, β decay, spontaneous fissure, cluster decline (English: Cluster decay), and some less level of decay.\n\nIn the 94 chemical elements present in the nature, the elements of the initiaters 1 to 82 have almost at least one stabilized isotope (钷 exceptions of the atomic sequence 43 and the 钷 序 61). For a certain isotope, it is considered a stable isotope if it is not observed. The element after the atomic sequence 83 is a radioactive element, and all of its isotope has radioactivity and a nuclear decay reaction. Some elements, such as the bismuth of the atomic sequence 83, the and the amylide of the atomic sequence 90, and the uranium of the atomic sequence 92 have an isotope having a long isotope. Therefore, its current isotope may be before the solar system formation, the star nucleation The heavy metal generated. The alpha-209 (English: BISMUTH-209) of the alpha decay exceeds 1.9 × 1019, it is currently more than 10 billion times the life of the universe. It is an elements that have naturally occurring, and the half-life isotope is almost considered to be a stable isotope. [7] [8]. Uranium elements (after uranium, elements of the atomic order greater than 92) have a short half-life of the nuclear decay, so it cannot be stable in nature, or it has been born from the solar system so that it has been exhausted by artificial synthesis. It is found that there is only a small number of uranium elements in the nature (such as 錼 and 钸, etc.).\n\nBy 2010, there is 118 known elements (\"known\" here \"is a part of the elements, from only the decay product, to the other elements Separates are included.) [9] [10]. In 118 elements, there are 94 in nature, and six of which are in nature is a very small amount of a very small amount: the 锝, the atomic number 61 of the atomic order, the atomic number 85, the atomic number 87, atom The 镎 of the order 93 and the 钚... In the universe detects the presence of these 94 elements, no exception in the spectra of stars and supernova, and the spectra of stars and supernovars can also detect radioactive elements of half-life. The first 94 elements are the detected raw nucleus (English: primordial nuClide) on the earth, which may be generated when the solar system is formed, or may be naturally uranium or splendid (or transmutation).\n\nThe remaining 24 elements have not present on the earth, nor in the cosmic spectrum, which are artificially generated, and these elements are radioactive elements that are short half-life. If these elements have existed during the formation, they have almost determined that they have fallen into other elements. In 1937, it was prepared in manual way in 1937, and it was considered to be the first artificial synthesis, and the nature did not exist. However, it was later discovered that there was a very small amount of 锝 锝 (and may have discovered in 1925) [ 11]. Some of the other radioactive, but the very small existence of a very small existence of the nature is found to be similar to that of the artificial manual manner, and then discovered that there is also in nature [12].\n\nThe atomic order is the number of protons in an atomic nuclear, and the nature of the elements is also determined [13]. Atoms with the same atomic order belong to the same chemical element. The symbol of the atomic order is Z. For example, all carbon atoms have six protons, so the atomic number of carbon is 6 [14]. Carbon atoms may have a different number of neutrons, these are carbon isotope [15].\n\nThe number of protons in the atomic nucleus determines the charge of the nucleus, so it also determines the number of electrons when the atom is neutral neutral. The electron will be filled in the atomic orbit domain to determine the various chemical properties of the atom. The number of neutrons has little effect on the chemical properties of atoms (hydrogen and deuterium exception). For example, all carbon atoms have six protons and six electrons, even if there may be six or eight, their chemical properties are almost the same. Therefore, in chemistry, the characteristics of the album are identified by the atomic sequence, rather than using its mass.\n\nThe general atomic number will be written in the lower left of the element symbol, for example\n\nBut because the atomic number of an element is determined, this value is rarely written.\n\nThe mass number refers to the number of proton number and neutron quantity, and the value of the mass number is integer. Such as oxygen-16 neutral atoms, the number of neutrons and neutrons are 8, so their mass is 16. Sometimes the mass number and atomic number (Z, proton number) are indicated in the upper left corner of the element and the lower left corner, such as\n\n\n\n\n\nO\n\n\n\n8\n16\n\n\n\n\n{\\ DisplayStyle {\\ CE {^ 16_8o}}}\n\nThat is, an oxygen atom [16] having a mass number is 16 and the atomic number 8 [16].\n\nIsotope refers to different types of certain specific chemical elements. All isotopes under the same element have the same proton number, but the number of neutrons is different. These isotope occupy the same position in the cycle of chemical elements, so named. For example, 氕, and belong to the isotope of the hydrogen element, and there are 1 proton in their atomic core, but the neutron number is 0, 1 and 2, so they are interpretable. Among them, is almost twice as much as weigh, and the dental is almost twice. In addition, a radioactive isotope is referred to as radioisotope.\n\nThe mass number is in the atomic, the number of protons and the number of neutrons, and the atomic amount of a single atom is the real number of the atomic mass, and its unit is atomic quality unit (AMU or referred to as u). In general, atomic quantities and mass numbers will have some differences, which will not be exactly the same, because the quality of each neutron and each proton is not exactly 1U, and atomic volume is also affected by electronics and nuclear joining energy. For example, if the atomic amount of chlorine-35 is accurate to five decimals, it will be 34.969U, while the atomic amount of chlorine-37 is accurate to five decimals, it will be 36.966. However, the atomic quantity is in units of u, and the error of the mass number will be within 1%. The only atom quantity is an integer, and the element with the same quality is carbon 12, since the definition according to the atomic mass unit is 1/12 of the carbon 12 atom in the base state, so the atomic amount of carbon 12 is 12U.\n\nThe relative atomic quantity (English: relative atomic mass) is also known as atomic quantity, is found in a particular environment, with average amount of atomic quantity after abundance, and then divides the value obtained by atomic quality unit (U). The value may be a score, such as the relative atomic amount of chlorine, less than the integer, because this value is 76% chlorine 35 and 24% chlorine 37 average results.\n\nChemists and nuclear physicists have different definitions for \"pure elements\". In chemistry, pure elements are the same atoms in the substance (or almost all) atoms, or the same number of protons. However, in the nuclear physics, pure elements refer to only one stable isotope [17]\n\nFor example, if 99.99% ingredients in the copper cable have 29 protons of copper atoms, it is a chemically, which is 99.99% purity copper. However, general copper includes two isotope, 69%\n\n\n\n\n\nCU\n\n\n\n\n63\n\n\n\n\n{\\ DisplayStyle {\\ CE {^ 63cu}}}\n\n31%\n\n\n\n\n\nCU\n\n\n\n\n65\n\n\n\n\n{\\ DisplayStyle {\\ CE {^ 65cu}}}\n\nThe number of neutrons are different. Relative, gold blocks are chemically or pure elements in nuclear physics, because the general gold is only one isotope\n\n\n\n\n\nAu\n\n\n\n\n197\n\n\n\n\n{\\ DisplayStyle {\\ CE {^ 197au}}}\n\ncomposition.\n\nChemical pure elements, the combination of atoms may not be only one, so the pure elements will also have a variety of chemical structures (English: chemical structure), which is that atoms have different arrangements in space, these are called the same Vesence is also changed. For example, in a toner body of carbon, the diamond is carbon that is interconnected with each other in each of the carbon atoms, while graphite is a hexagonal layer structure consisting of carbon atoms, and graphene has only a single layer of graphite. However, but the strength is very high, the geometry of fullerene is near the sphere, and the carbon nanotubes are a thin tube consisting of hexagonal structures, but its electrical characteristics are different from other homologous bodies.\n\nGeneral conditions of the element (also known as reference state) refer to a state in which the element is the highest in the pressure of the pressure, the specified temperature (generally 298.15k). In thermal chemistry, the standard molar generate is zero in general conditions under normal conditions. For example, the general conditions of carbon are graphite because the structure of graphite is stable than other homologous bodies.\n\nThere are many kinds of descriptive classifications that can be applied to elements, including consideration of their common physical and chemical properties, in common conditions, melting points, and boiling point, density, crystal structure, and their origin thereof, etc..\n\nSome words are often used to describe the general physical properties and chemical properties of the elements. The first classification method is to divide the element into a metal that can conduct electrically, non-conductive non-metallic, and some of the metals between metal and non-metals, and the properties are between metal and non-metals, and there will be semiconductors Features.\n\nThere is a finer element classification in the cycle table. In addition to metal and non-metallic margin classifications, there will be color indicates some relatively fine classification, such as alkali metal, alkaline earth metal, halogen, lanthanide, 锕 element, transition Metal, poor metal, metal, bisteon non-metallic, poly atomic non-metallic and rare gas. In the above system, alkali metal, alkaline earth metal, transition metal, lanthanide, and tangene elements belong to metal, and bia atom non-metallic, polymer non-metallic and rare gas belong to non-metallic. Some cycle tables will not be specifically divided into a class, which will be paid as a metal, and others are divided into non-metallic.\n\nAnother common classification is to distinguish between specific temperatures and pressure (standard conditions), the material state of the element itself is solid, liquid or gaseous to distinguish. Most of the elements are solid in the standard situation, and some are gaseous. At 0 ° C and normal atmospheric pressure, it will be bromine and mercury under 0 ° C and mercury, and the cesium and gallium are solid in the above conditions, but it will melt to liquid at 28.4 ° C and 29.8 ° C.\n\nThe melting point and boiling point under a atmospheric pressure (generally expressed in the Celsius temperature) are also commonly used as classifications of elements. The melting point and boiling point of most elements have been known, but some radioactive elements can only be prepared, and their half-life is short, so it may not be able to measure the melting point or boiling point. Because the absolute zero of helium is also a liquid state at an atmospheric pressure, it is only a boiling point according to the conventional representation, and there is no melting point.\n\nThe density of the element is often used as a basis for elemental classification at a specific temperature and pressure (standard condition). Density will be its unit in G / cm3. Because some elements are gaseous under standard conditions, the density of these elements will be expressed in their gaseous density.\n\nIf the elements have different densities, there is generally a common hi-shaped body and its density, and another method is to list the most common hi-shaped body and indicate its density. For example, in a toner of carbon, the most common is amorphous carbon, graphite and diamonds, and its density is 1.8-2.1, 2.267 and 3.515 g / cm3, respectively.\n\nSo far, the solid-state elements have been found to be divided into eight types: cube crystal system, intimate cube, facial cube crystal system, six-square crystal system, single overcrystalline system, orthogonal line, diamond type And Quadritical Crystals. Some artificial synthetic elements cannot be judged by too little atoms that can be analyzed.\n\nThe radioactivity refers to the radioisotope of an element from a non-stable atomic nucleus to form another isotope (decay product), which is referred to as radioactivity. The energy released during the decay is called decay energy. Each element has many radioisotopes. If all of the isotopes of a element have radioactivity, we call this element as a radioactive element. Elements with 83 (bismuth) or more are of radioactive elements, but elements (such as 锝 and 鉕) of some atoms are less than 83 are also a radioactive element [18]. The shorter the half-life, the more unstable radioisotope, the stronger radioactivity.\n\n\n\n\nGraphic: .mw-parser-output .div-col {margin-top: 0.3em; Column-width: 30em; Column-count: 2} .mw-parser-output .div-col-small {font-size: 90 %}. MW-PARSER-OUTPUT .div-col-rules {colorn-rule: 1px solid #aaa} .mw-parser-output .div-col DL, .MW-PARSER-OUTPUT .DIV-COL OL, .MW-PARSER-OUTPUT .DIV-COL UL {margin-top: 0} .mw-parser-output .div-col Li, .mw -Parser-output .div-col DD {page-break-inside: Avoid; Break-inside: Avoid-Column}\nUnder the standard condition, the serial number green is a gas; the sequence bluemer is a liquid; the number black person is solid; the sequence gray is an unknown phase.\n\nThe nature of the chemical element will often be sorted with an element cycle, which will place an element with an increase in the number of atoms, in different element cycles, and the chemical elements of the same group will have a relatively approximate physical and chemical properties. The currently used standard elements include 118 confirmed elements found before April 10, 2010.\n\nThere are also some scientists to express the relationship between elements in a similar periodic table, but the elemental cycle table is generally the contribution of the Russian chemist Dmitry Ivanovich, Makitrev in 1869. The Jerffee imports periodic table to describe the repeated characteristics of the elements. Over time, the layout of the elemental period is also adjusted to add newly discovered elements, and the new theoretical model has also been developed to explain its chemical properties.\n\nThe periodic table is often seen in many of the fields in chemistry, and is a very good framework for classification, systematic and comparison of many different forms of chemical properties. The cycle table is also commonly used in physics, geology, biology, materials science, engineering, agriculture, medical, nutrition, environmental hygiene (English: Environmental Health) and astronomical. The principles in the cycle table are also very important in chemical engineering.\n\nThe decision of the element name is constantly changing, and the understanding of various languages, culture, and chemical knowledge is mixed [19]. The name of the chemical element has different sources with historical evolution. There is a name from ancient times. There is a name of the chain dialector's era. It uses myth. It uses color. If you have a geographical name, there is element The nature is named, and there are also named named [20]. In modern slow acceptors have the right to name, but the international pure and application chemical federation (IUPAC), for element naming and symbols have final decision [20]: 72.\n\nFrom 1947, IUPAC's responsibility is taken from the Name of Huaai, and determines the international universal single symbol for each element. There are many names in the previous elements, such as the name of the elements 41 in Europe and the Americas. There is a dispute 150 years, until 1949IUPAC determines the names used in Europe [19]. As of 2015 (2015-Missing Required Parameter 1 = Month!) [Update], IUPAC govern global chemistry knowledge, became the final ruling court of new chemical elements and nitations, founded internationally recognized standard terms, this is in the 19th century Nothing is not. In terms of language participation, due to the political factors of history and world war, German has been boycotted by several international science organizations including IUPAC, and then in 1929 Iupac, German and Landan were awarded the status of IUPAC. [ twenty one].\n\nAccording to the National Science and Technology Nouns Trial Committee, the international name of the English name is determined by IUPAC discussions [22], the chemical nouns' submission committee expanded the inorganic names in 1998, according to IUPAC renames the element name of 101 to 109, and the corresponding Chinese naming [23] is verified.\nAfter IUPAC renaming the elements of 101-11, the two-strait chemical experts have reached an agreement on Chinese name, as of 2014 (2014-Missing Required Parameter 1 = Month!) [Update] No. 100, the two sides of the strait is complete Consistent [24].\n\nIn ancient times, there are 9 elements, 7 metal gold, silver, mercury, copper, iron, tin, lead, and 2 non-metallic carbon and sulfur [20]: 72. Among them, mercury is the latest discovery in ancient times, and the Bible has provided a lot of information about other eight elements, but did not mention mercury [20]: 72.\n\nThe naming of the chain dialective era is known as the well-known significance: such as arsenic, Arsenic, from Greek: Arsenkikos, takes his male, the meaning of the masculin; the bismuth Bismuth is derived from German: Weisse Masse, take it white Substance, white metal meaning [20]: 72.\n\nElements with star names are named: 名 Helium stem from the \"Sun\" Greek: Helios, Selen Selenium Slenes from \"Moon\" Greek: Selene, Tellurium from \"Land\": Tellus, TELLUS,名 er er 希 希 希 希 希 希 希 希 星 星 语 星 语 语 语 语 语 语 语 语 星 行 行 行 行 行 行 行 行 行 行 行 行 [[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[和 和 和 和 [[[( 25] Wait.\n\nNamed the element of the myth of Greece and Nordic, is named: uranium Uranium takes from Greek myths, the world ruler Uronos, vanadium name Vanadium is taken from the northern European mythology Watadis, name Neptunium is taken from Roman myths Sea Nitton, etc. [20]: 74.\n\nSince the nature or chemical reaction of some elements, some elements are named from color name: chrome name chromium stem from Greek: chroma fingers, name Rubidium originated from Latin: Rubidus refers to the darkest red, zirconium Name Zirconium originated from Persian: Zargun finger with gold, etc. [20]: 74.\n\nThe elements of the name are named: Name Scandium stem from Scandium, whichew Europium originated in Europe, name Holmium originated from Stockholm, Ruthenium originated from Russia (referring to Russia), name Americium From the Americas, the name Californium is from California, etc. [20]: 75.\n\nThe number of people named is less naming, maybe and Swedish chemist Bercelis oppose the firm stand of the use of people, when the elements are found to be named Wolfram or tungsten, famous German mineralologists Abraham Gottlob Vilner proposal is named Schelium in the study of Shelium in tungsten oxide, and Bercelis rejects this proposal with two reasons Tang: \"This name is not appropriate from Swedish point of view, and Our immortal achievements do not need to support this. \"[20]: 76.\n\nWhen the ultrahranium element is artificial, it is common to name the character to the element. [20]: 76\n\nFrom ancient times, there is a nameful metal element and the celestial body, such as gold and sun, silver and moon, iron and Mars, etc. [20]: The rapid development of chemical knowledge of century century makes symbols more Forced to have a lot of proposals is an extra geometry of an old case. Swedish chemist Berzilu developed a simple proposal in 1813: the first letter of the element name as a symbol, this element name may be old Latin, Greek, or modern name, if there are multiple elements Use the same letters, then take the first and second (or take the first and third) letters, the first letter needs uppercase and the second letter requires lowercase [26] [ 20]: 78.\n\nThe new symbol system mentioned by Becelis is soon being adopted in Europe and the Americas. Most of the new elements are defined according to the principles of this case. Only niobium's naming is more than the controversy in Americas and Europe after discovery. Today The resolution of IUPAC at 1949 and 1960 has used Niobium and symbol NB [20]: 78-9.\n\nThe satisfactory results of the element symbol are, regardless of the national language, the world's general set of chemical elements symbol language. [20]: 79. And European and American language systems such as Russia, China, Japan, etc., is also used in the elements symbols written by Latin letters [20]: 79.\n\nIUPACs for European members of IUPAC have disputed at the American Chemicals, such as American Chemicals, at the nomenclature, 106, in the nomenclature [27].\n\nAfter 1918, the English name of the international elements was discussed by the International Pure and Application Chemical Federation (IUPAC). Before the 103 elements, the element name did not have a controversy. But after the 104th, the West and the Soviet Union have happened many times. In 1977 IUPAC announced the number of element names after the 100th, the method of naming the name, country name, place name and institution name, and the use of Latin and Greek mixed digital words head plus the word tail - IUM, the symbol adopts three Letters are indicated, such as elements 104 named Unnilquadium, symbol UNQ. But this naming method still has controversy. By 1994, Iupac puts forward the original naming way and officially passed on August 27, 1997, and re-named 101-109 elements. [28]\n\nThe ancient China has a special name for some elements, such as iron, gold, etc. has been named. In the 1850s, Western chemistry was introduced to China, and the Chinese began naming other elements. At the end of the Qing Dynasty, China had at least two elements naming methods, respectively, with Wen Wen and Xu Shou. [29].\n\nAfter the Revolution of 1911, China began to unify and reform the element name, such as the No. 21 elements, is changed to 钪 [30]. After 1949, the naming of the elements in the three sides of the strait, such as elements, elements, mainland China and Hong Kong were named [31], Taiwan named 鋂 [32].\n\nAfter IUPAC renaming 101-11 elements, the two-strait chemistry experts have agreed to the Chinese name, as of 2014 (2014-Missing Required Parameter 1 = Month!) [Update] No. 100 after the two-strait chemical element name is completely consistent of.\n[twenty four]\n\nThe \"Chemical Naming Principles\" in 1955 in China included 102 element names. After 1980, 105 element names were included. In 1998, China and Taiwan jointly identified the names of elements of 101-109. [28] [33]\n\nThe following table lists the elements of the 118 discovered, and the element name can be connected to the corresponding chemical element entry, and there is still the following items in the table.\n\nThe amount of horses is the Earth, the number of elements contained, and if the quality is sorted by the quality element, the top eight are oxygen (46.6%), (27.7%), aluminum (8.1%), iron (5.0%), calcium (3.6%), sodium (2.8%), potassium (2.6%), magnesium (2.6%) [34].\n\nIf considering the entire earth, the most abundant element, the top eight is iron (32.1%), oxygen (30.1%), (15.1%), magnesium (13.9%), sulfur (2.9), sulfur (2.9) %), Nickel (1.8%), calcium (1.5%) and aluminum (1.4%) [35].\n\nThe concept of chemical elements is basically a substance that cannot be further decomposed (strictly, it is a substance that cannot be further decomposed with chemical reactions), which is divided into three different stages in history: early definition (similar to ancient Greece) The definition of time), chemical definitions and atoms definitions.\n\nThe term \"element\" is first used by Greek philosophers Platon in 360 BC. In his quotation \"Timai\", some organic and inorganic substances are discussed, which is the earliest chemistry work. Plato assumes some subtle substances with some special geometric structures: the four sides (fire), Zhengzhixi (wind), Zheng 20 somatic (water), positive six somewhere (ground) and the front duodo ( universe). [36]\n\nIn addition, Greek philosopher Enpe Dobre used the word \"root\" (Greek: ῥῥὤμα τα) in his writing \"On Nature\". Aristotle conceived five elements in \"On the Day (English: On the Heavens\", Aristotle said that in the four elements of Plato, plus Ether (Quality), Aristotle's \"Elements\" The formal definition is seen in \"Metaphysics (English: Metaphysics (Aristotle)\" [37]:\n\nBased on the above theory, in 790 AD, Ja Bill, Arabian Chemier, assumes that metal is composed of two elements: sulfur, as \"rock\", is used to explain its flammable, mercury, to explain the ideal metal properties . [38] At the Middle Age, Swiss doctor and chain gold Warri Palasessus proposed three-element theory: sulfur enabled material flammability, mercury makes the substance volatility and stability, while the substance has solids .\n\nIn 1661, Irish natural philosophers Robert Yubi, found that more than four classical elements were considered more than those in the past. In 1789, the first modern chemical element list, which contain 33 elements, and have an elemental basis. In 1818, the elements have been found to increase to more than forty kinds. In the elementary period published in 1869, Men Jierev has 66 elements.\n\nUntil the 20th century, the element is defined as a substance that cannot be decomposed into a simpler. In other words, a chemical element cannot be converted into other chemical elements. In 1913, Henry Mosham found that nuclear charge in atoms was atomic in the atomic, and is the basic definition of current atoms. In 1919, there were 72 known elements. In 1955, in order to commemorate the Gate Jevrev, then the element of the 101 discovery is named. Nowadays, 118 elements are found, see the elements periodic table.\n\nThere are ten kinds of substances, and humans are familiar with the prehistoric era. Later, it is an element: carbon, copper, gold, iron, lead, mercury, silver, sulfur, tin and zinc. In the Western Yuan 1500, the substances of other elements were found, respectively, arsenic, antimony and bismuth. Sulfur, cobalt and platinum were found before 1750.\n\nMost of the elements in nature have found in 1900, including:\n\nThe elements found after 1900 were:\n\nThe first ultrahranium element (element of the initial order greater than 92) is found in 1940. By January 2016, the International Purification and Application Chemical Association had recognized the discovery of 118 elements. The discovery of 112 elements is in 2009, It is recommended to name the Copernicium, element symbol CN [39], name and symbols are recognized by IUPAC on February 19, 2010 [40]. The most synthetic maximum element should be 118 elements OG, prepared in the nuclear reactors of the Joint Atomic Kernel Research Institute in the Russian Dubina Dubina, October 9, 2006 [10]. The 117 element TS is the elements found later, found in 2009 [41]. IUPAC has officially recognized two elements in June 2011, and the atomic sequences are 114 and 116, respectively, and the name is recognized in May 2012 [42]. IUPAC recognized elements 113, 115, 117 and 118 [43] on June 8, 2015, announced that the names of the estimated use are Nihonium (113, NH), Moscovium. (115, MC), Tennessine (117, TS) and Oganesson (118, OG), the name was officially recognized on November 28, 2016. [44]\n[45].\n\nOn January 15, 2017, the National Science and Technology Nouns Trial Committee jointly organized chemistry, physics, and linguistic experts from 113, 115, 117, 118 elements in elements. On May 9th, the Chinese Academy of Sciences, the National Language and Word Working Committee, the National Science and Technology Nouns Appointment Committee held a launch conference in Beijing, issued 113, 115, 117, 118, 118 element Chinese name, 鿭, 镆, 鿬, 鿫. [46] [47] "}