{"chinese_title": "psychology ", "chinese": "Abnormal psychology\nBehavioral genetics\nBiological psychology\nPsychological pharmacy\nCognitive psychology\nComparative psychology\nCross-cultural psychology\nCultural psychology\nDifferential psychology (English: Differential Psychology)\nDevelopment psychology\nEvolutionary psychology\nExperimental psychology\nMathematical psychology\nNeuropsology\nPersonality\nPositive psychology\nQuantitative psychology (English: Quantitative Psychology)\nSocial psychology\n\nApplication behavior analysis\nPsychological language\nClinical psychology\nCommunity psychology\nconsuming behavior\nConsultative psychology\nCriticism community psychology\nEducational psychology\nEnvironmental psychology\nBecause of engineering\nCourt psychology\nHealthy psychology\nHumanism psychology\nIndustrial and tissue psychology\nOntology Explanation (English: Ontological Hermeneutics)\nLegal psychology\nEconomic psychology\nMedical Psychology (English: MediCal Psychology)\nMilitary Psychology (English: Military Psychology)\nMusic Psychology (English: Music Psychology)\nOccupational Health Psychology (English: Occupational Health Psychology)\nPolitical psychology\nReligious psychology\nSchool Psychology (English: School Psychology)\nSports psychology\nTraffic psychology\n\nPsychologist list\nPsychological organization list (English: List of psychology organization)\nPsychologist list\nPsychotherapy list (English: List of psychotherapies)\nPsychology Important Works (English: List of Important Publications In Psychology)\nPsychological research method list\nList of psychologies\nPsychological schedule\nPsychological article index (English: index of psychology articles)\n\nPsychology (English: psychology) is a science of psychological phenomena, consciousness and behavior of humans and animals [1]. It is both a theoretical discipline, also an application discipline, including two major areas of theoretical psychology and application psychology [2].\n\nPsychology research involves awareness, feeling, perception, cognition, emotion, personality, behavioral and interpersonal relationships, affecting the development of other disciplines, such as education, management, communication, sociology, economics, mental school, Statistics, and literature, etc. On the one hand, attempts to use brain operation to explain the basic behavioral and psychological function of individuals. At the same time, psychology also tries to explain the role of individual mental function in social behavior and social power. Psychologists are engaged in basic research to describe, interpret, predict, and control behavior. Applying psychologists also have the fifth objects - improving the quality of human life. These goals constitute the foundation of psychology.\n\nIn order to study the behavior of human beings, early psychologists will speculate on the environment, physiology (such as: brain damage, causing dopamine, etc.) and some particular factors.\nBut this experimental method has always been discussed and controversial. However, with the advancement of science and technology, people use nuclear magnetic resonance, tomography, and develop more mature questionnaires to study human psychology. Sometimes patients with partial injuries, psychologists also understand why the function of each part of the head is observed by observing the brain activities of these people. [3]\n\nThe word \"psychology\" (psychology) in the Sen language is composed of Greek Stem, \"Soul\" (ψυή) and \"Research\" (όγος), earliest by Croatia's poet Mark Maroliqi.\n\n\"Psychology\" translated name, through the relevant research and psychology of history, there is a direct relationship with Chinese Ming Dynastics, Song Agency, and Song Ming Confucian Tudo, Tudo [4].\n\nIn 1890, William James defined psychology as \"science, including psychological phenomena and psychological state\". This definition has been widely circulated for decades. However, this meaning has been questioned by some of the radical lines, especially John .b. Watson and other efforts. Watson defines psychology as information useful for control behavior in the 1913 declaration. Similarly, since James defined it, this word stronger implies the technology of scientific experiments. [5]\n\nEarly psychological research is a scope of philosophy, called philosophical psychology. The study of philosophical psychology can be traced back to ancient civilizations such as Egypt, Greece, India and Huaxia. The ancient China believes that people's sexual ideas are borne by certain organs, and their events will reflect in the organs, such as \"the officials of the heart\" (\"Mencius\"), \"people are in the brain\", \"Head of God\" The residence of \"Spring and Autumn Fortune\"). \"God-shaped\", \"shaped\" and other ideas have many elaborates in the \"Yellow Emperor's Internal Classics\". There are many examples involving medical psychology. Plato's philosophy of binary coexistence, some people think that Aristotle's \"The Soul\" is the work of the earliest discovery of psychology. Through long-lasting evolution, slowly produce a wide variety of disciplines, including the psychology of people's understanding.\n\nPhilosophical psychology is mainly four major issues that explore mental relationships, natural and educational, free will and decisions, and sources of knowledge. Its early theory has a dollar, binaryism, environmental decisions, spiritual decisions, etc. Modern philosophical psychology is three major ideological geography, including rationalism, empirical and romanticism. As the German psychologist Abinhaos said: \"Psychology has a long past, but only has a short history.\"\nIn the medieval Islamics and psychology, clinical psychotherapy has begun [6] and experimental research [7] [8].\n\nAlthough psychology experiments can be traced back \"Optics\" (1021) (1021) [7] [9] [7] [9] However, psychology is started in 1874, and the physiology of Germany was initiated in 1874. Scholar William Fengter issued two psychological textbooks - \"Principles of Physiolog Psychology -, boldly declares in the preamble:\" To establish a new scientific field \"; Fengter also Therefore, it is called \"parent of psychology.\" [10] In 1875, Leipzi University hired Vonte for professor; in 1879, he established the world's first special psychological laboratory at Leipzig University, attracting students from all over the world. After more than 10 years, it is in the 1890s, and the university winds of the United States will explore this move, establish a dozens of psychology laboratories, especially in 1892, 20, this year is also the establishment of the American Psychology. It is usually the time for the birth of scientific psychology in 1874. This time is late for many natural sciences from philosophy to form an independent discipline. Fengter is also the first person to call himself as a psychologist. Other early and important psychologists include Ai Binhaos. At the end of the 19th century, the psychoanalysis of Sigmund Freud was built in the beginning of the 20th century.\n\nGerman psychologist William Vind is considered to be a person who introduces experiments into psychology research, known as \"the father of experimental psychology.\" [11] In 1879, he established the first psychology laboratory at Leipzig University. [11] Fengter focused on the elemental decomposition of the psychological decomposition, because the latter made a breakthrough in analytical substance elements at the time. Although Fengter himself is not a constructist, his student Edward B · Tienna became the thinker of constructor, opposite the functionalist. Tienna is an important person of American early psychologists.\n\nFunctionism is born relative to structuralism, and is affected by American philosophers, scientists, psychologists William James. James believes that psychology should have practical value, and psychologists should find a scientific way beneficial to people. His works \"Psychology principle (English: Principles of psychology\" [12] published in 1890, there are many paving problems, providing a direction for subsequent scientists. Other main functionists include John Dewey and Harvey Carl (English: Harvey Carr).\n\n\nOther 19th century outstanding characters have German psychologists Herman Abinhaus, he is a pioneer of studying memory experiments, founding a quantitative model of learning and forgotten in Berlin Humbolda University. [13] Soviet psychologist Ivan Petrovich Bavov, who found \"classical constraint\" when experimenting with dogs and applied its application with humans. [14]\nSince the 1950s, Fengter, James, Ai Binhaus developed more experimental technical directions to the experimental technical direction of experimental psychologists more trend to study cognition - paying attention information and information processing - the ultimate evolution is cognitive Part of the science. [15] At earlier, this is considered \"revolutionary\" development [15]\n\nAustrian doctor Sigmund Freud began researching spiritual analysis since the 1990s until he died in 1939. Psychoanalysis is a method of research awareness, explaining experience; it is a theoretical system for human behavior; it is a method for psychological, emotional treatment, especially for psychotherapy for subconscious conflicts. [16] Many theories in the mental analysis of Freud Based on interpretation, internal provincial law and clinical observation. The mental analysis is widely circulated, because its research object involves the subconsciousness of gender, depression, and psychological development. These issues were listed as a social taboo at the time, and Freud provided catalyst, making problems can be discussed in formal socialization. Clinically, Freud is the pioneer of freelance associations, and he is also studying in the treatment of dreams. [17] [18]\n\nFreud's influence on the Swiss psychiatric physician Carl Jerge, the latter analysis psychology and depth psychology complementary. In the 20th century, leaf psychologists studied mental analysis, psychology, mental illness treatment, and philosophy. These famous scholars include Aik Ericson, Merlanti Klein, Donald Venec, Carren, Erich From, John Bobby, and Flow Eider's daughter Anna Freud. In the past 20 century, mental analysis derived different branch schools, many of them were divided into new Freud school. [19]\n\nPsychoanalysis and its treatment are criticized by many people, such as Hans Eisenke, and philosophers Carl Popper. Popper is a scientist philosopher who believes that mental analysis is wrong as science, [20], and Eiseni claims that the principle of mental analysis does not match the experimental data. By the end of the twentieth century, the Psychology College of American Colleges and Universities became more inclined to emphasized, and the theory of Freud was marginalized and claimed to \"dry the old death\" history. [21] At the same time, the researchers maintain Freud's scientific position in the field of neuroplast analysis, [22] and other human literary scientificers are solid Freud, but they are not scientists, but a ... Interpretator. \"[21]\n\nIn the past 20th century, the behavioral school dominated the psychology at the time, and its advocacy is: \"Seeking to understand how specific environmental stimulation controls specific types of behavior [23]. It advocates that psychology should analyze the environmental conditions of the first line, that is, before behavior, and for a body to generate a reaction or inhibit the reaction to provide activity places. Therefore, they should refer to behavior as a body understanding, predicting, and control, and thus make corresponding results. Based on strict control and emphasis on experimental and variables, behavioralism has an important impact on later psychology research. Its representative figures are Shi Jinner, but its inherent cognitive process is to save, in the near future, the popular cognitive approach is to pay attention to the internal cognitive process of the previous neglected, representing the characters, there is a Piajie, Miller, Simon, etc.\n\nToday, the world's main psychological schools have five views, each of which emphasizes the different aspects of behavior and psychological process. It mainly includes neuropsychology, mental analysis, behavioral psychology, humanistic psychology, cognitive psychology [24]. [25]\n\nIn the 1950s, under the influence of behavioralism and mental analysis, humanistic psychology was born. [27] Applying phenomenology, interactive subjectivity, first person's perspective, humanism attempt to capture the whole person - rather than personality or cognition. [28] humanistic psychology focuses on the basis of human unique issues, such as personal freedom, growth, self-realization, identity, death, loneliness, freedom and significance (English: meaning (interiStential). The human process is characterized in that it is focused on subjective expensive, refuses fate, and focusing on the enthusiasm of growth rather than pathological factors. Some people's founders, such as American psychologists Abraham Maslow, founded the theory of the needs of the needs; Carl Roshez created a personal center treatment. After that, positive psychology analyzes humanism and further scientific analysis.\n\nWolfgang Crust, Marcos Weto, and Côte d'Ivo Kufka jointly founded a complete psychological school. This psychological study is established in the individual experience as a whole. The molecular structure of the corresponding substance is produced in the early 19th century in Germany, Austria. Decomposed psychology did not decompose thinking, behavior into a small element, but insisted on the importance of experience as a whole, and considered that the overall difference was different from partially added.\nDelicate Psychology should be confused with Fritz Pols (English: Gestalt Therapy), the latter only associated with the completed psychology on the appearance.\n\nIn the 1950s and 1960s, the American original analystist Roculo Mei was in the influence of German philosopher Martin Heideg, Danish philosopher Soren Obe Kerka, Learn the path of learning. This includes psychotherapy.\n\nThere is different from other people's school, namely human neutral perspectives, and anxiety positive perspectives. [29] The presence of a presence is focused on the humanistic theme, such as death, free will, meaning, and believes that the meaning can be changed, or a change in way. [30] For the authenticity of death and future, people usually encourage people to accept freedom, despite anxiety.\n\nAustria's existential psychiatrist, the massacre survivor Victor Frank learned from concentration camp, [31] summarizes the presence of different versions, this method focuses on existenceism, different from Adler's Nietzscheism The power will or the cheerful principle of Freud. [32]\n\nSwiss Psycho Analysis Lutidi Bins Wange, American Psychologist George Alexander Kelly and Mi (May), Frankl, is also considered to be a scholar. [33]\n\nCognitive psychology research psychological activities, including solving problems , Perception, memory, learning, etc. As part of cognitive science, this psychological branch is closely related to other disciplines, including neuroscience, philosophy, linguistics.\n\nNomi Jumsky triggered a psychological \"Cognitive Revolution\" when the \"stimulation\", \"corresponding\" and \"strengthen\" in criticism behavior concept. Jumsky's debate is applied to complex human behavior in a superficial manner, especially in the field of language acquisition. There is a hypothesis that human nun has a \"inner\" language acquisition function, but for behavioralism, this problem is all behaviors, including language, must be obtained by learning and strengthening. Social learning theorists, such as Alport Ban Dula, the child's living environment helps behavior improvement.\n\nAt the same time, technological progress helps people regain psychological activities and expressions, such as cognition, etc. British Neuroscience Charles Scott Sun Lington and Canadian Psychologist Donald Herb application experiments summarize the link between psychological phenomena and human brain structure and function. The rise of computer science and artificial intelligence makes human information processing to mutually comparison with mechanical information processing. Research on cognition is applied to World War II for understanding weapons operation. In the late twentieth century, cognitiveism became a unified fancy style of psychology, and cognitive psychology became popular branches.\n\nCognitive psychology believes that concealment of psychological activities should be studied in a scientific way, and psychologists have found two concepts: the threshold stimuli and the inheritance memory, the subconsciousness of the corresponding mental analysis or the accidental formation behavior of behavior. Behaviser elements and cognitive psychology are integrated into a foundation for cognitive behavioral therapies. This psychotherapy is created by American psychologists Albert Ellis and psychiatrist Aaron T · Baker. Cognitive Psychology and Other Disciplines, such as mental philosophy, computer science, neuroscience, and a cognitive science that is classified.\n\nBiological psychology or behavioral neuroscience from bio-angle research behavior and psychological process. There are different professional branches in biological psychology. For example, physiological psychology uses animal models, especially mice, to study nerve, gene, and cellular functions in learning, memory, fear. [34] Cognitive neuroscientists use neur imaging tools to study the relationship between nerve and human psychological activities, and neuropsyter use psychological assessment to conduct scientific research, such as the degree of cognitive deletion of cognition.\n\nThe research and application of clinical psychology includes understanding, prevention, relieving psychological pain and disorders, promoting mental health and personal growth. Although clinical psychologists also participate in research, teaching, consultation, court testification, procedures and management, but the center of the branch is psychological assessment and treatment. [35] Some clinical psychologists focus on clinical monitoring of patients with brain damage, and this area is known as clinical neuropsychology (English: Clinical Neuropsychology). In many countries, clinical psychology is subject to regular mental health.\n\nThe efforts of clinical psychologists have been affected by many treatment programs, all programs include professional relationships between professionals and patients (usually personal, couple, family, or small groups). Different therapeutic practices are associated with different theoretical perspectives, using different processes to establish a combination of treatment, explore psychological causes, encourage new methods to think, feel, and action. The four major theoretical views include psychotropic treatment (English: psychodynamic psychotherapy), cognitive behavioral treatment, presence - humanistic treatment and system / home treatment (English: family therapy). At present, there is a trend that some psychologists are working hard to integrate various treatment factions, especially in the absence of cultural, gender, spirit, and sexual orientation, this trend is more significant. [36] [37] Under rich research results, there is evidence that the effects of the major treatment factions tend to equally, and share the same infrastructure, and can form a strong psychotherapy combination. Because of this, more psychological training courses have adopted a discharging treatment trend (English: Integrative psychotherapy). [38] [39] [40] [41] [42]\n\nGreen red blue purple blue purple\n\nBlue purple green purple green\n\nThe Strip Effect indicates the color of the read text, and the first group is much simpler than the second group.\n\nCognitive Cognition of Psychological Studies. Perception, pay attention, reason, reason, thinking, solving, memory, learning, language, and emotions are in its research field. Classical cognitive psychology and cognitive schools have interrelated, depending on functionalism and experimental psychology, cognitiveism support psychological information processing model.\n\nAt the more wide-area level, cognitive science is a cross-discipline, including cognitive psychology, cognitive neuroscience, artificial intelligence, linguistics, human-machine interaction, calculation of neuroscience, and human logic and anthropology. Computers are often used to simulate such experimentation. Computer simulation provides tools for studying the functional organization of thinking, and the nervous system has provided a degree of scale.\n\nComparative psychology refers to the scientific research of non-human animals, especially those related to system development history, adaptation value, and behavioral development. Research on this area discusses many problems, using many different ways, explores the behavior of different species, from insect to primate. Comparative psychology and other disciplines studying animal behavior, such as animal behavior has a close relationship. [43] Comparative psychology research sometimes causes inspiration to human behavior research, but sometimes the association is very contradictory, such as the sociology proposed by Edward Wilson. [44] Animal models are often used to study the neural treatment related to human behavior, such as the use of animal models in cognitive neuroscience.\n\nDevelop psychology focuses on the development process of human will in life, trying to understand how people consciously, understand, and action in the world, and study how these phenomena changed as age. These research may focus on cognition, emotion, morality, social, and nerve development. Researchers use a range of special ways to explore children's cases to make observations in natural environments, or simply interact with them in their experiments. These experiments are often present in a game or an activity, both fun, and scientific significance; researchers even designed a very dexterous way to study the psychological activities of baby. In addition to studying children's psychology, developing psychologists also study the age of human life, especially in certain time periods (such as teens and elderly). Develop psychologists designed a complete set of psychology theories to support their research.\n\nEducational Psychology is to study the learning, efficiency, teaching psychology and schools in the process of education as a social psychology as an organization. Children's psychologists, such as Livi Vigoski, let the Piam, Jerome Brun, Bernard Luskins, etc. have an important impact on professors and teaching practice. . In many countries, educational psychology is a compulsory course for teachers.\n\nSchool Psychology (English: School Psychology) combines educational psychology and clinical psychology, trying to understand, students who have learned obstacles; cultivate high-quality students; promote adolescence (English: prodial behavior) behavior; or advocate safety, Mutual help, efficient education environment. School psychologists are in many fields, such as educational behavior assessments, interventions, prevention, consultation, etc. have been well received, and some are quite accommodation in the research field. [45]\n\nEvolutionary psychology from modern evolutionary perspectives to study psychological characteristics - such as memory, perception, language, etc. It tries to explore what human psychological features are adapted to evolution, that is, as a functional product for natural selection and sexual selection. The evolutionary psychologist believes that in the environment of human ancestors, the evolution of psychological adaptation solves the problem of periodicity. Through the evolution of psychological traits and their adaptability, evolutionary psychology provides the most approximate developmental interpretation in other psychology (that is, the evolutionary psychology is the ultimate problem, or \"why\", not approximate, or Ask \"how\").\n\nIndustrial and Organization Psychology (I-O) Applying Psychology Concepts and Methods Optimizing Workplace 's Human Potential. As the branch of I-O, the psychological principle and method of personnel psychology were screened and evaluated to employees. Another Branch of I-O Tissue Psychological Studies Working Environment and Management Style on the Effect of Positive Positiveness, Achievement and Productivity. [46]\n\nPersonality psychology focuses on personal continuity, ideas, emotions - these are called personality. Personality theory is different because of the different schools, and they have different assumptions on the role of latent sings and the importance of the experience. According to Freud, the personality is based on the interaction between this, self and super, this is the so-called spiritual analysis school. [47] In contrast, the characteristic theory tried to use discrete statistics to conduct research, and the species species proposed also have a lot. Early Hans Eisenk models make up the personality consisting of three basic characteristics: exquisite and introvert, neurotic, mental (English: psychoticism). Raymond Carter proposed 16 personality features (English: 16 Personality Factors). Today, the personality dimension model is increasingly valued, such as the DSM-V model (English: DSM-5). At present, it is currently a social cognitive school. In fact, it is initially called social learning theory. It is an extension from the behavior school: the shape of the personality is the behavior of people and people's interaction, and then the American psychologist Ban Dura The theory of the behavior school is more expanded, joining the intrinsic activity - cognitive ingredients, forming a social cognitive theory.\n\nSocial psychology research the views between humans and how they produce contacts, and social psychologists include the impact of others on individual behavior (for example: in public, persuading: persuasion), the establishment, attitude, Or bigger levels, not only the interaction between people, and some people interaction with a group, as the establishment and strengthening of the scribe impression will cause discrimination behavior after it is a classic example. Social Cognition (English: Social Cognition) links cognitive psychology to sociology elements, trying to understand how people handle, memories, and distort society. Population dynamics discloses the essence of leadership, exchanges and other microscopic levels (English: Microsociology) and its optimization. In recent years, many social psychologists have interested in the behavior of the inner hidden attitude, median model (English: mediation (statistics), individual and social value interaction. Therefore, research on human society can be found to lead to psychological disorders. Some sociological concepts applied to psychological disorders include social roles, patient characters, class, life events, culture, migration, etc. [48]\n\nIt is derived from Maslow's humanistic psychology to psychology. The experimental scientific technique is used to study the happiness and strength of human beings. Unlike traditional clinical psychology, psychology pays attention to health care. At present, the intervention of psychology has obtained some experimental affirmation. A special issue is published in the \"Clinical Psychological Review\" in 2010, which is reported to use some of the intervention methods of characteristic strength in psychology, such as the three weeks. Good things and physical forms of thanksgiving expressions (such as: hug, etc.) that helps life satisfaction. In addition, the Mindfulness-Based Stress Reduction, MBSR is also proven to be an effective method for treating depression. However, further research is required for the effects of intervention. Positive intervention is still limited, but their effect is considered higher than placebo, especially for physical image lack of people with a better effect.\n\nPsychological research tends to computers, ie knowledge of knowledge from other areas to help understand, explain psychological phenomena. In addition, psychologists use a large number of three-section of Charles Sanders Pierce: interpretation, induction, tracing. Due to the common use of interpretation of natural laws (English: Deductive-Nomological Model), psychologists will also rely on summary logic to explain the problem. For example, evolutionary psychologists try to utilize the survival of admissions to explain psychological traits - such as memory, perception, language, etc., which are naturally selected or sexually selected products.\n\nPsychologists will launch basic research to further understand a certain field of psychology, or to apply research to solve other issues such as clinical, workplace. Master's clinical professional meeting at the same time and teacher student research methods and evidence-based practices. The Psychology Association will also assist in establishing specifications, such as moral, training, research methods, professional operations, etc. In addition, according to different countries and regions, psychological services or \"psychologists\", they are also often requested to obtain practices.\n\nThe results of controlling the variable observation of variables in various situations in various situations in the control experiment context. Statistical analysis of the results, the effect of controlling the effects of unrelated variables, and inference: whether the variable has an effect on variables, that is, whether it has a causality between variables and variables (generally finding the correlation of both. Then confirm the causal relationship. Will also find the correlation coefficient of both according to data analysis, and then determine if there is research value.\n\nExample: Dog in Pavlov experiment (classic condition reflection). Whenever a bell, the dog secretes a lot of saliva. Experiments involve the independent variable, due to variables (dependent) (Dependent Variable). The bell is IV, the saliva of the dog is DV. The independent variable is a variable in the experimenter, and the variable is variable due to the variable. The experimental method is valued. Credibility and repeatability.\n\nExperiments with human beings have been controlled, such as the consent of the experimental objects, and ensure the principle of voluntary participation. After World War II, in order to avoid the event of similar Nazis abuse experiments, Nuremberg Code was formulated. Soon, many countries (and scientific institutions) received the \"Helsinki Declaration\". In the United States, the Health Center has established an ethical review committee in 1966 (English: INSTITIONAL REVIEW BOARD), in 1974, in 1974, the National Research Law (English: National Research ACT) was prepared in 1974 (HR 7724). All of the above bills advocate the license for researchers to obtain participation before the experiment. A series of influential events The amendments to the bill have led to the research of reflective isotope studies in MIT and Fu Na College, Sandy amine scandal, Wiro Brooke hepatitis experiment, and Stanley Mirgram's authoritative test experiment.\n\nAnimal learning experiments have important auxiliary role in studying human psychology, such as perceptual, emotion, learning, memory, and more. In the 1990s, the Russian psychologist Ivan Petrovic Pavlov utilizes the dog's experiment to showcase the classic conditions reflection. Non-human animals such as primate, cats, dogs, pigeons, rats, and other rodents are often used in psychological experiments, especially for behavioral psychology. In the ideal state, the experimental control group only gives only one independent variable to show its role of the variable. These can get the most approximate results in the laboratory. In contrast, the difference between human living environment and genetic environment is too large, and there are too many variables, so that it is difficult to control important variable data in the population. Of course, it is obvious that the results of animal experiments into humans are obvious. [49] Animal experiment will be subject to relevant constraints, and need to comply with the moral principles set by the Psychology.\n\nThe vast majority of psychology follows the standard scientific methods for research. Psychological researchers try to use the latest theories and assumptions to study data and quality and quantity.\n\nPsychological research methods include interviews, observation methods, etc. Creswell (2003) defines five major qualitative research, including narrative, phenomenological, ethnic, case analysis, and basic theory. Quality researcher [50] sometimes strives to enrich, or criticized, subjective experience or social structures for symbols. Similar explanations or critical perspectives are applied to \"quantitative research\", such as the Nazi experiment of Eric From (English: Authoritarian Personality) or Stanley Mirgram's power yield experiment.\n\nPsychological quantitative research often use statistics to test falseness. Design quantitative research often includes experimental, quasi-experiment, cross-sectional design, case control research and longitudinal study. The measurement and operation definition in the experimental structure is also very important. Statistical methods include Pearson's toss coefficient, variance analysis, linear regression, Logit model, structural equation modeling, hierarchical linear model, etc.\n\nThe study aims to answer individual ideas, feelings, behaviors, known as \"descriptive research\". The orientation of the descriptive study can be quantitative or qualitative. \"Qualitative Research\" is a descriptive study focusing on the observation of the incident, description, is a point of capturing a point of daily behavior and expects to re-discovery or understand in a rough experiment.\n\nJust like Gutogo's research includes observing the social, family, psychologists, by observing human society, professional, and homes. Sometimes participants will be aware that they are monitored and sometimes the opposite. But in any case, when observing the study is underway, the researchers must ensure that strict moral guidelines cannot be made.\n\nPsychology, statistical surveys can be used to measure attitudes, traits, monitoring emotions, check the validity of the test, and other related research projects, etc. Psychological statisticors can use traditional paper, telephone, email, or current popular network, etc., revolve around the theme, and conduct crowd surveys, random surveys, key investigations, sampling investigations. Similar surveys are also used in other applications, such as clinical assessments, personnel assessments.\n\nMainly divided into three kinds\n\nNeuropsychological research methods will compare psychological activities, behaviors, and brain structure, and function. These methods include testing (eg, Wixler IM, Wisconsin Card classification test (English: Wisconsin Card Sorting Test), functional neuroimaging and transcranial magnetic stimulation (English: Transcranial Magnetic Stimulation).\n\nCalculation models are often used as tools that are applied and mathematical psychology and cognitive psychology, that is, a computer simulated a particular behavior. [52] This method has its unique advantage. Since modern computer processing information is extremely fast, multiple simulation can be run at the same time, and a large number of statistics are generated in the short term. The model can help psychologists observe the assumption values ​​of psychological events, which is not easy to observe in usual activities.\n\nThere are many different models available in the application. Jointism utilizes neural network to simulate the brain. Another way is the image simulation, using variables and rules to simulate different psychological activities. Other types of models include power systems and random processes.\n\nArchives Research: It is to collect a large number of existing information based on certain purposes. By analyzing the relationship between certain phenomena and psychology. Archives research method has broad and narrow scores, broad-screwing research methods in addition to traditional References also include audio-visual imaging materials, narrow archive information including newspapers, magazines, meeting records, government documents, personal letters, etc. The use of archives research methods can make up for other research methods, but there is a disadvantage that needs to be subject to availability.\n\nCriticism of research often includes accusing psychology is \"soft\" science. Scientific philosophers Thomas Kun's 1962 criticism [53] suggesting that psychology is still in the previous form, lack of support theory like mature chemistry, physics.\n\nBecause some of the fields of psychology depends on research methods such as questionnaire surveys, critics believe that psychology is not objective enough. Other points of view believe that the personality, thinking, and emotions of psychologists cannot be directly measured, [54] The result is the subjective report of the investigation subject. [55] [56]\n\nOther critics believe that the statistics are misused. Some research records indicate that psychologists often confuse the statistical relationship between the statistics, and the former often does not matter in practice. Sometimes, the debate occurs inside the psychological community, such as the dispute between laboratory researchers and practical clinicians.\n\nSome observers have discovered conflicts in certain theories and practices - for example, some clinical practice has no theoretical support. [57] Critics believe that more and more psychological training courses have no sufficient scientific basis. [58] Some questioners believe that like \"baby autism help communication\"; it is used to remember to recover, the body shaping exercise; regenerative therapy, etc., although it is very popular, but doubts, and may be harmful to health. [59]\n\nIn today's moral standard framework, some research experiments are not allowed. These experiments violated the American Psychology Association, and Canada involved human experimental moral guidelines, as well as Belmon Report (English: Belmont Report). At present, Moral Guidance stipulates that research on non-human animals can only be carried out in the event of benefits greater than harm. [61] So the research method of psychologists in animal experiments cannot be used in humans.\n\nCollege Psychology Institute has a moral committee to ensure the rights and respect of the research object. Psychological researchers must obtain permission before experimenting to protect human participation in objects or experimental animals. [66]\n\nIn 1959, the statistian Sterling calculated that 97% of psychological experiments supported their initial hypothesis, suggesting the possibility of deviation. [67] [68] [69], Janeri, 2010) [70] found 91.5% of mental / psychological studies certified, issued issues (positive results) are space or earth science 5 times larger. Janer believes that the \"soft\" scientific researchers lack a bondage in their consciousness and subconscious deviation.\n\nIn 2010, a group of researchers announced the systemic experimental object deviation in psychological research (\"Western region, well-educated, industrialized, rich, democratic\"; \"Western, EDUCATED, INDUSTRIALIZED, RICH AND Democratic\"). [71] Although 1/8 of the world is a WEIRD category, the experimenter is called 60-90% of the experiments in Weird objects. The report shows that in Muller-Rial Illusion (English: Müller-Lyer Illusion), the experimental conclusion of the Weird object and tribal object is great.\n\nThe research area contained in psychology is wide, and many different methods are used to psychological processes and behaviors. Psychology is mainly divided into two major areas of theoretical psychology and application psychology, which can be divided into many sectors, such as educational psychology, metamorphology, management psychology. "}