{"chinese_title": "civilization ", "chinese": "Civilization (English: Civilization, the word origin \"Civilis\", the \"Urbanization\" and \"Civilization\", which are \"divided into cooperation\"), which is any urban development, social layering, government form and communication Complex society (English: complex society) characterized by symbolic systems (such as text) [1] [2] [3] [4] [5] [6] [7] [8]. It is also a state of advanced social and cultural development, as well as the process reaching this state. It involves a wide range of people, including national awareness, technical standards, etiquette norms, religious ideas, customs, and scientific knowledge. Civilization has a more dense population gathering, and has begun to divide the social class, which generally has a ruler elite and is dominated by the city and rural population. These people who are ruled are concentrated in agriculture, mining, small-scale manufacturing and trade in accordance with division of labor. Centralization focuses power and extends humanity to natural control. [9]\n\nIn humanology and archeology, civilization refers to some people living and have a considerable degree of cultural and economic development areas, such as two rivers civilization and Yellow River civilization. It is also possible to refer to a cluster similar to cultural, such as Christian civilization, Confucian civilization.\n\nCivilization is a kind of living habits and all derivatives extending. Biological morphology, social form, environmental ecologic mutual interleaving and collision produced by civilization.\n\nFor the judgment criteria in civilization, it is mainly the emergence of the city, the generation of text, and the establishment of the national system. The most important premise is the emergence of the city, that is, the crowd gathers, the city is a symbol of civilization. It is generally believed that the earliest civilization is probably [Source Request].\n\nThe sociologist Louis Henry Moore Moore divides social evolution into three stages of Savagery, Barbarism and civilization, with technical invention as the boundaries of each stage, he believes that the representative technical invention of civilization stages is the sound Systems and texts, but some scholars think that this is too narrow, thinking that it is not possible to use text to be used to enter civilization [10].\n\nCultural changes have a great role in the production of civilization. The changes in farming methods, the differentiation of labor, the ruling class, that is, the emergence of the central government and the emergence of social class is an important feature of civilization [Source Request].\n\nThere are many conjectures with prehistoric civilization, but they have not been recognized by the journal. However, left to future generations is just myths, as well as the lessons of disasters bring people's pain.\n\nDuring the 3500 BC, I was called an ancient civilization period.\n\nThe ancient civilization basically has a source of rivers and rivers [11]. Different periods often occupy different civilization, and are roughly divided into geographical environments:\n\nDuring this period 1000 to BC, many civilizations entered the prosperity period, and usually also known as classical periods.\n\nHow to appear in civilization, this is a very attractive topic for philosophers and anthropologists, so there is a lot of theories to explain their respective views. Most views of most views is that the emergence of central concentration is the starting point for civilization. Therefore, the emergence of central centralism has become a focus. But all theories cannot explain the origins of all civilizations, which can only apply to partial civilization.\n\nThe development of civilization promotes progress in human society, but also has a lot of problems. Such as health issues. There is also a problem of infectious diseases. In addition, conflicts between different civilizations, as well as the struggle within civilization makes war a very common problem. There is also a class between classes within civilization.\n\nsettle down "}