{"chinese_title": "dance ", "chinese": "Dance is one of the eight art [1], is the sports expressions of the human body of the body as the body of the body \"Missing\" in the three-degree space, generally have a music accompaniment, and the artistic form of the main manifestation means . It generally uses music, also with other props. Dance itself has diverse social significance, including sports, social / seeking, sacrifices, etiquette, etc.\n\nBefore the origin of human civilization, dance is very important in rituals, etiquette, celebrations and entertainment. Archaeologies offer traces of dance, such as 9,000 years ago, the rocky murals of Bindhka, India and 3300 egyptian tomb. Painting dance characters drawn 3300 BC.\n\nChina has already had dance before five thousand years, [2] is generated in slave society [3], there is a certain feature of development to Qin Han: long sleeve, waist, elegant, skillful, just fucked. [3] The big exchange of Chinese and foreign music dances since the Wei and Jin Dynasties and the emphasis on the Tang Dynasty, the emergence of dancers such as Yang Guifei, so that Chinese performance dance is unprecedronized. [3]\n\nAfter Song Yuan Mingqing, China's performance dance gradually integrated into opera, became a drama dance of the shape, expressing emotions, and showing the plot.\n\nAfter the establishment of the People's Republic of China, the dance as an independent theater is increasingly perfect and mature. [2]\n\nEvery dance has its theme, and this topic also has to develop and change. This is very similar to the situation of music. [4]\n\nChina's dance has a significant character, that is, \"composition\" symmetry, the people on the left do a posture, and the people on the right also make a corresponding posture. The three elements of the dance refers to the expression (not only the expression of the face, is a full body expression), rhythm and composition. The expression and rhythm of Chinese dance have its own characteristics, but the most significant characteristic is composition. This composition is called \"Symmetric Balance\" in the dance. [4]\n\nAccording to the function, use of the dance, it can be divided into two categories of \"practical dance\" (self-entertainment) and \"performance dance\" (entertainment); for each category, according to the \"time\" is divided into traditional and popular, totaling four categories;\nThen you can subdue down, but no matter that classification method, the boundaries have blurred, and the classification is represented below.\n\nWith the purpose of fitness, pleasure, puzzle, and performance, often participants is the dancer and the audience, but not the audience.\n\nFor performance or appreciation, participants are divided into performanceters and audiences.\n\n[Edit in Wiki Data] "}