{"chinese_title": "art ", "chinese": "Art (Latin: ARS; French, English: Art; Spanish, Portuguese: Arte; German: kunst) refers to the integration and balance of integrated people with skills, will, imagination, experience, etc., to create an aesthetic The expression model of the instrument, environment, image, action or sound, also refers to the process of sharing beauty with others or humans with deep emotions and consciousness to express existing perceived and personal or group experience precipitation and display. [1].\n\nAll human culture has some form of art and music, and art expression is one of the universal cultural generals.\n\nArt Traditionally include the following types: literary art (including poetry, drama, novel, etc.), visual art (painting, sketch, sculpture, etc.), graphic design, modeling art (such as sculpture, style), decorative art (such as mosaic map Design, etc.) [2], performance art (drama, dance, advertising [3], music, etc.) [1].\n\nIn the 17th century to the 18th century in Europe, art and science entered the critical period of knowledge and mutual inspiration, this process promoted the art and scientific finished products into an important symbol of Western humanistic thinking and civilization. [4]. The encyclopedia of the European Enlightenment Sports is also a dictionary titled book with the new state of the human groups that have been raised by art and science [5] [6] [7] [8].\n\nFrench and English ART (art) one word from the ancient Greek Latin ARS, the righteousness is \"skill\" [9], although the original meaning is also derived, almost all of the close-related life is closely related. Creative learning.\n\nThe word \"in Chinese came from the\" Han Han Shu \"Wenyuan Biography, Liu Zhen has mentioned\" Calibration Dongguan 5th, Zhuzi, Baijiao \", but the art refers to Six Arts and Structure, etc. The general name of the skills, and the meaning of modern art [10].\n\nIn terms of literature, literature, painting, music, dance, sculpture, architecture, drama, and movies, the knowledge in these areas is sufficient to establish a corresponding learning. In addition, some emerging art sectors such as design, photography, video games (video games (video games), and experimental art are also gradually received by the academic and public, and many art colleges have opened relevant profession [11 ].\n\n\nIn Chinese and English, the names of art and art often have mixed situations, strictly speaking, art corresponds to English, is a broad and wide concept, and the art corresponds to the English, which is a narrow, just the expression of art. One. Art includes \"painting\", \"sculpture\", \"building\", \"literature\", \"music\", \"drama\", \"dance\", \"movie\" and even \"game\", and \"art\" generally refers to \" Painting, \"Sculpture\" as the core of visual art. However, in the daily term, art and art are often equal to the equal sign. In the education sector, there have been controversy, causing the confusion of students related artists.\n\n\nSince the 20th century, it has been constantly emerged in conventional forms of elements other than traditional definition art, such as common \"Technical Art),\" Digital Art \",\" Installation Art \"(Installation ART) , \"Conceptual ART\", \"Behavioral Art\", \"Biological Art\", etc. Such a variety of art forms continue to challenge the limit of the artistic theory. Regarding how art is recognized, it has become an open problem, and it is currently based on the current recognition of art world.\n\nThere are many different functions in history, so it is difficult to abstract the purpose of art into a single concept. This does not mean that the purpose of art is to vague, but there are many different art creations, unique reasons. The purpose of an art will be listed below, which is divided into two types (Motivated).\n\nThe art of no motor means those art that is an indispensable part of human beings. This type of art beyond individual, or is not created for a particular purpose. With this point of view, art and creativity, it is human, and therefore exceeds the practical level.\n\nArtificial art refers to those that are generated by specific purposes. It may be to politically change, express a subject of society, express specific feelings or aimed at attitude, statement of personal psychology, describing another thing, selling products, or as an exchange of tools.\n\nSo far, there is no recognized art classification standard. The factions of each artistic theory have different classification, the more comparable and controversial in the timeline.\n\nIn general, the art can be divided into accordance with the different manifestations and methods.\n\nCompare new branching, the art is divided into:\n\nThe following is a common art category\n\n[Edit in Wiki Data] "}