{"chinese_title": "Comics ", "chinese": "Comics (English: comics) is a two-dimensional visual static drawing art, composition (such as color, line) is generally streamlined than art paintings (such as oil painting, watercolor), can add text (such as white, next to, silent) Composition content. As in other art forms, comics can use different narrative methods, such as boast, ironic, realistic, etc. Traditional comics are generally serialized in magazines, or regularly issued a single line. With the development of digital technology and Internet technology, comics have more and more ways of e-books or website content. Continental comics constitute a plurality of static drawings, different from animations. Usually there is no sound, there is a sound example with \"VOMIC). Comics can completely describe things narrative stories, can express a complete story or concept itself, different from floating world paintings and illustrations. Comics more than simply presents scenery, so different from landscape painting, character painting, sketch, sketching. \"The word\" is a long, long-term meaning, such as a long, long, etc.; and simple, casual meaning, such as writing, stroll, etc. Therefore, \"comics\" can be seen as simulation and rigorous and rich in painting, such as oil painting, etc., and the painting style of narrative and scholars. Non-single comics can also be called a ring chart, with a comic painting.\n\nComics has experienced a development process as a painting, from the initial hobby of a minority, and has now become a common reading of people. Although the recent comics, it is 800 years ago, Japan has started the beginning of comics.\n\nEurope in the sixteenth century Renaissance has a similar comic work, like Li Audo Davenxi, starting to use exaggerated expressions, this is the sketch of the small paper, but the exaggerated painting, funny The performance, and started the comics of the Western Ocean [1]. Swiss painter Rudolf Top Buddha (English: Rodolphe Töpffer) in the 1830s of the company's origin of European serial comics [2].\n\nThe picture of the comics can be simple or complicated, and abstract can be realistic, but pay attention to the connotation of an idea or story. Although many of ancient ancient times is based on satirical humor, there are also historical stories (such as the painted character story of the northern Wei Sima Jinlong Tomb), the horror ghosts (such as the Hell of the Tang Dynasty, Wu Daoli's Hells), social issues and other different themes.\n\nPeople are familiar with the Roman Tula column, the appearance of the 190-meter relief, engraved the Roman Emperor Tura, in the 113th year of Xiyuan. The 11th century Bayi tapestry is 70 meters long, the wider is half a meter, and there is 62 meters. Describes the front and rear process of the entire Blackstins battle. It can be seen as a mode of early comics.\n\nAnd the ancient China also comics this artistic form. The Wu Liangtu stone carved \"Xia Wei\" in the 147th year of the Han Dynasty, the Han Dynasty, the Northern Wei Sima Jinlong Tomb unearthed, and the \"one group and gas\" made by Ming Xianzong Zhu Xiangxiang, Ming Dynasty and the early Qing Dynasty, eight major mountain people \"Peacock Map \"The Qing Dynasty\" Yangzhou Eight Mobs \",\" rich can make ghosts to push mill \", etc. Just in ancient China, the name of the painted model that gradually adapts to the painting form of comics is not \"comics\", but called \"satirical\", \"meaning\", \"almond\", \"color painting\", \"harmonics\" , \"Smile\" or \"funny painting\".\n\nAfter the inventions in the fifteenth century, the West may have comics, but usually with the artist William He Hagas in the 18th century chart of works A rake's progress is the earliest comics in the current Western history. This work has a spiriery, even like a drawn split script.\n\nThe Oriental is the first time the word \"four 时 交 交\" in Japan's floating world painting. And Geji Behazhai is drawn, and Beizhai comics that will be published in 1814 may be comics this type in the east.\n\nModern comics can be traced back to the beginning of the 20th century, and Chen Shi, Qing Dynasty, was published in the \"Pacific News\" issued by Shanghai. [4], small shape, ink, ink, indifferent. However, due to the continuous war, most of the publications were lost during the war, it was difficult to see all works. Fortunately, Lu Xun, the \"Beijing Notes\" edited by Zheng Zhenzhen has collected some similar comic books similar to Chen Shi, in order to be a long rhyme of the early comics.\n\nIn May 1925, since the future generations of Feng Zikai, Feng Zikai, who was called the Master of Comic Master, published some paintings, and from the 172th issue of May, Mr. Feng, \"comics\" from the 172th issue of May. The words, this is the name of the comics first appeared in front of the Chinese public. Since then, Feng Zikai's paintings are popular in various newspapers with the name of \"Zikai Comics\".\n\nUnfortunately, comics will not be important in the history of modern painting in China. China's various school courses, scholars research, art awards, social evaluation, government regulation, market sales, etc. In the 20th century, comics in China have long been in a weak position, less value. Until in the 1990s, China has the first professional comic magazine, late and Japan and other countries in the near future. In 1998, there was the first Chinese Comic Award [5], and the hands of Japan in 1971 were rewarded late for more than 20 years. Until 2002, the Chinese Academy of Fine Arts established an animation system [6].\n\nJust like the problem of defining literature and movies [7], the definition of comic media has not reached a consensus [8], many of the exceptions of the definition or description of the comics [9]. Like Töpffer [10], RC Harvey (English: RC Harvey), Wil Esna [11], David Karrell (English: David Carrier) [12], Alain Rey [8] and Lawrence Grove All of the combination of text and drawings [13], but in the history of comics, there have also been famous unmanned comics [9]. The importance of emphasizing the drawing sequences like Thierry Groensteen [13] and Scott McCloud. At the end of the 20th century, different cultures found each other's comic tradition, and reproduced some of the comics types that had already been forgotten, and the production of new comics, therefore to define comics more difficult [14].\n\nClassified with a single comic, multi-grotto, plot, plot comics (serial comics), etc. in the form of expressions.\n\nAge restrictions, different countries have different grading standards. "}