{"chinese_title": "Meteorology ", "chinese": "Meteorology is the object of the study of the atmosphere as a study, from the qualitative and quantitative two aspects to the disciplines of the atmospheric characteristics, focus on the weather conditions and changes in the atmosphere and the forecast for the weather. Meteorology is a branch of atmospheric science.\n\nThe first person to establish meteorology is an ancient Greek philosopher Aristotle. In his special book \"Meteorological Remarks\", he first narrates and thoroughly explains the weather in the wind, cloud, rain, snow, thunder, and hail, and this book is the earliest meteorological book in the world. Until 18-19, due to the development of physics and chemistry, the German Budland, the German Budland was drawn, and a modern weather analysis and forecast method were created by the development of physics and chemical development and the development of air pressure, temperature, humidity and wind. In 1835, the Frenchman proposed the concept of wind deflection; in 1857, the Dutch Belle Bello proposed the relationship between wind and air pressure, and their concepts became the basis of atmospheric dynamics and weather analysis. During the Crimear War, a heavy rain made Henry IIW, causing 400 people to die, and the Minister of Defense at the time of Vaillant asked the astronomer in Yilban Levi. Jegone is responsible for finding the original committee. After study, Yu Shi proved that the storm has existed on November 12, and within two days, it will hit the whole Europe from the southeast of northwestern. Therefore, he pointed out that most of the factors affecting the weather have migration. The event made him think that it is necessary to develop meteorology, and he prompted this discipline to get a formal position in 1855, and modern meteorology stepped out the first step. [1]\n\nAround 1920, Norway's Pienis father and son proposed a theory called \"Extreme Perspective\", and the weather change in the middle and latitudes. The theory has been published in the 1920s that it has been more than 100 years, but it is still the main theoretical basis for the weather forecast today, and it has also laid the theoretical foundation for the analysis and forecasting weather in the next 1-2 days. In the 1930s, the wide use of radio detectors was widely used, and the atmospheric science research of three-dimensional space was truly started. According to the high-altitude weather map drawn by a large number of materials, the atmospheric wave is discovered. In 1939, Karman Gustav Rosemail proposed long wave mechanics. His theory also had a great contribution to the weather forecast. By the 1950s to the 1950s, the application of computer, weather radar, satellites, and remote sensing, making the atmosphere, large to the air circulation, small toast formation process, can be expressed in accordance with physics and chemical mathematics For example, thermodynamic first fixes, partial differentials. Thus, the atmospheric science has developed a sharp development [2].\n\nResearch on research [3]:\n\nObserving research is to understand different atmospheres, it can be said that one of the cornerstones of meteorological theory is also concerned about the general weather enthusiasts. There are also many kinds of meteorological stations, high air balls, satellite clouds, radar retrays, etc. Observing research is not just observations, and there is also a certain degree of summation and analysis, such as a \"cold to turn\", it is an analysis. In addition, drawing weather maps, sorting tropical cyclone paths, climate area classification, etc., is also what to do.\n\nThere are three major parts of theory research, except for observations, physical and mathematics is also important for theoretical research. The theory can be generated from two aspects, and on the one hand, it is directly established from the observation data, for example, Dewarzak analysis of tropical cyclone intensity, and on the other hand, from physical theory or other weather theory, such as ground transfer Equation, air pressure gradient equation, etc. The physics theory is much more helpful, in turn, math language is sometimes making us understand physics and meteorological theory.\n\nModern weather forecast is built in numerical modes, numerical models transmitted through nonlinear equations and supercomputes, and the anti-performance is a quarter of the future. Numerical model research is less known, and they all require considerable theoretical knowledge, computer program techniques and experimental skills. Numerical model studies will put different physical and weather equations, in the computer program, and then calculate future temperature, humidity, air pressure, wind direction, etc. to assist weather forecasts or theoretical studies.\n\nMore famous weather numerical models:\n\nExperimental research is also a fewer people, and the experimental research has been more than Japanese, but there is also a value, such as verifying certain theories, and numerical model research.\n\nother: "}