{"chinese_title": "Mapping ", "chinese": "Specifications and mapping research and estimates and estimate ground geometries, global shapes and earth gravity fields, and measure the geometric distribution of natural objects and artificial facilities in Earth, the theoretical and technical disciplines of various scale maps are measured. The research object of surpassing and mapping is geospatial information such as the morphology, position, gravity distribution of the earth, and thus measuring and mapping can be considered a branch discipline of Earth Science. In recent years, the research object of surveying and mapping has also expanded from the surface of the Earth to the field of access to the anterior space and the internal structure of the earth.\n\nThe Progressive Progressive Progressive Relying on Humans' Understanding of the Geoplasses, the Improvement of Map Map Technology and the Innovation and Change of Surveying and Mapping Instruments.\n\nIn the era of ancient history in the world, there is a saying that the Nile and Mappiness is in the Farmland border. In the 7th century BC, Pi Zhong has collected 27 early maps in its \"pipe\" book. In the first 5th century BC, China has made the earliest guide to \"Division\" records in China. In the first 2nd century BC, in \"Historical Records and Summer Ji\", it records that there is a \"left-line rope, right rule\", indicating that there is a simple mapping activity at the time.\n\nThe study of the study is the earth, and the understanding of the shape of the global shape is also made in constant changes. Initially people think that the earth is \"Tianyuan Local\", until the 6th century BC Pythagoras and the 4th Century of the BC proposed \"the circle\". In the first century BC, Eltosteney was observed in Alexander, and the length of the miramoa and the radius of the Earth were confirmed that the approach is the initial form of \"radian measurement\". At the end of the 17th century, Newton and Huygens start from the principle of mechanics. It is considered that the earth is two-pole slightly flat oval, called \"surprising\". In the Mid-18th Century, the French Academy of Sciences in South America and Europe confirmed \"surprising\". In the 19th century, with the measured data, Laplas and Gaussian have pointed out that the earth is not perfect. In 1873, Rismin proposed the concept of the geodetic surface to represent the shape of the earth with a gravity equipped with a heavy sea surface surrounding the earth. In 1945, Moro Josky used Earth gravity measurement data to determine the true shape of the earth.\n\nOne of the results of the surveying and mapping is the map, so the important indication of the development of surpassing is the improvement in the map technology. The earliest map is portrayed on the pottery, copper plate, and reliability is not high. In the first 3ruces of BC, Eltoster first applied the latitude and latitude to the map. In the first 130 BC, the first stage of the Western Han Dynasty has \"Topographic Map\" and \"Wrun Map\", which is the earliest map found in China. In the 2nd century, Torle Master explained the method of preparing the map in the \"Geody Guide\", and proposed a map projection problem. Since then, the Xi Dynasty, the Xi Jin, established a \"six body\", enabling the reliability of the map. After the Second World War, the computer chart technology developed rapidly and developed into a plurality of geographic information systems.\n\nThe tools of surveying and mapping are the surveying and mapping instruments, so the development of surpassing is inseparable from the innovation of the surveying and mapping tools. Early mapping is a simple rope, torque, etc., 17th century telescope invention, and the mapping tool began to change. In 1617, WiHo Snell invented the \"Triangular Measurement Method\" and creating an angle measurement. In 1730, Xissen developed an angle to use theodolite. After the beginning of the geographic discovery, many countries have studied the instruments for the latitude latitude at sea to position ships. In the 1950s, the first photographic measurement method of Losda. After the 20th century, as the inventions of the plane, the method of aerial photography mapping map appeared. After man-made satellite, satellite positioning techniques (GPS) and remote sensing technology (RS) are widely used, which is known as \"3S technology\" with geographic information system technology (GIS).\n\nMap related entries "}