{"chinese_title": "medicine ", "chinese": "Medical (English: Medicine, Medical) is based on prevention, diagnosis, treatment of physiological and psychological diseases and the purpose of protecting human health, improving physical and psychological quality [1] [2]. The narrow medical treatment is only the treatment of disease, but it also says that prevent medicine is the first medicine, clinical medicine is the second medicine, rehabilitation medicine is the third medicine. The science of medicine is the theory and discovery of basic medicine, such as biochemistry, physiology, microbiology, anatomical, pathological, pharmacology, statistical, epidemiology, nutrition, etc. to treat disease and promotion. However, medicine also has a side of humanities and art, but it is concerned not only the human organs and disease, but is health and life. \"Physiology - Psychology - Social Mode\" is a widely accepted theory, and other \"care of physiological psychological spiritual society\", \"all people, whole team, full, family medical\" is also an important theory of modern medicine. With the transformation of medical model, medical humanities have received more and more attention. Medical ethics is the most widely known one is the four-first principle methodology: \"Independent, good, not harm, justice\".\n\nIn human society, medicine has already had thousands of years. Modern medicine originated in Europe after the 17th-century scientific revolution, with scientific processes and methods for medical treatment, research and verification. The large direction of the research is included in basic medicine, clinical medicine, inspection medicine, preventive medicine, health medicine, rehabilitation medicine, etc. Medicine developed before modern medicine, known as traditional medicine; traditional medicine continues to exist in the form of alternative medicine in modern medicine, or research in modern medical science methods.\n\nModern medicine is based on natural science, making scientific analysis and clinical analysis of pathology, pharmacology, epidemiology, etc. of life and physical changes. The development of modern medicine has benefited from the achievements of industrial civilization and effective use of scientific and technological development, which makes it enriched in the research and application of testing, medical and surgery. Modern medicine in surgery, organ transplantation, epidemic control, vaccine and immunization, gene and stem cell research, animal experiment, new drug development and medical engineering, etc., there is an important impact in contemporary human health and per capita life [3].\n\nThe explanation of the word \"doctor\" in \"Say Wen\" is: \"Governance and doctors are also. 殹, viciousness; the doctor is native. Get wine, from 酉.\" [4] means sick people The body will be discomfort, and wine can be treated, they get \"medical\" words.\n\nIn most cultures, the earliest medicine is to use some experience to prove effective substances, such as some plants (herbs), animal medicines and minerals.\n\nThe latter people constantly add-to-death on the basis of this medical book, gradually forming the later \"Yellow Emperor's Internal Classics\" and \"Yellow Emperor\", and I wish you a pure medical medicine to form later Chinese medicine. . The \"Yellow Emperor's Internal Classics\" proposed a preventive medical care for the disease and health care in the disease.\n\nThere are some knowledge of medicine and dental health in the Harda River Basin during the Harda (3300 BC).\n\nIn ancient Egypt, people have recorded many medical literatures, such as Kahun paper text (2000-800 BC), Smith paper (1700 BC) and Ebers (eBers) paper Grass Wen (1500 BC). Among them, Smith paper recorded the spasm and meningums caused by the brain, which is the first record of the brain in the world [5]. The medical records of Cuba Babylon civilization can be traced back to 2000 BC.\n\nSince William Harvey, the blood circulation theory is marked as the beginning of modern medicine. Today, there are many new technological methods that have been continuously added to the medicine and produce biomedical engineering, medical imaging, nano-medicinal branches.\n\nMedical branches include:\n\nMedical courses in most medical schools in the United States and Canada are only open to undergraduate graduates (ie, medicine can only be used as a second degree). Students who intend to report must first take the bachelor's course, unlimited field, but the scientific category is recommended (because such students can prove that they have certain scientific knowledge before reading medicine). During the first undergraduate course, students also need to complete a series of medicine, the United States called \"Pre-Health Science Course\" and completed and passed the course test. Apply for the course of medical schools. The application process is also relatively comparable, self-recommended letter and recommended letter averaging. [6] After completing the course and passing the local medical practice exam, it can formally become a doctor and can continue to promote the selection of specialist and master's degree and doctoral degree.\n\nIn these areas, medicine is open to high school graduates. Students participate in local college entrance examination after graduating from high school, and can apply for medical school courses after all conditions. The medical undergraduate course in these areas is generally five years to six years. After obtaining the academic academic degree in the internal and foreign academic degree, it is necessary to work in the hospital for one year, and can continue to promote the selection of specialists and the master's degree and doctoral degree.\n\nThe Song Dynasty, Song Yuanjia, 20th Years (443), Tai Medical Due to Qin Chengzu created related medical education institutions, the earliest medical school in human history [7]. In the 6th century AD, Sui Dynasty improved the medical education institution, and named the \"Tai Medical Department\", the department is divided into medical, the medicine is two, the doctor's order is the highest official position, the assistant, the subject, the doctor, medicine Garden, Ph.D. True, Dr. Massage, Wishing Dr. Ban, at most than 580 people in school teachers in school [7].\n\nIn the first year of the Datong (947), the Liao Jun entered, \"寅, Jin Zhuang, 嫔 嫔, 宦 宦, square skill, hundred work, illustration, illustration, stone, copper, Ming Tang, Too Changle spectrum, Zhanterong County, halogen books, rules and armors, and I will send it to Beijing [8]. \"In the beginning, Khitan doctor was in full care, and the life of the translation of the party was in the book. It is all the people to practice, although the people also know the medical treatment.\" In order to learn Han Medical, Liaoning Zong people translators \" The book \"book and brings medical development in Liao Dynasty [9]. There is no clear record of the establishment of official medical education institutions in the historical book of the Liao Dynasty. [10].\n\nIn 1894, Li Hongzhang played to Tianjin General Hospital to attach Western Medical Tang (also known as Beiyang Medical Tang), which is China's earliest Western medicine school [11]. Early China's medical academic system is mainly to copy Japanese models, and hire teachers from Japan, the construction industry is 4 years, and the university undergraduate level [11]. At the end of the Qing Dynasty, a large number of Chinese students went to Japan. In 1902, 3 of 272 international students in Japan were studying medicine [12]. In 1903, the Beijing University of Science and Technology, \"Selecting Students Outdoor, Dear Specializing in the Choice of Hearing\", and there are 1 people in 31 people in Japan [12]. In 1904, the number of medical students reached 23 people in the school [12].\n\nIn 1912, Cai Yuanpei, the Temporary Government Education of the Republic of China, promulgated \"university order\", one of the 7 points of medical department as part of the medical department as a text, reason, law, merchants, agriculture, and effort [11]. 103 subjects of medical curriculums, is the largest number of courses, and the construction period is the preparatory age for 3 years, university 4 years. In 1917, the Ministry of Education of the Northern Government issued the \"Amendment of University Order\", which stipulates that there are universities in the two sections, and the establishment of one of the five sections of law, medical, agriculture, work, and merchants, etc., such as medical department. the University. In 1922, the Ministry of Education of the Northern Government issued a \"new school system\" in the United States to learn from the United States. The medical practice of medical preparation and medical specialist is 3 years. Medical undergraduate construction is 5 years. In 1935, the Ministry of National Government issued the \"Interim Subject Table of Medicine\" and made a unified requirement for the academic and curriculum systems in medical institutions. In 1941, it was changed to 6 years of medical undergraduate industry and stipulated two phased exams after the course of a specific academic year. This system has been used as the founding of the People's Republic of China.\n\nIn October 1951, the Administration of the People's Republic of China promulgated the \"Decision on Reform\", and began to develop a large number of medical practitioners in the three-year-old medical system in the preserved six-year sectic system [11]. In 1955, the medical specialist and undergraduate professional construction is unified to 3 years, 5 years, and directly cultivated high school graduates, short school education and cultivation becomes a special talent with application-oriented medical and health technology. Since 1988, the Ministry of Education of the People's Republic of China officially begins to triggered seven-year clinical medical profession. In 1997, the State Council's degree committee approved the implementation of clinical medical professionals. In 1998, the Ministry of Education and the State Council of the State Council will re-positioned the seven-year medical education training target in the Master of Clinical Medicine. By 1998, medical professionally adjusted to 8 major categories of 16 majors, learned from three, four, five, six, seven, and eight-year-old.\n\nAccording to the definition of the Ministry of Education of the People's Republic of China, the level of medical, basic medicine, clinical medicine, stomatics, public health and preventive medicine, Chinese medicine, Chinese and Western medicine, pharmacy, Chinese medicine, special medicine, medical technology ( Can teach Medics, Science degree, nursing.\n\nIn 1876, Japan followed the European countries, such as Germany, the United Kingdom, established the National Institute of Medicine, Medical University and Medical College, headed by the Imperial University [13]. Beginning in 1945, it was adjusted by the United States, Japan adjusted the original 50 medical schools (including the university affiliated specialist ministry). In 1950, the old universities and upgraded schools were changed to Xinchui University Medical College and 46 Medical University, and significantly cut the number of enrollment. During this period (1946), no matter the new system, it is 8 years of the old medical institution. From 1970, Japanese medical colleges have developed rapidly and reached 80 in 1981 (National 43, public 8, private 29) [13].\n\nAt the beginning of the 19th century, Argentina created the first medical school, including the University of Buenos Aires Aires Alex, China and 1877 University Medical College [14]. In 1958, the University School of Medicine, Salvador, and two private medical schools in Cordova Catholic College.\n\nArgentina has a total of 29 medical schools, 10 of which are located in Buenos Aires, the capital, and other largest cities in the internal province [14]. The course settings in all medical schools are six years, including three-year basic discipline study, two-year clinical discipline learning and one-year internship, a slight difference between the schools in the form of specific implementation. Since 2000, Argentina's medical schools need to pass the National University Evaluation and Certified Certification Certification. The full-time teachers in the Medical College are most basic subject researchers, which are subject to other national sectors under the National Science and Technology Research Committee (CONICET) or government management.\n\nMany confirmed diseases such as aging, death, AIDS and cancer are still the challenge of the medical community [15] [16].\n\nMedical ethics is some moral principles that need to be observed in medical work. Medical ethics include clinical applications, as well as their history and their philosophies and sociology. The most widely known is the four basic principles: \"Independent, Good Good, Do Not Harness, Justice\" [17]. The following is the six principles of contemporary medical ethics [18]:\n\nThe moral principles described above are not used to process the processing method in a particular situation, but provide an available architecture for some contradictions in medical treatment. Sometimes two moral principles may conflict, and the results may be two difficulties in morality (English: Dilemma) or crisis. Sometimes the two difficulties in medical ethics have no good treatment, sometimes medical groups (hospitals and medical staff) values ​​and patients, patients with patients, and even most non-medical groups have conflicts. Sometimes there may be a valuable conflict between medical service providers or between the patient's families. For example, when the patient refuses to accept blood transfusion, the autonomous and good-ended ethics has conflict. Before there is Ai Dynasty, the general processing method is priority, regardless of whether or not to tell the truth.\n\n[Edit in Wiki Data]\n\nMedical navigation: tumor\n\nGene / logo\n\nTumor / same name /\n\nDrug (L1i / 1e / V03)\n\nMedical navigation: obstetric\n\nPhysiological / development / film (English: Template: Extraembryonic and Fetal MEMBRANES)\n\nPathology / Conditional Source / Master Transmission (English: Template: Diseases of Maternal Transmission), (English: Template: Eponymous Medical Signs for Obstetrics)\n\nSurgery (English: Template: Obstetric Procedures), Drugs (2A (English: Template: oxytocics) / G2C)\n\nMedical navigation: psychology / psychiatric\n\nPsychological course\n\nObstacle (O, P, M, P, A, D, S) symptoms / 名 /\n\nOperation (evaluation / treatment) drug (N5A / 5B / 5C / 6A / 6B / 6D)\n\nMedical navigation: respiratory system\n\nAnatomy (N, X, L, C) / physiological / development\n\nPathology (C, P) / congenital / tumor, symptomatic / signs, trauma\n\nSurgery, drugs (R1 / 2/3/5/6/7)\n\nMedical navigation: skin attachment\n\nAnatomy / physiological / development\n\nPathology / congenital / tumor, symptom /\n\nSurgery, drugs (D10)\n\nMedical navigation: teeth\n\nAnatomy / physiological / development\n\nPathology / congenital / jaw / tumor, human name signs, trauma\n\nDental, surgery (dental marrow, cavity, repair)\n\nMedical navigation: Toxicology\n\nToxicology / toxin\n\nPoison and toxicity\n\nAntidote\n\nMedical navigation: urinary system\n\nAnatomy / physiological / development / cell\n\nPathology / Acidine / Congenital / Tumor, Symptoms / Missed, Urine\n\nSurgery / injection, drugs (G4B), blood test, urine test\n\nMedical navigation: genetic metabolic defect\n\nMetabolism, K, C / G / R / P / Y / I, F / h / S / L / O / E, A / U, N, M\n\nK, CGRP / Y / I, F / H / S / L / O / E, AU, N, M, human name\n\nDrugs (A16 / C10), intermediate (K, C / G / R / P / Y / I, F / H / S / O / E, A / U, N, M)\n\nMedical navigation: nutrition\n\nAssist, metabolism, trace elements\n\nPathology, disorders, symptoms / name, innate\n\nDrug (A8 / 11/12)\n\nMedical navigation: pathogen\n\nBacteria (classification)\n\nGr + F / Gr + a (T) / Gr-P (C / GR-O\n\nDrugs (J1P, W, N, M, vaccine)\n\nMedical navigation, fungal disease\n\nFungi · Classification\n\ndisease\n\nDrug (antifungal)\n\nMedical navigation: virus disease\n\nVirus (protein) / classification\n\nCUTN / SYST (HPPV / AIDS, flu / herpes / human body affected) /\n\nmedicine (Anti-DNA, anti-RNA, anti-reverse transcription, vaccine)  EC 1.1 / 2/3/4/5/6/7/8/9/10/11/12/13/14/15/16/17/18/19/20/21/22  ·  2.1 / 2/3/4/5/6/7 (2.7.10 / 11-12) / 8/9  ·  3.1 / 2/3/4 (3.4.21 / 22/23/24) / 5/6/7/8/9/10/11/12/13  · "}