{"chinese_title": "Europe ", "chinese": "Europa (Greek: ρρ π η), referred to as Europe, the word \"Europa\" (Greek: ρπ πης) in Europe, the world is about 10, 140,000 square kilometers (3,931,000 square miles), 742,073,853 (2017) [1], the third largest population of the world, second only to Asia and Africa, the population density is 70 per square kilometers per square kilometer, and there are 50 independent sovereign countries.\n\nEuropean East Ura Mountain, Ula River, Southeast Yahai, Caucasus Mountains and Black Sea and Asia, West, Northwest Near Atlantic, Greenland Sea, Denmark Strait and North America, north of the Arctic Sea, South Sanzhong Sea and Africa hope.\n\nThe northern end of the continent is Norway North Point, the southernmost part is Spain's Marchi, Europe is the world's second small continent, mainland, is only larger than Ocean, which is known as the European continent, and Asia, and Asia, Africa is known as the Eurasian continent.\n\nUsually, the boundary line of Europe is not always the same as political, economic, cultural or practical considerations. This makes people have a few different \"Europe\" concepts.\n\nYou can click on the European map: show the boundary line formed with the historical cause of the Asian mainland. (See Asia and Europe's boundary line for more information).\n\nLegend: Blue = InterContinental Country; Green = Sometimes it is considered to be Europe, but outside the European border line.\n\n\n\n\nThe origin of the European name may be a woman from the Myth of Greece, she is attracted by Zeus that has become Bull. [3] A more academic statement is: this term may come from the flash to express \"the land of sunset\" [4].\n\nThe word \"in Chinese is the first to use in Kunyi Wan Guo, which is translated by Lima Siri, 16th Century. [5].\n\nThe terrain appearance of Europe is quite rich.\n\nEastern Europe is an inconsistency, the southeast world of Europe is a high Caucasus mountain range, and its main peak Elburus is 5642 meters above sea level, which is the highest peak in Europe. In addition to French, Netherlands, Belgium and other coastal areas, the remaining tops of mountain hills, plains and highlands, the Alpine Mountains, France, France and Spain, Andorra The mountains are bounded, the Nordic Polygonity terrain, there are many glacial cuts to dissolve into the fjords caused by the sea, and Iceland has a lot of volcanic terrain except for the Ice Terrain.\n\nThe European river flowing through several countries has the Rhine, Danube, Yibei River, Otte River, etc. In addition, the main rivers also have a Senna River, a Loire River, a Canal River, and the Russian Thames, the Bohe, the British Thames, the British Thames, and the British Thames, etc.\n\nIn addition to rivers, there are many lakes in Europe. Among them, the Ice Legal Lakes left to the country of Finland as the country of thousands of lakes.\n\nEuropean latitude is north of 35 degrees north latitude, most of which belong to temperate climate, extending north to the Arctic Circle, so the tapered climate in Northern Worth and southern parties. There is no hot summer temperature in Europe that has a hot summer temperature above 30 degrees Celsius, and there is no cool cold area with the most cold moon, and the disaster weather is also less than other continents.\n\nUnder the adjustment of Western Breeze, the climate in Western Europe and the western Europe and the Nordic waters is the greatest global deviation. Therefore, there is no cold flow in the coast of North Atlantic, so this winter is not cold, and the summer is not hot, it is pleasant, and it belongs to the temperate Marine climate.\n\nEastern Europe belongs to temperate continental wet climate, and the annual temperature is relatively large, but it is still smaller in East Asia in the same latitude. Southern is close to the Mediterranean, winter rain, because the summer side tropical high-pressure knock, winter western wind blows. And the Arctic Coastal area is a tundra climate.\n\nAccording to these two and three hundred years of archaeological discovement, it has confirmed that European (including UK, etc.) has some human activities in the old stone age.\n\nIn the first 4000 centuries of BC, the Celtics of Western Europe have a huge stone culture, and now there is a European boulder architecture. The Aegean Sea, the Eastern Mediterranean is considered to be the birthplace of European civilization.\n\nArrived 2000 BC, the ancient Greek ancestors settled in Crete in the Aegean Sea, which also became the birthplace of ancient Greek civilization, and gradually developed a city-state culture.\n\nAfter the 5th century BC, after the War of Bernardnese, the ancient Greek has gradually moved to decline, but its cultural influence continued to expand.\n\nIn the first 3rd century BC, the Greek border Ma Qi Wang State's Alexandrians conquered Egypt and Persia, establishing a big empire across Eurasia, spreading Greek culture into Asia and Africa, historically known as the Greece era, giving humanity .\n\nIn 27 BC, the ancient Rome raised, established a Roman Empire, became a big empire that ruled Europe, West Asia and North Africa, and the Mediterranean became its inner sea. The Yaping Ning Peninsula is the central region of European politics and economy.\n\nAfter 1 century AD, Christian gradually spread in Rome.\n\nIn 313, Christianity was set to Romanism and achieved the dominance in Europe.\nIn the late 3rd century, the Roman Empire gradually weak.\nIn 376, the Hungish defeated the kingdom of Donggodide, and the Gudder was repeated by the Danube into the West Roman Empire.\nIn 395, the split became the East, and the West empire. The Slamen, the Nordic Temman and the Eastern European Slavant.\n\nIn the 4th century, the Hungiang from the East Force Eastern European people to migrate west.\nIn 436, the Western Goths were destroyed in the Roman Empire, and Western Europe entered the medieval.\nThe East Hem of the empire (East Roman Empire) continued to develop until 1453, and finally was destroyed by the Turks of Outman.\n\nIn the Middle Ages, many ethnic groups have established the kingdom, the filing of feudal, war, the Christian church gradually became an important institution in the society, the relief people [6] [7]. Monk's devout service, silent and clean image, which helps to spread Christian belief [7].\n\nIn the 8th century, Charlium established Charles Empire.\nIn 843, ie split. The Empire of the empire has developed into a sacred Roman Empire. Many of the United Kingdom, France, Germany, Italy, etc. have been established during this period.\n\nThe Catholic Church has great power in Western Europe, and all knowledge inheritance is carried out in the monastery. The religious persecution and the Crusaders have brought great disasters to European people. During this period, the enlightenment era is called the dark age. During this time, Europe, especially Southern Europe and Eastern Europe have repeated invasion of Asian nomads, such as Arabs, Mazar, Avar, Mongolians and Turks.\n\nIn the 14th century, in some countries in Western Europe and South Europe, especially in the United Kingdom, France, Portugal, Spain, capitalism began to germination, through geographical discovery and overseas adventure, footprints all over Africa, America and Asia.\n\nIn the same period, a large amount of culturalities began happening, known as the revolution, which also triggered the religious revolution. Many countries were separated from the jurisdiction of the Catholic Church, and all countries in political and clicking were often triggered by the sects. There are many religious wars. On the occasion of the political and religious of Western Europe, Russia, the Eastern Trusted East, gradually becomes strong under the Great Emperor and the subsequent Tsar Leadership.\n\nIn the 16th century, the Khabsburg Dynasty, which was originally the will, Spain, Portugal and its colonies declined, and finally lost the status of European hegemon in the thirties war.\n\nFrom 1667 to 1763, it is an emerging British, France, the Netherlands, a total of six war: France and Spain - the Heritage War of the Netherlands (1667 ~ 1668), France and the Netherlands Laim (1672 New Year to 1678), the Datong War of French Alliance and France (1688 ~ 1697), the Wood of the Spanish Inheritance War (1700 ~ 1713), United Kingdom - Austria and France - Prussian Austria throne War ( 1740 to 1748) and the United Kingdom - Prussia and France - Austria - Seven-year war in Russia (1756 to 1763).\n\nThe final result of these wars: Britain defeated France and the Netherlands, capturing large overseas colonies, establishing \"Japanese Infair Empire\"; France's monarch authorization system collapsed, and finally broke out the world's French revolution.\n\nAt the end of the 17th century, the British politics had a glorious revolution. In the 18th century, the UK began the industrial revolution, and then the European continent has also promoted the rise of nation.\n\nIt has completed unity in the 19th century. With the advancement of technology, the continuous exploration of the outside world, the proposal of the evolution of the outside world, Europe became the cradle of imperialism, plundering resources in the world.\n\nAt the beginning of the 20th century, the extreme expansion of imperialism has finally leading to Europe to become a war policy source, and two world wars have caused great trauma and losing world hegemony. European countries have lost their colonial rule.\n\nDuring the First World War, there were the world's first socialist country - Soviet Union. After World War II, in the influence of the Soviet Union, a group of socialist countries occurred.\n\nIn the 1950s, two groups organized by the United States, the United States, the Northern Atlantic Convention Organization, and the Soviet Union, the Soviet Union.\n\nEurope is divided into two major political and economic camps: communism of Eastern Europe and capitalism of Western Europe.\n\nBy 1990, with the Soviet Union, the Cold War ended, the political pattern of Europe was significant. Socialist countries in Eastern Europe returns to capitalism.\n\nNow, the word \"Europe\" is more widely used as synonymous with the European Union. Now there are 29 Member States in the EU, and more membership negotiations are or will be done. All EU member states are Member States of the European Commission.\n\n(It must be noted that this partition method is not unique. According to geography, political, cultural, there may be different partition methods)\n\nFrance\nNetherlands\nBelgium\nLuxembourg\nSwitzerland\nLamnaden\nAustria\nMonaco\nGerman\n\nPoland\nHungary\nSlovakia\nCzech\nBulgaria\nRomania\nRussia\nUkraine\nBelarus\nMoldova\n\nRussia\n United Kingdom\nDenmark\nNorway\nIceland\nFinland\nSwedish\nLithuania\nLatvia\nEstonia\nIreland\n\nPortugal\nSpain\nGreece\nRighteousness\nVatican\nAndorra\nNorth Macedonia\nSan Marino\nMal him\nSlivinia\nCroatia\nBoss and Herzegovina\nMontenegro\nSerbia\nKosovo\nAlbania\nGibraltar\n\nEurope is the primary origin of modern Western political ideas. In terms of political systems, whether it is a democracy, agency, a constitutional constitution (cabinet system), double head system, etc. from Europe, and the world has affected.\n\nIn political color, European political thinking is from left to right, one is full, such as anarchist, Nazism, fascist, conservatism, monarchism, and socialism, communism, and in the history of European politics, this is more Other continents are unique to Europe. Now that some countries in Europe are turned to ruling with the right to right, forming a pendulum effect is also quite concerned.\n\nEuropean integration is increasingly becoming the trend of European development. The political parties of many countries in Europe, such as the European People's Party, European Green Party, European Freedom Democracy Reform Party, European Zuo Party, European Democratic Party, European Free Union, etc. In addition to the United States, Member States organized by the Northern Atlantic Convention is mainly composed of European countries. At present, Europe has 44 Member States in the United Nations, of which Britain, Law, and Russia are permanent members of the UN Security Council.\n\nThe current Europe is the most concerned strategic focus of the world. The EU's development strengthens European integration. At present, the EU is more super national organization, which is an important factor affecting the development of world economic political development. After the end of the Cold War, the US European struggle for European dominant struggles began to emerge.\n\nEuropean policies for gay people are also tolerant in the world. In countries around the world, there are sixteens in Europe, Europe, Belgium, Spain, Norway, Sweden, Portugal, Iceland, Denmark, France, Luxembourg, Ireland, Finland, British, Malta, Germany and Austria. In addition, more than 10 countries have more than ten countries to recognize the combination of the same sex partner, they are Andorra, Czech Republic, Slovenia, Switzerland, Hungary, Liechtenstein, Croatia, Cyprus, Estonia, Greece, Italy, San Marino. There are 37 national legislation prohibited discrimination based on sexual tendencies in daily life in terms of employment, medical and other social. In addition, all countries in Europe require voluntary homosexuality between two adults.\n\nThe earliest capitalism has developed from Europe, and the mechanization level of its industrial and agriculture is also the highest in all continents. Most countries in Europe are developed countries, including the highest economic development level in north Europe, Western Europe and Central Europe.\n\nWith the development of the EU, the European economic integration is getting higher and higher. On March 13, 1979, the European monetary unit began to use European currency units as a currency unit for pricing settlement. Now the euro (€ ISO 4217 EUR) is the current 18 countries in 28 Member States in the EU (there are countries other than this 18 countries, which are already the official currency of 31 countries and regions). The EU countries have their own interests in the euro zone, and more than half of the EU Member States still issued their own currency, and did not join the ranks of the Eurozone, such as pounds. The euro zone is one of the main major economies in the world. The euro zone economy has deeply influenced the world's boom.\n\nIn some traditional European traditional industries, agriculture has a high level of modernization. The total area of ​​the total cultivated land is about 290 million hectares, and the proportion of agricultural population is 15%. However, due to dense population, high consumption, most national food cannot be self-sufficient. European industrial output is the highest in all continents. The transportation industry is extremely developed. There are 350,000 meters of railways in the provinces; the total length of the road is 4.2 million; the total tonnage of the sea accounts for 45% of the world, which has a strong export economy. In addition, European aviation industry and tourism are also very developed.\n\nThe European population has about 728 million (2005 data), accounting for about 11% of the world's total population. The average population is the first in the continents. At present, European countries face more of fertility rates and problems of population aging, and implement various policies to make the population grow up normally.\n\nSource: UNPP\n\nEuropean people are mainly a nation (more than 90% of European residents), which is the most widely used in Baltic language, Roman language group, Germanian, Slavian, Celtic and Albanian, Greek, as well as the ethnic groups from the Oriental Language and the ancient Basque, in the European European part of Russia, there is still a part of the nationality of the Altai. Basically, people in nation have been divided into nation. Some people living in different countries have recognized that they belong to the same nation, but some are reluctant to admit that they only emphasize that they are the people in that country.\n\nEuropeans are divided into multiple different languages, including:\n\nSee the language of the European Union for the language of the European Union Member States.\n\nAll European countries have to accept compulsory education, or at least accept some kind of education training. European compulsory education is probably from 6 or 7 years old, lasting until 15, 16 years old. In most European countries, basic education time is probably only four to five years, but in a few countries, it takes seven or eight years. After the completion of basic education, the students who continue to receive education have a variety of types of schools, and there are some technical schools that continue to train talents in advances, and some technical schools. At the same time, there are many high-level colleges and comprehensive universities in many countries, and students who have completed junior high school education have been completed. Under the promotion of this education system, almost all illiteracy rates in European countries are very low.\n\nCarving art buildings, art, literature, and music are traditional things with a long history in Europe. Many cities, such as London, Paris, Vienna, Rome, Berlin and Moscow today, today is also considered to be the country's cultural center. In addition, there are many important theaters, museums, symphony or other important cultural facilities in many cities.\n\nEurope has a very deep cultural heritage. European prehistoric art reflects the achievements of architecture, engraving, paintings, and crafts of the European Times and Neolithic Age, where European Old Stone Age is the earliest art of human being known to date. In addition, European prehistoric appliance art has a strong performance, and learned is active.\n\nIn the 11th to 17th century, the rise of the Middle Century University in Europe laid the model of modern higher education.\n\nCooperation in European countries in science, culture is also very close.\n\nIn terms of culture, in 1950, the European Broadcasting Union mainly based on Western Europe and Mediterranean coastal national radio and television institutions. The European News Agency established on August 21, 1957 increases communication and cooperation among national news agencies.\n\nIn science and technology, European South Tianwen Taiwan, which is located in the Southern Halple, Britain, Germany, Belgium, Switzerland. In 1973, the European Molecular Biology Laboratory established by more than 30 countries promotes the rapid development of European countries in the field of molecular biology. On May 30, 1975, the European Space Branch consisting of several countries in Europe is very competitive in the space sector.\n\nAmong Europe, 72% are mainly believed in Christ, including Catholic, Christ and Orthodox Church.\n\n8% is Islam, most of them live in Russia (2,500 million), in addition to this, in Turkey (5.9 million), France (5.5 million), Germany (3.2 million), Bosnia and Herzegovina with Albania ( 140-2500 million) and other European regions such as Italy (11 million) have Muslim distribution, and Muslims in Western Europe are mainly immigrants.\n\nOnly less than 1% of European residents believe in Jewish (nearly 2 million people). Other religions (such as Hinduism, Buddhism, etc.) are only less than 1% of believers.\n\nIn Europe, the more developed areas, the higher the proportion of non-religious population; the more behind the backward areas, the higher the proportion of religious believers of God. According to the results of the survey released by the European Union, there is not believed that there is a population proportion of God, more than 60% of the United Kingdom, France, Netherlands, Sweden, etc., more than 50% have Germany, Belgium, Switzerland, Norway and other countries, and low In 10%, there are countries such as Romania, Turkey, etc., with Portugal, Greece, Poland and other countries.\n\nEuropean countries have established vast colonies in Asia, such as the UK owns India, Singapore, Malaysia, Myanmar and Hong Kong; France has Indian branch, that is, the eastern part of the South Peninsula; Portugal, Guanzhi Macau, Goa and East Timor; Spain Zeng Tuition of the Philippines; the Netherlands has an east Indian islands, namely today's Indonesia. Therefore, the relationship between Southeast Asian countries and European countries is very deep. Due to this profound relationship, in today's international relations, Europe has a certain degree of influence on Southeast Asia; in Southeast Asia, the Philippines, the Catholic Church The bishop assignment of the assignment is also political and social influence. Japan in Northeast Asia has made a shaft country in Germany and Yuri in the Second World War. Now Japan, South Korea and European countries are mainly based on economic relations, and political alliance has gradually decreased.\n\nAlthough Europe and the United States have a strong historical origin and contact, it is roughly in the middle of the 20th century. After the Second World War, the United States and Europe have a close relationship. Prior to this, due to the Americas in the 17th century, it was places where European countries spread out of the people and prisoners. Therefore, in the early days of the United States, the United States, in the early days of Europe, especially the UK, which has been ruled by the United States. Relationship. Thereafter, due to the policy of implementing political mutual intervention in the United States and Europe, both of them have their own development in the 18th to the 19th century. The two world wars in the 20th century, making European vitality, but the US economy has highly increased, and Western Europe requires US economic assistance, nature is close to the United States. Plus Eastern European countries joined the socialist camp, and thus landed with the United States. During the Cold War, the threat of socialist camp headed by the Soviet Union strengthens intimacy of other European countries and the United States in Eastern Europe. However, after the end of the Cold War, the threat disappears, Europe (mainly EU member states) has changed in the relationship between the United States, and Europe needs to have their own voice, so some European countries are in the September 1 event, Iraq issue, Iraqi issue The aspects have different opinions from the United States, even with large differences, but its root deep allies will remain unchanged. Britain has more close closer of the United States in the above incidents, and the United States has become a very strong colonial relationship, but it has also been smiled in this US original colonist almost inverted into the US attache. Spain, Poland, etc., for the Second War of Meiyi's second war, making the United States praise these countries for new Europe, but with the horror of terrorists to attack Spain, Spain has exited her with the United States, from Iraq withdrawing the army .\n\nGeographically, Europe and the Middle East are neighbors. In history, the relationship between Europe and the Middle East has always been nervous, basically because the two are different from the religious concept: most of Europe is the main belief in Christianity, and the Middle East Arab countries Taking Islam as a state. Middle Eastern regions have become the colony of the United Kingdom and France after the First World War of the 20th century.\n\nThe relationship between Turkey in Turkey in Europe and Xiao Asia is very subtle, it is located at the junction of Asia, and it has been destroyed by the Undertang Empire. Now it is eager to join the EU.\n\nThe relationship between Europe and North Africa is similar to her relationship with the Middle East, because North Africa is in the Mediterranean Sea, and North Africa is also a harmonious country area. In history, only the medieval period, the Arab Empire has ruled the south of Spain, Portugal and France. Since European colonialism, Africa has become the colonies in Europe, France's colonial, West African colonies established in Central Africa, West Africa and North Africa, is the largest colonial in the African continent. The European colonialists compete for natural resources in Africa, and the situation in the 1950s began in the independent sports in African countries, many countries have independently, and they have improved. Europe and Africa have also developed in the direction of economic and trade.\n\nLike the United States, European developed Australia's initial role in exile of prisoners. However, because Europe and Australia are very far apart, there is a space that has developed, but in the link between economic, cultural and consecutive, Australia and Europe still have a very close relationship. The major immigrants in Australia and New Zealand come from Europe, develop Oceania with local indigenous peoples and other immigrants.\n\nAlthough many of the countries around the world (such as GDP, import and export, Olympic awards, etc.) have to treat the EU as a whole similar to sovereign state, the extent of European integration is indeed a global, but different European countries are There is still a significant difference in internal policies in some areas.\n\nEurope is a world with the highest level of secluded in East Asia. Most of the European countries have no national education, but Norway, Iceland, Finland's constitution still stipulates that Christian Road Dezong is a national education or only the religion of national subsidies, and the Greek Constitution still stipulates that the Orthodox Church is national education.\n\nEU member states such as Denmark, Sweden, Poland, Hungary, Czech Republic, Romania, Bulgaria have not joined the euro zone.\n\nMost of the countries in Europe do not have a death penalty but reserved for life imprisonment, Spain, Portugal, Serbia, Croatia does not have a life imprisonment, but criminals for crimes may be accumulated for hundreds of years or even thousands of years.\n\nOnly Belarus with the law of death penalty.\n\nThe Netherlands is the only European countries that clearly specify and sell cannabis legal. France, Greece, Sweden, Norway, Finland and other countries have severe control on marijuana, whether it is inhaling or buying and selling, and it is not allowed to use marijuana as a prescription drug. Most of other European countries prohibit private planting and sale of marijuana, but in the UK, Germany, Spain, Belgium and Czech Republic allow for use of certain ingredients from cannabis.\n\nRussia, Sweden, Norway, Iceland and Eastern European countries prohibit all forms of sexual transactions, Germany, Netherlands, Switzerland, Austria, Hungary, Greece, Turkey allowed to open brothel prostitution, and the rest of European countries allow sexual transactions but prohibit organizational prostitution.\n\nMost of Western Europe allows countries such as sylining marriage registration, Switzerland, Czech Republic, etc., which allows the same-sex relationship, but does not provide syndrome marriage registration, Poland, Slovakia, Bulgaria and other Eastest European countries, clearly, marriage, can only be anisotropy The civil relationship between China.\n\n\n\n\nParis France\nLondon, England\nBerlin, Germany\nAmsterdam, The Netherlands\nBrussels, Belgium\nLuxembourg - Luxembourg City\nIreland - Dublin\nMonaco (City State)\n\n\nDenmark - Copenhagen\nNorway - Oslo\nSweden - Stockholm\nFinland - Helsinki\nIceland - Reykjavik\n\n\nMadrid, Spain\nPortugal - Lisbon\nRome, Italy\nAthens, Greece\nTurkey - Ankara\nCyprus Nicosia\nVatican (City State)\nSan Marino-San Marino\nMalta - Valletta\nAndorra - Alder City\n\n\nBerlin, Germany\nAustria Vienna\nSwitzerland - Bern\nStandardon-Vaduz\nPoland - Warsaw\nPrague, Czech Republic\nSlovak - Bratislava\nHungary - Budapest\nSlovenia - Ljubljana\n\n\nEstonia - Tallinn\nLatvia - Riga\nLithuania - Vilnius\nUkraine - Kiev\nBelarus Minsk\nMoldova - Kişina\nMoscow, Russia\n\n\nRomania - Bucharest\nBulgaria - Sofia\nMontenegro - Podor\nKosovo - Pristina\nBosnia and Herzegovina Federation - Sarajevo Serb Republic - Bania Luka\nNorth Macedonia - Skop\nAlbania - Tirah\nSerbia - Belgrade\nCroatia - Zagreb\n\nAfrican (Africa)\n\nAntarctica\n\nAsia Asia (Asia)\n\nOceania (Australia)\n\nEuropa (Europe)\n\nNorthern Meitacine (North America)\n\nSouth Asia Mergania (South America)\n\nEurasian non-continent\n\nArmeliqia (America)\n\nEurasia\n\nOceania\n\n \n\nSubmerged continent / land\nKelgalan Haitai · Zilang Continent · 巽 巽 古 陆\n\nSuper continent that may be formed in the future\nUltimate Plant Ancient Continental · Aestian Continent · New Pan Ancient Continent\n\nMythology and guess continent\nKumari Candidam (English: Kumari Kandam) · Remlia Continental · Mc 麦普斯 大陆 (English: Meropis) · Mi Jimland · Unknown Southern Continental · Atlantis 许珀 耳 耳 亚 亚\n\n\n\nAsia\n\nEast Asia Southeast Asia · South Asia Central Asia, Saina / Southwest Asia / Siberia Northeast Asia\nOthers: Near East · Middle East · Far East · East Asia Arc East India · India\n\n\n\nAfrica\n\nCulture Geography: Arab Africa · Black Africa (Latin Africa)\nNatural Geography: Northern Africa / Saharan Africa Sahara South Africa (Eastern Africa · Central Africa · Western Africa · Southern Africa)\nOther: Northeast Africa, Northwest Africa, large Middle East\n\n\n\nEurope\n\nNatural Geography: Eastern Europe, Western Europe, South Ou, China, Other: Southeast Europe / Balkan, Europe\n\n\n\nAmerica\n\nNatural Geography: North America · South America Political Geography: North America · Latin America (China (Central American · Caribbean) · South America) Culture Geography: Angulus America / English Masseari, Latin America (Iberia, Spanish) · · Central America\n\n\n\nOceania\n\nAustralia: Australia, Macau, Miranecia, Micronesia, Polynesia\n\n\n\nPolar\n\nArctic Place · Antarctica / Antarctic place\n\nOther\n\nHolland Area / Asia Pacific · Independent National Association, Arab Region · Ring Medal, Caucasus\n\n\n\nOcean\n\nWorld Ocean · Pacific · Atlantic · Indian Ocean · Arctic Ocean · South Ocean\n\n\n\nClimate zone\n\nTropical: Tropical Rainforest · Tropsterus · Tropical Prairie · Tropical Desert · Tropical Monsoon\nSubtropical: subtropical moist / summer rain type warm and humid side tropical monsoon\nTemperate: Temperate Marine · Temperate Continental · Temperate Mediterranean · Temperature Tempera · Temperature Zone Desert · Temperature\nSub-temperate tape:\nCold zone: Polar Climate · Vice Patent Climate (Moss Climate · Iceland Climate)\nPalace:\nOther: Alpine Climate · Hilly Climate · Plain Climate · Basin Climate · Taiwan Climate\n\n\n\nBiological distribution area\n\nNew North Territory · Gu Beiji · Ethiopia, Dongyang Dynasty, Australia, New Territories, New Tropical, Antarctic "}