{"chinese_title": "Communication ", "chinese": "The research object of communication (English: communication studies) has a variety of expression, overview, communication is the discipline of the transfer of social information or the operation of social information systems. [1] The concept of spreading also has the expression from different subjective perspectives and different focused, the main profile of the propagation is six types: communication is transmitting, communication is sharing and interaction, communication is control, communication is spreading, communication is power, spread It is a game. [2] Through discourse research, these definitions can be explored and several propagation concepts of these definitions.\n\nCommunication is usually divided into five parts: mass communication, organizational communication, collective communication, interpersonal communication, and people. According to the media division, several branches such as propagation, text propagation, non-language propagation, digital communication can be divided. According to the content and purpose of the information, there is also a professional in journalism, public relations, and advertising. The research content in these areas is overlapping with each other. [Source Request]\n\nIn ancient China, people pass information through the station, flying pigeons, bonfire alarms, symbols, body language, eyes, touch, etc. Today, with the rapid development of the scientific level, various communication methods such as radio, fixed calls, mobile phones, Internet and even video calls have emerged, and the spread of information can cover the world and play an increasing role in people's lives. At the same time, the development of communication technology has greatly enriched the theory and content of communication research, and the links between other disciplines are also more complicated.\n\nLaswell's 5W mode:\n\nShannon Information Theory: Source → Encoding → Channel → Decoding → Subcommitte\n\nIts process, in short, the issuer is encoded by the message in language, text or other way, and then pass through communication channels to the recipient, by the recipient yourself, decoded the message from the sender. Taking the radio, this mass media is used as an example. The employees of the radio (issuer) will be accepted (such as news), through the channel of the atmospheric wave (mass media), transfer to the audience (recipient), audience (audience) ) Interpret the sound in your mind to get information.\n\nThe common point of these two modes is the process of transmitting information into a single item, and ignoring the audience's initiative and information from the recipient feedback to the sender's process, the incense is noticed, but the information is transmitted in the social environment. The impact is not the noise can be explained.\n\nIn Ostrid and Schram's mode, each commissioner is both a person who processed information and a person explaining and translating information. They have both information and editing information and make an understanding. This mode is aimed at interpersonal communication, suggesting that the communicator has equal communication opportunities and understanding, while many of the political status, cultural levels and economies in society.\n\nThe interactive mode of Zuverler comes on the basis of Shannon, which is no longer a single propagation, replacing the encoding and decoding to the transmitter and receiver, increasing the impact of each link in the propagation of noise. This mode is more in line with the universal propagation process and deepens scholars' understanding of noise.\n\nIf the propagation is defined as the passage of information, since the original society, the process of human communication spreads has been in progress. But spreading into a specialized discipline starting from the US of the 20th century. Many universities began its establishment of news communication colleges in the 20th century. It was officially established by Schram in the fifteenth century, and China's communication studies started late, and after 80 years ago.\n\nThe rise of the promotion research after a war, making people and the government aware of the power of promotion, and the rise of the broadcasting company has made market research began to pay attention to the preferences of the audience. Many European scholars in World War II include Carl Hofland, Paul Razasfield, and Andono and other scholars have also traveled to the United States. Scholars in these social sciences are later gathered in Washington by the US government to conduct several types of communication research. [3] For example, Carl Hofland et al. About the film convincing, Laswell et al. On the research of publicity content, etc. Some scholars who have contributed to the communication in the war returned to the original field, Schram was born in the war, and the idea of ​​creating a new discipline.\n\nCommunication is a very young discipline, established in the mid-20th century. It is an extremely rare event to establish a new scientific area in the US university. Since 1900, that is, after 5 traditional social sciences (economics, psychology, political science, sociology, humanology), only very little academic fields can develop. As the establishment of the propagation discipline, Schram does make an irreplaceable contribution. He created the first communication college in Illinois University in 1947, which is the world's first person with the propagation professor and the head of the head. In 1948, he wrote the first communication course \"The Spread of Modern Society\", Schram founding the signal of communication is the first authority of the first authority in 1949 - \"public communication Publishing. [Source Request]\n\nSpread can be divided into the following categories: "}