{"chinese_title": "sculpture ", "chinese": "Sculpture is a visual art of three-dimensional spatial maternal image made by material materials and means. Sculpture is the earliest use of graphics (by reducing materials) and plastic (by superimposing materials), in materials such as stone, metal, wood, ceramics, etc., but modernist sculptures, materials and creations There is a high degree of freedom, which can be used to create a variety of different materials using carvings, welding, molding or casting.\n\nStone sculpture (STONE Sculpture) is more preserved after a long time, and the sculpture left by the ancient culture is mostly the stone carving and ceramic art. There are also a lot of traditional woodvites in the same time, but many have been decadentable. Many of ancient cultural sculptures have had a bright color, but now most of them have faded [1].\n\nIn many cultures, sculptures are the center of religious worship. They have been very expensive until recently, and large sculptures are still very expensive. It is not a general personal ability, so many large sculptures are religious or political products. Like ancient Chinese sea, India, China, South America and African ancient culture leave a lot of sculptures.\n\nThe sculptures in Western cultures originate in ancient Greece, many Greek sculptors have created many outstanding sculptures during classical Greece. In the middle of the ancient century, Gothic sculptures showed the pain and passion of Christianity. The metichetic works of the Renaissance, like the David of Mi Kaikojo is the famous works at the time [2]. Modernist sculptures are less increasingly conventional processes and humans, and the collection art (English: Assemblage (ART)) and pickup (English: Found Objects) are presented as their work.\n\nSimple classification of sculptures can be divided into round carvings, reliefs and openness. Circular carvings Similar to the statue, referring to the three-dimensional sculptures that can be enjoyed from all angles, and because the appreciators may appreciate the work from any angle, each side needs to plan [3]. There is at least one of the embossed is attached to the background, and can be classified as a discussion and high relief according to the projection method [4]. When there are many things in the work to be narrative, the way to use circular engraving is not easy to presen, and embossed is usually used. In architectural sculpture (English: Architectural Sculpture) and other items (like pottery, metal products or jewelry) are decorated with small sculptures, it will also choose embossed. Openwork revoles are a sculpture between circles and reliefs. On the basis of relief, the hollowed background is divided into single-sided permanent and double-sided permeable.\n\nAnother classification is classified according to its work, and the vulture is removed from the work, and the plastic is to complete the work in a manner of shaping the material. It can be sculptured like cast, stamping and molding, and multiple identical finished products can be made at a time.\n\nSince ancient times, huge sculptures have a strong attraction to people. The highest statue is the 2018 Indian unity statue, 182 meters high (597 feet) [5] [6]. Another magnificent statue is the riding statue of the Knight on the horse (English: Equestrian Statue), which is not often seen in the last decades. Among the body sculptures of the real people, the most often look at the avatar, or half body (English: bust (sculpture)), only for half your chest above. Small sculptures include small statues (English: figurine), generally less than 18 inches (46 cm) statues, or embossed squash, medals or coins.\n\nModern and contemporary arts have joined many non-traditional ingredients, such as sound devices (English: Sound Sculpture), photovoltaic, environmental art (English: Environmental ART), environmental sculpture (English: Environmental Sculpture), Lock ON (English) : Lock On (Street Art)), dynamic art (English: Kinetic sculpture) (related to the movement of objects), earth art, field-specific art. Sculptures are an important part of public art. If there is a collection of sculptures in the park, there is a sculpture park (English: sculpture garden).\n\nThe most common use of sculptures is related to religion. There will be gods in many cultures, these gods are more than an ancient Greek art, such as the Olympian Zeus God Statue). In the most innermost sanctuary in the Egyptian temple, although there is no maintenance to the present, there is evidence that its size is not large, even in the biggest temple. The same is true in Hindu, common is very simple and old Linga. Buddhism brought these religious sculptures to East Asia, and there is no similarity tradition before East Asia, but some simple shape of sculpture (like 琮 琮) is a weigher used.\n\nThe concept of small sculpture as a personal property can be traced back to the earliest prehistoric art, while the sculpture of public art is generally the power to show the rulers to the viewer. This type of sculpture can be pushed to 4,500 A year ago. In archeology and art history, the appearance of huge sculptures (may also include disappearance), but it may be quite difficult to trace the time point that appears or disappears, because some use like wood or other can't save long-lasting Materials, and may not leave a record [7].\n\nTotem pillars is an example of the large artwork made by the ancient use of wood, and the residue cannot be found in archeology. At that time, it could concentrate on producing large commemorative sculptures, including many materials for long-distance transportation, as well as those who hired sculptures (should be a full-time job), which means that they have been more advanced, social organizations and division of labor. Recently, the bronze era sculpture found in the Samsung Site in China, and its size is twice as many people. Many impressions on Chinese ancient culture have been rewritten. The Chinese bronze sculpture for Chinese ancient culture is more small [8].\n\nThe Indian River Basin Civilization is also an old and advanced civilization, but there is no huge commemorative sculpture, but there is a fine little god and seal. Other cultures, like ancient Egypt and Easter culture (English: History of Easter Island), which will put a lot of resources on large commemorative sculptures very early. China's Qin Shihuang Terracotta Warriors is a large number of real people in the Tomb of Qin Shihuang.\n\nFor the collection of sculptures, you can trace back to the Greek, China, and the two river basins, and also showcase the collected sculptures in half-disclosed models. Since the twentieth century, the restrictions on the topics in the past have been greatly relaxed on large sculptures, and there is an abstract theme and any type topics today. Many of the sculptures now have planned a period of time in the museum and gallery, so how to ship and store is also one of the considerations when making large sculptures. Small decorative figures (English: figurine) are mostly ceramic materials, today is quite popular, but often being modern art and\nContemporary art is ignored, and in the past, there are often such artworks in the era of Rococo, and in the ancient Greek Tower Tatanigra figurine (English: tanagra margarines) has formed an industry, in East Asia and the former Columbus Period (English: pre- There are also many similar sculptures in Columbian ART. Small sculptures with furniture and other items are in ancient times, such as Nimrudi Ivory products (English: nimrud ivies), Baghram ivory products (English: Begram Ivories), and Tamon grave Funeral products.\n\nThe portrait of the sculpture is starting from Egypt. There is a ruler of the 32nd century BC in Nalmai Temple, and 27 ancient sub-statues in Morco Namia (English: statues of gudea) It is the image of the Lagshist, 2144-2124, West Yuan. In ancient Greece and Rome, you can have a maximum honor mark in the public place. It is also the wish of the elite part. If there is an open statue, it may appear on the coin [9]. In the country of Egypt and Near East, the statues of the open space are almost the privilege of the rulers, and the statues of other rich people will only appear in their cemetery. In the former Columbus during the Americas, generally only the portraits of the ruler, the earliest may be the huge head (English: Olmec Colossal HEADS) for about three thousand years ago (English: Olmec Colossal Heads). There are many statues in East Asia to be religious. The sculpture of the Mediterranean period is revived again in the middle of the August Edition. At the beginning, he only appeared in the tombs statue and coin, and later launched a large decoration period, and there was a new type, such as a personal portrait medal.\n\nAnimals are one of the topics in human sculptures, some are realistic, but they are also a fictional animal or a monster. In the Chinese grave and temple, it will use the stone carving of animals as a decoration. Plant sculptures are common in jewelry and some ornaments, but large sculptures in Byzantine art and Islamic art are also plants as the theme, and there are also plant sculptures in Eurasian tradition, like brown leaves and vines such as brown leaves and vines. It has been used twenty years ago.\n\nAnother common sculpture in prehistoric culture is an increased version of daily necessities, weapons or containers, and material is not practical, which may be used in etiquette or exhibiting. Like China, Olmek Civilization or Neolithic Age Europe (English: Neolithic Europe) will use jade, and the early large pottery in Metomya is made of stone. Europe and China will also use bronze to make large ax and swords, such as Oaksborne deck (English: Oxborough Dirk).\n\nSince the sculpture of the material is quite a variety of clay, stone, wood, metal, gypsum, resin, ivory, British composite soil (English: Milliput). I develop a few categories:\n\nSculpture production methods are engraving, plastic, pile, stickers, welding, knock, editing, etc.\n\nSome sculptures are quite sensitive to the conditions of the environment, like temperature, humidity, and exposed to light and ultraviolet rays. Acid rain can also destroy specific building materials and stone carvings, because of the calcium reactions in the rain (limestone, sandstone, marble and granite), forming gypsum and peeling.\n\nMany contemporary sculptures will be displayed in public cases. If the sculpture can be recognized immediately, it is generally not easily stolen. However, in the early 20th century, the value of metal is high, so large bronze sculpture may be stolen by millions of sculptures because of the attention of the thief, melting into metals due to the value of the thief due to the attention of the thief. After selling it later. The price of the sold metal may only be small in the value of the original sculpture [10]. "}