{"chinese_title": "myth ", "chinese": "In folklore, myth is a sacred story about human and world changes. [1] In general, \"myth\" can refer to any ancient legend, [2] express the national ideology by the form of the story. [3]\nMyth origin is from the primitive social period, and humans explain the natural phenomena through reasoning and imagination. However, since the knowledge level is very low, it is often covered with a mysterious color.\n\nMost of mythology is mostly superman's strength, the idealization of the understanding and wishes of the original humans.\n\nThe history of the primitive society of many nations is starting from mythological stories. Most of the characters in myths come from the original human figure. The hunting is relatively developed, most myths are related to hunting; the myths created by farming and developed tribes are involved in agriculture. The hero in myth is also a knife ax, the bow is a weapon. From mythology, you can see some of the people's deeds.\n\nWhether it is the original social nation in the earliest area of ​​world civilization, it is still in the nation of the primitive society in the world, and many myths they have spread are similar.\n\nMyth is also the primary river of literature, and it is the earliest oral essay work. For example, \"Zhuangzi · Emperor\" said: \"Thailand, his is awkward, and it is true, one is a horse, one is a cattle.\"\n\nMyths have certain geographical and regional, different civilizations or nations have my own myth meanings [4].\n\nIn academic, scholars must have a few conditions:\n\nAnd mythical concepts have legends and folk stories. These three words refer to different types of traditional stories. [11] Unlike myths, folk stories can happen in any time, any location; people inheriting folk stories do not treat them as real, sacred. [5] The legend is generally used as true, but the legend is generally happening within the closer event segment, the legendary world is almost the same. [5] The protagonist of the legend is generally human, mythically protagonist is generally supernatural roles. [5]\n\nThe three concepts of define myths, legends and folk stories, just to classify traditional stories. [12] In many cultures, there must be a clear boundary between myths and legends. [13] Some cultures only divide the traditional story into two categories: folk stories and myths. [14] Even myths and folk stories can not be completely distinguished, a nation thinks is a fictional story (folk story), may be regarded as a historical fact of another nation (myth).\n[15] [16] In fact, after a myth is lost, it is more like a folk story, such as the previous European giant, the fairy and human heroes have the gods, and it is a folk story after the Christian propagation. . [6]\n\nMyth is roughly divided into three categories: creation myth, God's myth, hero myth. Among them, it is most important to create myth.\n\nBut not to mention that every nation will have the above types, and some nationalities may talk about human origins, but they did not say the origin of cultural, but in this way, they can still summarize a common point, that is, the \"universe start\" Evolution to \"Order Rules\".\n\nThe word myth in English comes from the word Mythos, Greek, and its original text includes \"words\", \"words\", \"story\" and \"fictional story / novel\", etc .; due to its invalidity And often with the \"Road / Science\" (LOGOS) in Greece, in modern academic research, myths are often not \"false stories\", \"misunderstanding\" synonyms, in different academic research, \"myth\" term Three main uses, namely etiquette / human learning, literary usage and symbolic learning:\n\nOne theory believes that myth is evolved from a real historical event. [17] [18] According to this theory, the ancient story of the ancient story has repeatedly described a history, and the characters in the story are gratiate. [17] [18] For example, some scholars believe that the myth of Fengshen, the myth of Russia is from an ancient real king. He teaches people to use sailboats, master the skill, and later spread into Fengshen. [17] Zeus is a broad king and is buried after death in Crete. [19] The ancient Greek writer in the 5th century BC He has supported this claim. [18] Greek mythologist Jishi Ros (ancient Greek: ὐή ὐή ὐήερος [Euhēeros], born in the first 4th century) is the most famous person who holds this theory, this kind of thought is also known as \"Jishi Ros) \". [18] [20]\n\nSome people think that myth comes from the palm. For example, the ancient Greek gods look at the interpretation and metaphor of natural phenomena, representing the sun, Puerton represents water. [18] Similar theories believe that myth is the carrier of philosophical or spiritual concept: Attendant represents wisdom and fair, representatives of Aphrodite represent the desire. [18] The 19th century Sanskan scholar Max Miler supports mythical trapping theory. He believes that myth is originally a metaphorical description of nature, and later gradually be understood by literally. For example, people often use rhetorical techniques to describe the sea \"restlessness\", and later the bodies in myths are described as violent. [twenty one]\n\nSome scholars believe that myth is the proposed manification of lifeless objects and strength. For example, the ancients worship fire, air is natural, and then gradually imagine them into gods. This theory is called \"mythopoeic thought). [22] According to this theory, the ancients often see people with no life as subjective people. [23] Therefore, they describe the natural events as the god people, these gods often have human character. These stories have formed a myth. [twenty four]\n\nAccording to myths - ritual theory, all the myths and ceremonies are inseparable. [25] The most extreme, all myths are the explanation of early humans on ceremonies. [26] This theory was earliered by the Bible scholar William Smith. [27] According to Smith's theory, people have nothing to do with the original ceremony and myth. Later, we forgot the original reason, try to edit some stories to explain the ceremony, and claim that the ceremony is to commemorate the incidents described in myths. [28] Anthropologist James Fraser also holds similar theory. He believes that the primitive people fell to magic, and later people lost their confidence in magic, invented my words, and said that they held the religious ceremony of the magic ceremony for appealing the gods. [29]\n\nSome religious historians believe that one of the most important functions of myth is to build behavioral modes [30] and provide religious experience. [31] Through each other, members of the traditional society temporarily separate themselves and the current world, let the soul return to myths, thus making them more close to the sacred world. [8] [30] [32]\n\nIn some cases, the society will try to reproduce the scene in myth when review myth. For example, people will reproduce God's cure means used in creation, hoping to cure people who are currently sick. [33] Roland Bart also agreed with this point. He believes that modern culture also makes similar things. Due to science unable to define human morality, people still have access to a more aftern era by religious experience. Those ancient times have higher moral standards in people's minds, and the current technology era is completely different. [34]\n\nThe religger Joseph Campbell Defines the Myths There are four basic functions: mysterious function (make people feel the universe), scientific function (explaining the world operation mode), sociological function (support and verify social order), education function (explain humanity How to live under various conditions). [35]\n\nIn a culture, myths usually play four functions [36]:\n\n1. Digital function: can be used to explain the root cause\n\n2. The function of the universe: emphasizing that all things in the universe are part of a large picture\n\n3. Social function: Promote members of members of social norms through myths\n\n4. Psychological function: provide a model of personal behavior\n\nFor details, please refer to mythist list, the following is listed below.\n\nCompare mythology refers to comparing different myths to identify their common topics and characteristics, or the myths branches with the system, such as Mongol's myths and Turkic myths, the origins of the two are 古aluna, maybe because It is produced by the nomads to communicate or separate from each other.\n\nPlease refer to comparative mythology for details.\n\nKessu mythology "}