{"chinese_title": "politics ", "chinese": "Political Science, or Political Science (Politics or Politology) is a social science discipline to study political behavior, political system, and political related fields. In the West, the study in the academic field is also known as political science, political research, or only political words. \"Political Science\" means that in the academic research field, \"Political Research\" represents a wider range of research. As the name of the discipline, \"political science\" and \"political science\" are basically synonymous, but \"political science\" is more focused on empirical-based empirical research, especially quantitative studies.\n\nPolitical researchers are known as political scientists (Political Science). The academic norm of modern political science requires political scholars to maintain strict value in political affairs as research objects. However, due to the political engineers' own involvement of political processes, or their ideology and value position judgment, the reality is often more complicated. On the other hand, the politicalist is proposed to say that it is an ideal political framework for other critics, such as reporters, special interest groups, politicians, and voters analysis and choice. Although most politicalologists are generally only academic activities, some political scholars may also become a consultant for certain politicians, and even their own investment in politics. Politicalists are often working in government departments or work for some parties. They are also possible to participate in non-governmental organizations or other political movements. People who have been accepted by political education and training may also have experience and value they need for commercial enterprises and groups. The private enterprises related to the study organization, and and public relations may also hire politicalologists. Taking the United States as an example, political scientists are known as \"American ISTS\", focusing on various data such as elections, public opinion and public policies (such as social welfare reform), foreign policy, US Congress power, and Supreme Court Stand on some topics, etc.\n\nThe initial start of political research begins in ancient Greece, political science after birth. However, the predecessors of this discipline are obviously ethics, political philosophy and history, as well as other academic fields surrounded by national characteristics and functions. In almost every historical age and in every place, we can see some people specializing in research and studying politics.\n\nThe predecessor of political science even dates back to Plato and Aristotle, especially in the works of Horodod, Homer, Hessic, Xiritore and Ouri Hills et al. Later Plato began to analyze the political system of Greek City State, and they originally extracted their research and analysis of literature and history, and applied to the philosophies we call. Similarly, Aristotle has established research based on historical experience in the analysis of Plato, and has developed politics in comparative methods, and it is known as the father of political science. . \"The\" Ideal States \"and Aristotle's\" Political Science \"and Aristotle is more considered to be the founding of political science. In particular, Aristotle pointed out the correct direction of Western political research in a considerable extent [1].\n\nDuring the Roman rule, with the rise of Style, the famous historians such as Bobibibi, Top Li Wei, and Putak also recorded the Rome's Republican rising process, and the organization and history of other countries. And the politicians such as Caesar and Sichyro make us more understanding the political and war of Rome at that time. At that time, political research was mainly based on the means of learning, government governance, and the situation described by the government. Sicrosro is defined in the country (Res Publica, \"Public Life\"), designing the operational model of power refrigeration, and develops natural law thinking.\n\nWith the fading of the Roman Empire, the stage of political research is more spread. The rise of a god, especially the rise of Christianity in Western culture, producing more research spaces in political and political behavior.\n\nIn the medieval period, based on the administrative education in Europe, political science has not yet become an independent discipline, and the political issue is tended to be interpreted by religious doctrine. Therefore, the so-called political science is affiliated to theology. However, the church and the court have a quite extensive research on political research. The political study at the time was represented by the godfather's godfatherology and the philosophy of Thomas Aquarium.\n\nThe book of the \"God of God\" in the \"City\" of Augustine Hippo met the philosophical and political tradition of Christianity, redefined the domain boundaries between religion and politics. Most of this era political issue is around the church to clarify and compete with each other. Aquika has combined Greek philosophy and Christianology, and demonstrates the possibility of belief, rationality, morality and political bore.\n\nIn the Middle East and later other Islamic areas, Omar Hay Yam, \"Lugai Collection\" and the Estimi of the King of Phil Doctise have provided political points, while other Aristi Dove's Islamic scholars such as Avisena also continued to study Aristotle's analysis and empirism, and wrote many comments against Aristotle. In ancient China, the research on politics is mainly formulating the system of ritual music, military prison, and judges, and has considerable differences in modern political research [2].\n\nThe Renaissance is an important turning point for Western political research. Political science began to get rid of the theology of the theology, and people observe and explain political phenomena with rational and experience. The Italy's Niko Makiaville has established a research focus of modern political science. For political institutions and political participants to do direct observations, their works \"Monarch\", teach monarchs, and the political means of the consequences, Content and Christian doctrine conflicts are very large. The completion of \"Monarch\" is considered a milestone that is fully separated by Christianity. Later, in the enlightenment era, the expansion of the academic field has further extended the scope of political research, and it has exceeded the research on the decision-making basis.\n\nFrench political thinkor lets · Budan systematically discusses sovereignty issues. He believes that sovereignty is the basic attribute of the country in \"Republic: Les Six Livres de la Républiques\", is the basic attribute of the country, and is the first and inseparable. And think that in order to avoid social turmoil, it is necessary to strengthen the absolute authority of the monarch. His political theory has not yet got rid of the impact of the Middle Ages, but his sovereign theory has promoted the formation of modern nationalities and the pioneer of rational political science [2].\n\nIn the emergence of Newton, 18th Century, when the construction of modern scientific theories, political science also started scientific research in the same discipline, in Newton's world, using the results of the experimental method to sum up as knowledge, believe in nature, Responding to mathematical interpretation, etc., all of the political research has issued a new direction. At the same time, a large number of ideas, politicians have advocated the various political ideas of politicians, including the talent human rights, social contracts, decentralized balances and other learning and natural law, natural rights, sovereignty, freedom, democracy, equality, happiness, etc. Become a dominant framework for political research. When Hobbes and John Locke explore the origin of the government from different hypotenses and their legitimacy issues, Western political science began to enter logical rationalistic traditions.\n\nThe 19th century thought inherited the ideological tradition of enlightenment, including Historicalist Hegel, Kongde and Marx, as well as the Evolutionary Theory Socius, Merin, Synnis, etc. As political research is increasingly becoming a science, researchers pay more attention to the inventive and analysis of historical facts to explain political phenomenon. John Mir, Robert Michels, Max Weber et al. Is a typical representative.\n\nModern political science has originated in the United States in the 20th century. Political Science Become a formal discipline and a system in the 1880s in the 1880s, the establishment of a Political Research Institute in Columbia. The process of integrating past political research as a discipline, the history of political science also provides a wealth of research fields for political benchmarks and empirics, and every part of the discipline has some common history. But at this time, the national public law, political system, history is the most famous in Germany.\n\nAt first, political student includes explaining economic phenomena, without economics construction, but under the development of modern science, economics is made by political economics, and economics tend to study people's behavior, political research. The field is more focused on power distribution, the country, and system. After the end of the Second World War, a political branch related to sociology, economics and law is closely related to international relations becoming more important. Over time, national relations or international political research methods have also have a big difference with political science.\n\nIn the 1950s and 1960s, David Easton, Gabriel Almond, etc., promoted the scientific research of individuals and groups in the academic field from the original system and severely discipline. . At the same time, political analysis is also facing deeper and complex parts, but also makes political science and other different disciplines more closely, especially sociology, economics, history, anthropology, and statistics. Researchers in political behavior are also increasingly dependent on scientific methods, such as quantitative research, methodology, etc., the foundation is confirmed and inferred on political trend, and summarizes the political behavior of human and groups. Explanation. In the previous generation, the political discipline is increasingly focusing on how to solve political and social issues in the reality of the reality, or to study how to solve political and social issues in the use of new methods and pathways.\n\nContemporary politicalists focused on the development and distribution of decision-making power, as well as political systems and their roles - including general government and international organizations, political behaviors, and public policies. They use many factors to assess the success of governance and specific policies, including stability, justice, material wealth, and peace. Some politicalists attempt to analyze politics to pursue further empirical scientific themes. Other politicalists analyze politics with the subject matter of the subject to propose specific policy recommendations.\n\nBased on the different opinions of politics, there are different opinions on political research objects.\n\nThe National School believes that politics itself is a national activity, so political science is the science of researching countries [3]. The political scholar headed by David Easton believes that the research object of political science is the power of power and authority and interest [4], this view is for later government research and multi-diverse development. There is a great influence [5]. Another point of impact is that political science is science in studying the political relationship between human society [6]. It is also believed that political research objects are public affairs [7]. The \"Blackville Politics Encyclopedia\" believes that the research object of political science is the government and public policy.\n\nTraditionally, political research is generally divided into two major categories of political philosophy and modern political science [2].\n\nTraditional political philosophy research political issues mainly from the perspective of philosophical thinking, from the perspective of morphine, the highest guidelines, democracy, justice, freedom, equality, etc., and corresponding political design are the focus of their research. Most politicalists generally set up an universal humanity by priori, and then set a set of high guidelines in accordance with human beings through logic deduction, and then design the corresponding political system according to this guideline.\n\nEarly institutionalists were influenced by traditional political philosophy and European mainland countries, mainly focusing on the top-down system design issues. It is believed that the system is the basic factor affecting human behavior, and the research of political institutions is mainly understood by the law and institutional constraints of power distribution and human behavior in the political system. It is mainly conducted by institutional research methods and historical comparative methods [2].\n\nThe system research method is based on political institutions, mainly research legislation, administrative and judicial and other political institutions. The main information of research is the constitution, legal, government documents, parliament agenda, etc., analyzes the political value of specific society from these materials, and The political institution or system that meets a certain purpose is designed.\n\nThe general summary of the lack of institutional research method, and the historical comparison method is enabled. The historical comparison method focuses on comparing the system between different countries, comparing different systems, and comparing the historical changes of various systems, by summarizing the universalization rules.\n\nBehavioactist against the study of the study and interpretation of political philosophy, also opposing the static description of the institutionalism and simple realistic, and believes that political research objects should be actually exist and can observe. The behavioralism pays attention to the collection and finishing of data, often uses mathematical models, simulating experiments, direct exploration, and field observation technical means for research. The main principles include accuracy, pure science, quantitative research and value removal. Its main theories include:\n\nRational choice Theory is like behavioralism, from individuals to observe and analyze political phenomena, but do not take the method of summarizing, but first assume an individual to seek its own interests, and then calculate and interpret in various situations Action that utilitarize the principle of action can take action.\n\nRational Choice Theory origins from public choice theory. Including the public selection model of James Buchanan, Anthony Downs' bureaucratic economics, Olsen's collective action theory and Rile's political alliance theory. He has gradually developed the theoretical form of alliance theory, trading theory, game theory, voting analysis, and departmental decision.\n\nStructuralism believes that there are different structures in the world affect political phenomenon. The factors of the structure include geof factors, economic strength, social norms, values, etc., environmental factors have spawned, limited political phenomena, and even make individuals unable to make independent decisions. The environment can be changed over time.\n\nIn the political academic community, there have been structuralism and rational selection, structuralists believe that the environment determines that people's choice, but the rationalists believe that people's decisions are factors that affect the environment. This makes the political phenomenon unable to avoid balance factors.\n\nSince the 1980s, the United States has raised the new institutionalism, reinstalling the research path of institutionalism, paying attention to the dynamic movement of the research system on political activities, especially the relationship between the system and behavior and the concept. As a reaction to behavioralism, the new institutionalism believes that from individuals to study the overall concept is wrong, the overall is not a simple addition of individuals. Its main genre:\n\nComparison of politics to study different governments in various ways. Take the United States and Canada as an example, it also includes research on local areas; it is to study specific states, provinces or administrative regions. Political theory includes a benchmark study on governments, ideology, regime, political movement, and political philosophy. International relations focus on the relationship between research countries and countries, and recently began to study transnational topics such as natural environment, population smuggling, trade, social exercise, production process division, and strikes against terrorism. The complex relationship between political and economic activities, responding in the field of political economics, politics Economists try to understand the relationship between economic architecture and theory and politics. The Interactive Relationship between Political Sociology and Society. The Relationship between Man and Political Behavior in Biological Political Research Institute. Political Phenomenon from Geographic Phenomena. Research Political System and Political Behavior from the Angle of Cultural Anthropology. Research on political elites, political behavior, and interaction between the two is the field of political psychology. Public administration research public policy implementation, decision, and results. Try to explain the role, bureaucratic politics, and interest groups on the political architecture, and the results of the public policy, and the results of the entity public world implementation policy. "}