{"chinese_title": "Religious Studies ", "chinese": "Religion (English: Religious Studies, also known as Study of Religions), is a learning of religious beliefs, ceremonies, behaviors, and institutional learning, is a modern history of modern history in social sciences. Collar disciplines have life and death, theology, philosophy, funeral, etc., generally considered to be the first defined by Max Miler, and the father of religious school.\n\nIt is generally believed that the goal of religious studies is religion, and it is believed that before religious development and its characteristics and its characteristics. For example, witchcraft, mysterious, ghost worship, and the composition of religion and philosophy, and religious beliefs. There are also many suspected religious worships in the prehistoric era, but there is still no conform to definition with today's religion.\n\nGenerally referring to the cross discipline of a variety of religious formation, development, changes, results, theory, and works, a human literature and social sciences. Religious and theology use religion as research objects, and the difference is that religion is observing and analyzing religion from various perspectives from religion, and often combines with other relevant disciplines such as sociology, humanology, psychology, historics. Religion is more emerging disciplines compared to theology, for example, in the 1950s in the United States, there is religious related department.\n\nAt all stages of human history, there were research on religious beliefs at all stages of human history. At that time, as a contemporary discipline, religion originated from Europe. The countries that have emerged in contemporary in contemporary, including the United Kingdom, Netherlands, Germany and Nordic countries.\n\nAt the end of the 19th century, Oxford, British Oxford, a \"comparative religion\", Max Miller was appointed as the first professor. He is often considered to be the first work of religion in 1873.\n\nAt the beginning of the 20th century, many of German universities have begun to teach other religions and beliefs outside the Christianity. In the University of Germany, in 1912, the first independent religious profession was in Leipzig University.\n\nIn 1964, he was responsible for the establishment of the first religious research institutions in the country - the World Religion Institute of the Chinese Academy of Sciences, and the master student, doctoral student, doctoral student, from 1985, from 1985 to cultivate religion Undergraduate students cultivate a large number of religious studies. He is committed to studying the history of Chinese Buddhist history and Chinese philosophy in materialism, and has repeatedly speaking abroad and conduct academic access. This is the beginning of the new Chinese religious research research.\nIn 1989, Mr. He Guanghu graduated from Dr. Ji Yue, opened the prelude of the small climax of Chinese mainland religious studies. He hosted his wife, the famous religious sociologist Gao Shi Ning, introduced a large number of religious research classics, based on the \"religion translation of Renminology\" and Sichuan People's Publishing House, \"Religion and World Series\" in China Renmin University. . This batch affected the earliest intellectuals interested in religious research in mainland China, which laid a solid foundation for religious research in mainland China. This is the stage of development of new Chinese religious research research.\nSince 2000, China's mainland has successively opened a religious school, or the research room, marking the religious study in mainland China enters a new stage. Among them, in China, the Chinese Academy of Social Sciences, Renmin University of China, Peking University, Central University for Nationalities, Fudan University, Nanjing University, etc.\n\nReligious History starts in the end of the 19th century, studying the disciplines of religious origins, development and its nature, intersecting disciplines such as archeology and ancient language, can also only study a history of a particular religion (such as Buddhist history), or only study some The history of factors (such as the history of religious concepts).\n\nReligious anthropology begins in the 19th century, studying the religious beliefs and its various factors in the original nation in the non-text stage, exploring the original religion of the ancient times. Different from religious sociology, it is more than the original religion. With the development of Western colonial expansion and missionary activities, religiousologists conduct field inspections in the original tribes of Oceania, Africa and other places, mastering a large number of indigenous cultures and their religious materials, making religious anthropology developed rapidly. Religious anthropology focuses on traditional field surveys, statistical and symbolic systems, and intersection with folklore and ethnic students. The representative said that there is a spoon, and there is a spoon, witchcraft, the original aim, functionalism and mythological structure.\n\n(Religious phenomenology (English: Phenomenology of Religion) is part of the phenomenological movement, and its essence and research purposes are still controversial inter-religious scholars. Religious phenomena can be summarized into descriptive, divided intokimor, explore the nature, significance and The purpose of the structure. And the method of religious phenomenology has been regarded as art.\n\nReligious philosophy\nOne of the main philosophical research tributaries, the main research topics are the existence, religious nature, creation, miracles, religious behavior, sinful problems, and compare the relationship between religion and science or other moral standards. There is a belief that the beliefs can also study religious philosophy. It is a branch of humanity and philosophical research, and it is also a more basic philosophical study that most people can do.\n\nReligious sociology is the emergence of the gods, the social factors of belief God and the impact of religious beliefs on social life. In fact, religious sociology is the interrelationship between religion and society, and is the discipline of sociology branches.\n\nReligious psychology was founded in the late 19th century, and it was founded by William James. He discussed religious experience in his work \"all kinds of religious experience\", and the research objects of religious psychology include individual and group unique psychology in religious activities. Phenomenon, the impact of religion on the development of personal psychological processes and individual characteristics, generalized religious awareness and religious emotions, study religion origin, function, consciousness, conscious cause, conscious development, religious experience, psychological response, religion symbol Psychological effects, etc., involving observing psychology, experimental psychology, mental analysis and deep psychology. In terms of religion origin, the main school has a cognitive saying that emotions said and intended. On the issue of religious function, it is mainly considered to have functions such as advice, value, understanding, and socialization.\n\nSuch as religious basic laws, religious legislation.\n\nFor example, talk, deafness, etc.\n\nContains Life Ethics, Ecological Ethics, Global Ethics, Exciting (English: The Golden Rule), interpretation and analysis of religious perspectives.\n\nSuch as Dunhuang Art, Bible Art.\n\nSuch as totem, classic, performance.\n\nSocial sciences such as business, transactions, management.\n\n[1] "}