{"chinese_title": "Sex ", "chinese": "Sexual science or sex (English: Sexual Science, Sexology), is a systematic study on human sexual performance, including human sexual fun, sexual behavior, sexual function ... [1] Sexual term usually Contains non-scientific research, such as social criticism and political research [2] [3].\n\nModern sexology is an interdisciplinary field that uses research methods from different fields, including biology, medical, psychology, statistical, epidemiology, sociology, and criminalization to study research. Sexually studying humanity growth, sexual relationship, mechanism of sexual behavior, and sexual dysfunction. It also studies the sexual group, such as physical and mental disorders, children and elderly. The mainstream studies also conduct research on sexually transmitted diseases, including erectile dysfunction, high blood pressure and leathers.\n\nIt should be noted that sexuality is a descriptive study, rather than indicative learning - sexuality is trying to record the facts, not what behavior is appropriate or moral. Therefore, sexuality will often bring disputes, some people support sexual studies, and some people think that sexually spying is too private, sacred, or disgusting things for a scientific study. Original research? ]\n\nThere is still some ancient manual, including the \"Art of Love\", Vatsyayana, and \"Ananga Ranga\" and \"Aromatic Garden\" in Watsyayana. However, these manuals have not been sexually regarded as research issues in the formal field of science or medicine. Alexander · Alexander Jean Baptiste Parent-Duchatelet visited 3,558 Paris's registered prostitutes early in the 1930s, and in this way \"from public health, morality and In the administrative side, the Paris City is published by this one year (1837) (1837). This study is generally considered to be a modern first sexual study [2 ].\n\nScientific research of human behavior begins in the 19th century. At that time, the European countries showed some major changes, so the conflict law at the time introduced the law related to sexual freedom, but on the other hand, the same-sex behavior is crime.\n\nDespite the social atmosphere of the Victorian era, the social atmosphere is full of society, but in the end of the 19th century, sexual liberation movement begins in the British and German germination. In 1886, Richard von Kravt-Ebin Burg (English: Richard Freiherr Von Kraft-eBing) published a research book that was considered to be scientific scientific scientific research - \"Psychopathia Sexualis) [4].\n\nIn the United Kingdom, the father of Harvey, Harvey, Ellis, challenged the trendy social atmosphere, such as the taboo of homosexual and masturbation, he took his own research to change the concept of time . The \"Sexual Invrsion\" published in 1897 pioneered the primary river of sexual studies, and studied the sexual relationship between gay, including adult male and boy. Ellis is the first objectively studying gay researcher, because he didn't describe it into a disease or an un moral / crime. This study assumes the love of love and the age and psychological gender. He also makes other important cardiac concepts, such as autonomous behavior, quiet. Then both were further improved by Freud. [5]\n\nMagn Hefield, Germany, like Ellis, has created a primary river studying across sex phenomena. He defined the word \"cross gender\" and score it with the same horizontal, forming a new category [6]. Ellis pays attention to the study of the easy-to-hawford, but he is dissatisfied with the term he chosen, so he first created \"Sexo-aesthetic Inversion\" in 1913 to refer to this one Phenomenon [7] [8].\n\nIn 1908, the first natural semester - \"Zeitschrift Für Sexualwissenschaft) was officially published and published in a monthly updated manner. The journal has published Alfrad Adler, William Situk (English: Wilhelm Stekel) and the academic key of Freud [3]. In 1913, the First Sexual Academic Association - The Society for Sexology was formally established [9].\n\nIn the late 19th century and early 20th century, Sigmund Freud developed a set of theories based on his research on his patient. The gerotic development stage he proposed is in turn, anal period, sexual performance, incubation, reproductive period. He believes that these stages will be in infants to adolescence, and they have been continuously experienced after youth. [10].\n\nThe German Germany of the front Nazi period is based on the French Civil Code of Tilting Liberal, organized and boycott the Anti - cultural culture of the Victorian era. Therefore, some of Germany's traditional scholars transferred the focus on \"sex\" to make Germany's leadership. A doctor of Hechfield is a bluntty gender minority group support, and he established the Scientific Humanitarian Committee - the first organization that supports homosexual and denatant rights [11].\n\nMagnus Hirschfeld has also established a degree of sexual study center (English: Institut Für Sexualwissenschaft) in Berlin in 1919, with a collection of 20000 books, 35,000 photos, a large number of artworks. Many people from different places in Europe have visited the Institute, in order to increase the knowledge of sexual understanding, and seeking solutions for their sexual relationships and sexual dysfunction.\n\nHechfield has developed a system for the type of heterosexual male and female determination medium to show the potential diversity of human behavior and is separated from the gay zone today. Come, call them \"Transvestism\" (easy to use) [12] [13]. In the field of sexual behavior, the status of German leaders ended with the Nazi party's rule [2]. The Nazis has taken the regime for a few months, that is, May 6, 1933, the Nazi Party destroyed the research center [3], and burned the Book of Hechfield.\n\nStudents participating in early comrades' scholars include Ester Burt Burt (English: Ernst Burchard), Hans Brurles (English: Hans Blüher), Benedict Friedel (English: Benedict) FriedLaender). Oster Grefhg Posted the preliminary study of the uterus ring, \"G\" of G point is also taken from the first letter from Gräfengenberg.\n\nAfter the Second World War, sexology was revived in the United States and Europe. Large-scale research of sexual behavior, sexual function and sexual dysfunction, to develop sexual treatment to develop [3]. The sexual study after the Second World War II was influenced by the influx of European refugees, and it was popularized by Golden Collection. Previously, the American sever severings were mainly composed of groups that focused on sexual transactions, and vigorously promoted the sexual infectious disease education for young people [2]. In 1947, Alfred Golden Estate Estate Research Center (Institute for Sex Research), now this research institute is called Jin Sai, Gender and Reproductive Research Center (The Kinsey Institute For \"(THE KINSEY INSTITE for Research in sex, gender and reproduction. He wrote in his book (1948): \"In the scientific recognition of sexual behavior, people's understanding of farm animals is much higher than humans.\" [14]\n\nIn the 1950s, Psychologist's research on John Manny developed its identity and gender identity theory. His research is a controversial, especially David Reimer, even if the accident is the development of bobbies and children's treatment options [15] [16]. Creek Slovakia's Kurt Freud (English: kurt_freund) developed a penis impedance blood flow map (English: penile plethysmograph). The equipment is intended to objectively measure the extent to which male is evoked, and is currently used to assess whether there is a child or a young woman. This tool is also used for sexual criminals [17] [18].\n\nFrom 1966 to 1970, Mester and Johnson have published two studies - \"Human Sexual Response\" and \"Human Sexual INADEQUACY). The sales of their works are not good. They established the Mester and Johnson & Johnson Research Center in 1978 (English: masters_and_johnson_institution)\n\nA large part of the modern appearance of sexually studies reflects the phenomenon of the 20th century.\n\nSexualism is related to many other fields, belongs to integration:\n\nThis is a list of famous scholars, in accordance with their death year: "}