{"chinese_title": "Subculture ", "chinese": "Secondary culture (English: subculture), also known as culture or non-mainstream culture refers to a small culture of a certain mainstream culture.\n\nThe demonstration of subcompices may appear in facing things of things, attitudes, habits, beliefs and lifestyle, can be said to be a relative to mainstream cultural value, belief, which is also another special values ​​that are generated by mainstream culture. And behaviors, like different levels of different nature of countries, regions, skin tones, race, religion, gender, sexual, class, the rich, education, occupation, and age, have different cultures. Every society will have mainstream culture in the face of impact and changes in the face of subsequent culture, which may be a positive improvement of mainstream culture, or as a negative resistance for mainstream culture.\n\nMost of the culture is circulated by the group. With the identity and sharing of groups, these times are circulated as a common mainstream culture, and people living in society are not only only the value and norm of mainstream culture. Also from people living in people, they are affected by many cultures.\n\n\"Secondary culture\" can also be opposed to \"Pop Culture\", refers to the new entertainment of a small number of people. Such as jazz, rock music and hip hop, street dance, extreme sports, homes or ACG have been a niche culture, but through the promotion, it has become popular culture.\n\nWhether a emerging culture belongs to popular culture is often determined by the media exposure. After the popularity of TV, some cultures have been promoted by the media. For example, the band in Hong Kong in 1960 can only perform in a few places. By the 1970s, it began to enter the public vision, and now become a popular culture. In the 1990s, there was no cilian culture in the 2000s and failed to become mainstream culture. But not all novelty cultures have been promoted by the media, such as TV animations in the 1970s, are seen as children's entertainment, and this concept is deeply rooted, and animation is protected from varying degrees. For example, Hong Kong regards the animation theme song as a children's song (although many works do not have a child's style), there is a \"Ceremony of the Candus Golden Songs\" (2009 \"Animation Golden Song Concert\"). However, in the late 1970s, this set of works gradually be gradually reversed by the \"Cosmic Battleman and\" Luzhou Third \"and\" Motor Soldiers Too \". "}