{"chinese_title": "Humanities ", "chinese": "Humanities (English: humanities), and translators literature is to explore human emotions, morality and rational criticism (literature, philosophy, religion, art, historiography, anthropology, linguistics, etc. with observation, analysis and rational criticism. ) And the general name of knowledge.\n\nThe Chinese words of humanities, the earliest appearance in the \"Yi Jing\", the words: \"Just soft, astronomy. Civilization, humanities also. Waiting for astronomy to change the time; watching humanities into the world. \"There are a lot of annotations about this word. The explanation of\" Yichuan Yi Chuan \"in the Song Dynasty is:\" Astronomy, the heavens are also; humanities, people also. Astronomy, the sun and moon, the sun, the sun, the sun, the sun, the sun, Yin Yang The generation change, observed the operation, to check the speed change of the four time. Humanities, the nervies, the concept of humanities, the world, the world has become a customs, and the saints are also useful. \"(See\" Yichuan Yi Chuan \" Volume 2) Generally speaking, Chinese traditional human concept refers to various properties of people.\n\nIn modern times, the word \"humanism\" is used to translate \"humanism\", which is humanism. This word is some intellectuals in European literary revival. In the process of surpassing and opposing the traditional European religious tradition, the ancient Greece, Roman culture is learning. Model, return to the secular. These people are known as \"human Chinese scholars\". In 19th century Europe, there is a so-called humanistic discipline, and there are also humanities in the 20th Century Best University. The meaning of humanities is not to speak humanistic things with a scientific theory, but a kind of knowledge of people's knowledge is discussed for people's knowledge.\n\nUnder the influence of Chinese modern intellectuals, under the influence of traditional and Western countries, the understanding of the close-related vocabulary connotations of humanities, humanism and humanities have experienced a lot of changes.\n\nThe history of the Western Research Humanities can be traced to ancient Greece, and the humanities discipline is the foundation of citizen education. In the ancient Roman period, the concept of three schools is beginning to form. [1] These subjects became the Middle Ages' educational subject, emphasizing humanistic disciplines like technology or doing things.\n\nAnd China's research on humanities is very early, such as \"poetry\" compiled by Philosophers, a philosopher in Spring and Autumn, is the side reflection of civilians and basic morality of civilians, including love. Or the universal nature of Westerners' minds and the values ​​of the humanities, and thus the research of humanities disciplines is proposed, mainly in the form of drama, legend, novels, etc., and \"Dou Yu\" as an example, will The value comment of the humanistic orientation system, and ignored the \"critical feudal system to cruel compression and underlying women\", just a ring of humanism, not enough to represent universal humanistic thoughts. Furthermore: \"The rulers in China's different feudal periods have conducted different levels of humanities, so that the development of humanities in China has been slow, and there is no system science, and even participants itself also receives a cruel persecution. Just To the \"May 4th\" period, humanities learned really started to go to mainstream culture. Although the initial Humanism has appeared in different forms of literature, the humanities discipline contains all kinds of facies, generally believes that \"Wen, History, Zhe\" is the basic field of humanities, is the understanding of the essence of humanities. . It is a kind of \"White Horse is a horse, white horse\", and the white horse is a horse, but this term is not enough to represent all horses. Furthermore, when attacking the feudal system, it cannot be simply \"symbolized\" feudal system, regardless of the essence, should first clarify the characteristics of the feudal system, so as to avoid the phenomenon of attacking the old feudal system. Xia, Shang, Zhou 's \"Sealing Building\" political system, that is, the stage of the old class form, the class becomes the value of the value of a person, and the people are different from the family of birth, and there is a discerning, this kind of bloodline is feudal Institutional granary.\n\nDuring the Renaissance During the Renaissance, the humanities were identified as a discipline that only studied and un practical, and suddenly detached from traditional areas such as literature and history. In the twentieth century, this view was challenged by the modern movement, which was to seek an equal definition in the democratic society. [2]\n\nClassical, sometimes known as ancient research or classical civilization research, is an important branch of humanities.\n\nThe word anthropology (English: Anthropology) originated from Greek \"ανθρωπος (Anthrōpos, people)\" and \"λογος (-logia, discipline)\", meaning the research person's discipline. This discipline name has appeared in German philosopher Hend (English: Magnus Hundt) in 1501 \"anthropology - about people's advantages, essence and characteristics, and human ingredients, parts and elements\" (ANTROPOLOGIUM De Hominis Dignitate Natura et Proprietatibus, de Elementis, Partibus et membracris humani corporis, at that time, the word of humanology referred to a human body structure. [3] [4] The contemporary anthropology has the source of natural science, humanities and social science. [5]\n\nReligion is a cultural system of contacts and supernatural gods or transandalism. It can be divided into multiple styles, pan the god, and the aid and unsyardial [6], including personal behavior, traditional ritual, value concept, world concept, Classic works, pilgrimage, moral norms, or social groups [7]. Religion is a consensus and reverence of a certain system. The humanologist Clevrew Germ is claimed to complement with myths and philosophy, and religion is equivalent to a \"survival of survival\" in a human social sector. [8]\n\nDifferent religions may contain different elements, including but not limited to sexy, sacraging, beliefs, supernatural existence (one or more), the ultimate or superior life experience of believers or strength. The form of religion includes ceremonies, preaching, commemorative or worshiping god, sacrifice, holiday, festival, funeral service, marriage service, prayer, music, art, dance, public service or other cultural form. Religion may record the origin of life, universe or other things through the sacred history, the symbolic meaning and holy land, and to express the meaning of life. In the traditional sense, faith is considered a source of religious beliefs. About 10,000 different religions around the world are affiliated with 5 largest religions, Christian, Islam, Hindu, Buddhism or different forms of folk religion [10].\n\nPhilosophy can be divided into many different branches, mainly including forms, enhancement, ethics, logic and aesthetics.\n\nIn order to study, it refers to the study of the existence and the essence of things. Ideal school is a scope in philosophical research, which is considered \"First Philosophy\" and \"The Basic Problem of Philosophy\". It refers to a problem that the rational reasoning and logic can not be directly perceived, which is a discipline of human rationality for the most common cause of the most common face and the ultimate cause of things.\n\nThe main problems of my own upper school include: What existence is there? (What is ultimately there?) What is it? (What is it like?)\n\nMasterpiece tried to clarify that people are used to understand the basic concepts of the world (categories), such as existence, objects, and their nature, space and time, causality, and possibilities. One of the main branch disciplines of the MPRO is this vocabulary, that is, the basic category and its interrelated research. The main branch of another form of school is the cosmology, that is, the source of the source (if any), basic structure, nature, and universe dynamics.\n\nCosmology (English: COSMOLOGY) or the universe, this word originates from Greek κομολογ (Cosmologia, ORDER + λογια (Logia) discourse, μμος (COSMOS). Cosmology is a study of the overall of the universe and extends to the status of humans in the universe. Although the word cosmology is only recently, people have a long history of research on the universe, involving science, philosophy, mysterious learning, and religion.\n\nThere is currently different views on the relationship between \"knowledge\" and \"epistemology\". Some scholars believe that although the knowledge and understanding of understanding is closely related, there are some important differences. They believe that knowledge is about the content of thinking activities, and understanding is the possibility of knowledge. However, there are also scholars to put forward different statements, and believe that territory and understanding are the same, including a holistic concept including the above.\n\nLogic (English: logic), also known as the philosophical study of effective inference, theories, theories, and inference. [11] Logic is used in most intelligent activities, but mainly in the philosophy, psychology, learning, inference statistics, brain science, mathematics, semantics, law and computer science, etc. are considered a discipline. The logical discussion of the general form of logical demonstrations, which form is effective, as well as the paradox.\n\nLogic can usually be divided into three parts: summarizing reasoning, with reasoning and interpretation of reasoning.\n\nIn philosophy, logic is applied in most main areas: - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nIn mathematics, logic refers to formal logic and progenyl logic, and form logic is a valid inference of a formal language [12]. It is mainly to interpret the results. Logic will also be learned in dialectics [13]. Mathematical logic is to study abstract logical relationships and mathematical problems.\n\nIn psychology, brain science, semantics, law, is the treatment of human thought reasoning.\n\nIn the study, inference statistics, it is the best possible conclusion. Mainly induced by reasoning, traceability.\n\nIn computer science, it is to study the nature, possibilities, and implementation of various methods. It is mainly summarizing reasoning, and it is also in the study of reasoning.\n\nStarting from ancient civilization (such as India [14], China [15] and Greece) have a logic. In the West, Aristotle establishes logic into a formal discipline and gives it a basic location in philosophy.\n\nTraditional linguistics are called language to study ancient literature and written languages. In China, there has been a part of the e-learning, training, and literature. Modern language is dominated by contemporary language and speaking. Generalized linguistics include language.\n\nThese disciplines have also affected the study of linguistics. For example, symbolics is a related area that involves research on both general tags and symbols in language and language. The Studies of Literary Theory Studies in Language in Literary Art. In addition, linguistics are also known from different fields, like psychology, speech-language pathology, information learning, computer science, biology, human anatomy, neurology, sociology, humanology, and acoustic.\n\nHistorical Linguistics, also known as the Diachronic Linguistics, is a discipline of studying language changes. Historical linguistics is an important branch of linguistics.\n\n\n\nVoice is the language branch of speech (ie, speech). Narrow phonology corresponds to the word Phonetics (pronunciation) in English, focusing on specific voice nature and method of generating speech, relative to sound rhyme (or said), study the sound or speech difference character Abstract rules and voice systems operated in a language. Generalized phoneticity refers to the total research of these two major aspects. This article describes a narrow voice. Voice is the object of phonetics, refers to the specific sound of human speaking, that is, the sound of words. The international audio symbols set by the International Learning Society are widely used in the language community to mark the phonetic scheme of the voice.\n\nAvailability (English: Phonology or Phonemics), also known as the Department of Juvenile (China), Yun Yun (Japan), Vocalicology, Templer (Taiwan) [16] [17], for the language branch discipline, is a study A Learning of a Language Touch.\n\nStylistic, also known as morphology, is a branch of linguistics, studying the internal structure of the word and its formation. If English's Dog, Dogs, and Dog-Catcher have considerable relationships, English users can use their background knowledge to judge this relationship, for them, Dog and Dogs relationships are like CAT and CATS, DOG and DOG-CATCHER. Just as Dish and Dishwasher. Structured is a relationship to studying this single interval, and tries to organize the rules of its composition.\n\nResearch on the discipline of a language evolution from the development of syntax structure in history.\n\nHistoric law is also from historical linguistics and is a cross discipline.\n\nStudy the relationship between the relationship between the relative language syntax structure, mutual influence, and the discipline of the relative relationship between each language.\n\nComparing laws and laws are also from comparative linguistics.\n\nTo study a language, in a particular period, its detailed syntax structure discipline.\n\nIt is a cross-discipline that describes speaking language.\n\nDialect: dialect geography\n\nSecond language teaching: English teaching\n\nLiterature (English: LITERATURE), in the broadest sense, is any single written work. More stringent, literary writing is considered to be an artistic form, or any single work that is considered to have art or intellectual value, usually due to deploying languages ​​in a different way different from ordinary use. Its latin root Literatura / Litteratura (itself originated from Littera: Letter or Handwriting) is used to refer to all written records, although contemporary definitions extend the terminology to text (oral literature) including oral or singing. Literature can be classified according to the fictional work or non-fictitious works, or it can be classified according to the rhyme or the prose; can be further distinguished according to the main forms of long novels, the novels, short novels; works often according to historical periods or to certain aesthetics Features or expectations (art types) are classified. Reflections with language text to reflect the art, including rhyme, prose, scripts, novels, etc., is an important manifestation of culture, with different genres in the inner emotions and reproduction of life and a certain period of life.\n\nThis concept changed its significance over time: Now it can expand the verbal art form of non-book, can cooperate with the language or text itself, so it is difficult to agree on its origin. The development of printing technologies makes the distribution and spread of written works, and ultimately leads to online literature.\n\nLiterature is not necessarily objective, a successful writer can show his own subjective views, express their emotions and feelings, but by trying to build a \"objective standard\", When you can help writers to learn about \"readers' feelings\" to seek emotions and art The performance is completely reflected in the reader. Sometimes it can also borrow the idea of ​​thinking about the society, such as the rise of women's literature.\n\nOral literature is a literary work that is passing in the mouth. It is the main flow of folk literature. Its content can include poetry, story, etc. In folk oral literature, oiling poems, yellow stories and ghost stories are three types. For example, China's four folk legends are slowly formed by oral literature.\n\nArt refers to the integration and balance of integrated techniques, will, imagination, experience, etc., to create implicit aesthetic utensils, environment, images, action or sound expression patterns, to point to others, or have deep meaning Emotional and conscious humans are used to express existing perceived and personal or group experiences in the process [18].\n\nSince the 20th century, it has been constantly emerged in conventional forms of elements other than traditional definition art, such as common \"Technical Art),\" Digital Art \",\" Installation Art \"(Installation ART) , \"Conceptual ART\", \"Behavioral Art\", \"Biological Art\", etc. Such a variety of art forms continue to challenge the limit of the artistic theory. Regarding how art is recognized, it has become an open problem, and it is currently based on the current recognition of art world.\n\nThere are many different functions in history, so it is difficult to abstract the purpose of art into a single concept. This does not mean that the purpose of art is to vague, but there are many different art creations, unique reasons. The purpose of an art will be listed below, which is divided into two types (Motivated).\n\nHistory, referred to as historiography, is a discipline with history as a research object. Although in a broad history can include things other than humans, but as a literature, history is mainly based on human society as research objects.\n\nArchaeological (English: Archaeology or Archeology, from the ancient Greek: ἀἀχαι;; ἀἀχ ῖῖῖς, arkhaīos, \"ancient\"; and -λογ, -logiā, \"learning\"), for the past human society, mainly through reconstruction Analyze the material culture and environmental materials of the ancient people, including equipment, buildings, and biology (English: Biofact (Archaeology) and cultural landscape (English: Cultural Landscapes). Due to many different research procedures, it can be identified as a science and one-person literature, [29] and in the United States, it is a branch of anthropology, [30] is an independent discipline in Europe.\n\nArchaeological study human history, from the world's earliest stone buffer's development from the past, until modern times. [31] This discipline is the most important historic research discipline. There is no text data available in the prehistoric age for historians, and this era accounts for more than 99% of human overall history, from the old stone age until the writing text appears. [29] Archeology has a variety of different goals, scope from the study of human evolution to cultural evolution and understanding of cultural history. [32]\n\nArcheology includes a site survey (English: Archaeology Field Survey), discovers (English: Excavation (Archaeology)) and final analysis of the collection of information in order to know more human. As far as the macro vision, archaeological remarging interdisciplinary analysis, disciplined assistance from anthropology, historical, art history, classic, nationalology, geography, [33] geology, [34] [35] [ Linguistics, Physics, Information Science, Chemistry, Statistics, Guqi, Ancient Zoology, Ancient Biology, Ancient Ethnic Botany (English: Paleoethnobotany) and Ancient Fluenics.\n\nArchaeological was developed by European Collection (English: Antiquarianism) in the 19th century. From then on, it becomes a discipline throughout the world. From the beginning, the archeology of various specialty has developed, including the ocean archaeological (English: Maritime Archaeology) and archaeological astrictions, and diverse science and technology to assist archaeological investigations. However, the archaeologist today faces many questions, including facing fake archaeological (English: Pseudoarchaeolog), stiishing plunder, and discovered against human beings.\n\nIf China's history, there is approximately 3,300 years from China's first system Oracle or Tao Wen's text (the first 1300 years); from the first dynasty of the archaeological, there are about 3,700 Year; from the legendary Xia Dynasty in the Xi Zhou literature, about 4,100 years (the first 2070 counted); from Confucius, there is about 4,700 years (counting the top 2698); From the uncertain myths such as Pangu, God, Women, there is about 5,000 years (this is also the length of traditional folk cognition); there is approximately 10,000 magnetic mountain culture marking the nemesis era of civilized sprout. Year; from human beings start from the original life of the old stone, Santian culture, a history of more than 800,000 years. [37]\n\nThe history of population refers to the history of population development and its situation.\n\nAbout China's population growth history.\n\nStudies and record the origins of a family and their relatives. "}