{"chinese_title": "Cryptography ", "chinese": "Cryptography (English: Cryptography) can be divided into classical cryptography and modern cryptography. In Western languages, the cryptography is derived from Greek Kryptós \"hidden\" and written with Gráphein. Classical cryptography main attention information confidential and written, and corresponding to its corresponding deciphering method. Modern cryptography does not focus on information confidentiality, while also involving information integrity verification (message verification code), unrecognizable sex (digital signature), and attacks generated from internal and external in distributed calculations All information security issues. The important difference between classical cryptography and modern cryptography is that classical cryptography and decipherment usually rely on the creation of designers and hostile creativity and techniques. As a practical art, there is no clear definition of password. Modern cryptography originated in a large number of related theories in the late 20th century, which made modern cryptography have become a science that can be rigorously learned.\n\nCryptography is the branch of mathematics and computer science, and its principle has a large number of information theory. The famous cipher Scholar Ronald Lee Vistone explained: \"The cryptography is about how to communicate in the environment in which the enemy is present,\" from the perspective of engineering, this is equivalent to password and pure math difference. The development of cryptographics promotes computer science, especially those used by computers and network security, such as access control and information confidentiality. Cryptology has been applied in daily life: including wafer cards, computer users, etc., computer users, etc., including automatic tellers.\n\nUntil modern, cryptography almost specifically referred to the algorithm: converting normal information (plaintext) into a process of difficult to understand (ciphertext); decision algorithm is the opposite process: converted back to express text by secret text; These two algorithms are generally encrypted and decrypted simultaneously.\n\nThe specific operation of the addendal density is determined by two parts: one is an algorithm and the other is a key. The key is a secret parameter for the addition of the reinforcement algorithm, usually only the communicationr has. Historically, the key is usually used directly in the addendum without authentication or integrity test.\n\nThe password protocol is a communication protocol using password technology. Modern cryptographers think more about the traditional plus cue algorithm, the password protocol is also the same, and the two are two major issues of cryptography. In English, \"Cryptography\" and \"Cryptology\" can represent cryptography, and the former is also known as cryptography. But more rigorously, the former refers to the use of password technology, and the latter refers to the study of the password, including cryptography and password analysis. Password analysis is to study how to crack the passwordologies. However, in actual use, it is usually called cryptographic (ie, Cryptography), and does not distinguish between its meaning.\n\nEncoding: It refers to the specific plaintext replaced by codeword (English: Code Word). For example, replace \"Apple Pie\" (Attack At Dawn). The encoding is no longer used in rigorous cryptography, which has a more clear meaning in the principle of information or communication.\n\nIn Chinese speaking, the personal account password used by computer systems or networks is often known as cryptographic, although the pass code is also a scope of cryptography, but the golden key known in the academic pass code and cryptography is not The same, even between the two is often closely connected.\n\nSymmetric gold key encryption is a cryptographic method in cryptography, is to convert one of the numbers, letters, or only string random letters, a secret key to change the text or letters inside the message in a specific manner, such as replacing the relative position For example, Hello turns to Lohel. As long as the sender is known to the recipient know the secret key, they can encrypt and decrypt and use this information.\n\nThe public key encryption (also known as asymmetric encryption) is a cryptographic method, a non-symmetric pocket, refers to a pair of encrypted pockets and decrypted pockets, and a user is obtained using an encrypted pocket encryption. Information, only the user's decryption key can be decrypted. If you know one, you can't calculate another one. Therefore, if one of the key is disclosed, it is not harm to another. Therefore, the open gold key is the public key; the non-disclosed key is a private key.\n\nDigital signature (also known as public key number, electronic signature) is a kind of signature that is written on paper, but the technical implementation of public key encryption domains, for identifying digital information. On the Internet, we can use the \"digit signature\" to confirm. Digital signature is a unique value. If the public key can be verified, then we can determine the correctness of the corresponding public key, and the number-bit signature has both dual attributes: \"Confirmability\" and \"undispire (No handwriting expert verification) \".\n\nMany physical devices are used to assist in encryption, such as the codes of the ancient Greek Sparta, which is a cylinder that assists the replacement method, which can mobilize the order of the letters in the information, use the strip to wind a wooden bar, put the letter Displacement, the recipient should use the same diameter wooden stick to get the restore. In the European Middle Ages, the password bar (English: cipher grille) is used in a certain type of intraoperative.\n\nAfter the multi-character encryption method, more auxiliary tools appear, such as the Bordi-invented cryptographic disk, Tritmius inventive table method, and Jefferson, the US President Tomb Mas Jefferson Invention Disc (English: Jefferson Disk) (BAZERES (English: Bazeries) is approximately independently invented in 1900).\n\nIn the early 20th century, multiple plus decryption machines were invented and registered, including the most famous rotor (English: Rotor Machines), the Second World War German, alias \"Mystery\" cipher (Ennigma The cryptographue machine), its encryption method is the best design for breaking the test at the time after the First World War.\n\nThe early 20th century biography essentially considers the linguistic model. Since then, the center of gravity, now cryptography uses a large number of mathematics, including information theory, calculating complexity theory, statistics, combination, abstract algebra, and numerical theory. Cipher is also a branch of engineering, but it is different from other, because it must face a smart and malicious opponent, most other projects require only malicious natural power. The connection between cryptography and quantum physics is also a hot study.\n\nPrior to modern times, cryptography only considers the confidentiality of the message: How to convert an understandable message into an unhappy message, and make the person with secret messages can respond to back, but the lack of secret messages or eavesdroppers cannot Interpretation. In recent decades, this area has been extended to cover identity certification (or claims), message integrity check, digital signature, interaction certificate, security and multi-party calculation.\n\nThe ancient Chinese Zhou Chao Bing Book \"Sixty. \"Dragon\" recorded the use of cryptography, the \"阴符\" and \"Yin Book\" recorded Zhou Wu Wang asked Jiang Zi to the way of fighting with the main communication:\n\nToo public: \"The Lord and will, there is a licking, all eight, etc., there is a big victory of the enemy, long one foot. The break of the army will be the same, the fortress is nine-inch. Campaign is the same, long eight inches. The enemy is far away, and it is seven inch. The police hold down the inch, long six inch. Please ask the grain person to be five inch. The defeat army will be the same, long four inch. Failure martial arts compass, long three inch The privacy makes the line, if you think, if you think, the leaking is all. The eight accords, the main secrets, so the textbooks, do not vent the middle and foreign knowing. Although the enemy is holy, don't know. \"\nWu Wang asked Taikong: \"...\" can't be clear; the same is Liaoyuan, the words are unreasonable. What is it? \"\nToo public: \"All the shackles, use books, don't need. The Lord will be asked by the book, and the book is all right and then left, three, one, one, book For three. Sanfa, a known person, three people, people operate one point, phase transceiver, do not know, this is a blind book. Although the enemy is a holy, don't know. \"\n\nThe phenonis is a different message and instructions to express different messages and instructions with eight-ordered, which can be regarded as alternatives (English: substitude), transforming information into a symbol that the enemy can't understand. As for the Chinese book, the shift method is used, and the book is divided into three, divided into three people, and the three books will be reroute to get the restore.\n\nEntering the Song Dynasty and defined encryption method.\n\nIn fact, in the presen, secret letters have been used in war. The \"Parers\" of Western \"The Father of History\", which records some of the earliest secret letters. In the first 5th century BC, Greek City Bang was against slavery and aggression, and many conflicts and wars occurred with Persian. In the first 480 days of Xiyuan, Persian secretly knocked the strong army, ready to launch a raid to Athens and Sparta. The Greek Dimlatus (English: Demaratus) saw this assembly in Susak in Persian, using a layer of wax covering the word on the wooden board, sent and told the Greek Persian. Finally, the Persian Navy covers the Salamy Bay (English: Salamis Bay) near Athens.\n\nIt is said that Spartan commander sent a belt to the front line: [1]\n\nKgdeinpklrijlfgoklmnisojntvwg\n\nAfter the commander got, wrap it on a wooden stick and got the clear text \"Kill King\" as follows:\n\nKgdeinpklrijlfgoklmnisojntvwg\n\nThat is, one letter is taken every 4. Other letters are interference. But this legend has not been confirmed because the story occurs in Greece and Persia, but the secret text is English.\n\nSince most people do not know word, the earliest secret written is only used in paper pen or equivalents. As literacy rate is improved, it will begin to need real cryptography. The most classic two encryption skills are:\n\nThese two simple ways are not sufficient to provide sufficient confidentiality. The Caesar password is the most classic alternative, according to the emperor of the ancient Roman Emperor, in the communication with the distant general, each letter is replaced in the back of the three-graphic alphabet.\n\nEncryption is designed to ensure the secret of communication, such as spy, military general, diplomatic communication, and also have religious applications. For example, early Christians use cryptography to blur the parties they write to avoid persecution. 666 or some earlier manuscripts on the 616th of the New Testament Bible reveals the number of beasts referred to, often used to distinguish the ancient Rome Emperor Nero, who is persecuted by Christians. There is also a documentary of some Hebrew passwords in history. Ancient India is also mentioned in the classics to communicate with the password. In ancient times, Hirodo Described the message to hide the message with invisible ink, mamma or digital watermarks with invisible ink, regaming or digital watermark.\n\nIn addition to being applied to the military, the \"Want\" 4 of the Western Yuan 4th Century Brahman scholar (English: Vatsyayana) is mentioned in the \"Want\" 4 of the book. Article 45 of the book is a secret letter (English: Mlecchita-Vikalpa) to help women conceal the relationship between them and love. One of the methods is to pair the letters casually, such as in the Roman alphabet, you can draw the following table:\n\nThe cryptography generated by the classic encryption method is easy to leak about the statistics on the plaintext, which is actually very easy to crack in modern views. The Arabs will mention that if you want to crack encrypted information, you can calculate the frequency of each letter in an article at least one, and count the frequency of each symbol in the encrypted letter, and then For example, this is the predecessor of frequency analysis, and there will be almost all such passwords are cracked immediately. But classic cryptography has not disappeared now, often in the riddle (see password map (English: cryptogram)). This analytical method is also used in archeology in addition to the coding method. This decryption method is used when cracked ancient Egyptian hieroglyphics.\n\nAll passwords in essence are still harmful to the above-mentioned critical laws, until Abundated invented multi-letter encryption law (English: Polyalphabetic Cipher) in 1467, Abordy's innovation is different parts of the message. The code, he also invented the first automatic encrypler, a wheel that implements some of the idea. Multi-character encryption method is the most typical example of Virginia encryption: encryption reuses a keyword, which letter replaces the end of the key to which letter to the keyword. Despite this, the multi-letter encryption method is still partially harmful by frequency analysis, but this is discovered by Charles Babery until the middle of the nineteenth century.\n\nMore modern examples of famous examples of Medieval Scotland Mary, the First World War Germany's Zimmerman Telegraph and the \"Enny Mima\" of the Second World War.\n\nIn 1578, the Queen of Mary was restored by the Queen of Elizabeth. On January 6, 1586, Mary received a batch of secret letters and learned about Anthony Babington. Anthony and a few people with the party in a conspiracy to rescue Mary and plan to thorns the Queen of Elizabeth. Their letters are converted to a password and hide the wooden plug in the beer barrel to hide the eyes and ears. However, it was intercepted, replicated, and failed from the General Minister Walsingham, and cracked the letter by Philip Van Marnix. After the letters crack, Huaxing Han's handwriting of Philhami Ji Mary is induced by Antoni action, and the rebellious person is a net, tried and dedicated to Mary Queen. The problem is to use a fragile encryption method to make a false safety illusion: Anthony is too confident on their communication methods, making his encryption method too simple and easily crackd from the enemy.\n\nOn August 25, 1914, Germany's Magdeburg cruiser (Magdeburg) was stranded in Finland, and Russia searched for many German documents and two electrical codebooks. He was sent to the UK \"No. 40 Room (ROOM 40) performs password analysis. At the same time, the inventions of the radio have also made interception secrets such as connecting. Since Germany has been cut when the cable to the United States is started at the beginning of the war, Germany borrows the US submarine cable power report to Washington, but the cable has passed the UK, January 17, 1917, was \"40 Room 40\" Intercept. On February 23, the same year, the secret content was uncovered, and the content refers to the \"unrestricted submarine war\" in Germany, including the submarine attack, including neutrality, including neutrality. In order to prevent the United States, the United States has been grouped, Germany recommends that Mexican invaded the United States and promises to help Mexico will take the Texas, New Mexico and Arizona Sanzhou from the United States. Germany also wants to convince Japan to jointly attack the United States, Germany will provide military and funding assistance. After the secret is uncovered, the United States declared war in Germany on April 16.\n\nGermany learned the lessons of the first war, developing an encryption method that replaces the human hand. Schiwood Arthur Scherbius invented the \"Mystery\" (ENI GMA, Enny Gema tagging machines for military and business. \"Mystery\" is mainly composed of keyboard, encoder, and light board. The three sets of encoders, coupled with the connector and other parts, the possibility of 100 billion codes. In 1925, \"Mystery\" began a series of production. In 20 years, the German military has purchased more than 30,000 \"mystery\", which is also difficult to fill \"No. 40 House\" and become an important tool for Germany in the second war. Poland is located in the east of Germany, the west of Russia, has been threatened, so the Polish Cryptography is established to obtain intelligence. Poland is an espionage from Hans-THILO Schmidt, which is interpreted by a young mathematician Marian REJEWSKI, and has been compiled by a year. In the 1930s, the \"Bomba\" (Bomba) was produced and gradually understood \"Mystery\" technology.\n\nIn December 1938, Germany strengthened the safety of \"mystery\", which made Poland lost information. \"Mystery\" has become the core of Hitler lightning strategy, and the encrypted alignment of the daily changes maintains a powerful and fast attack. On April 27, 1939, Germany was revoked with Poland, Poland, Poland had to decide to share the \"bomb\" ideas and English, method to solve new \"mystery\". On September 1, 1939, Germany infunded Poland and the war broke out. After the UK received the decryption technology of Poland, in addition to the original language and humanists, the Room 40 has also added mathematicians and scientists, and later, Government Code and Cipher School, 5 years The number of people increased to 7,000. From 1940 to 1942, it was a knocked and decrypted pulling war, and successful decoding provided a lot of valuable information. For example, in 1940, the German attack Denmark and Norway, and the air raid intelligence was obtained in advance in Battle of Britain, and many crises were resolved. But \"Mystery\" is not completely crackdown, plus \"mystery\" has a lot of networks, and Germany has always accounted for the wind in the Atlantic campaign. Finally, the Britain captured the \"Mystery\" cryptographic book on the German submarine in the action of \"Jihapping\", cracked the \"Mystery\". The British hides this thing in a variety of false means, lests from Germany to change the password again, and plan to destroy the German replenishment line and shorten the duration of the Atlantic campaign.\n\nThe development of computer and electronics after the Second World War has contributed to a more complex password, and the computer can encrypt any binary information, which is no longer limited to writing text, and it is eliminated by linguistics. Most computer encryption is on the two-in-binding string, and do not directly act directly on traditional alphanuces as classic cryptography. However, the computer also promoted the development of critical analysis and offset the advantages of certain encryption methods. However, excellent encryption law remains ahead, usually good encryption law is quite efficient (fast and useful resources), and cracking it requires many levels of resources, making it impossible to break.\n\nAlthough frequency analysis is very effective, it is often useful to encrypt the method. Do not use frequencies to crack a message, you need to know what encryption method is currently used, so it will contribute to the espionage, bribery, theft or betray. Until the nineteenth century scholars identified that the algorithm of the encryption method is not reasonable or real protection. In fact, the appropriate cryptographic mechanism (including the additional understanding method) should be safe, even if the enemy knows what is used. For a good encryption method, the secretability of the gold key should be sufficient to ensure the confidentiality of the information. This principle is first proposed by Auguste Kerckhoffs and is called Kerckhoffs' PrinciPle. Information Theory Ancestest Claude Alwood Shannon Reproduction: \"The enemy knows the system.\"\n\nA large number of disclosed academic research appeared in modern. This originates from the mid-1997, National Bureau of Standards, NBS; National Standard Technology Research Institute, National Standard Technology, National Standard Technology, National NATIONAL, NIST to develop digital encryption standards (DES), Whitfield Diffi and Hellman (English: Hellman) proposed pioneering papers, and publicly released RSA. From that period, cryptography became an important tool for communication, computer network, computer security, etc. Many modern password technologies depend on the difficultness of specific calculation problems, such as factorial decomposition issues or discrete logarithms. Many password technologies can be proved to be safe as long as the specific calculation problem cannot be effectively solved. In addition to a famous exception: One-time PAD, OTP, such proves is accidental rather than decisive, but is the best way to currently available.\n\nThe cryptographic algorithm and system designer must not only pay attention to the history of cryptography, but also must take into account the future development. For example, continuously adding computer processing speeds to enhance the speed of brute-force attacks. The potential effect of quantum calculations is already the focus of some cryptograph.\n\nModern cryptography can be roughly distinguished into several fields. Symmetric key cryptography refers to the same gold key with the transmit party and the recipient. Until 1976, this is the only public encryption method.\n\nResearch and Application of Modern Cryptography Pay Attention to Group Cryptography and Flow Code. Block Encryption Law In a sense, the modernization of the multi-character encryption method of Abbit. Block Encryption Method Note a block and key of the plaintext, and outputs the same size ciphertext block. Since the message is usually longer than a single block, there is a variety of ways to weave a continuous block. DES and AES are the block encryption standards approved by the US Federal Government (AES will replace DES). Despite the abolition from standards, DES is still very popular (triple data encryption algorithm deformation is still quite safe), is used in a very much application, from the automatic trading machine, email to far end access. There are also many other block encryptions that are invented, released, quality and application, there is no laxator.\n\nThe stream encryption method is encrypted with block encryption, and a number of any long gold key raw materials is manufactured, and the expressive sequence element or the character is combined, a bit similar to one-Time PAD. The output stream is determined according to the internal state of encryption. In some stream encryption, changes in the state of the gold key are controlled. RC4 is a fairly famous stream encryption method.\n\nPassword Pseudobic Functions (sometimes called message summary functions, mixed functions, have a hash function or hash function (haveh)) does not necessarily use the pocket, but related to many important password algorithms. It will input the information (usually a whole file) to output a shorter fixed length, this process is unidirectional, the reverse operation is difficult to complete, and the collision (two different inputs produce the same whispering value) The chance is very small.\n\nMessage Authentication Codes, MACS is very similar to the password mixture, in addition to the receiver additional secret gold key to authenticate the mixed value.\n\nPublic key password, referred to as public key cryptography, but also known as a symmetric gold key passage, with respect to symmetric gold key cleavage, the biggest feature is to encrypt and decrypt different gold keys.\n\nIn the symmetric gold key passage, encryption and decryption use the same gold key, perhaps use different types of golden keys for different messages, but all face the puzzle of the key management. Since each pair of callors must use the golden key of his group, when the number of network members increase, the number of golden keys is increased in secondary. What is more embarrassing is that when the safe channel does not exist in both parties, how to build a common key to securely communications? If there is a channel to secure the key, you do not use the existing channel. The contradiction between this \"chicken egg, egg chicken\" is the hindrance of cryptography that cannot be applied in real world for many years.\n\nIn 1976, Whitfield Difi published the pioneering papers in the open key password: a pair of different values ​​but mathematics related gold keys, public key (public key, public key ) And privacy key (private key, private key or secret key). In the public key system, the privacy key of the public key is calculated is not feasible. Historic scholars David Kahn (English: David Kahn) describes public key passwords; \"\" The most revolutionary concept after the multi-character replacement method of literature and art. \"\n\nIn the public key system, the public key can be passed freely, but the private key only has the person. Typical usage is that others use public keys to encrypt the recipient, and the recipient uses its own private key to decrypt. Diffie and Hellman also show how to use the public key password to reach the Diffei Herman key exchange agreement.\n\nIn 1978, the Massachusetts Institute of Technology, Ronald Leevist, Adi Samore and Renard Ademan invents another public key system, RSA.\n\nUntil the 1997 public document knows that early 1970s, the Mathematician James H. Ellis (English: James H. Ellis) in British Intelligence Agency's Communications Headquarters has invented asymmetric gold key password, and Diffie -Hellman and RSA have been preceded by Malcolm J. Williamson (English: Malcolm J. Williamson) with Clifford Cocks (English: Clifford Cocks). These two oldest public key systems provide excellent encryption based, so they are used in a large number. Other public key systems are also Cramer-Shoup, El Gamal, and elliptic curve cryptography.\n\nIn addition to encryption, the most significant achievements of public key passwords are digital signatures. Number of signature names is the number of ordinary signatures. Their characteristics are someone who can easily manufacture, but others are difficult to counterfeit. A number of signatures can be permanently combined with the signed message and cannot be removed from the message. Digital signature generally contains two racing algorithms: one is a signature, using the private key to process the message or the message value of the message; the other is verification, using the authenticity of the public key to verify the truth. RSA and DSA are two most popular number of signature mechanisms. Number of signatures is the basis for public key infranstrungth, pki and many network security mechanisms (SSL / TLS, virtual private network, etc.).\n\nThe public key algorithm is mostly based on the problem of computational complexity, usually from a number of arguments. For example, RSA is derived from an integer factor decomposition problem; DSA is derived from discrete logarithms. In recent years, the fast elliptic curve cryptography is based on mathematical problems associated with elliptic curves, and is equivalent to the discrete logarithm. Since these underlying problems involve analog-to-digital multiplication or index operation, more computational resources are required relative to block encryption. Therefore, the public key system is typically a composite, containing a highly efficient symmetric gold key algorithm for encryption, and then encrypts the key used by the public key to encrypt the symmetry gold key system to enhance efficiency.\n\nThe cryptographic analysis is also known as broken test. The purpose of the password analysis is to discover the weaknesses of the cryptographic mechanism, and those who are engaged in the intention of the system malicious attacker or the designer of assessing the weakness of the system. In modern, the cryptographic algorithm and agreement must be carefully checked and tested to determine their guaranteed security.\n\nVolkswagen general misunderstanding believes that all encryption methods can be cracked. The work of Shannon during World War II has proven that as long as the gold key is completely random, no revitalization, the external absolute confidentiality, and the message equal to the message is unlikely to crack. In addition to most encryption methods other than one secret can be cracked in violent attacks, the efforts required to crack the length of the gold key may be growing.\n\nThere are many ways to analyze the password analysis, so there are several categories. A common separate law is how much information is attacked. In the DIS attack, the cryptographic analyst can only access ciphertext, and the good modern cryptographic system is usually immunized to this situation. In known mandatory attacks, password analysts can access multiple plaintext, ciphertext pairs. In the selection of the plaintext attack, the cryptographic analyst can be selected as any text and give the corresponding ciphertext, such as the gardening method used in Britopy in World War II. Finally, in the selection of ciphertext attacks, the cryptographic analyst can choose any ciphertext and give the corresponding plain text.\n\nThe cryptographic analysis of the symmetric gold key encryption is often aim to find more efficient ways than known best breaking methods. For example, cracking DES with the simplest violence, requires a known clear text and 255 decryption operation, trying nearly half possible positors. Linear Analysis Attack Method For DES 243 known apparent and 243 DES operations, it is obviously effective than violence.\n\nThe public key ranking algorithm is based on a variety of mathematical problems, and the most famous is integer decomposing and discrete logarithmic issues. Many public key cryptographic analysis is a numerical algorithm for studying how these calculation issues is efficiently solved. For example, it is known that the discrete logarithmic problem based on an elliptic curve is more difficult than an integer factor of an integer factor of the same key size. Therefore, in order to achieve equal safety intensity, the technique based on factor decomposition must use a longer gold key. Due to this factor, the public key cryptographic system based on the elliptic curve is gradually popular from the mid-1990s.\n\nWhen a pure password analysis focuses on the algorithm itself, some attacks focus on the weaknesses performed by the cryptographic device, called the sub-pass attack. If the cryptographer can access the device to execute the encryption or return password error, it may use the timing attack method to crack the password. Attackers may also study the mode and length of the message, and it is useful to report, called traffic analysis, which is quite effective for the enemy of the unit. Of course, social engineering and other attacks on personnel, social attacks and breaking motions may be the most powerful attack method.\n\nMost cryptographic theory studies are exploring password learning principles: the algorithm of basic cryptography and is related to other issues. For example, it is easy to forthbly operational unidirectional functions. In general, if you want to be secure, you must ensure that the one-way function is present. However, if the one-way function exists, it means P ≠ NP. Since the current P and NP issues are still unsubalypse, we have no knowledge of the one-way function. If the one-way function exists, the safe quotular number generator exists with the quotient function.\nCurrently known password learning radicals provide only basic functions. Usually confidential, messaging, authentication, and undeniable. Any other functionality is a combination and extension of the basic algorithm, which is called a cryptographic system. For example, PGP, SSH, SSL / TLS, open key foundation construction and number signs Chapter. Other password prototypes also have an encrypted algorithm itself, unidirectional arrangement, dark door arrangement, etc.\n\nIn many cases, cryptographic techniques involve two or more parties (such as company headquarters and segment) or leaping time (such as protecting backup materials). The password protocol has been extended to a variety of topics, such as interaction prove, secret sharing, and zero knowledge, more complex e-banknotes and security multi-party calculations.\n\nWhen a good password system is safely failed, there are few vulnerabilities in the cryptographic prototype. Most weaknesses happen to the agreement design, the system is actually, or some people are wrong. Many cryptographic agreements have developed in non-systematic processes, rarely have a secure proof. Some formal analysis agreements are allocated on mathematical logic (such as BAN (English: BAN) logic) or the recent specific security principles, these are the themes of researchers for decades. Unfortunately, these tools are fairly cumbersome and cannot be used for complex design. How to implement and integrate cryptographics itself is a distinct area, see cryptography and safety engineering.\n\nCryptography has long been interested in intelligence or judicial institutions for a long time. Due to the implicitness of these units and the reduction in personal privacy after the ban, cryptography is also the focus of human rights supporters. The legal issues surrounded by cryptography have long history, especially after the high-quality password, cheap computer.\n\nCryptology in some countries or even the national biography is also limited. Until 1999, France still limits the use of domestic cryptography. Many countries have more stringent restrictions, such as Belarus, Kazakh, Mongolia, Pakistan, Russia, Singapore, Tunnesia, Venezuela and Vietnam.\n\nIn the United States, domestic use is legal, but there are still many legal conflicts. A particularly important issue is the export control of password software and hardware. Due to the important role of password analysis in the World War II, I also expect cryptography to sustain in national security, and many Western national governments strictly regulate the export of cryptography. After World War II, it was illegal to spread the encryption technology in the United States. In fact, encryption technology has been regarded as military needs, just like tanks and nuclear weapons. The situation until the personal computer and Internet network have changed. Good cryptography and bad cryptography have no difference in most users. In fact, most of the current password technologies are generally slow and easier. However, when the internet network is growing with personal computers, excellent encryption technology is gradually known. It can be seen that the export control will become an obstacle to business and research.\n\nA number of events challenged US export norms occurred in the 1990s. One of them was the PGP encryption of Phil Zimmerman, which was released in the Internet in June 1991. After the protest of RSA Security, Zimmermann was investigated by the Ministry of Commerce and the Federal Survey. Then, Daniel Bernstein, the University of Berklai California launched a legal proceedings of the US government, with some views of the freedom of the ban. In 1995, the Bernstein V. United States (English: Bernstein V. United States) has contributed to the US Constitutional Speech Freetenance of the original code of the printed cryptographic algorithm in 1999. In 1996, 39 countries signed a Warsa Convention on the Export of Military Exports. The convention is not referred to as a short-gold key length (a symmetric pocket 56-bit element; RSA 512-bit yuan) is no longer subject to export control. From 2000, the US export password has been loose. Now, almost all Internet users can access excellent cryptography, in the browser built-in transport layer security protocol (TLS) or a security sleeve layer (SSL). Mozilla Thunderbird and Microsoft Outlook email User ends can be connected to the IMAP or POP server with a TLS and transmit encrypted email with S / MIME. Many network users don't know that their basic application has a large number of cryptographic systems. These browsers and mail programs are so popular, even trying to regulate the public's government units that use codenics to use the government units that are unable to conduct effective restrictions.\n\nAnother cryptographic dispute site is the intervention of the US National Security Agency (US National Safety Administration) in the development of encryption. The National Security Authority considered the federal standards developed as the national episode, and We included in the development of IBM. DES is developed by NSA and IBM for the combined potential analysis method, this attack is not disclosed until the late 1980s. According to STEVEN Levy, IBM re-discovered differential analysis, but was banned by NSA. This attack is disconnected from Biham and Shamir (English: Shamir). These things show that it is difficult to decide which resources or knowledge of the attacker. In 1993, NSA was involved in encrypted microcrystals CLIPPER CHIP (English: Clipper CHIP) plans in Capstone (English: Capstone). Clipper has criticized cipher scholars, one is because its encryption algorithm is listed as confidentiality, and NSA may deliberately design a weak encryption method to reach intelligence purposes; the second is the entire account violation of Kirkhof principle, due to This mechanism uses a particularly government's appointment gold key, which is difficult to protect the possibility of eavesdropping.\n\nDigital Wisdom Property Rights Management is also known as Digital Rights Management, DRM)\nCryptography is the core of digital smart property rights, and many technologies are applied to the use of copyright materials. In 1998, US President Bill Clinton signed several Millennium Copyright Act (Digital Millennium Copyright Act, DMCA), which clearly determined the revision or spread of criminal acts, especially some evaders. . This has caused a considerable potential impact on the cryptographic research community because any reverse decoding techniques can be used to crack DRM thus being identified as a violation of DMCA. Considering these disputes, the US Federal Investigation Bureau and the Ministry of Justice did not strictly implement DMCA. A cipher scholar Niels Ferguson (English: Niels Ferguson) has publicly stated affected by DMCA, and he will not release some research to Intel security design. The second year of Linux core, Alan Cox and Professor, Princeton University, edward felten (English: Edward Felten) have been related to this bill. Dmitry Sklyarov (English: Dmitry Sklyarov) was in violation of the bill for several months from Russia to the United States, but violated DMCA's works actually occurred in Russia, and in Russia is legal. Similar things happen in many countries. For example, the Copyright Directive made by the EU (English: Copyright Directive). In 2007, the golden key responsible for digital multi-function audio and video disc and HD DVD anti-counterfeiting is discovered and is on the Internet. At the same time, the US Film Association issues a number of non-DMCA notices, leading to a large number of Internet users, also A issue of fair use and freedom of speech is taken out. "}