{"chinese_title": "geography ", "chinese": "Geography (English: GeoGraphy) is about Earth and its characteristics, residents and phenomena [1]. It is a discipline system for studying the interaction between the surface of the Earth's surface, and the discipline system of its spatial differences and changes.\n\nGeographicists are traditionally be regarded as the same class with mapologists, and believe that both are famous and numbers. Although many geographicists have experienced the training of local names and maps, both are not their most concerned. Most geographicists have studied many phenomena, process, characteristics, and interrelationships in human and natural environments in space and time. Because the space and time affected a variety of topics such as economics, health, climate, plants and animals, geography is a highly interdisciplinary discipline.\n\nGeography as a discipline is mainly roughly divided into two areas: natural geography and human geography. Natural geography investigates the natural environment and how to cause terrain and climate, water, soil, vegetation, various phenomena of life and their relationship. Human geography focuses on how human beings are manufactured, treat and manage, and how human space is affected. Because the above is the reason, the third field of use of different methods is used in environmental geography. Environmental geography in the research results of natural geography and human geography, analyzes and commenting the relationship between human and nature, and proposes human conquest nature, transforming nature to adapt to its own sustainable development safety status and technology (including production technology and Conditions of System Technology.\n\nThe word from Ancient Greek γεωγραφία (Romanization: Geographia), is composed of Geo (meaning \"earth\") and graphein (meaning \"writing\"), which means \"a description of the land\". The earliest man using Geography is Eloranti, he uses this word to represent the study of the topic scenery.\n\nIn ancient China, the establishment of land or Justuctive, geographicity refers to the environmental situation of mountainous land [2]. After Japan, after the Meiji Destination, the word English Geography translated into translation as geography, and then passed into China.\n\nIn 1902, the Emperor Guangxu received Zhang Baixi, and promulgated the \"Qin Decoration\", in the formal school, there were two in history, and two. After Zhang Baixi, Wu Xiun went to Japan to study education, 1903, Zhang Baixi, Zhang Zhidong, who was responsible for education reform, and Rongqing recommended to redeem the school stages [3]. After re-redefining the charter, it is regulating the primary elementary school in Japan, and the history, the second sect, renamed history and geography. Then, geographic nouns are popular in China.\n\nTraditionally, geography has four basic research categories [4]:\n\nIn contrast, modern geography is a comprehensive coverage of the relevant discipline, and the geography circle has been scientific and dialectical, and the dialogue after the measuring revolution and the various philosophical ideas enters the school. The modern geography is to seek understanding space. In-depth complexity of human and nature - not only \"knowing it\", but to \"know it,\" Geography as \"Human Social Science and Natural Science Bridge\" is divided into two major branches - human geography and natural geography [5]. The earliest books in Ancient China include \"Yong Gong\" and \"Shan Hai Jing\". Ancient geography mainly explores the measurement methods related to the shape, size, or describes known areas and countries.\n\nGeographicists are traditionally be regarded as the same class with the map, and believe that both are studying place names and numbers. Although many geographicists have experienced the training of local names and maps, both are not their focus. Geographicists have studied many phenomena, process, characteristics, and interrelationships of human and natural environments in space and time. [6] Because spatial and time affecting a variety of topics such as economy, health, climate, plants and animals, geography is a highly interdisciplinary discipline.\n\nGeography as a discipline can be roughly divided into two larger areas: human geography and natural geography. The former focuses on how human beings build, how to treat, treat and manage and manage how to affect its occupied space. The latter investigates the natural environment and how to cause various phenomena of climate, vegetation, life, soil, water and terrain and their interrelationships [8]. Because the above is the reason, the third field of use of different methods is used in environmental geography. Environmental Geography Integration Humanities and Natural Geography and Observing the Interrelationship between Humans and Nature. [6]\n\nNatural geography focuses on geography of geography. Its goal is to understand the rocky circles of nature, hydrological circles, large air circles, soil circles (Pedosphere) and biospheres (global plants and animal phase modes). Natural geography uses biology to study, is a systematic geography, understanding global flora and animal zone pattern, using mathematics, physics to study the exercise of the earth itself and its relationship with other solar system, is research Disciplines of global changes in position and space. Natural geography can be classified as the following rough category:\n\nHuman geography is a branch of geography, focusing on studying interaction patterns and processes between humans and many environments. He contains the ingredients of social sciences such as humanities, politics and economic levels. Although the main focus of human geography is not the substantial landform of the earth (see natural geography), because various human activities occur in substantially land, it is actually not mentioning the substantial landform to discuss human geography and impossible. Environmental geography is just a bridge used as both. Human geography can be divided into many different rough categories (see Human Geography), for example:\n\n\n\nIn response to different periods, many methods appear and applied in human geography research, including:\n\nEnvironmental geography is a branch of geography, describing human relationships from spatial levels and the relationship between the natural world. Environmental geography has aware of human geography and natural geography, and also needs to have awareness of human society as a conceptualization environment.\n\nEnvironmental geography has become the increasing specialization of the above two disciplines as the bridges of human geography and natural geography. In addition, the relationship between human and environment has changed in globalization and technology development, and it is necessary to understand this relationship between this changing and dynamic. Examples of the research category of environmental geography have disaster management, Environmental Management, sustainability and ecological politics (ECOPOLITICS) or Political Ecology.\n\nGeomatics is a branch of geography, which appears first in the 1950 Geographic Measurement Revolution (Quantitative Revolution). Geographic Information includes traditional spatial technology and computer applications that use local graphics and surveylation. Geographic Information is a universal subject with other disciplines using geographic information systems and remote sensing methods. Geographic Information also causes the revival of some geographic departments. This phenomenon especially in the 1950s experience in North America in North America.\n\nGeographic Information includes a wide range of disciplines including spatial analysis, such as maps, geographic information systems, remote sensing detection and global positioning systems.\n\nRegional geography is a branch of geography, she studies the region of different sizes on the Earth. Its main purpose is to understand or define the uniqueness or characteristics of individual regions that contain human and natural factors. The attention of regional geography is also placed on Regionalization, including suitable methods to become a region.\n\nRegional geography is also considered to be an inevitable way to study geography (similar to metrics revolution or critical geography), detail the history of geography.\n\nSince the interrelationship of space is very important for geography of synoptic science, the map is a major tool. Geography Analysis In addition to using classic maps, it also fuses modern approach, namely computer-based geographic information systems (GIS).\n\nGeologists use four related methods in their study:\n\nThe map studies the expression of the Earth's surface using symbols (ie, map production). Although other branch disciplines need to use maps to express their analysis, the actual map production theory is very enough to come from other disciplines. The map of the map is generated by drafting technology.\n\nCartography must learn cognitive psychology and people to understand the symbol to express the symbol to express the top of the earth, and learn behavior psychology can guide map readers to make action. They must learn from the earth-making and quite high-order mathematics to understand how the shape of the earth affects the deformation of the map symbol, which is reflected in the plane. The map can be regarded as a seed of large disciplines in geography without disputeously. Most geographicists are fantastic to maps in young ages as an early characterization they will pursue their geography.\n\nGeographic Information Systems, GIS process and stores high-accuracy Earth information in the computer. In addition to other geographical branches, geographic information system experts must understand computer science and database systems. The geographic information system causes a change in map of maps; almost all maps are now helped by geographic information system software. GIS also represents Geographic Information Science, which is the scientific relationship between software and technology using geographic information systems.\n\nRemote Sensing can be defined as a technology and science that achieves information from a distance. The information of telemetry comes from many aspects, including satellite maps, aviation photography, and portable sensors. Geographicists have increasing the Earth, Ocean and Atmospheric Data that uses telemetry. The reason is:\n\nThe data obtained by telemetry can analyze or analyze other digital data levels (eg, geographic information systems).\n\nGeostatistics (Geostatistics) Processing the information derived from geographic quantity methods, especially the application of statistical methods to explore geographic phenomena. Geological statistics are widely used in many areas including: water literature, geology, petroleum exploration, weather analysis, urban planning, logistics and epidemiology. The mathematical foundation of geological statistics is from data clustering, distinct analysis, no mother-in-law and other people. The application of geological statistics in the geographic information system, especially in interpolation (estimates) of unsatisfactory points. Geographicists have significant participation in geographical techniques.\n\nGeographic Qualitative Methods, or Ethnography research technology is used by human geography. Cultural geography has traditions with quality studies, and quality studies are also exploited by humanity and sociology. Human geography takes a participant observation and gaining quality data in depth.\n\nThe conception of Milles of Milu is a late Greek writer, believes that it is a geography of geography, and now only one of its successful sections can be known. Anakzand's contribution includes gnomon, although simple but she provides an effective greek tool as a measure of latitude. Thales and Anna Kendan were also praised because of the predictive yaw. The foundation of geography can be traced back to ancient culture, such as ancient, medieval and modern Chinese history. Initially explored geography in the art and scientific level, the map is used to learn from the map (see map history history of cartography), ancient Greek philosophy, ancient Greek literature or mathematics (see Math History of Mathematics), etc. Geography.\n\nThe first person who pointed out that the Earth is the sphere is the dispute between Badenid or Pythagoras. Alikaro La Lei can use the interpretation of the eclipse theory to show that the earth is circular, but he thinks the earth is flat as the other contemporary scholars. Eltostny is one of the people who originally estimated Earth radius [10].\n\nThe first initial exact latitude and longitudinal system is considered to be Xipcha. He uses Babylon Mathematics to perform a Sixty Get Affirmation System. Wire and weft are subdivided to 360 °, each degree is more subdivided into 60 '(angle). For measurement (the longitude of different positions, he proposed to use the daily etch to determine the difference between the relative time [11]. The Roman Empire Explore the extensive mapping in the new place to provide a highly information to Toller's construct a detailed image ( Atlas). The results of Ptle Tervance Yanpatas, using coordinate network (Grid System) and 56.5 miles on the map [12].\n\nThe Empire of the Roman Empire is transferred from Europe to Islamic World by Europe. [13]. Scholars include Abu Abd Allah Muhammad Al-Idrisi, Ibbd Allah Muhammad Al-Idrisi, Iben Batuhammad Al-Idrisi, and Iben Herle Tower. In addition, Islamic scholars translate and interpret the early works of the ancient Rome and ancient Greece, and build wisdom (House of Wisdom) as the above use in Baghdad [14]. In the third century, geography research methods and geographical literature writing in Chinese history and geographical literature were more complicated in Europe [13]. Chinese geography, such as Liu An, Shen Kui, Fan Cheng, Zhou Daguan, Xu Xiake, etc. Writing a lot of important indices, but after the 17th century, there are many geographical concepts and methods of Western geography by China.\n\nDuring the 16th to 17th century, the explorers were discovered and occupied by Christopher Columbus and other new land, which requested geographical materials more accurate, and a more robust theoretical basis. Geographia Generalis, which is \"Geographia Generalis\", is the first class of new scientific geography, from Gerardus Mercator and Bernhardus Varenius. example.\n\nGeography is identified as an independent academic subject in the 18th and 19th century and has become a classic course in Europe (especially Paris and Berlin). During the 19th century, many geography associations developed, including the Emperor of the Paris Geography in 1821 (Société de géographie) [15], the Emperor established in 1830 Royal Geographical Society [16], Russian Geographical Society, Russian Geographic Society, 1851 (American Geographical Society) [18] in 1888, established in 1888 Geographic Association [19]. The impact of Emanuel Kant, Alexandria von Humboldt, Carl Lee, and Vidal de la Blache can be regarded as a geographical transition from philosophy to a transformation point.  In the past two centuries, technological progress such as computers, such as computers, etc., the development of geographic information, such as participating in observation and geological statistics as geographic research. In the 20th century, the Geographic Academic experienced four processes: environmental decisions, regional geography, measurement revolution and critical geography. Because Earth science pursues the relationship between the world with a full coverage, interdisciplinary connection is largely strengthened in geography, geology, economics, sociology, and population statistics.  Map related entries "}