{"chinese_title": "Natural science ", "chinese": "Natural Science is the science of studying organic or inorganic things in nature. Natural Science includes astronomy, physics, chemistry, earth science, biology, medicine, etc.\n\nDifferent from natural sciences, there are also application science, human literature, social science, form science and engineering. Whether psychology and geography are natural sciences. At present, controversy is currently controversial. It is generally widely accepted to include both natural sciences and social sciences.\n\nIt is generally believed that ancient Greek Tayles, Aristotle is the founder of natural science, Galileo Galilele is the first to introduce experiments to natural science. In the 18th century, European natural sciences and philosophy were almost unable to separate. Philosophers are also natural scientists, Lie Cartes, Gottfried William Leibnitz, John Rock, etc. also is also natural scientists. In the early days of natural science development, a systematic study on natural objects or classifications, called Natural History, Latino Historia Naturalis. [1]\n\nThe fundamental purpose of natural science is to look for the law behind the natural phenomenon, but the work of natural science does not include these regularities. Natural science believes that supernatural, casual and self-contradictory phenomena does not exist. The most important two pillars of natural science are observational and logical reasoning. Natural science can guide the laws of nature from natural sciences. If the phenomenon of observation is different from the law of the law, then it is either because there is a mistake in the observation, or because it is considered to be the correct rules to be wrong. A supernatural factor does not exist.\n\n110 mathematics\n120 Information Science and System Science\n130 mechanics\n140 physics\n150 chemistry\n160 days\n170 Earth Science\n180 biology\n190 psychology\n\n210 Agricultural University\n220 forest\n230 animal husbandry, veterinary science\n240 aquatic studies\n\n310 basic medicine\n320 clinical medicine\n330 Preventive Medicine and Public Health\n340 military medicine and special medicine\n350 pharmacy\n360 Chinese Medicine and Chinese Medicine\n\n410 Engineering and Technology Science Foundation\n413 Information and System Science related Engineering and Technology\n416 Natural Science related engineering and technology\n420 Surveying Science Technology\n430 Materials Science\n440 mine engineering technology\n450 metallurgical engineering technology\n460 Mechanical Engineering\n470 power and electrical engineering\n480 energy science technology\n490 nuclear science technology\n510 Electronics and Communication Technology\n520 Computer Science Technology\n530 chemical engineering\n535 product application related engineering and technology\n540 Textile Science and Technology\n550 food science technology\n560 civil engineering project\n570 water conservancy project\n580 Transportation Engineering\n590 aviation, aerospace science technology\n610 Environmental Science and Technology and Resource Science and Technology\n620 Safety Science and Technology\n630 management\n\n710 Marxism\n720 philosophy\n730 religious\n740 language\n750 literature\n760 art\n770 historical\n780 archeology\n790 economics\nPolitics\n820 law\n830 military school\n840 sociology\n850 nationalology and culture\n860 Journalism and Communication\n870 Library, Intelligence and Document\n880 Education\n890 Sports Science\n910 statistics "}