{"chinese_title": "Aerospace ", "chinese": "Aerospace is the general name of the activities that occurred during the development of the atmosphere and the space of the universe, and the aviation and aerospace are separated from the details. Among them, the aviation refers to the navigation activities of manned or non-carriers in the atmosphere, and space refers to the navigation activities in the universe space outside the atmosphere of the manned or non-carrier [1]. However, the emission and recycling process of the spacecraft must pass the atmosphere, which makes it necessary to contact aerospace and spaceship. The aerospace plane landing in horizontal gliding and the level of empty air planes that are currently developing in countries are being the best embodiment of this connection. The word aerospace also refers to the science necessary for aerospace activities, and it also refers to the various technologies involved in the development of aviation and spacecraft.\n\nThe Yuan Huang Tie in the Wei, Jin, Southern Dynasties may be the first successful flight; the Soviets, the Soviets, the Soviet Union Alale, the first, the first successful entry of space.\n\nAerospace technology is a highly integrated, interdisciplinary modern science technology, which is based on mechanics, thermodynamics and materials. Electronic technology, automation technology, computer technology, jet propulsion technology, manufacturing process technology, medical, vacuum technology, and low temperature technology have also played an important role. The above discipline intersects each other in aerospace applications, producing some new disciplines, aviation and aerospace technology thus form a complete system. Due to the related art of aircraft, missiles, the development of aerospace technology is often closely related to military applications.\n\nAerospace is one of the most active and most influential science and technology fields. Its products have high added value, driving other high-tech development, which has a huge and far-reaching impact on national economy and social life. Its development reflects the advanced level of national science and technology, and the major achievements made in this area reflect the high development of human civilization.\n\nAviation History · Aircraft (Manufacturer) · Aircraft Engine (Manufacturer) · Rotor (Manufacturer) · Airport · Airport · Museum\n\nCivil airplane (start customer) · Junji passenger plane · Airlines (have been aircraft) · Air code · Civil Aviation Management Department ·\n\nAir Force · Aircraft Weapon · Missile · Unmanned Air Carrying · Test Machine · Air Force Base · American Trunard Aircraft Name System · US Three Army Missile and UAV Name System · British military aircraft serial number\n\nAerospace agency · Space shuttle machine · Load Rocket (above) · Avoid Rockets · Alliance Series Universe Ship Lunning Task · Bank Activities: 2000 (Separate) · Folk activities: 2000 (International Space Station) · Space Tourist\n\nBusiness Vehicle Accident List · Military Aircraft Air Brake List · Aerospace Tools Accident List · Causes at least 50 people's death\n\nSpace Record · Flight Speed ​​· Flight Distance · Flight Time · Maximum Yield Aircraft "}