{"chinese_title": "literature ", "chinese": "Literature (English: LITERATURE), in the broadest sense, is any single written work. More stringent, literary writing is an artistic form, or any single work that is considered to have art or intellectual value, which is usually deployed in a way different from normal use.\n\nIts latin root Literatura / Litteratura (itself originated from Littera: Letter or Handwriting) is used to refer to all written records, although contemporary definitions extend the terminology to text (oral literature) including oral or singing. Literature can be classified according to the fictional work or non-fictitious works, or it can be classified according to the rhyme or the prose; can be further distinguished according to the main forms of long novels, the novels, short novels; works often according to historical periods or to certain aesthetics Features or expectations (art types) are classified.\n\nReflections with language text to reflect the art, including rhyme, prose, scripts, novels, etc., is an important manifestation of culture, with different genres in the inner emotions and reproduction of life and a certain period of life.\n\nThis concept changed its significance over time: Now it can expand the verbal art form of non-book, can cooperate with the language or text itself, so it is difficult to agree on its origin.\n\nThe development of printing technologies makes the distribution and spread of written works, and ultimately leads to online literature.\n\nLiterature is not necessarily objective, a successful writer can show his own subjective views, express their emotions and feelings, but by trying to build a \"objective standard\", When you can help writers to learn about \"readers\" to reflect in the heart of the inner emotional and artistic performance.\n\nSometimes it can also borrow the concept of the idea of ​​the concept, so that the society has different faces to save the situation, such as the rise of women's literature.\n\nThe history of literature is closely related to the development of civilization. If literature is defined as a writing record, the earliest ancient literary work is generally considered to be ancient Egyptian literature [1] and Sumei literature (English: SUMERIAN LITERATURE) [2]. The main instruments in the ancient Egyptian literature (praise poems, prayers and stories) are almost all in the way of poetry [3], but although it can be clearly seen with poetic devices, but the rhythm of poetry is unknown [ 4]. The earliest known literary work is 2700 BC's \"Gilgamesh Shi Shi\" created by Su Men, which describes heroism, friendship, losses and chasing eternal life.\n\nDifferent distinctive literature have different characteristics. There are many in ancient literature about the world's origins and customs, and there are some myths with morality and spiritual meaning. Tutomatic epic in the Iron Age and more about Indian History (English: INDIAN EPIC Poetry) have more information about the author, and many myths are circulated in the way they use orally.\n\nVarious literature can be considered a record of text, and literature itself may be realistic or fiction, but it can be depicted, but some facts, such as the protagonist action and speech, the author's writing style, and the meaning of the text. These plots are not only entertaining, including related information about economic, psychological, scientific, religion, politics, culture and socialism. Studying and analyzing literature is also an important part when studying history. Studying past literature can see different historical periods, their evolution of their society and social norms, even can help understand today's literature, because of the information of ancient Greek mythology, religious classics and related literature. It is more than just seeing this topic from the topic of literature. With the evolution of history (eg, from the book of the economic history or the book of science and evolution), you can see similar content in the science fiction. The authors often add some historical content in their works, such as the Lord Byron in \"Childe Harold's Pilgrimage: Canto I\" to mention Spanish and French by the protagonist Childe Harold, which also mentioned some of the author's ideas [5]. By literary people can continue to discover new information about history, this can be seen from various disciplines in various disciplines. [6]. When people record information in writing, it is easier to pass through this generation to the next generation, and the information left will be more and more. From these information, people can study literature, improve ideas, and expand knowledge, and began research on medical or trade. With the increase and expansion of modern people's learning content, literature will have some differences, and become the foundation of people's research.\n\nMany ancient civilizations have their literature about philosophy or related perspectives, like ancient China, ancient India, Persian and Greek Roman's classical work. Many ancient works, even if there is a narrative form, there is still a moral or teachings, like Sanskrits, \"five volumes\" or Ovid's \"modified\", and later the audience of the drama and satirus There is therefore a literary creation of similar nature begins. Lyrical poetry is often the character of the noble circle, especially in East Asia, many songs are collected by the aristocrats and become poetry.\n\nRomantic abnormal traits in the medieval bloom. At the same time, the rational era has created nationalist epic and philosophical text. Romanticism emphasizes popular literature and emotional investment, slowly seeking realistic reality and naturalist literature. In the 20th century, symbolism looks up, explores the description and development of roles.\n\nFor a long time, China's literature and history and myths have no obvious boundaries, the earliest literature is a record of history and myth. But pure literature has appeared in the week, such as the \"Book of Songs\". Ancient Chinese literature focuses on philosophy, history history, military, agriculture and rhyme. China invented the papermaking and carving printing, and the world's first printing civilization (English: Print Culture) [7]. Many of China's philosophical thinking is the hundreds of sons in the Spring and Autumn Period, and the most important thing has Confucianism, Taoist, ink family and French, and military school books (such as Sun Tzi) began to appear during the Spring and Autumn Warring States. Chinese historical literature has continued from Shang Shu, Spring and Autumn, War National Policy, and History, etc., and has a very detailed information record.\n\nChina's literary achievement is the biggest poetry, from \"Liu\" to Tang Dynasty, poetry has been a huge impact on Chinese literature. Later, in the form of poetry, words, songs, and novels, in Tang, Song, Yuan, and Ming Qingqing. The new literature movement promoted by Hu Shihe Chen Duxiu during the Republic of China, believes that work should not only seek form, and should pay attention to the fullness, expression and emotion of the content, and also promote venue literature. During the Republic of China, the martial arts novels were popular at home and abroad, and became the most popular novels at the time.\n\nDuring the period of the People's Republic of China, after the Cultural Revolution, there was a related reflection literature and scar literature, and there was a number of white-minded poets to conduct a large number of creations, and they also replaced ancient poems became the most popular poetry. Later, online literature was raised and became popular business.\n\nAfter retreating Taiwan, the Republic of China has been in the 50 and 1960s, and the four major anti-Japanese novels represents the four major anti-Japanese days as the background, and later there is anti-communist, and the 1960s began, with Qiong Yao as The romance novel represents also begins to popular. In the 1970s, the new modern literature in Taiwan's social research has gradually begun, and the local literary literature that emphasizes the local local local literature. After 1990, the rise of online literature has begun.\n\nChinese classical literature is divided into poetry and text, and Wen is divided into rhyme and prose, and China's lyrical poems and classical Chinese have been more developed.\n\nLiterature is generally divided into novels, prose, poetry, script, and called four major literary genre;\n\nThe script is another ancient literary form, mainly expressing the author's thoughts and feelings through dialogue between different roles. The script can be used for the stage of the stage, or you can read it. Like the Yuanqu, Peking Opera, the Quenstill is part of this part. Many Western drama are accompanied by music and dance, such as opera and musical, ancient Greek drama is currently known in the West's Western drama, tragedy, comedy, tragic comedy, etc.\n\nThere are a lot of literature awards, issued to excellent writers, praise their achievements. Because the scope of literature is wide, many literary awards will depend on style, literary types, language, nationality and other characteristics (such as new writers or novels (English: debut novel), etc.) [11].\n\nThe Nobel Literature Award is an award established by Nobel in the 1895 will, which is a Nobel Prize [12], generally winning the author's overall work, rather than high-specific works [Note 2] . Other awards of other people with: Newstadt International Literature Award, Bark International Award and Kafka Award.\n\nLiterary skills (English: literary technique) is a way of literary creators in literature and a special effect. Literary skills are widely scope, including whether the work is to be called the first person or others, using traditional linear narratives or nonlinear narratives (English: Nonlinear Narrative), or include text options. This allows readers to feel some familiar structures and architectures, such as traditional crime novels, but some author will pay special choices to make readers have unexpected feelings.\n\nThe use of literary skills may also produce new texts, just like Samuel Richards, the early modern novels \"Pamela (English: pamela, or virtue shutard\". \"Pamela\" is composed of many letters, called \"Book Body Tips\". Therefore, \"pamela\" makes everyone noticed the book's novel (English: EPISTOLARY NOVEL), and a previous appearance, but there is no attention to it.\n\nDifferent literary skills and literary means are a bit similar to the relationship between military strategy and military tactics. Literary means is a special structure in the narrative, like metaphor, metaphor, omission, narrative theme (English: Motif (Narrative)) and House, etc., even simple homophones can be used as literary means. Narrative mode (English: Narrative Mode) can also be considered a literary means, such as consciousness.\n\nLiterary criticism refers to the comments and assessments of literary critics to other people, and sometimes it will also be used to improve and enhance literary works. Literary editing (English: literary editor) can also bring similar roles to the author. There are many different kinds of literary criticism, and there will be its theoretical foundation, and different types of literary criticism can comment on various parts of literary works or all levels.\n\n[Edit in Wiki Data] "}