{"chinese_title": "Chinese kong-fu ", "chinese": "Diet - Apparel - Architecture - Cultural Relics - Festival - Folk - Education\nScience - Five-Trim (Medical - Surgery) - Wushu\n\nChinese martial arts is an important part of Chinese traditional culture. The early days of the Republic of China is referred to as national surgery (after the name of the Central Columbus, the Taiwan is also used in this name), which is considered to be the essence of Chinese culture, so it is also known as \"national quintes\". Due to historical development and regional distribution relationship, different genres are derived. The main contents of Chinese martial arts include combating techniques, fighting techniques, offensive and defense strategies, and weapons. It is divided into two categories of theory and practice. Practice is mainly referred to as important functions such as sports and Chinese martial arts uniqueness, and health, theoretical part is a martial arts experience and box record. Therefore, it reflects the understanding of the martial arts and strategies of the Chinese nation. Plus experience accumulation, self-operation, self-reliant, and healthy health, and the exercise routine show the beautiful gesture of body movements. Chinese martial arts often bring the cultural characteristics of the ideological and refined chains and the characteristics of human philosophy, meaning, and the far-reaching influence on the popular culture in China.\n\nThe origin of Chinese martial arts can be traced back to the primitive society. At that time, the human beings used to fight with the beasts, and gradually accumulated some attacked experience. The business generation is an important means of being treated with martial arts training.\n\nDuring the business period, using the \"Wu Dance\" to train soldiers and boost. Therefore, martial arts can exercise in a dance form. Zhou Dynasty set \"Preface\", \"Preface\" and other schools also listed the shot and habits to one of the education contents. During the Spring and Autumn Warring States Period, each vassal country attached great importance to the use of fighting technology in the battlefield. Qi Qigong held a \"angular test\" in the spring and autumn to select the world hero. In this period, the manufacturing and Keyway of the sword were unprecedented development. During the Qin and Han Dynasties, the customs of the horn, fencing, and feast is happy. There is a Xiangzhuang dance sword in Hongmen Banquet. Its form is closer to today's martial arts routine. The application of the Han Dynasty has reached the peak, and various guns begin to appear. According to the first \"five birds\", it is the abuse of Chinese martial arts.\n\nPeople think that martial arts originate in combat, but the book \"Chinese Wushu - History and Culture\" is proposed that although some from military needs, most of them come from civil affairs. Martial arts and civil martial arts requirements are different.\n\n\"National Geographic Magazine\" believes in the TV show of \"Zheng He Xiaoxi\", the Northern Dynasties, Buddhist Zen Bezua Motor may bring India's martial arts into the Shaolin Temple of Zhongtonghe South.\n\nThe early development of Chinese martial arts lacks text records, which can only be passed down by the teacher.\n\nThere are many Chinese martial arts, and it is very rare in World Wushu. According to statistics, there are more than 300 fists in China currently \"clear history, context, unique style, and self-contained system\". In Guo Xiwei's \"China Sports History\" mentioned that there are many martial arts martial arts due to different geography, climate and people in north and south. The northerners have a high body, and the cold weather is harmful to the northern part of the North School. Southern water, the southerners are short, and the boxing is more delicate. The proverb also has the saying \"Nanquan North Leg\". Of course, this is not absolute, such as from the northern gossip palm, rarely attacks [source request], and the Southern Wing Chun has many legs skills.\n\nThere is a lot of Chinese martial arts, but there is no unified naming method. Some are named by the region (such as Henan sent a punch); some according to the mountain, river (such as Wudang); there is a name of the masters (such as Yang's Taijiquan) ... In the past, these genre will be maintained in the maintenance, and the external work is rough Divided, becoming two categories: both inner boxing and foreign fists.\n\nIn 1949, after the construction of the CPC, the orthodox commitment and martial arts have stopped. Only some martial arts of some martial arts are compiled into fitness and performance routines, teachers students in primary and secondary schools.\n\nAfter the reform is open, it is generally divided into two categories of rolling and fighting. With the development of fighting movements, Chinese martial arts have turned to more practical Sanda.\n\nAfter the fifth generation, the Liang people were in the \"Review\" book, alleged \"...\" 蚩 蚩 氏 人 人 觝 觝 觝 觝 觝 觝 觝 觝 向 觝 觝 觝, 向 觝 觝 觝 觝 觝 觝 觝 觝 觝 觝, It refers to the oldest wrestling. The Yellow Emperor, the Supreme Times has completely improved social organizations and combat types, so although they can not be present, they can be seen as a master.\n\nThe Spring and Autumn Warring States era also have a record of wrestling. Lu Weiwei wrote \"Breaky Month Order\" to mention that Zhou Tianzi will train the wrestling skills to train the craftsmanship training, and the two army struggle competition is called \"angle\". On the one hand, we can test the martial arts, and then collect the effect of the team to practice the troops. In addition, \"Lu's Spring and Autumn\", \"Huainanzi\" has a similar description.\n\nAfter the Qin Dynasty unified China, in the current Shaanxi Province Xianyang City, the Qin and Han Dynasties were created in the Qin and Han Dynasties in Shaanxi.\n\nWhen Li Shimin, Tang Dynasty, there was a record of Shaolin Temple in Henan Province and a record. Wu Zetian booked a martial arts system in 702 [1], the electoral army will give talents, and use the exam to grant a certain title, which greatly promotes the development of martial arts. Song, Ming, Qing also abolished, until the end of the Qing Dynasty\n\nThe Song Dynasty is the branch of the prohibition of private groups and private weapons. In the first year of 1127 (South Song Jian Yan), Song Ranked South Movement, with Yue Fei, Han Shizhong, under the proposal, most of the military and civilians were in the middle of the military and centered on Hangzhou. Hangzhou is spreading for the south box, the fist is more than the upper limbs, the elbow is supplemented, and there are very few flying to the ground. \"Boxing Wastern\" [2]. He is said that there is \"Yue Wu Mu Wang Jianjing\". It is a pity that there is no history from the ancestral teacher.\n\n1156 (Shaoxing twenty-six), the court established martial arts in Lin'an. 1180 (熙 seven years), set \"Wushu Liang from the Military Law\", the school weapon can take the fame. Twenty-seven martial arts dollar appeared in the South Song Dynasty. At that time, Hangzhou martial art group had a angular arrival, the tourist society, the water shot, the Sichuan Zhao bow, the English, Ma Shu, etc. There are also folk, archers, good people, and other groups. They have a good week, \"embarrassing the bow, the sword tour\". After the Northern was invaded, a large number of refugees came to Hang, bringing the northern boxing, and fused with the original southern box.\n\nAt this time, the \"road disagreeman\" that has been launched, and praised by the rivers and the sold art.\n\nYuan Dynasty facing the Han people, and unwaiters. Ming Dynasty is all in Beijing, bringing the South (Nanjing) martial arts such as long punches, red boxing, etc., and the original Beijing, Tianjin, the Wuzhou martial arts, such as 18-hand (叟), Liuhe and other boxing, this person is called Shaolin Boxing .\n\nThe Ming Dynasty Qi Shouguang was organized at the national martial arts (including long boxing, short hunting, red punching, Brazhu fist, and noticed that there were not mentioned Shaolong and Wudang) at the time (in the early days of the Republic of China) Nans Shaolin (Or conceptual symbol).\n\nThe coastal was searched in the coast, Yu Dazhen, Qi Jiguang has stationed in the coastal place. Fujian and Shandong have left the boxing such as long boxing, short hits, five punches and Huaquan. Fujian is derived from five-shaped punches, crane boxing; two widely derived of Hong Bun, Wing Chun and Cai Liover and other south boxes (now called South Shaolin). Shandong will appear in Luo Han Boxing and Liuhe Dynasty.\n\nMing Wanli Zhang Songxi created the inner fist. (At this time, it was called the punch. Wu-style Taijiquan in the Early Republic of China said: Song Shu Ming claimed to be a good fist in the Song Dangqiao, and there was no evidence in the second ancestors.\n\nMing Dynasty formed a number of \"fists\" techniques. (At this time, it was called the punch. Many books that record martial arts are also published. Popular \"boxing\" has a long boxing (after the life is Tai Chi), the red boxing, Huaquan (after the life is a six-hand boxing), five boxes (after the play, the five-shaped flood boxes), check the boxing, Big boxing, Sign in legs, short hits (the launches are born in the boxing), inquiries, etc.\n\nIn the early preliminary, the Han people must not gather people to praise, the south, Shaolin Temple no longer exists, Shaoshan Shaolin Temple is monitored, and the temple is not kind.\n\nAt the beginning of the Ming Dynasty, in the middle of the \"five punches\" in the south (five-shaped fists), this person is called \"Nan Shaolin\", popular in Guangdong, Fujian. Its boxing is from Fujian, and the south of the south of the south. The sea salt in Fujian, the foreign goods are in Guangdong, all must be proficient in the darts of martial arts.\n\nAfter retiring, Chen Wang Ting took his boxing (including long boxing, gun, red punch) to Taoist elements, to Tunne's health, inheriting Chen's long punch in Homestead, and belonging.\n\nIncidental traffic is inconvenient in the Qing dynasty, freight safety must be guaranteed. Because the Han people don't want to praise the martial arts, they do it close to the people of Zhangzhou in Beijing. Zhangzhou is the main way for the freight into Beijing. There is a six-in-law, Luo Han boxing. Huimin Foreign Boxing (such as Barbun, Cheap, etc.) is popular, and join local boxing; long boxing and red fists.\n\nMing and early Qing dynasties, the gods (1602-1683) taught the boxing \"Liuhe Boxing\", including the trend (potential), the later generation, the heart, the heart, Liuhe box, etc., today, \"Northern Shaolin\". Yongzheng thirteen years (1735), Henan Jinshi Wang Sheng made \"boxing question session\". \"The order\" cloud: \"The type of boxing is different, he does not know what to create, but the Liuhe fist is from Ji Long, Ji Feng, and the second division is in the late Ming Dynasty (should be the mistake of Ji Longfeng (Feng)) , Is fine from the gun method, people have thought of God ... \"[3]\n\nThe name of the inner fist appeared in Huang Zongxi as a \"Wang Zhengnan Epitaph\" in Kangxi, Kangxi, for 1669.\n\nFirst, in Guangdong, Lin Zexu and two Guang Guang Governor Deng Tingyi severely smoking, need local community and martial arts group support, vigorously develop civil pilots to enter the Guangdong Sanjiang River Basin from the sea road, and the Han people are prohibited from gather in the Qing Dynasty. Later, Zeng Guofan developed the Hunan Army of the Hunan Army in the pilot system. Make Han people to develop.\n\nChen Wang Ting, Chen Changxing (1771-1853) Chuanyang (1799 - 1872) (later said Yang Ti Taijiquan), Yang Decorate some new fists (such as artillery, red punch), pay attention to just soft . Hebei Li Luo (1808-1890) from the heart of the six-in-one boxing.\n\nIn 1851, Taiping Heavenly is formally established, and Tianti, Tianjing (now Nanjing) in 1853. The three-phase martial arts group of Guangzhou and Foshan in the Southern Big Cities rapidly developed human resources for Taiping Heavenly Kingdom. Participating martial arts association leaders, in order to avoid their own friends, they are numbered. As a \"South) Shaolin as a call. Hong Bun, Guangdong Foshan (the so-called Shaolin fist) has passed Hunan to Nanjing Jiangsu, Zhejiang.\n\nChen Xiang was in 1845, after Lin Zexu was removed, returned to the township room, Xijing Mei Village, Xinhui, Guangdong, opened Hong Shengwu. Therefore, it is called the flood box. Later, 44 branches were set up in Guangdong. There is a flower boxing, Pingpeng, Five-Shaped Punch and Gossip.\n\nHuang Huabao was 1852 years later, the technological Foshan Liangzhan, removing the hard work, emphasizing the flexible south of the skill, and the Wing Chun boxing appeared. The five teachers of Shaolin.\n\nQing Wang Zong Yue appeared \"Tai Chi Boxing\" (in 1852 by Wu Yi), starting there is a Taijiquan name, only gossip five lines of thirteen. Retirement Eunuch Dong Haichuan (1797-1882) was taught in Beijing to teach the gossip palm in Beijing after 1856. Zhao Bao Chen Qingping Fu Wuyi (1812-1880), (Wu Shi Taijiquan).\n\nSome famous martial artists, such as the high three, Chen Enjo participated in the Secret Common Hall to overturn the Qing Dynasty and promote the development of Chinese martial arts.\n\nHongquan in Foshan, Guangdong, including floral boxing and gossip (Pacific Heavenly Hongxiu full boxing - (South) Shaolin Boxing) passed to Nanjing, Jiangsu, Zhejiang. Guangdong Huang Yinghong Hongjia Boxing Huang Feihong (1847 - 1925). Zun (South) Shaolin Xi Shan Zen Master is ancestor. Zhang Yan was connected to Foshan Hong Sheng Hall in 1876, and Professor Cai Li Fuquan. Zun (South) Shaolin Xi Shan Zen Master is ancestor.\n\nThe Qing Dynasty is in place, and the rich people and shops can come to the house, and trained to the martial arts; local people have self-owned people group (self-defense team), hired martial arts coaches.\n\nAfter the middle leaves, there is an inside (practice a tone), and the outside (practice of the bones) home. There is also a Buddha, and the road is also different. There is also the branch of South (punch) North (leg).\n\nShandong Fan Xudong (18 ?? - 1935) The \"Shaolin Clothing\", according to the \"Luo Han Short play\", and its own experience is complemented by five volumes. Content theory and the 18th Method, the Boxing method, 螂 短 要 要 论 论 论 手 手 手 手 总 总 总 总 总 总 敌 总 总 总 敌 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总 总(The name is officially appeared).\n\nFuju Zen Master flows to \"short secret keys\". The self-written time is the five years of Xianfeng (1856) (the book is said, there is no evidence), and it is believed to be a copy of Fan Xudong or its future generations.\n\nThis phase of the boxing, the gods appeared. There are Shandong Bai Lianyi or its tributary - Qixing Red Punch (Qi Xing Boxing in front of it?), Righteous and punch, volunteer punches, Eight Pan; Sichuan has plums (Huayuan? See Sichuan Chu Chu); Guangdong has a Buddha Boxing and gossip (see Chen Enjoity and Taiping Tianshi).\n\nIn the late Qing Dynasty, the name of the Wudang School appeared. The Wudang School or the inner boxing refers to the local martial arts of Beijing, Tianjin, Zhili, mixed the long boxing, cannon, red boxing, and the Taijiquan, gossip palm, and the best boxing.\n\nThe name of Shaolin is also appearing at this time. The revolutionary party borrowed the mirror of floodmen, and spreads the fire to Yin Temple and other refused emotions in the party and the community. In the three years of Xuandong (1911), Shanghai \"Tiangui\" served as \"Shaolin Zong Law\". It is related to Cantonese people, Chen Tieheng and other collective creations, the South Shaolin pointed to the South Shaolin: Historical background and the description of the description. The boxed boxes have been Guangdong Hong Bun. Mr. Tang Hao once adopted and had a book of Shaolin Boxing Secrets.\n\nBei Shaolin refers to the boxing of the Candles of Hebei. Refers to Liuhe, Luo Han and Dragonfly. After the stamp, practice hard work, the whole body is tight. Dantian is two to three inchesides on the navel, exercising the overall abdominal muscles. Nan Shaolin, Guide; By the martial arts, the whole body muscles are not tightened than \"Bei Shaolin\", Qigong transferred to just soft, Dantian two to three inches under the navel, exercise the abdominal muscles. The Southern Boxing Boxing is accepted by the fullness (even as the ancestors of Shaolin as a just punch). (With five teachers too, Fang Yongchun, Yan Yichun as the conceptual symbol of the soft boxing).\n\nIn 1909, since the founding of Huo and Huo Yuanjia in Shanghai (At that time, after the first folk martial arts group) Jingwu Gymnastics Association, Foshan, Hankou, Guangzhou, Zhangzhou, Nanning and other places were established and influenced. And, overseas branches such as Hong Kong, Macau, Singapore, Malaysia, Vietnam, etc. also have established. The purpose of the Jingwu Gymnastics Association is to promote martial arts, research sports, and cast strong people.\n\nChina Sami will be a large-scale private martial arts association established under the North China League Association, which is organized by Ye Yun Table, Ma Fengchao and others. In the same way, we will improve Chinese martial arts and invigorate national spirit. In the autumn of 1912, a grand martial arts show held in Hebei Park in Tianjin.\n\nIn 1912, Beijing Sports Research Society was established in Beijing, Heng Zhiyun, Yang Zizi, Zhao Xinzhou, Hengshou Mountain, Ji Zi Xiu, Gao Kexing, Yan Ruiyi. The purpose is to develop martial arts sports, cultivate talents, and achieve the purpose of strong national salvation. [4]\n\nIn the early years of the Republic of China, the folks are relatively stable and economic transformation. Guarantee 镳, hood, pilot, all transferred to the martial arts, many new genres appeared. In the late Qing Dynasty, Li Jinjun's martial arts is also the boxing of the Yuan Shikai's new army, and the straight warfare is successive. The National Government actively supports the people's martial arts. Martial arts sports class is also established in major advanced colleges.\n\nWu style Taiji, the Early Republic of China, said that she said to the Song Song Ming of Yuan Shikai, claiming to have a Taijiquan of Yuanzu Song Yuanqiao. Said Zhang Sanfeng Chuan Zhang Songxi and Zhang Cuishan, and Fu Song Duanqiao, named 13 style.\n\nIn 1915 (four years of the Republic of China), the Zhonghua Book Company published the \"Shaolin Boxing Tips\" written by the owners. The content is like a martial arts novel. Now it is said to the so-called \"Shaolin Pai\". The following is the legendary novel of Shaolin. Such as Zhao Shi's \"South Shaolin Legend\", \"Fire Burn Shaolin Temple\", etc. In 1918 (Seven Years of Republic of China), the Loud Book Company published the so-called \"Yulin Boxing Jun\" combined with the \"Voltivity Chart\" and \"Yi Ji Jingyi\" in Lu Shizhen. The content is not related to Shaolin Boxing. In 1926, the Kuomintang began in the Northern Expedition. On March 6, 1927, Shaolin Temple hosted Miaoling and the Joined the Beiyang warlord, in the dance Yang, only 37 years old. In 1928, Shaolin Temple in Shaoshan was burned in the warlord.\n\nThere are many new martial arts in the martial arts in the early years of the Republic of China. They all said that they have exactly the best of Shaolin five old, Shaolin Temple, Wudang School and 嵋 嵋. However, this revealed their \"new\", and its purpose is to \"source orthodox\", and most of the substance is mixed by several Master. Sophistication and other Shaolin five, for the late Qing Dynasty, in the late Qing Dynasty, the Wushu novel \"Wan Yong\" in Guangdong, and the other \"Qianlong Huntuan Jiangnan\", is selling. There is no more records in the history of the Ming and Qing Dynasties. \"Wan Yong\" is popular in Guangzhou and Foshan in Guangdong Province in the late Qing Dynasty. At that time, the famous boxing of the land had a Wing Chun boxing (complied with the five teachers to ancestors); Hong Bun, Hua fl flut (now Shaolin Yongchun) and Cai Li Buddha (complied with the ancestors of the ancestors); Huaquhao (complied with the ancestral teacher); Dongjiang Bun (obeying the opposite of the opposite). The novel believes in writing the plot of the Han people in Guangzhou computer room according to the above-mentioned number of martial arts.\n\nIn the early days of the Republic of China, advocating \"strong country\", martial arts encouraged and implemented. In 1927, in order to further manage the respective political and strong martial arts groups, the National Government has set up a central Chinese-Chinese library in Nanjing, and established a pre-evaluation office, Tang Fan Sheng (Hao) as the head office. Due to the true martial art history of Tang, it is not possible to have some powerless people. A lot of Hostu (pseudo) handwritten is collected by the subsequent pre-examination.\n\nAt the time of the Military Foreign Large, there were Li Jinglin, Zhang Zhijiang and Du Xin five, etc., please ask the martial arts of each school to teach. Divide Chinese martial arts into two doors of Shaolin and Wudang, and then subdivided. The martial art officially appeared. At that time, Manyu (claiming to be Du Xin Wu) called himself to send a natural door for the moth. Since then, the eight major martial arts appeared on martial arts novels, officially fighting, and all the ancestors, one authentic.\n\nIn December 1927, the willered Zhang Zhijiang founded the Martial Arts Institute under the support of Cai Yuanpei of educators. In the slogan of \"Strong Savings\" and \"Royal Examination\" as the slogan, the Nanjing government and local army also laid martial arts as the main surgery of training the army, so they have set off martial arts hot, all provinces and cities and counties. \"\" Has been established. [5]\n\nSince the heart of Japanese aggression has appeared, the patriotic anti-gold hero Yue Fei, and the success from the foreign national retrieval of the politicism of Ming Taizu Zhu Yuanzhang was made into Shaolin hero. After that, many so-called martial arts handwritten secrets, all called Yue Fei, Zhu Yuanzhang, Qi Jiguang and Yu Emirates against foreign enemy hero; all have a relationship with Shaolin Temple.\n\n1929 (18 years of the Republic of Republic) published the \"Book of the Book of Book\" by Shi Pei, said that it was made by Cao Huanou, and collected Kangxi, Zhang Kong Zhao's boxing. [6] In the same year, Zhang Zhijiang, Li Jinglin held the \"Wushu Games\" in the \"West Lake Expo\" in Hangzhou.\n\nIn 1932, Jin Enzhong claimed to be a seventy-two technique for the Miaoxing and Shangxing of Shaolin Temple. In 1933, the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of the singer of \"佗 佗 佗 术\" and It has been published \"Shaped Boxing Lecture\", \"Xiangxiang Boxing True\", \"Ling Venean Teacher Points\".\n\nIn August 1936, the Chinese martial art team went to the Berlin Olympics to participate in the performance. In the same year, \"蟫 蟫 庐\" published a \"Boxing\" full of \"Boxing\". After the Tang Hao test, it may be the legal law of the Ming Dynasty and Yulin Mu Xuan Juan.\n\nSince then, China has experienced the World War and the country's civil war, and the development of martial arts is not developed.\n\nIn 1950, the official Zhonghua National Sports Club established martial arts to serve the people's health. The Communist Party implements a public system and cannot be awarded privately. Some famous fist, famous boxing, such as Wing Chun, etc.\n\nIn 1956, the China National Sports Association established a Chinese martial arts association to raise martial arts as performance projects, and established a martial arts team. Chinese martial arts association management and allocation of all martial arts practitioners. There are only twelve martial arts units nationwide. Professor pays attention to the legacy of the fitness and Qigong. Like Yang's Taiji twenty-four, fan dance, sword dance, etc., Magnolia and other aerobics. In 1957, the Chinese Wushu Association organized the martial arts association in various provinces and municipalities. In 1960, mid-local, primary schools labeled martial arts as physical education content.\n\nFrom 1966, martial arts were denied during the Cultural Revolution. Old fist books were destroyed. The martial art workers are cleared. 1966 - 1982, within 16 years, martial arts development is completely paused in China.\n\nFrom 1983 to 1986, the State Sports Committee (referred to as the State Sports Committee) made a martial arts census and re-entered the content of martial arts units (martial art). In 1984-1993, there were two top Chinese Chinese national competitions, and there were two kinds of performances and fight competitions. The three sides of the strait and the international representative of the \"City\" grade, each country is not necessarily each \"city\" \"There are representatives, but each ninth (45kg level to 85 kg) event has more than one hundred representatives to compete for sixty-four, and it is very feat; the competition will end due to the political contradiction between the two sides. Hold. In 1993, China was substantially involved in China. This year, the competition system contains the origin of origin.\n\nIn 1985, the first International Wushu Invitational Tournament was held in Xi'an and established a preparatory Committee of the International Martial Arts Federation. At this point, local martial arts groups have settled or recovered, such as Shaolin Temple, Jingwu Sports Club, Wudang Road Wushu Institute, China Emei Wushu Research Association. The so-called (eight or ten) menisses have appeared again.\n\nIn 1987, the first Asian martial art tournament was held in Yokohama. In 1990, martial arts was first included in the eleventh \"Asian Games\" competition project. In 1999, International Wuling was absorbed as a member of the official International Sports Senior Association of the International Olympic Committee, which is a sign of Chinese martial arts toward the world.\n\nAt present, the Wushu Movement Management Center (formerly known as the Martial Arts Management Center of the People's Republic of China) and the National Sports General Administration Institute (originally known as the Chinese Wushu Institute). The National Martial Arts Organization - China Martial Arts Association is also one of the individual sports associations under the leadership of China National Sports Association. It is generally initiated by them to organize martial arts sports competition. The above organization believes that martial arts should turn to a strong fitness and competitive sports competition.\n\nIn addition, there is an international martial arts federation (English: International Wushu Federation, abbreviated as IWUF) to promote martial arts, and believe that martial arts should be a kind of competitive sports, and organize international \"standard routine\" competition. Therefore, the martial arts competition is criticized as a performance \"dance\", no practical hit, just the gymnastics of Huayuan embroidered legs. At present, there are 114 Member States in the International Martial Arts Union. Therefore, China officially launched a Sanda Movement since the 1980s. However, this has been criticized, and many negative people do not recognize that it is calculated as Chinese martial arts, criticizing it is the leg law of Thai, boxing, plus some four unlike paintings (because Chinese traditional martial arts Pretty and it is completely either).\n\nChina's boxing has developed a long boxing system, and two systems in the Ming Dynasty. In the early days of the Qing Dynasty, the development of the above two major systems were mixed.\n\nWhen Qianlong, the Tai Chi Boxing was a simplified long boxing system with five lines of gossip and other ideas, the same farewell boxes will be boxed. Mixed above three major systems play out modern boxing system, including Wing Chun, Dacheng, Jamaday, and now Wu Xu, Emei.\n\nThe study of Chinese martial arts is currently enrolled in the martial arts or some martial arts teaching venues. Traditional martial artists studying in the people still maintain many ancient traditions, need someone to recommend, then post the post to worship the teacher. Although it has rarely \"three years old, the teacher is three years\", it will still have a long observation period, let the master understand whether the apprentice can teach; let the apprentiuses understand whether the master's work can learn .\n\nThe cultivation of Chinese martial arts, all gates are different. It is generally included basic skills, routines, internal strength and external work. In particular, the internal strength and external work are regarded as the most important content by all the factions. The statement of \"inspiring one breath, external practice bone skin\", refuses to show people, even if their apprentices are not necessarily pouring . [Source Request]\n\nIn terms of internal strength, the main Chinese medicine theory is the meridian of Chinese medicine. TCM believes that \"meridians are the table, the organs of the organs\", cultivating the meridians, will have the effect of conditioning, consolidating and enhancing the viscera. The internal strength of Chinese martial arts is mainly inner gas, and meridians are channels running in the internal gas. The intra gas is operated in a manner in a manner. It will cause the meridian itself, the corresponding organs, and the whole body to adjust, consolidate, and enhanced. effect. [Source Request]\n\nIn terms of external work, many external practices should be aid with drugs. The auxiliary role is mainly divided into auxiliary practice, healing, conditioning and enhanced body corresponding parts and organs. The action of drugs generally includes multiple aspects therein.\n\nThe basic work of Chinese martial arts is different. Generally there is station pile, such as station horse step; a method of flexibility of various exercise limbs (similar to the training method of modern other sports projects); some basic movements and basic routines practice. This is for traditional martial arts. For the current routine martial arts, it has certain athletes, and directly learning the routine action, and pays attention to the basic skills of traditional martial arts.\n\nThe basic skills of Chinese martial arts pay attention to \"the body of the hand, the spiritual power\". There is a punch, palm, hook, \"four hits eight law 12\".\n\nIt is mainly to use breathing, Tunne, luck, and make an intention to focus and cooperate with physical action to enhance the effect of attack and defensive action.\n\nInternal work practice: Most of ordinary people cultivation as a method of strong body fitness. If you have long-term persistence and practice your ability, you can make your spirits, the whole body is highly comfortable, and your body can be enhanced. If you do a long-term exercise as a masterbatch, you can significantly increase the muscle explosive [source request], and enhance the physical strength [source request]. Some major genre, there are efforts to make internal gas. [Source Request]\n\nBecause Chinese folk thinking is far from the past. Taoism has a statement that the big horizon (the world) and the small universe (body) can communicate with each other, so there is so-called Qigong or internal practice. In this context, some martial arts schools in China also have \"raise\", \"training\", \"luck\". At first, the internal strength is not the content of Chinese martial arts. After a long development, it is gradually combined with Qigong.\n\nDifferent genities have the same understanding of \"qi\", but the difference in the imagination of the atmosphere is similar to the imagination of the atmosphere. It is similar to the gas in the theory of Chinese medicine, but is different from air or other gases in modern science. The internal gas is also known as \"real gas\" or \"qi\", and the internal gas is roughly divided into two categories of motion and moving. The former has a certain action routine with breathing, the idea is enhanced to the internal gas, promoted, and widely flowing. Such as Tai Chi, etc .; the latter mainly rely on breathing and ideas to achieve the same purpose. The latter is more difficult. Also, due to depth conditions, it is susceptible to external interference (that is, the so-called \"fire into the magic\"). [Source Request]\n\nMainly to exercise the intensity of the bone skin, the use of practicing hands, eyes, body, steps and shoulders, elbows, wrists, knee, and knees, to strengthen the power of attacks and defensive movements.\n\nThe practice method is similar to those similar to other skills, and it is repeatedly hit a certain hardness goal or repeatedly hit it. However, in Chinese martial arts, traditional Chinese medicine practicing is also an important role, including healing and Conditioning the body.\n\nEffect of external work: The purpose of external work is to increase its own fight against the fight, and the other is to increase the power of attack. Because martial arts as a combat combat mean has already basically disappeared, only a few people are practicing external work. The content of the disclosed performance and armed police training includes a brick slamming the head, the brick is broken and the head is not damaged. Over earlier periods on external public performances have a performance in which the knife guns in the period and group.\n\nChinese martial arts a more significant feature is that there are many sets of roads. The routine is a series of actions containing the actions of martial arts and attack defense. All their families have many sets of jackets that express their own portals, and the routine is gradual, and the junctions of beginners and practicing people learn are different. At present, although the martial arts athletes will learn very different sets of routines, it is not clear for their hit and attack and defense.\n\nIn traditional martial arts, there are many initials in the early days of the routine, let the learners feel the meaning of luck, and the impact of the attack. And this practice is repeatedly carried out, and it is necessary to carefully understand the effect of the movement in the actual anti-reflex, it can carefully understand the effect. For example, Guo Yunxiao, who is known as \"half-step collapse to play the world\", and the enemy always uses a moving collapse, and strictly just half a move, but it is enough to defeat the opponent.\n\nThe main source of martial arts instruments is the weapons of the cold weapons, such as swords, knives, guns, sticks, etc. In ancient China, the sword once is the most important short weapon on the battlefield, which will give the knife. The martial artists have the most widely studied instruments with swords and knives.\n\nOther martial arts instruments include non-combat weapons such as moth eyebird, nunchakows, or some daily life, such as embroidery needles, stone mill, iron pot, sickle, umbrella, and so on.\n\nChinese martial arts always give people a mysterious color. This is of course the impact of martial arts novels and kungfu films. However, China's martial arts itself is due to the impact of traditional traditional partial laws (see \"Chinese Martial Arts - History and Culture\"), most of them are secret teaching, and the crucial place is even more than the words, but the teacher is said. Therefore, just in accordance with books, basically it is impossible to truly learn. It is also because of this, many boxes have gradually extracted, slowly become a topic of Yi Wen or Square.\n\nChinese martial arts is very different in the performance of martial arts and martial arts in other regions. China's martial arts is a different level of competition. Therefore, Chinese martial arts produces an empty hand in an empty hand of an empty hand and a weapon, and the martial arts used in the plane, and the hidden instruments used when the passenger does not preparation. Wait. Even the monkey fist also has a leg gate Also absorbed.\n\nThe actual combat fight of Chinese martial arts is exaggerated due to literature and movies. The handicrafts between martial artists use the form of push hands, point until. And the truly struggle is not like a lot of people to understand, and it is half a day, and most of them are only a few rounds.\n\nIn terms of actual competition, the existing Chinese traditional martial arts programming film information can be found in an embarrassment, whether it is Chinese martial arts against modern struggle or with foreign skills exchange, most traditional martial arts players or participation People often have a trick to the double boxing, the legs make the legs like a scattered leg or a blank handkerchief, and even the scene that caught the opponent and wants a lot of fell, and even more people can see the game The two are almost close to the village fighting of martial arts, and the traditional martial arts exquisite technology did not see. The demonstration is a matter of routine dismantling. In fact, the game is playing again, and it can see the boxing, the kick, the mutant, the power to see the power and momentum Not as far as shed.\n\nWhat kind of realm of Chinese martial arts can practice, it is a problem that is difficult to answer. According to Taijiquan's statement, the highest realm can reach \"a feather can't be added, mosquito can't fall\", that is, a feathers encountered his body, can be bounced in him. But can anyone can achieve this ideal realm?\n\nChinese martial arts is one of the important collective memories of Chinese society. It has often emerged in various literature, movies and drama, and has a deep and uncharacted humanistic meaning against Chinese society. In addition, due to the relationship between globalization, Chinese martial arts often appear in European and American movies and TV programs, and it is an important foot of Chinese culture by Europe and the United States.\n\nEverything in modern Chinese is talking about Chinese martial arts, often paying great attention to the philosophical spirit of it. Most people who love Chinese martial arts have attached importance to \"ethics and value of martial arts\", or called Wu De.\n\nTraditional martial arts, the first \"respecting teacher\", teach people to do good, practice martial arts purpose is to exercise the body, self-defeating, and then weaken, the safeguards.\n\nOften some people will quote \"Tang Ge as Wu\" to explain the humanistic spirit of Chinese martial arts. According to \"Zuo Chuan Xuan Gong Twelve Years\": \"Fuwen, Tengang is Wu Wu\", mostly said that China's Chinese characters \"Wu\", composed of two words \"stop\" and \"Goro\", thus interpreting The true value of \"Wu\" is not to kill damage, but for later peace. Although the source of \"Wu\" word is explained, for example, some people think that \"Tong\" \"toe\" is \"hand\", \"toe\" picking up \"Gao\" for the fight. But many people like to explain the part of the spirit of Chinese martial arts.\n\nRegardless of martial arts, novelists, movies, often emphasize the value of Chinese martial arts: \"Kung Fu is not used to fight, but use it as a strong body.\" When the martial artists learn the skill, it should be \"point until\", and should not be chaotic. The people who will, \"don't worry about the dryness\", you must \"quit the use of our urgent use\" because martial arts should not use active injuries, but should only \"as self-defense purposes when necessary.\" As for the country, when the country is in danger, it is the time when the husband is responsible.\n\nWe can sum up Chinese martial arts for the Chinese meaning, in:\n\nChinese martial arts, in China's modern and popular literature, movie works, and then derived from martial arts novels and action movies.\n\nIn these works, Chinese martial arts often have the following role:\n\nIn fact, people who write the above works often do not really understand Chinese martial arts. Some of the martial arts movements, the martial arts genre is the subject, and others refer to some legendary martial arts, and some are more martial arts content that creates Tiama. In fact, there are many martial arts (such as flying walls, point acupuncture, closing mountains, etc.) in various stories, are all tricks, but under the rendering of the story, these movements have been out of reality. It is far away.\n\nMany cultural analysis believes that this is reflecting the weakness and depression of modern people in society, making people seeking to overst the human body strength to defeat anxiety, and and mechanical civilizations in the real society. "}