{"chinese_title": "Chinese drama ", "chinese": "Diet - Apparel - Architecture - Cultural Relics - Festival - Folk - Education\nScience - Five-Trim (Medical - Surgery) - Wushu\n\nOpera refers to the traditional drama of Chinese culture. \"The Opera\" is seen in the \"Wushu Village\" <the word Wu Yunzhang biography \", the Guide Song is playing in the folk drama, which is the development of the drapers of the South. In a Song Dynasty tomb unearthed in the Henan Province, the \"Song Yilu actor Dingdu Same Brick\" was discovered in China's existing cultural relics in China's first recorded drama performance. After the name of \"Opera\", \"Chinese Traditional Drama\" is referred to as \"Chinese Traditional Drama\", and the \"Song Dynasty\" is the first to \"opera\", and the Chinese traditional drama will be pushed first. The \"Chinese Traditional Drama\" is the special name of \"Chinese traditional drama\".\n\nWang Guowei will define the \"singing and dancing story\", but also pointed out that the spoken is an important feature of the drama different from other texts. From this definition, the opera must have basic elements such as actors, theater, poetry, dance, music, spokes, and stories. Taiwanese scholar Zeng Yisheng will regard Wang Guodian's definition of the opera as the condition that the drama small play must have, and the performance art of the small play is relatively primitive. Compared to the playful drama has a higher artistic performance, it is already a comprehensive literature and art. It is defined as: \"Chinese classical drama is in the stunning story, with poetry, closely combined with music and dance, plus acrobatics In order to sing the narrative method of singing literature, through the integrated literature and art of the spoken, the comprehensive literature and art showed in a narrow theater. \"2001 UNESCO first\" literary represented by the human non-material cultural heritage \" The Quenston has been included in the list, causing public on the development and inheritance of opera. In 2009 and 2010, the Cantonese Opera, Trends and Peking Opera have been included in the world-class intangible cultural heritage and opera art further from the world. [1]\n\nAccording to the installment, Chinese operas include:\n\nAccording to the data of the China Art Research Institute, in the late 1960s, the early 1960s, the Type of Leap forward, China has 367 drama drama, including more than 50 newly created dramas (ie, emerging drama); in 1982, \"China The investigation statistics for the compilation of the Baskkooks · Opera Volumes have found that there are still 317 dramas at that time; in 2005, only 267 dramas were left [2].\n\nIn many drama, Kunqu and Peking Opera are considered to be the highest model of traditional Chinese drama [3], other common dramas have Henan Opera, Cantonese Opera, Yue Opera, Huangmei Opera, Event, etc.\n\nCoala (the ancient book, Hu Yizuo), Taiwan's cloth bag, Nan Direction (seven son, nine \", North management (chaos), shadow play, 傀儡, Hakka Drama, Peking Opera, Yu Opera, Kunqu, Huangmei Opera , Three-foot tea show, praise, local song, car drum, cow plow, bamboo array, seven-ring, moline "}