{"chinese_title": "Ethnic group ", "chinese": "Ethnic groups (English: Ethnic group) refers to a group of people who think that they share the same ancestors, blood, appearance, history, culture, customs, language, regions, religions, living habits and national experiences, thus form a common group. In order to distinguish between the classification of our \"other people\". These differences of these differences and others are called ethnic divisions (English: Ethnicity), which may include \"objective\" and \"subjective\" (such as cognitive and emotional ingredients). [1] [2]\n\nEthnic groups, this noun is translated from English ethnic, from the ancient Greek ἔ ἔἔος (Ethnos) adjective morphology ἐ ἐθνιςς (Ethnikos), literally is a family, or a crowd, refers to a crowd of ancestors, culture and customs. This single word becoming the Latin Ethnicus, becoming the word in the ancient English in the Middle Ages. In the Middle Ages, it corresponds to English FOLK, in the middle of the middle of the century, it corresponds to English. The meaning of ethnic groups in the 19th century is that Europeans used to refer to immigrants, races and even non-European immigrants, races, and 1900, the meaning of cultural character is distinguished, and the latest views believe that the ethnic society is society. The result of the result of the process. Therefore, the ethnic group may form a \"one group\" and other differences from the historical, cultural, language, geographical, religion, blood ancestors,, behavioral, religion, blood ancestors. [3] [4]\n\nAccording to Hao Taomi, Chinese ethnology and anthropologists, the ancient Chinese \"nation\" may be introduced to Japan in modern times, but the empowerment of modern significance is mainly in the Japanese translation of Xishu (mainly German books). \"Ethnic Groups of Group (ethnic groups \"and\" nation \".\n\nEthnic groups can refer to ethnic or races, or groups with the same language, behavioral orientation, gentle, ancestral, cultural background or religious beliefs, [5] belongs to cultural anthropology or sociology concept.\n\nThe group is not an objective thing, but is defined and divided by people, with great scalability. The ethnic identity is sometimes self-defined. In order to seek group unity, resist discrimination, strive for political economic rights, self-advertising, etc.; the identity of the ethnicity is sometimes decided or \"divided\". [6] "}