{"chinese_title": "print ", "chinese": "Printing refers to a technique that rapidly replicates a large number of images or text originals. Generally, the printing machine is typically published on the paper, which is the basic component of the publishing. The printing machine is a machine capable of printing on the substrate. Library is known as one of the four major inventions of ancient China, which can be said that the two great inventions of paper and printing have played a decisive role in the spread of human cultural knowledge.\n\nToday's books usually use offset printing technology to print, sometimes inversion printing (mainly for printing, but also less).\n\nPrinting is the earliest to trace back to the east of the two thousand years in the past three thousand years, Soviet, etc.\n\nThe sculpture printing is the first in China, which is gradually developed and synthesized by two methods of Tui and the seal. It is a long time, accumulated many people's experience, is a crystallization of human wisdom. The earliest literature and the earliest carving type are in the early days of the Tang Dynasty.\n\nThe earliest carving print in the world is China invented. At the end of the 19th century, there were Japanese scholars, and the Chinese six charters were printed in the 6th century. According to the \"Yan's home training\", the word \"\" is \"in the\" 河 汾 \" In the thirteenth year of the Emperor, he was abandoned as a written sculpture version of the sculpture, and thought it was printed in the Sui Dynasty. [2]\n\nThe earliest print record\n\nTang Dynasty literature\n\nThe mulade printing Buddha is a great relationship with Buddhism in the Tang Dynasty, and Buddhism has a great contribution to the improvement and inheritance of early printing in China, North Korea, Japan, and Buddhist technicians. [3] The scope of the printing is then expanded to other classics.\n\nExisting printing products are:\n\nChinese traditional Chinese paintings have also retapleded with wood-based Chinese painting, such as the famous Yangliu youth painting.\n\nSince the printing of the engraving printing can only be used for specific prints, the platelet has a large workload, and the efficiency is low, making early prints very precious. In order to solve the problem of the plate, the orthodontics are later invented. Since the alignment in the group version can be reused, the overall efficiency of printing is greatly improved. Early alignment uses cement production, modern times are improved to use lead words.\n\nLaboratory printing is a Bi Song in 1040, China. The \"Mengxi Net Talk\", which was called Shen Kuo, was described in the time of the famous scientist, and completely non-suggestions included a complete set of orthodontics and printing and printing, and the principle of the prototype plate version of the later generation was identical. Bi Sheng invented the slurry word printing was carefully designed, and the repeated test was successful. Early active word printing is found to find and confirm the authenticity and scientificity of Bi Si's orthodontics.\n\nMetal alignment printing is also invented in the Northern Song Dynasty. In the 12th century and 13th century, the orthodontics spread in Asia, there are many libraries in Arabic and Chinese, including tens of thousands of books. Metalism is invented by the Song Dynasty.\n\nChina's Yuan Dynasty, China and Europe have a great development. First, the expedition of Mongolia, bringing China's culture to the West, and the Western missionary soil has also come to China many times, and also brought China's printing technology. In the 13th century, the Italian Human Bo Polo has been in China for many years. In his \"travel\", the situation of China's printing banknotes is described. His introduction makes Europeans know China's printing. It is said that in this period, some people also brought China's prints and carving to Europe. China's printing is most likely to pass through the Uighurs through the Silk Road into Central Asia, spread through the Arab world to Europe. The world's earliest active alphabetic version of the world is currently discovered is the 14th century ancient dimox of the 14th century in Dunhuang.\n\nIn 1880, an archaeologist found more than 50 carved prints from 900 to 1350 in Egyptian Fa, including praying and Qur'an, and these prints were printed on paper, and the printed is like China. Printing, is not imprint. The academic community generally believes that Egyptian carving printing comes from China, not the livestock of the earth [8] [9].\n\nIn 1294, the Mongolian Kajia Tu Khan, who was ruling in Persian, was printed in the big hairy, and it was printed with Chinese \"banknotes\" word [10].\n\nIn the 1310, Persi historian Lished Ding Ding Ding Ding Detained in the book of \"World History\", in detail, China's carving printing [11] [12].\n\nAlthough printing has been introduced to the Arab world, it is blocked by religion, especially in 1727, Islamic leaders announced that the printed Guran has violates Izlan, which is prohibited, so that printing is not developed in the Arab world [13]. In 1707, there was a Hungarian named Ilahim, approved to Turkey to establish a printing office in Constantine, at that time, although the Sudanese Haymot III was approved, but the Qur'an can only be copied, it is not allowed to print, 1729 In the year, a history of Egypt was published, causing a strong opposition. In 1825, there was no more printing attempt all over the Arab. However, in the 15th century, there are also Arabic Wenlan in Italy, but the 16th century Syria also still exists in Arabic printing. In 1797, the Russian Catherine was still printed in Russia with a carving of Quran [14].\n\nAs in Europe, like China, the first thing is the carving printing, and there is a library printing. Europeans discovered that China's orthographic printing is higher than that of the engraving printing efficiency is so fast, and the carving is eliminated. About China's printing is passed to Europe, there are three in many books. One is the European missionary and travelers directly bring China's printing to Europe; the other is passed through Central Asia, West Asia, North Africa, and finally passed to Europe; Article 3 is passed by the Russians to other European countries.\n\nInvention of the Chinese Song Dynasty's cards in the 194th centuries in the early 14th century, in the early 14th century, playing cards in Spain and Germany, play cards in Italy and Belgium, 1381 France, play cards [15] [16].\n\n\n\nThe German believes that the Johannes Gitanburg, the United States invented the printing technology in 1440, which has been improved from the vintage press, and the role of Turntao developed the use of raised alignment, using oily ink from the beginning. However, the research scholars have been conclusively after a large number of research and adoption, the source of orthodontics is China, and Hangao Annta Pagang has taken \"Representative of European Centralism: The so-called Turntao may be printed inventors\" That is the title of the title [17].\n\nThe invention of the printing machine will bring printing techniques into the mechanical phase from the manual phase.\n\nThe development of printing machines has made knowledge of revolutionary changes: the first printing community (ie publisher) in Venice (ie, publishing house) in Venice, 417 printing plants in 1500. In 1476, William Kakston was established in England in England in 1539, Spanish Juan Pablos in Mexico City, Mexico. Stephen Day established North America's first printing agency in 1628, the United States, and assists in the establishment of Cambridge Publishing House.\n\nDuring the rapid development of electronic technology, printing entered the e-control and automation, electronic typography, electronic color separation, electronic engraving wide application, has been greatly improved in printing quality and efficiency. Computer applications continue to bring printing into digital printing ages, making small varieties that are difficult to complete, and multi-change printing is successful.\n\nDocuments can be printed by laser printers, inkjet printers, or other computer printers. In recent years, computer printing and industrial printing processes have been integrated together, leading to the development of digital printing.\n\nThe drawing process of the prints is also commonly referred to as printing, and the photocopy is also one of printing.\n\nStereoscopic printing (English: lenticular printing), 3D lens printing is also a printing effect, and the optical refraction is lifelike stereo effect, and the object is a conventional printing (hierarchical design) and grating material. In 2008, a company, such as a macro-professional printing, proposed a three-dimensional print solution.\n\nThree-dimensional print is a manufacturing technology, and the object is generated by three-dimensional files and three-dimensional printers. The object manufacturing is printed by superposition of a layer of layer. In 2012, some companies such as Sculpteo or Shapeway proposed a three-dimensional print solution on the Internet. "}