{"chinese_title": "anthropology ", "chinese": "The word anthropology (English: Anthropology) originated from Greek \"ανθρωπος (Anthrōpos, people)\" and \"λογο (-logos, logos)\", meaning the research person's discipline. This discipline name has appeared in German philosopher Hend (English: Magnus Hundt) in 1501 \"anthropology - about people's advantages, essence and characteristics, and human ingredients, parts and elements\" (ANTROPOLOGIUM De Hominis Dignitate Natura et Proprietatibus, de Elementis, Partibus et membracris humani corporis, at that time, the word of humanology referred to a human body structure. [1] [2]\n\nContemporary anthropology has the source of natural science, humanities and social science. [3] Its research topic has two orientations: one is human biological and culturality, one is the source and evolution of human beings today's characteristics. Ethnicity also refers to the main research methods of anthropology, and text written according to the study of anthropology. Experts engaged in anthropology are called anthropologists.\n\nBasic attention from anthropics is: What is the definition of a wise person? Who is the ancestors of modern wise people? What is human physique? How do humans do behavior? Why is there many variations and differences in different groups of human beings? Wisdom people in the past evolution history, how to affect their social organization and culture? So on and so forth.\n\nSince Franz Baux and Brownislau Ma Lingnosky In the early 19th century, this discipline was separated from other social science disciplines in the late 19th century, and humanology emphasized Inspiration, intercultural comparison (social and cultural anthropology is inherently a comparative study discipline), as well as a long-term understanding of the study area, which is often called participation. Cultural anthropology emphasizes cultural relative and uses its research discovery to construct cultural criticism. This is particularly popular in the United States, from Fallands Baux's opposition to the nineteenth century, and then advocated gender equality and sexual liberation through Margaret Mid, to the criticism of the post-colonial oppression, and Multi-cultural advocation.\n\nIn the United States, contemporary anthropology is usually divided into four major branches: cultural anthropology (also known as social anthropics), archaeological, language human beings, biological anthropology / physical humanology. [4] Anthropology of this four branches is also reflected in many university textbooks, [5] [6] and many university anthropology courses. In the United Kingdom and many European universities, these branches are often placed in different departments and are considered different disciplines. [7]\n\nThe social and cultural anthropology have been seriously affected by the postmodern theory. In 1970 and 1980, there was a steering from the topology, separated from the trial tradition well known to this discipline. [8] In this steering, the topics of the nature of knowledge and production have occupied the core position of social and cultural anthropology. Relatively, archaeological, biological anthropology and language human beings are still an empirical. Due to this difference in this epistemology, even some anthropology is divided into family, such as Stanfo University in the 1998-9 school year, \"scientists\" and \"non-scientists\" are divided into two department: anthropology, and cultural and social human beings. learn. [9] (later, in the 2008-9 school year, the humanity of Stanfo University is re-integrated into a department). [10]\n\nTraditionally, the traditional Chinese tradition is divided into four major branches: physical anthropology, social anthropology (or cultural anthropology), archaeological and language human classics, each branch has a finer branch. [4] The scope of these branches is often overlap, but there are often different research methods and techniques.\n\nThe Human Academy has been developed by many different sources (refer to humanity history), including (but not only) fossil collection, exploration, documentary shooting, ancient biology, primate, civilian maintenance and museum, text, language, language , Genetics, regional analysis, ethnology, history, philosophy and religion research, [14] [15] Therefore, it is difficult to describe this entire discipline in a short message, even if some scholars try to write the history of the entire discipline. [16]\n\nOn the other hand, this has led to the internal instability of many human beings in the United States, enabling the department of the department (for example, Stanfo University, Duke University, recently happening in Harvard University). [17] However, from the front perspective, among many American universities, anthropology is very small, forcing people to face their faces with nature sciences. Overall, anthropology is also in the development of several interdisciplinary fields (the late 20th century), such as cognitive science, global research, human-machine interaction, and various ethnic groups.\n\nA anthropologist refers to people specializing in humanity research. Due to many human academic science, individual anthropologists generally study one or several unparalleled. Most anthropologists engage in university education, but more and more anthropologists are engaged in application work. According to the branch of discipline, anthropologists can be divided into cultural anthropologists, social anthropologists, archeologs, language humanologists, physical humanologists and ethnologists.\n\nRelative to other disciplines, anthropologists have studied human behavior from a broader foundation, so it is more good at the general observation of human beings from complex biological or cultural levels. Through cultural anthropology, the results of different cultures are often questioned and challenges sociologists, psychologists, and economists. Therefore, anthropologists often play a constructive role in social sciences. [18]\n\nArake Wolf, Arak Wolf, has written anthropology as: \"The most scientific humanities, and the most human science\". [19] Contemporary anthropologists believe that certain early thoughtners are their farmhes, and this discipline has many source; for example, Li Wei Shi's proposal is an important influence in Moncutum and Rousseau.\n\nIn the English world, use the term \"anthropology\" to refer to the natural science of human beings, first seeing in 1593. [20] 18th century philosopher Kangde spent 25 years to write one of his important proposals to explore anthropology: \"Anthropology from A Pragmatic Point of View, 1798). [21] [22] However, Kant often does not be considered a modern anthropologist, because he has never left the German region, and he has never learned any culture outside his own culture, and in fact, he describes anthropology. The necessity is an auxiliary field that treats anthropology as his main subject philosophy. [23] However, he did start a one-year anthropology course in 1772. The humanology has become a discipline in the Enlightenment era and the post-Kaimon era.\n\nHistory experts, such as Ma Wen Harris [24] pointed out that two major architectures have been raised in the empirical people: the comparison of people in different spaces, and to see the long-term human development process or through time Humanity. Harris retracted the time to ancient Greece and ancient Rome. Some ancient and medieval writers and scholars may be considered to be the pioneer of anthropologists, which is the matter that they have studied and written different national customs, including Greek writer Herodo (\"Father of History\"); Roman historian Tasi, he wrote a lot of works about the ethnicity of the ancient Serbs and the Germans, and Hondodo Go to some problems with persistent interest in anthropology. [25]\n\nMedieval scholars can be identified as a pioneer of modern anthropology, which is forced to study the detailed study of their customs in geographically \"different from\" self-cultivation. The guests of Bo Lang reported his stay in the Mongolian Empire. His report was unusual at the time, where it was a detailed description of a non-European culture! [26]\n\nMarco Polo is another example of studying human variability across space for nature, humanology and geography. [27] Marco Polo travel, take him through a variety of human landscapes, and he is a crowd of people who meet in the trip, so these people have won a name for Marco Polo: \"The father of contemporary anthropology\". [28]\n\nAnother example in the first ethnicity of nationalizes is the 11th century Persian Buse, and he wrote a crowd, customs and religion about the mainland of India. Like contemporary anthropologists, Bruneti participated in the observation of specific people, study their language, study their main classics, and use intercultural comparisons to present his research with objective neutral angles. [29]. He wrote a detailed comparative research work, explore the relings and cultures of the Middle East, Mediterranean, especially South Asia [30] [31] The across cultural comparative study of Brruni, through Iben Hellen in the 14th century work, And in the Muslim World continues. [29] [32]\n\nMost scholars believe that contemporary anthropology is the product of the Enlightenment era, in this era, European tried to have systematically study human behavior, from the first wave of European colonial tide (15 to 19th century) since the 15th century, European know Human behavior diversity is increasing. The academic traditions of law, historical, literature and sociology have become a contemporary view of these disciplines at the time, and triggered social science development, including anthropology.\n\nClassics and Egyptics, including systematic research on ancient civilization, providing information to archaeological and social anthropology, as in East Asian and South Asian language and culture have also provided such information. At the same time, the Romanticism's response to the enlightenment movement has born Held and William Dertai and other ideas. Their works constitute the foundation of \"cultural concept\", which is the core concept of anthropology.\n\nIn organizational, humanity is derived from the development of the museum of (Buffe et al.), Which occurred in Europe from the 17th century and the colonial age. The National Zhizhi Research on this era is a research on \"primitive human\" supervised by the colonial administrative agency.\n\nIn the 18th century, the enlightenment of enlightenment has a tendency to understand human society as a natural phenomenon, and the activities of human society are in some principles, and therefore observations can be observed from experience perspectives. In some respects, there is no difference between the research method of European colonies, cultural, physiology and utensils, and discussing the local plant phase and the animal.\n\nEarly anthropics is divided into two dispathers: single-line evolution (English: unilineal evolution) supporters advocate, all society has passed a single evolution process, from the most original to the most advanced; Non-lineal Theorists tend to support other concepts, such as communication. [33] Most of the 19th century social theorists, including anthropologists, regard non-European society as a window of human history in pre-industrialization.\n\nAs each discipline gradually differentiated during the 19th century, anthropology gradually became the biological research orientation of the museum, and it was also separated from pure history and literature (such as Classical). Common criticisms are many social scientists in Western countries (such as historians, sociologists and psychologists) over-emphasis on Western themes, and anthropologists have excessively biased \"other people\" (Westerners \"); [34 This situation has changed in the late 20th century, and anthropologists have gradually studied Western themes, especially in Western societies, transition classes, regional or ethnic mutual variations, and other social scientists have gradually taken global perspectives to explore their field.\n\nIn the 20th century, various academic disciplines were divided into three fields in the system. Natural or Biosciences are trying to generate universal rules from repeatable and verifiable experiments. Humanities generally study local traditions, through their history, literature, music and art, and emphasize understanding of specific individuals, events or era.\n\nSocial science generally tries to develop scientific methods to understand social phenomena, although this is often a research method that is different from natural science. In particular, social science often develops statistical descriptions, rather than the universal rules of physics or chemistry; or social sciences may explain the case through more universal principles, just in many fields in psychology. Anthropology (in some areas of history) does not simply enter one of these three major areas, and different branches of anthropology have ink one or or more of the fields, respectively. [35]\n\nThe path taken by anthropology born in Western colonial power, is generally different from Southern European and Central Europe (Italy, Greece, and the subsequent countries in the Ozarian Empire and the Turkish Empire \"). In the former, the unique culture encountered by scholars often is different from Europe, which leads to the continuous emphasis on cross-cultural research and accepts certain types of cultural relative theory. [36]\n\nOn the other hand, in the subsequent countries, anthropologists often build a national (national) perspective with folkologists and linguists. Ethnic groups in these countries tend to focus on identifying various local national language groups, recording local folk culture, and through museums and other public education to reproduce how this country has formed. [37]\n\nIn this architecture, Russia occupies a middle position. On the one hand, it has the great territory (most of the east of the Ural Mountains), which is very unique, pre-industrialized, unmanned crowd, similar to the US mainland; on the other hand, Russia also participates in some extent Central European and Eastern European Nationalism. After the 1917 revolution, the Soviet Union was particularly attached to the humanology of the Sovietian national country, and served in the theory of Marx's social evolution. [38]\n\nEdward Bernate Taylor (October 2, 1832) and James Fraser (January 7, 1854) were generally identified as contemporary British society. Pioneer of anthropology. Although Taylor has traveled to Mexico to conduct a field of field, he and Fraser have read more through extensive reading, not a field survey, which produces it for comparative research, including: Classical (Classical Greece and Rome, Literature and History) Early European folkologists, as well as reports from missionaries, travelers, and at the same ethnic group. Taylor vigorously advocates single-line evolution and \"identity of human species\" [39]. Taylor specifically established the theoretical basis of cultural communication, and he advocated the various human groups, and there were similar cultural forms or techniques. There were three ways: \"Independent invention, from a ancestor in a remote area, from a race delivery To another race [40].\n\nTaylor's cultural concepts of anthropology, proposes the earliest and influential definitions: \"Culture ... is a complex and whole, including knowledge, beliefs, art, morality, law, customs, etc., including knowledge, beliefs, art, morality, laws, customs, and Other capabilities Habits. [41] However, as Stocking said, Taylor focused on describing the distribution of specific cultural components, rather than the greater function of nor cultural; and he seems to hold the progressive view of the UK Victorian Times, and It is a non-directional and multi-line cultural development process proposed by the humanologist.\n\nTaylor also established the theory of human religious emotion origin, proposing a set of panicism, regards the first stage of religion, and pointed out that \"religion\" has many ingredients, and he believes that the most important thing is the belief in supernatural. (This It is relative to the moral system and the universe, etc.). Fraser is a Scottish scholar with a profound classic knowledge. He also pays attention to religion, myths and magic. His comparative study, the most influential is \"The Golden Bough\" of the \"Golden Bough\" is the huge version of the countless version of the world, analyzes the similarity of religious beliefs and symbols around the world.\n\nHowever, Taylor and Frazer are not interested in field investigations, and they are also not interested in how cultural components and systems are interested. At the beginning of the twentieth century, many anthropologists became unsatisfactory in this kind of research method that branching various cultural components; historical reconstruction has become gradually questioned.\n\nUnder the influence of several vectors, a new research orientation began to prevail in British anthropologists, focusing on how the Synchronic is analyzed, rather than peachronic analysis or Historical analysis; and emphasized long-term (annual to several years) in-depth field investigation. In 1898, the UK Cambridge University funded a multidisciplinary expedition to Torres Strait Islands, which was responsible for the group of Alfred Court Haddon, including a physical anthropologist Livus (WHR) Rivers) and a linguist, a botanist and other experts. This explore research found that the new standards are set up for national symbol.\n\nAfter fifteen years later, when the British British anthropologist Brownislau Ma Lingnoski (1884-1942) is intended to collect information on the list of cultural projects, and expand the short-term field investigation, first The next World War broke out, he was suspended in New Guinea. He lived in this British colony with the Austro-Hungarian citizen, which made him indeed trapped in New Zealand as a long time [42].\n\nHe used this time, engaged in more intensive fields than previous British anthropologists, and his classic nationality: \"ARGONAUTS of the Western Pacific, 1922) advocates a field of field work research orientation. This has become the standard of field research: \"Indigenous Perspectives\" (local perspective) is obtained through the participation observation. Under his revolutionary creation, anthropologists (especially cultural anthropologists) began to study and record their cultural (especially small tribe culture) in the local way, and even participate in local activities. In theory, he advocates the interpretation of functionalism, and checks how various social systems play function to meet individual needs.\n\nBritish anthropology has been expanded in the shock period (1918-1939), and important contributors such as Merooski and Mel Fortes [43].\n\nAvo Ricker - Brown (also published a developing work in 1922. He conducted his first field survey in the Andaman Islands. However, when he read France After the work of the sociologist, the work of Mu., Ricker-Brown published the discussion of his field research, he gave a simple title \"Andaman Islanders\", focus The meaning and purpose of the ceremony and myth. After a period of time, he developed a set of research orientation, called\nStructural functionalism, focus on how the various systems have played role, or maintain balance in this social system, so that it is harmoniously operated (this theory is different from Minenosky's functionalism And with the later French structureist anthropology is very different, the latter examines the concept of language and symbols).\n\nThe influence of Ma Lingnoski and Rigkrev-Brown originated in a fact that they actively cultivated students, and established agencies to reach their ambitions. This especially in the situation of Ricker Brown, he lessers across the university across the big UK to spread his \"social anthropology\" issues. Since the late 1930s, there is a series of special books and editorial books, consolidating the theoretical model of \"British Social Anthropology\". The famous national governments include Edward Ivan - The Nuer and Fuds' \"Tallenthi\"; Among The Tallensi; The editorials include the \"African Systems of Kinship and Marriage\" (African Political Systems).\n\nMax Glarkman (Max Gluckman) along with a number of colleagues in Rhodes-Livingstone Institute and his student in Manchester University, called Manchester School, through the introduction With the theory of Marx's Message, they emphasize conflicts and their mediation, and their concerns about social structure and utilization of social structures and use social structures, bringing British humanology to some new directions.\n\nIn the UK, humanology has huge knowledge influence, it \"helps the erosion of Christian power, the growth of cultural relativeism, and I am aware of the vital population in contemporary life, and replacing the simultaneous frames with penetration analysis mode. These are the core of contemporary culture. \"[44].\n\nLater, in 1960 and 1970, Edmund Li District and his students Mary Douglas and Nur Yalman, and other scholars have introduced the French structuralism of Livi Shi, but British anthropology Continue to emphasize social organization and economy, which is better than symbolism and literature. Differences between the Social and Cultural Anthropology of the United Kingdom, France and the United States have gradually decreased with the gradual increase in the theoretical and methodological dialogue. Today, British anthropology has adopted other social theories from all countries and branches toward many directions.\n\nIn the big Britain Association, social anthropology often opens with physical education and primary classics in the college system, the latter may be connected to biology or animal schools; it is also divided into the archeology, archaeological may be connected to classical Department of learning, Egyptics, etc. In other countries (and universities in some especially large-scale North America), anthropologists may link to folklore, museum, human geography, sociology, social relationship, ethnic research, cultural research. Work with social work.\n\nFrom the early 19th century in the early 19th century, it has been affected by the presence of Native American society.\n\nAmerican cultural anthropics is greatly affected by the fact that the Aboriginal society of the United States can immediately use the facts of national grams. This area serves as a pioneer with the Indian Affairs Bureau and the Smithsoni Society, such as John Wesley Powell and Frank Hamilton Cushing.\n\nLawyers from Rochester, New York, Moore (1818-1881), became the supporters of Yuluki people and ethnickers. His comparative analysis of religion, government, material culture, especially relative model is indeed a far-reaching influence. Just as other scholars in the same era (such as Edward Taylor), Morgan advocated human society in human society, and was classified into various cultural evolution categories according to the scale of progress, and scope from \"obscurity\" , \"Barbar\" to \"civilization\". In general, Mooregan use techniques (such as arrow production or pottery) as the status indicators of various cultures in this scale [45].\n\nFranz Baux built US academic anthropology and opposing evolutionary views. Bowe's research orientation is empirically, and is suspected of overrepising, and avoiding the establishment of a universal rules. For example, Bauquian studies immigrant children to present biosome and non-change, human behavior is derived from the day after birth, not innate.\n\nAffected by the German tradition, Bao Yan advocated the world full of unique culture, rather than certain societies, can measure the evolution of its evolution according to their degree of civilization. He believes that each culture must be studied from its particularity, and advocating cross-cultural summary, similar to natural science, it is impossible to achieve.\n\nTaking this, Bao Schi confronts discrimination against immigrants, African Americans [46] Many American anthropologists use his argument to support social reform, and today, race theory is still keen from anthropologists. Research theme. The so-called \"four branches\" humanity is from Bao Yam to learn anthropology, divided into four important and interrelated areas, including social and cultural anthropology, physical anthropology, language and prehistoric humanity. School (archaeological). American anthropology continues to be deeply influenced by the Bao Yas School, especially for cultural emphasis.\n\nBowe is using his position, training and developing many generations of students in Columbia University and the American Natural History Museum. His first generation of students include Alfred Kroeber, Robert Rowell, Edward Spir and Ruth Pande, and each of them has written rich content for North American aboriginal culture. the study. They provide rich information to attack the theory of single-line evolution processes. Croopber and Spil will focus on North American Aboriginal languages, which helps to build linguistics into a true general science and make it liberated from this state of the Indo-European language.\n\nThe publishing of the textbooks \"Anthropology\" written by Kruber, indicates a turning point of American anthropology. Bao Yanshi spent 30 years of collection information, he felt a power of increasing power to summarize. This is the most obvious when studying \"Culture and Personality) has been studied, which is carried out by Bao Xishi's young generation, such as Margaret Mid and Ruth Pan Dode. They are influenced by psychological analysts such as Freud and Carl Jerge, seeking to understand individual personality traits, which are shaped by greater cultural and social forces in their growth.\n\nAlthough \"Samoa's adult\" and \"Chrysanthemum and Sword\" are still welcomed by the US public, Mid and Pan Nad are not as expected by some people, they are subject to humanology. There is never such a big impact. Bao Yan's original plan to let Pan Nade will take responsibility of the Director of the University of Humanology in Columbia, but she was crowded by Ralph Forest, and Mid's position has been limited to the American Natural History Museum.\n\nCanadian anthropology is just like other places in the colonial world, starting with ethnic data among travelers and missionaries. In the 1600th, Canada, Jesuit missionary, for example, Leclercq, Le Jeune and Sagard, providing a record of the Aboriginal Tribaine in the Canadian territory.\n\nCanada's academic anthropology begins with a government department: Geological Survey of Canada, as well as George Mercer Dawson, director of 1895. Dousen's support for anthropology created the driving force for anthropology in Canada. This is expanded from the Senior of Wilfried Laurel, in 1910 he sets the humanology department at the Geological Survey Bureau. Among them, anthropologists from the United Kingdom and the United States are based on unique Canadian style. Early scholars included an outstanding linguist and the Boway School of Edward Satur.\n\nCanadian anthropology often realizes the plays in the South: USA. Canadian anthropology is close to the United States later; the first humanity is established in the University of Toronto in 1925. There are many founders of the department and museums still in the health. Many Canadian anthropologists are the ideology refugees at the time. They fled the United States and selected to stay in Canada, developing local anthropology traditions, often focusing on the research of Canadian society.\nCanadian anthropology and beauty, law, and the three main contemporary countries have closely related. The American tradition is due to the geographical location and part of the two countries from exploring the common experience of the original nation; the French tradition (especially in Quebec) is one of the two nations of Canada for the French; the British tradition is due to colonials (and The result of the post-colonial) history.\n\nAnti-Americanism continues to grow in Canada, but reaching peak in the 1970s, which appears in anthropology and Canadian society itself. In the same era, the Amplifier of the Canadian Human Studies has led to a large number of teachers from foreign countries, most of which come from the United States. In recent years, with the gradual retirement of teachers, the result of alternating generations produced another wave of foreign teachers. In Canada's small-scale universities, anthropology is more likely to learn from social learning, in fact, this is still the case in several large-scale universities, such as the University of British Columbia and the University of Carlton. Kaga University (English: Cagayan State University) and the University of Ximen Feiza have a Department of Humanism and Archeology. Quebec's anthropology maintains a strong link between European and French-language countries.\n\nBasically, there will be an expert in studying the first nation in every anthropology department in Canada. In Canada, the original national affairs are more eye-catching in public culture, which is due to the active Aboriginal groups in each province and territory. The Aboriginal Aboriginal in Canada is widely identified as one of the three ethnic groups in Canada. The cooperation between antonymiters and the Aboriginal community is quite common, and many anthropologists are quite active in political issues, representing the original nations they jointly cooperate. Canadian anthropologists are also engaged in research around the world, just like they study their society. [47]\n\nFrench anthropology is not as clear as in the UK or American tradition, part is because of many of France's influentials of human knowledge, with sociology, philosophy or other non-anthropological disciplines or academic posts. Most of the commenters believe that sociologist Tucan's nephew Mos (1872-1950) is the founder of French anthropology. Moss is an academic group in the ANNée Sociologique; and although Turkan and other scholars see the situation of contemporary society, Mushan and his colleagues (such as Henri Hubert and Robert Hertz) ink In ethnography and literature, analyzing is not yet as European countries that are generally \"classification\". The two works of Muz have a particularly lasting correlation: \"The Gift\", this is a work that explores the exchange and interrelationship (Reciprocity, or lectures), and triggers many follow-up works; and his Her Li speech, discussing humanistic observation, this is the first multi-cultural perspective, discussing humanistic and self-view comparative research works [48].\n\nIn the shock time, France's interest in anthropology is often compliant to a larger cultural movement, such as super realism and primitiveism (Primitivism), which invoke nationalizes as the inspiration source. The two of Massel Griore and Michel Leiris are examples in combination of anthropology with French avant-garde. During this period, things called \"National Studies\" Ethnologie are limited to museums, such as the \"Musée de l'homme created by Paul Rivet, and humanology is closely related to folk research.\n\nHowever, the most important thing is that Li Wei Shi Gaso helped the institutionalization of French anthropology. In addition to his structuralism, Li Wei Shiji has established a link between the United States and British anthropologists in the huge influence of many disciplines. At the same time, he established a research center and research room in France to provide a set of institutional contexts within human sciences. He also trains several influential students, such as Maurice GodElier and Françoise Héritier, they have anthropology The world does have a great impact. Many of the characteristics of anthropology today, from most anthropology research, in the national funded French National Science Research Center, rather than at the University Department.\n\nOthers In 1970, the authors included Pierre Clastres, who mentioned the \"primitive society\" to the country's system in the book written by Guayaki tribes in Paraguay. Therefore, these unresonsive society are not more advanced than those with the country, but take active choices, transform the national system into a separate function from society. The leader is just a spokesperson for a group. When this group needs to contact other groups (\"International Relations\"), it does not have the authority inside the group, and when this leader wants to abuse the position, the group can make a rapidly He went to work.\n\nAfter Fu Ke and Li Wei Shi, France's most important social theorist is Pie Budi, his early academic training is philosophical and sociology, and finally won the sociological lecture of the French Academy. However, such as Muz and other scholars before him, his research topics include sociology and anthropology. His research on the Algeria Kaber made him stabilize the strong position of anthropology, and his analysis of the function and reproduction of European social fashion and cultural capital, let him sit in the strong position of sociology.\n\nAnthropology in Greece and Portugal is much more affected by British anthropology. Greece has a folk science since the 19th century, called LaOGraphia (LaOGraphy), using \"scientific research on domestic research\", although its theoretical is weak; but the connotation of this discipline has been deeply changed after the second battle At that time, a group of English and American anthropologists introduced a \"external research\" in the \"external research\" [49]. The attention of the development of all-in-law, ethnology and related research is not as many as other disciplines [50].\n\nAt the university in Japan, in general, \"natural anthropology\" belonging to the Department of Science, China (Chinese Translation is \"Physiological Anthropology\"), and the cultural anthropology set by the Social Science Department, completely separated in the college system . This is also the case in the society, the Japanese Society of Natural Anthropology, is also separated from the Japanese Cultural Human Society of Cultural Anthropology (the old name Japanese National Society). However, in terms of Japan's characteristics, there is a primate study that is affected by this Xijin Division, as well as the ecological anthropology tradition between natural sciences and social sciences [51].\n\nBefore the Second World War, the British \"social anthropology\" and the United States \"cultural anthropology\" still distinguishes two traditions. After the war, there is enough British and American anthropologists to take each other to the concept and methodism, so some people began to collect these two traditions as \"social culture anthropology\".\n\nIn the 1950s and the mid-1960s, anthropology gradually incorporated into natural sciences as a model. Some anthropologists, such as Lloyd Fallers and Krifford Gez, focus on modernization, and new independent countries can develop this. Other scholars, such as Julian Shituhua and White (Leslie White), focusing on how society is developing and adapted to their ecological location - this orientation is big by Ma Wen Harris. It is affected by Carl Brani and is challenged the standard new liberal economics by Marshall Sahlins and George Dalton. Social factors are included in the consideration, and the analysis of the Marxism school is applied to anthropology. In the UK, the theoretical model of anthropology begins to split. When Max Glarkman, Max Glakman, Try Peter Worsley, and other researchers such as Rodney Nitan ( Rodney NEEDHAM) integrates the structuralism of Li Weihai Taki in Aidon Li District into their work.\n\nStructuralism has also affected many disciplines in the 1960s and 1970s, including psychological anthropology, cognitive anthropology and ingredient analysis. Some authors, such as David Schneider, Krifford Gez and Marshal Sally developed a more revealing the cultural concepts of the inner miles, regarding the culture of culture as a meaning or meaning, this It is very popular with human science. I have echo the topics of these ages, many anthropologists participate in politics, through the Algerian independent war, and against Vietnam against the Vietnam [52]; Marx's theory becomes this discipline increasingly popular theoretical orientation [53]. In the 1970s, in some choices, such as \"Reinventing Anthropology, the authors worry about the neutrality of anthropology.\n\nSince the 1980s, power has become a core issue of anthropology, such as Eric Wolf's \"Europe and no history\" (European and no history \". In the 1980s, it is like \"Anthropology and the Colonial Encounter\", reflecting anthropology and colonial inequality, while Antonio Granxi and Michelle Four, etc. Endless influence, focus on the topic of power and hegemony. Gender and sexual topics become popular topics, as the relationship between history and anthropology, once again affected by Marshall Salness, he quoted Li Wei Shijun and Fernan Brandae's work to view the social structure The relationship between individuals is embarrassed. Similar to these issues, the authors include Nietzsche, Martin Heidegger, and the Frankfurt School, Jacques De Sida and Jacoblaga Critical Theory [54].\n\nIn the late 1980s and 1990, George Marcus and James Clifford thinking the authority of ethnographic authority, especially human knowledge (why) Establishment and authority. They reflect the research and discussion of the femaleist of this study door, although they argue that they are particularly concerned with criticism of these pioneers [55]. However, the important faculty of femaleists has established theory and research methods to become \"customary\", which is a part of the \"postmodern time\" of anthropology; ethnicity has become more refined and clearly indicates that ethnic representatives Research methods, culture, gender and race stand, and these factors have the impact on her (or his) nationality analysis. This is a part of a more common post-modern trend in the time. [56] Current humanologists pay attention to many of the many issues of contemporary world, including globalization, medical and biotechnology, aboriginal rights, virtual communities, and anthropology of industrialized society.\n\nAfter the discipline of anthropology enters the Chinese region, the academic circles in mainland China, Taiwan, and Hong Kong have been developed. After 1950, Chinese scholars were started to conduct physical fitness. The following introduces the humanological traditions in these areas.\n\nAt the end of Qing Guangxu (1875-1908), some people translated Moore's \"ancient society\" into Chinese. In 1904, Liang Qichao has published \"Chinese Trial\" in his \"New People's Evening News\", and Yan Fu has also translated the social anthropology. Lin Biao and Wei Yi put German Haberland original, 1900 \"nationalology\" translated as Chinese, published by Peking University Tang Dynasty. In 1900, the Qing Dynasty government promulgated the \"university student and its discipline\", there is a \"human and human species\" course. In 1912, the University of the Ministry of Education of the Republic of China and its disciplines also have this course.\n\nThe word \"anthropology\" in China is in 1916, and Sun Xue Limin issued a \"schematic\" in humanity \"Science\" magazine. In 1926, Cai Yuanpei wrote the \"Sewa Nationalology\" and officially introduced ethnology. Cai Yuanpei studied Germany in 1907, specializing in philosophy and anthropology, returning to China as a president of Peking University (1917-1927), has set up anthropology, is the founder of Chinese anthropology and ethnology. [57]\n\nAccording to Zheng Dekun's view, from 1920 to 1949, the development of anthropology in China can be divided into three schools. The first is the \"historical school\", which is created by Cai Yuanpei. In 1928, the Central Research Institute was established in Nanjing. The first dean is Cai Yuanpei, and established a historical language research institute. Promote the localization of cultural anthropology, named nationalology. Take historical literature as objects, both folk customs, archaeological and linguistics, and in terms of field investigation. Participants include Ling pure sound, Rong Yifu, Tao Yunda, Yan Fu etiquette. The second school is \"Folk School\", which is created by Gu Wei. In the 1920s, the Northern Government discriminates against education, and a batch of national Chinese scholars in Peking University, the first to Xiamen University, when Gu Yigang advocated folklore, songs, folk literature. After moving to Guangzhou Zhongshan University, establishing a Folk Research Center, participants included Zhong Jingwen, Yang Chengzhi, Wei Huilin, Yang Kun, etc. The third school is the \"sociological school\" founded by Wu Wenzhi. He is based on the Beijing Yanjing University, and Wu Wenluo introduces the theory of social anthropology. It is also a real investigation. Participants include Lin Yaohua, Fei Xiaotong, Yang Qingkun, Li'an , Li Zeyi and others. During the Anti-Japanese War, these three scholars will focus on Kunming and Chengdu and engage in border areas. Inuting Xikang, there are Li'an Tibet, Zhuang Xue, Liu Silan, etc. Sichuan, Yunnan has a pure sound, Yan Yifu, Lin Yaohua, etc. Guizhou, Guangxi has a yellow, Fei Xiaotong, Yang Chengzhi, etc. In 1949, the People's Republic of China was established. Some historical sciences, including Ling pure sound, Yan Yifu, Wei Huilin and others, followed by the Central Research Institute (see next section). The sociology continued to stay in China, participated in the establishment of the National Institute and the National Institute, and Wu Wenluo hosted the Central College of Education. [58]\n\nHowever, in 1952, China announced that anthropology and sociology were bourgeois disciplines, and the relevant department was abolished. Fei Xiaotong, Huang Yizhang was drawn as the right part in 1957. They were assigned with colleagues to participate in ethnographic work, engaged in minority identification, based on Starilin's reinterpretation of Moore and Engels social evolution in 1942, and this national identification Methods are more derived from folklore research, not social and cultural anthropology. Fei Xiaotong does not think it is necessary to clearly divide humanology, sociology and ethnology, which is a pragmatic attitude of Chinese scholars. [59]\n\n\nThere are very few studies of modern Chinese in modern Chinese in this period. In mainland China, there is only the humanology of Dong Yu's Guangxi Zhuang's physical fitness [60]. In 1966, Dong Yu was persecuted in the cultural revolution. In 1969, Wu Dingliang was also persecuted in the cultural revolution [61]\n.\n\nAfter the reform and opening up in 1978, humanology gradually recovered in China. In 1981, the Chinese Academy of Social Sciences was sponsored with the National Education Commission, the Chinese Antiology Society was established. In the same year, Guangzhou Zhongshan University re-established the Department of Human Academy and is divided into archeology and ethnic groups. In 1984, Xiamen University established a Human Academy, providing the first anthropology. Since then, many anthropology courses and seminars are launched. However, these rehabilitation anthropology is mainly cultural anthropology, compared to this anthropathic branch, the response, physical anthropology and archeology have long-term and stable discipline, and has independent academic research institutions. Cultural anthropics also facing the situation in which they must compete with ethnic groups, the ethnology has been grabbing the leader, especially the \"Bangguo School\" in the ethnology founded by Huangxu, is more fruitful. Therefore, cultural anthropics strive for their academic status in the 1980s, hoping to establish humanity research with their own characteristics, and assist countries' four modernization processes. [62]\n\nAt present, universities in the establishment of anthropology or ethnic groups in mainland China include Peking University Social Sciences (Social Anthropology Research Institute, two names for an institution), Department of Anthropology, Sun Yat-sen University, Department of Anthropology and Ethnic Studies, Xiamen University College of Ethnology and Sociology, Central University for Nationalities, School of Ethnology and Sociology, Yunnan University, School of Ethnology and Sociology, Inner Mongolia, School of Ethnology and Sociology, Sino-South University for Nationalities, Nationalities Department of History and Culture, Southwest University for Nationalities, Xinjiang School of Ethnology and Sociology, Normal University, School of Ethnology and Sociology, Normal University, University of Normal University, Inner Mongolia Normal University, School of Ethnology and Sociology, Guangxi University of Nationalities, Department of Nationalology, Yantai University, Northern National University, Yunnan Nations University, etc. In addition, Fudan University, Tsinghua University, Renmin University of China, China University of Political Science and Law, Beijing Normal University, Wuhan University, Nanjing University, Zhejiang University, East China Normal University, Nankai University, Jilin University, Huazhong University of Science and Technology, four Colleges and universities with anthropology or ethnic institutions, the University of Sichuan University, Lanzhou University, Yanbian University, Shaanxi Normal University, Anhui University, Tibet University, Northwestern University of Nationalities, have a master's degree, a doctoral authorization point, and a professional research institution.\n\nTaiwan 's humanity is from the Japanese period (1895-1945) for the Customs and Han nationality of the NEO (at that time). Liu Binxiong, a scholar of the Central Research Institute, believes that it can be divided into three periods: First, the Times of the Tokyo Human Society, 1895 to 1900. Second, temporary Taiwan's Ibrepusted Period, 1901 to 1928. Third, Taipei Emperor has established to Taiwan's light, 1928 to 1945 [63].\n\nIn 1928, the Taipei Imperial University (predecessor of National Taiwan University) sets \"Treasury Seed Lectures\", which is the predecessor of the Taiwan University. At the end of the 1945 War, the former Empire University was changed to National Taiwan University. The lecture was also renamed \"National Studies\" and attached to the History of Literature. In 1949, the \"Archaeological Human Academic\", the original \"National Studies\", which was incorporated into the department (retrograde the anthropology department in 1982), and laying a foundation for the study and teaching work in Taiwan.\n\nIn 1949, the establishment of the Department of Anttroors in Taiwan, and the archaeologists in the Central Committee of the Republic of China were related to ethnologists, and the relevant academic institutions in the mutant were the History Language Institute of the Central Research Institute. The detailed manager of the saved Henan Anyang Yinxue was studied by Li Ji, Dong Huibin, Shi Wei and other scholars. Nearly near scholars were mainly engaged in archaeological discovers in Southeast Asia. In 1955, the National Institute of Ethnology, which was planned by ethnologist Lingchi, and continued to explore Chinese minorities in the early stage of the establishment, and the study of the rescue nationality of Taiwan's NEO society. The theme gradually expands to include the study of NET, Han, Oceania, China's minority studies, and is currently the largest anthropology agency in Taiwan.\n\nThe academic organization of Taiwanese humanology is a Taiwan Anthropology and the National Society. The number of anthropology has gradually increased in the 1980s, including the Department of Anthropology, National Taiwan University, Department of Political University, Anti-Critics, Tsinghua University, National Institute of Nations, National University of China, National Central University Hakka College, National Central University School of Anthropology, Jinan International University, Research Institute, Tzu University, Nan Island Culture, Taitung University, Human Studies, Fanguang University, etc. Antiology has also become a course in many university facilities and general education.\n\nIn 1949, Taiwan's humanological development, like other social humanities, and is extremely deeply influenced by North American traditional, adopting four major branches. The discipline of Taiwanese humanologists, according to members of the sequential sequencing as cultural anthropologists, archaeologists and physical anthropologists, and language humanologists are extremely limited. There are also scholars who travel to the Britain, France and Europe, represent the traditional Chinese anthropology tradition. There are many conversations between the two traditions of Europe and America, which also makes Taiwan anthropology unique in East Asia and has a multi-angle international vision.\n\nCai Xiku, Taiwan University of Medicine, was studied in the measurement of bone in Buna in 1960. The publication related to physical anthropology has the \"How to become a\" 古 猿 \",\" The Former Residence of Beijie \"in Jalangpo,\" Head People \",\" The Outline of Bone Anthology \",\" Chinese People And its culture \", Guo Moruo, Yang Zhongjian, etc.\" The Discovery and Research of Chinese Human Fossil \", Liu Xian 's\" Monkey and Italian \", and the History of Life History of the Woods of Wushu.\n\nBefore China's 1978 reform and opening up, Taiwan is an important field of Europe and America to study the important fields of Chinese society. They have published many well-known national entries, such as Bernard Gallin [64], Wu Jishu (Arthur Wolf) [65], Margery Wolf [66], Kong Mai Lilong [67], Songgongren [68] et al. The nationalizes written by the local anthropologists have a deep foundation of Taiwan's humanology, including the National Institute of Central Research, the Historical Language Institute, Taiwan University, the Journal and Special Issues of the University of China and the University Institute. And the journals, nationalizes and translations of the museums, the Provincial Municipal Government Literature Committee, the Foundation and Publishing House, and the like. Boeming thesis also accumulates a considerable ethnicity.\n\nThe cultural anthropologists in Taiwan tend to study local aborigines and Han people. Over the past half centuries, they have left precious records in Taiwan's ethnic diversity and social culture. It also studies the research of the local regional ethnic groups since the 1990s, including the establishment of a strong theoretical and methodological basis for the atrial culture, etc., including Aboriginal, Hakka, Minnan, Contemporary. On the other hand, the Taiwan region has quickly industrialized and urbanization since the 1960s, and the urgent needs of archaeological rescue were also produced, such as the archaeological investment in Tainan Science Park. In recent years, Taiwan has strengthened cross-disciplines on the Southeast Asian society and the Pacific South Island national topic, and anthropologists also participated.\n\nOn the other hand, as European and American anthropology is moving to the Chinese social research to mainland China, many Taiwanese anthropologists in studying abroad have also learned to China before, including the minority areas, and further leading Taiwan students continue research theme. The anthropology exchanges on both sides of the strait also gradually became frequent.\n\nIn general, Taiwanese humanology will take into account traditions and innovations, continue to study in Taiwan, Southeast Asia and Pacific, mainland China, to promote national knowledge accumulation, theoretical dialogue and application popularization.\n\nThe Human School of China University of Hong Kong was established in 1980. The research area includes South China, Hong Kong, Taiwan, East Asia and Southeast Asia. Research topics include cultural identity, construction of urban communities, women and gender identification, Chinese folk religions, Chinese ethnic minorities, Asia Diet culture, cultural and tourism, and prehistoric culture in South China. [69] For the only one in the four sides of the strait, the Department of Human Academic Teaching in English. Due to the terminology, the Department of Humanities, Hong Kong University and the Department of Anthropology, China University of Humanology, in particular, NAI, NASA. On November 8, 2010, \"Hong Kong Chinese University - Sun Yat-sen's Historical Anthropology Research Center\" was directed by Professor Science David Professor, Professor, Scholar David. Science and education said: \"Research Center will strive to carry out research projects in the field of excellent disciplines, and in the broad empirical research, the research information on Chinese society is accumulated, and the theoretical and methods of historical anthropology research on Chinese society will be explored.\" 70]\n\nThe research methods of anthropics are mainly:\n\nIn the United States [71], anthropology is often defined as \"overall theory\" (full view) and has a research orientation based on \"four big branches\". There is a continuous argument, which is about whether this is theoretically and practical in theory in the American institutional architecture. Supporters [72] believes that human beings have two meaning: this discipline explore all human beings that span time and space, and study all of human-oriented (evolution, biological body, social politics, economic, cultural, language, and psychology) Wait a four major branches, many university courses and research plans cover the following items: physical anthropology, archeology, language and cultural humanology, and cultural anthropology or social anthropology. Many leadership of anthropologists have argued that arguments for the study of human academics as a \"four big branches\", and they think that these ideas are the nineteenth century. The product of cultural evolution of thoughts is not suitable for use to specify scientific trials on top of cultural anthropology [73]. This \"integration\" social and cultural anthropology (essentially connected to humanities) and \"Biological-Physical Anthropology\" (essentially connected to natural science), has been criticized to criticize it for inappropriate trials (it The belief is that the only correct knowledge is derived from scientific methods to cultural anthropology) [73]. This comment is the late 1960s, and by many anthropologists, such as Marshall Sarkos proposed to the development of social biology, the \"four major branches\" [73] of the American anthropology [73]. Although the four big branches and their arguments are derived from the United States, they have been output to the inter-international emphasis on the academic influence of the United States. [76]\n\nIn the United States [71] some anthropic sects (sub-branches) span these branches. For example, medical anthropology is often seen as a branch of social and cultural anthropology; however, there are many anticologists in studying medical issues also explore the biological variation in the group or the interaction between cultural and organisms. They may also use language analysis to learn about communication around health and disease issues, or use archaeological technology to understand the health and disease of historical age or prehistoric age group. Similarly, forensic anthropology may also use physical anthropology and archaeological technology, or may adopt a similar medical anthropologist. Environmental anthropology or ecological anthropology is a gradually growing, focusing on the relationship between humanity and its environment, is another example of combining cultural anthropology and biological anthropology research orientation (sometimes including archeology), this is Since it can process many of the topics that have excellent range, protect from environmentalism, wild animal and plant conservation or habitat, to traditional ecological knowledge and behavior. Biological culture is a broad term to describe the fusion of various cultures and biological views.\n\nAs the respective branches listed earlier, anthropology is a discipline with a variety of methodology, including quantitative methods and quality methods. Ethnic research methods - Altructed case study of planting in the field field research - in the literature of social and cultural anthropology and language classics, there is a historical core position, but this research method is mixing various research methods Supplement. At present, scientific and technological progress has stimulated the methodology of various branches of anthropology. Carbon elements, group genetics, GPS, digital photography and recording, etc., only a few new technologies that stimulate anthropology research new technology.\n\nIt is best to be considered a focus, rather than another branch in the four major branch of the standard. Applicants can work for government agencies, non-governmental organizations, or private enterprises, using research techniques from four branches to deal with some issues, such as policy implementation, impact assessment, education, marketing research or product development.\n\nA anthropologist, like other researchers (especially historians and scientists engaged in field research), in the past, they have helped national policies and plans, especially colonialism [77] [78].\n\nSome comments pointed out:\n\nThe relationship between anthropologists and the US government is particularly triggered in this discipline. Bali publicly opposed the United States to participate in the First World War and published a comprehensive report after the war, disclosed and condemning several American anthropologists as camouflage, participating in the spy activities in Mexico. However, by the 1940s, many anthropologists of Bowias school actively participated in the war action of the allies to confront \"Axi Germany\" (Nazi Germany, fascism, Japan Empire). Many people serve in the army, and others have served in intelligence agencies (for example, the Strategic Intelligence Agency and the US War II Bureau). At the same time, David H. Price shows the study of American anthropology during the Cold War, several American anthropologists have been clarified and dismissed because of the sympathy of the Communist Party.\n\nSome scholars try to accire the anthropologist and the US Central Intelligence Agency and the Government Intelligence Unit, but the surprising is that this sound becomes quite weak. Many anthropologists are active in anti-war sports, and in the US Society Annual Conference through many condemnation of war. Since the past decades since Vietnam, at least in social and cultural arguments, it has gradually politically, and the freedom of generations has been replaced by a more radical argument, mixing Marxists, femaleist, anarchism. The agency, the post-colonial, postmodern, Saidian, Fuko School, identification foundation and other arguments [80].\n\nAntiology major organizations often object to use anthropology to support national interests. The ethics of these organizations may prohibit anthropologists from providing secret newspapers. The Association of Social Anthropologists of the UK and Commonwealth (ASA) indicates that some scholarships are dangerous in ethics. The existing \"Professional Responsibility Statement\" of the American Human Society clearly states about the government of anthropologists and the government of landlords, ... cannot agree to conduct secret research, and no form of secret report or report. \"\n\nSome scholars advocate humanity from and develop as a research on \"alone culture\", which is the point of view of time (past society) and space (European society / non-Western society). For example, in the classics of urban anthropology, ULF Hannerz refers to the introduction of the book in the book that triggers a rich follow-up discussion, in the introduction of the book of Urban Anthropology, is mentioned in habits. The third world is receiving the most attention of anthropology; traditionally, in anthropologists who specialize in \"alone\", go to the distant place to find these cultures until the late 1960s began to pay attention to \"Drashing Straight Rails\" [81]. There are now many people who have discussed very close to the author's \"hometown\". There are also scholars to advocate other disciplines, like historics and sociology, and pay much attention to the West [82] relatively.\n\nIn France, research on contemporary society is traditionally reserved for sociologists, but this situation is changing [83], from the 1970s, from ISAC Chiva and other journals, and by Marc The \"Le Center D'Anthropologie des Mondes Contemporains\" created by Augé. The same research orientation in \"contemporary society\" also appeared in the Manchester School (Anthropology] in the 1950s in the 1950s. "}