{"chinese_title": "linguistics ", "chinese": "Linguistics (English: linguistics) is a scientific study on human language [1] [2], and involves analyzing language form, language meaning and context [3]. Traditionally, through the interaction between sound and significance, analyzes human language [4], and discusses social, cultural, historical and political factors affecting the language, and the meaning of language can be defined by analyzing these factors. Context [5]. Linguistics contain several branches. There is an important topic division between language structures (syntax) research and significance (semantic and pragmatic) research. The grammar contains lexical (formation and composition of words), syntax (determined how words constitutes a fracture of phrase or sentences) and speech (sound system and abstract sound units). Voice is a related branch of linguistics, which involves the actual properties of voice (phone) and non-voice sounds, and how they have been received.\n\nUnlike learning language, linguistics is an academic subject related to human \"Chinese development\" (usually only according to language, non-text). Traditionally, linguistics is a branch discipline in cultural anthropology, but the language is now more and more independent. The description of the language and other languages ​​such as language research, and the history of the development of language.\n\nLinguistics are narrowly defined as scientific methods for researching languages, but we can explore language from various aspects and have related associations with several other intelligent disciplines, and these disciplines have also affected the study of linguistics. For example, symbolics is a related area that involves research on both general tags and symbols in language and language. The Studies of Literary Theory Studies in Language in Literary Art. In addition, linguistics are also known from different fields, like psychology, speech-language pathology, information learning, computer science, biology, human anatomy, neurology, sociology, humanology, and acoustic.\n\nThe history of linguistics is very old. The earliest language of human beings is to study the philosophy, history and literature in the study of philosophy, history and literature. China has produced training in the Han Dynasty. It is known that the earliest language description is the analysis of the Pifanan in the first five hundred years of Sanskin [6]. In India and Greece, the 4th century BC has established a language law. Linguistics history\nModern language is established in the early 18th century, which has emerged with historical comparison.\n\nTraditional linguistics are called language to study ancient literature and written languages. In China, there has been a part of the e-learning, training, and literature. Modern language is dominated by contemporary language and speaking. Generalized linguistics include language.\n\nLanguage other affiliated subjects include the following:\n\nLinguistics branch disciplines include:\n\nThe main research object of modern linguistics is the language and text. Linguistics work is to study:\n\nThe research on language can be divided into total and last time:\n\nLinguistics and Evolution Biology, Sociology, Psychology, Mathematics, Logic, Information Theory, Neurophysiology, Computer Science, Communication Engineering and other subjects have penetrated each other, forming many marginal disciplines:\n\nLanguage is a unique communication method that reflects human civilization in the social and cultural level in human-specific communication methods, reflecting human civilization. Linguistics is to study the language skills of human beings, through analysis and research on spoken, written languages, and lips, and to understand the essence of human language.\n\nIn addition to the understanding of human language, linguistics research also has a variety of application value. In terms of language education, through understanding of language itself, compilation of various dictionary, cultural law, textbooks, and help to improve the difficulties and errors encountered in the process of language learning. In terms of translation in different languages, language theory has more specific guidance for translation and interpretation, and also helps to use technology to translate machine translation.\n\nWithin the vast language of language, there are many emerging branches, focusing on more specific language analysis and description.\n\nSymbolism is a research symbolic humanism. The symbols of research may be individual, or have a symbolic system that will also study the meaning of symbols. How to understand. The symbol of the symbolist study is more than a symbolic symbol of the language ditch, which also extends into various symbols in culture.\n\nTranslation This area includes a written content written or an exit, which may be digital or printing. Simply, the translation is to convert the content from a language to another. Some translators are employed in companies or organization, such as travel agencies or national embassies, which often need to process communication between two languages. Translation can also be carried out using computational linguistics, such as Google Translation is an automated programming tool, which can be transformed between the words or even sentences between two or more languages. Publishers will also need to translate, translation books from a language into another language, making more people can become readers. Academic translations focus on translation in some specific fields, such as technology, science, law, economics, etc.\n\nBiological Linguistics (English: Biolinguistics) is a communication system for researching animals, which may be natural or taught by people. Researchers of biological linguistics want to know the possibility of animal language for a long time.\n\nClinical linguistics is the application of linguistic theory in speech therapy. The speech therapist is treated with people of communication barriers and swallowing disorders.\n\nComputational linguistics are handled in a computer to handle linguistics, that is, the specifications of the algorithm and computational complexity have a careful consideration, so there is some ideal calculated characteristics and its implementation. Computational linguistics also study computer language (including machine language, C language, Java, and wide application C ++, which is the modern common computer language; machine language is 0 and 1 binary language, directly understanding and executing the machine) ) And software development.\n\nEvolution Lingu is a cross-regional study of language generated by human evolution and will also use the cultural evolution of different languages. Evolution Linguistics also studies different languages ​​around the world [7].\n\nTheoretical language is used to investigate the common laws and universal characteristics of human language. From the specific language to identify the theory and laws of the universal system. "}