{"chinese_title": "Language ", "chinese": "Language is a class of composite AC systems, mainly including its formation, acquisition, maintenance and application, particularly corresponding human capabilities. A particular example of such systems is a specific example of such systems. In addition to communication communication, language is also a major component of a person's identity, and is also one of the main components of culture.\n\nLinguistics is a scientific research on language. The debate related to language philosophy is, such as whether vocabulary can express the experience, at least to the ancient Greek Golgia and Plato. Some thinkers represented by Rousseau believe that language is self-emotion, while Kant believes it stems from rationality and logic. The philosopher demonstration of the 20th century, such as Tittan, said that philosophy is essentially a study of language. The famous linguists have Fudi South Dude Sauss, Num Jumsky, etc.\n\nHuman language is estimated that there are about 5,000 to 7,000 speculations. Due to the difference in language and dialect, it is difficult to have accurate statistics. Natural language is often expressed in oral or sign language, but any language can be expressed in sound (e.g., whistlers (English: Whistled Language), visual (such as sign language) or tactile stimuli (such as Braille). This phenomenon is described in symbolics as modality (Modality-Independent). According to the definition of language and meaning in language philosophy, \"language\" can refer to learning and use the cognitive capacity of the complex AC system, and can also describe the set of rules constituting this system, and can also refer to language rules ( A collection of phrases. All languages ​​relies on symbolic processes (English: Semiosis) to connect specific marks (English: Sign_ (Linguistics)) and meaning. Speaking, sign language and tactile language have a vision system to combine symbols in a system or a morphology, and there is also a speech system to combine words and morphoons into phrases and discourse.\n\nThe human language has creativity (English: Productivity (Linguistics)) and shift (English: Displacement (linguistics)), which is completely rely on social customs and learning. The complex structure of the language makes its expressed ranges are wide than any known animal communication system. According to the perspective of institutionalism, the language is the ability to form a mental theory of the human family, as well as sharing, and then gradually evolved from its original communication system [1] [2]. This period of development is also roughly the same as human brain capacity expansion, and many language believes that language has evolved because of some specific communication and social functions. There are many parts of the human brain to deal with language, but mainly in Bukuka's area and Venke district. Human language acquisition is to study in early social interaction in early childhood, and the child can speak fluent about three years old. The use of language has been deeply rooted in human culture. In addition to communicating, language also has many social and cultural purposes, such as strengthening group identity and social classes, also used to social carding (English: Social Grooming) and entertainment.\n\nThe language will evolve over time (English: Language Change) and differentiation. Its evolutionary history can be configured with modern language: which qualities are determined from modern languages, which are existing in the ancestral, thereby deposited in the follow-up phase of the language. A set of languages ​​with common ancestral language called language. The language of the Indo-European language is the most used today, and its main members have English, Russian and Hindi. The Han Tibetan language includes Chinese dialects [Note 1], Tibetan, Phando language, etc. The Yiafang is included in Arabic, Somali and Hebrew. There is Swahili, Zulu and other hundreds of African languages ​​in the Ban Tuo. Malay - Polynesian language group includes Indonesian, Malay, his plus language and hundreds of languages ​​all over the Pacific. Daro Dutong is mainly distributed in southern India, including Tamil and Telugu. The academic community believes that 50% to 90% in the existing depository will be extinct at 2100 [3].\n\nToday, \"Language\" or French \"Langage\" translation, it may be derived from the original Pi-Parser-Output .IPA {Font-Family: \"Charis Sil\", \"Doulos SIL\" \"Linux Libertine\", \"Lucida Sans Unicode\", \"Code2000\", \"Gentium\", \"Titus Cyberbit Basic\", \"Arial Unicode MS\", \"IPapannew\", \"Chrysanthi Unicode\" \"Gentiumalt\", \"BitStream Vera\", \"Bitstream Cyberbit\", \"Hiragino Kaku Gothic Pro\", \"Lucida Grande\", Sans-Serif; Text-Decoration: None! Important} .mw-Parser-Output .ipa A: Link , .MW-PARSER-OUTPUT .IPA A: Visited {text-Decoration: None! Important} * Dn̥ǵʰwéh₂s (tongue, speech, language), Latin \"Lingua\" (tongue, language) or ancient French \"Language\" [ 4]. Sometimes \"Language\" also refers to the code, password, or other artificial created AC systems, such as programming languages ​​or in manual languages. In this sense, in the form language and innate human language, it is a marker system for encoding and decoding information. This entry mainly pays attention to the natural language studied by linguistics.\n\nIn Chinese, one person tells the words, and the two answers the language. \"The Book of Songs, the\" Book of Books, \"in the time of the words, in time,\" Cloud: \"Direct words, it is said that one person is self-proclaimed; the answer is difficult, it is relative.\" [5] Zheng Note Solit: \"The origin is saying, the words are difficult.\" [6]\n\nAs the object of language research, \"Language\" has two initial meanings: an abstract concept, a specific language system, such as French. Swiss Linguist Fudi South De Saussu defines the basic principles of modern linguistics, and he first districts two concepts of words (Langue). The concept of \"Language\" refers to a particular language system instance, and \"speech\" refers to the specific speech application in a particular language. [7]\n\nIn terms of a general concept, the definition of language can be used to emphasize all aspects of language phenomena [8], form a linguistic faction of the opposite, or even mutually exclusive. [9] Key issues in language philosophy, such as the origin and essence of language, and its debate can be traced back to ancient Greece. Philosophers' Golgia and Plato have done a debate on the relationship between the words, concepts and reality. Golgia believes that language can't express objective experience and subjective experience, so language communication and true also can't exist; Plato insists that will and concepts are presented in the language, so language communication is existing. [10]\n\nThe enlightenment era focuses on human origin, and there are also questions about language origins. Rousseau, Held and other thinkers believe that language comes from emotional instinct expressions, so language compared to logical expression and rational thinking, more closely related to sensible cognition such as music and poetry. In contrast, Kant, Cartesol, etc., and believes that language is derived from rationality and logic. Since the 20th century, thinkers have begun to question the language of the objective world, or create certain concepts to put human subjective experience to the world's understanding, what roles are played here. The problem has become a study of the essence of philosophy. Therefore, in the 20th century philosophical development, the language in the creation of concepts and circulatory works on the concept of reappearing, Ludwig Vitgenstein and other philosophers and language steering are their representatives. Until today, the meaning and association of the language, the debate of cognitive and consciousness is still active. [11]\n\nOne definition is mainly explained to make people in mind (learning, expression and understanding language). This definition focuses on the versatility of human language and emphasizing the biological basis of human language ability is a unique evolution of the human brain. The supporters of \"Human and Branches have the power of language\" have proposed that all children are normal, as long as they can get in the language in the growth environment, they can learn in the case where there is no formal teaching. This factually supports this concept. Languages ​​can even spontaneously generate them in a living environment without using people who are in the same language; for example, Kreth, as well as spontaneous sign language, such as Nicaragua. This can be followed by philosopher Kant and Cartesale thinking that the language is inherently (English: Innatism), such as Num Jumsky's theory, or American philosopher Jerry Fu Extreme innate theory. These definitions are often used in the language of cognitive science and neurological field. [12] [13]\n\nAnother definition is constrained by the composite symbol rules to convey the semantic symbol form system. This definition emphasizes that the human language can be described as a closed structural system, and the system also includes a specific mark and a particular meaning association rule [14]. The structuralist view of this language was originally proposed by Fernandan Dude Saussle [15], his structuralism laid the foundation for many linguistics [16].\n\nSome supporters of Some Contributions advocate the use of a form method to study the language structure, that is, by identifying the basic elements of the language structure, and formally express these elements into the words, the rules of the sentence. The main supporter of this theory is the proposed Num Jumski, which generates the literary law. He defines the language as a syntactic generated by the available conversion syntax [17], and it is considered that these rules are the inherent characteristics of human thinking and the basic principles of the language [18]. Through the control, such a conversion syntax is also widely used to provide the definition of the language of the proactive logic, formal grammar theory linguistics and computational linguistics [19] [20]. In this linguistics, Alfred Taski, Betlan Russell and other mathematics continue to develop, and believe that semantics exist in the logical relationship between propositions and reality.\n\nAnother definition sees the language as a human communication system on an oral or symbol. This definition emphasizes the social function of the language, focusing on mankind to express yourself or control the object in the surrounding environment. Syntax function (English: functional theories of grammar) Explain language with language communication function, understanding language grammatical structure can be symmetric to adapt and meet the communication needs of language users. [21] [22]\n\nThis language view also involves the language, cognitive linguistics, and interactive frameworks, as well as social linguistics and language people. As a functionalism theory, it tends to use the language as a dynamic phenomenon, always in the language of the structure of the language. Language type studies, especially for language structural features, it is also attracted attention to this view, as language types tend to partially affect the trajectory of the language process. [20] In the philosophy of language, as the center of language and meaning, the pragmatic view is taken with later Ludwig Vitgenstein and John Austin, Paul Grace, John Rogers Hill The work made by Len and Willard von Omanzin have compared the work of other general linguists. [twenty three]\n\nCompared to other forms of AC systems, such as animals used in humans (English: Animal Language), human language are unique. Other animals, such as the exchange system used by the bee and is a closed system, and its expression is often very limited [24]. In contrast, there is no upper limit and creative (English: Productivity (Linguistics)), allowing human beings to produce a large number of discourses from finite elements and create new words and sentences. This is because the human language is a limited number of elements in the language. It does not make sense (such as sound, text and gestures), but the meaning of the meaning (including words and sentences) is unlimited, limited elements and infinity The meaning of combination can produce unlimited human language [25].\n\nHowever, research points out that Australia's chestnut bending mouth (English: CHESTNUT-CROWNED BABBLER) can arrange the same sound element in different ways to generate two pronunciation [26]. In addition, the spots also reveals the ability to use two of the same type of sound as a similar behavior, and the two types of sound can only rely on the number of times of sound elements. [27]. Indeed, some species are indeed possible to achieve some communication form through social learning. For example, an orangutan named Cansan learns to use a set of Jehis language to express their wishes; many birds and whales are also singing with the same class. However, although these animals can master a large number of words and symbols [Note 2], they can learn that the number of marks is only equivalent to an average 4-year-old human child, and there is no rules like a syntax similar to human language [29] .\n\nThe communication system of different human language is still in human language, such as nouns and verbs, now and past, etc., used to express extremely complex meaning [29]. The human language also has a unique recursive level property, for example, one noun phrase can contain another noun phrase (such as \"[[orangutan]'s lips]\"), there is another clause that can contain another clause (such as \"[ See [Dog is running] \") [2]. Human language is also the only modal unrelated natural AC system that adapts to it. It can be applied to various media. If the spoken language uses the sense of expression, and the sign language uses the visual mode, and the Braille uses tactile modality [30].\n\nThe uniqueness of human language is also reflected in the ability to use abstract concepts; with shift (English: Signature (language)), allowing human language to describe some imaginary, things happening in the past or future. Some animals have also displacement (for example, the bee can pass location information other than its own detection range), but far less than human level [25].\n\nThere is another assumption for language definitions, resulting in different theory of language origin. There is a view that the language is very complicated, it is hard to imagine that there is no midsency and an evolution into the ultimate form, so the language must be evolved from the pre-linguistic systems of human ancestors. Based on this The theory of views is called Continuity-Based THEORIES. The opposite point of view, the language is a unique characteristic of human beings, and it cannot be compared to anything of non-human beings. Therefore, the language must have suddenly appeared in the pre-Hominids transition from the pre-HominiDS. . Similarly, based on the theory of Jumsky to generate cultural law, most of the language is visualized in the inner endowment of the gene; the functionalism theory will be regarded as related to cultural heights, through social acquisition systems. [32]\n\nLanguageists, philosophers Num Josky is an important supporter of non-continuous (English: discontinuity_ (linguistics)) (discontinuary) (DISCONUITY). [32] He explained: \"Perhaps some primary animals have been gone around, suddenly, it may be a random mutation after being radiated from some singular universe, it reorganizes the brain of the primate, Inside the implanted a language official. \"[33] Although this describes some literature, he still insists that\" the mythical story related to other condictions including the language, this may be closer to the facts. \" [34]\n\nMost scholars are more inclined to continuous hypothesis, but they have their own different views on the evolution process. There are some sense of language skills to be largely born, including Stidane Pink, which avoids the study of the clear language of the research primate, and simple thinking is only the precedent of animal cognition [13] \"Language instinct\" is evolved by the usual way [13]. In addition, some scholars are like Michael Tomaselo (English: Michael Tomasello), they believe that language is a communication tool, which can be developed through cognitive control social communication methods, these ways are more based on gestures. Not a sound. [35] There are also some consecutive hypothetical views that language issues from music and singing, this view is received by Rousseau, Held, Humbold and Darwin [36] [37] [38] [39] [40] [ 41], as well as the most important supporters, archaeologists Stephen Misen (English: Steven mithen) support [42]. Linguist Stephen Anderson (Stephen R. Anderson) Speaking that the speaking has already existed 60,000 to 100,000 years [43]. He says:\n\nSince the origin of the language is in the early stage of the prehummer's prehistoric era, there is no form of written records, so the development process has not left a direct historical remains, and there is no finding process with it. Despite this, modern newly born sign language (such as Nicaragues) may allow us to see the phases and processes that must appear in language development. [45] Another research method is to find out the trail of physiological structural changes in language use by observing early human fossils. [46] [47] These traces show that the size of the brain is related to the body, and the appearance of the throat increases the sound, and the ability to use tools and other manufacturing items. [48] ​​In the detection of some detached human DNAs, whether the genes associated with language function (such as foxp2) may also be able to provide us with a lot of information. [49] There is also an archaeological method, which is to find an archaeological remains left by the symbolic behavior (such as repeated ceremony), such as the use of human painted pigments, and theoretically demonstrate the logic of the symbolic behavior to the language. relationship. [50] [51] [52]\n\nLanguage evolution and the anatomical prerequisites needed, theoretically, its time span from human genus (230 to 24 million years ago) from chimpanze (500 to 6 million years ago) to the behavior modernity (Behavioral) The model is completely exactly (about 5 to 150,000 years ago). It is generally identified that there is no significant difference between the exchange of exchanges between Nanoba and the classes [53], but there is also an objection to the research of the ancestral macaque [54]. It has different opinions between the scholars in the development of the human belongs to about 2.5 million years ago. There are some original language systems that think that the people (approximately 2.3 million years ago), others believe that the erectile (1800,000 years ago) or Hydeburg (600,000 years ago) has a primitive symbolic exchange The language begins to develop when there is a homework with a modernity of a modernity before 100,000 years ago. [55]\n\nMore than 2000 years ago, with the development of Boromomin, India has the first grammatical description for individual languages, which is considered to be the world's earliest language research. Today, modern linguistics have developed into a science, based on the aforementioned various language theoretical perspectives, all aspects of language and linguistics. [56]\n\nLinguistics research can be divided into many different professional branches from different theoretical perspectives and research ideas. For example, describing the language of the language (English: linguistic_description) examining the syntax of individual languages; theoretical language is based on how to conceptualize and define language intrinsically, the social application of social language research languages, from society perspective description Grammar, explore the social function of language; neurological language testing and study human brain nerve for language understanding, output and acquisition; calculating linguistics based on description of linguistics and theoretical linguistics, building a computer model of language, to deal with natural language, Test language hypothesis; and historical linguistics use vocabulary and grammatical descriptions to trace the history of individual languages, and often use comparison language research methods to reconstruct the language spectrum. [57]\n\nIt is generally believed that the official language initially begins in the 5th century in the 5th century in the first 5th century, Your Nini is in 1959 for the State of State. [58] [59] [60] The Sumeren also studied the difference between Sumur and Akad in about 1900 BC. Subsequently, all civilizations with writing systems have produced their own literary tradition. [61]\n\nIn the 17th century, the French generally rigorous syntax (English: Port-Royal Grammar) proposed that the grammar of any language reflects the general foundation of thought, so the grammar is also universal. In the 18th century, English language, Gu Yishen, the first time, the first time used the control method to study the language, creating a relatively linguistic [62], and William von Humboldt will speak the scientific research of the language from the Indo-European language Broaden to all languages. In the early 20th century, Fudidan De Sauus is one of the most important formalism. He compares the language and its various elements, and believes that language is an internal element interrelated static system [15] In contrast to several basic research perspectives of linguistic research, such as historical linguistics and speech, language and speech, laid the basic research principles of modern linguistics. [63] [64]\n\nIn the 1960s, Nom Jumski raised the theory of cultural law. The theory believes that the most basic form of language is a set of syntax rules for all human beings. This set of rules is called universal grammar, which is the foundation of all human language syntax. Jumsky believes that the basic task of linguistics is to describe the general grammar, and individual languages ​​are important for linguistics in the ability to derive what the underlying universal rules produce the language can be observed. [65]\n\nUnlike the formal grammar theory with the generated school, functionalism believes that since the language is a tool, according to its functionality, it can analyze its structure most thoroughly. Formal grammar seeks different system elements in definition language, describing the relationship between elements, formal grammar law and grammap operation, and functionalism theory seeks to define language functions, and will have its language elements. [20] [Note 3]\n\nThe theoretical framework of cognitive linguistics from the perspective of the concept of language forms, the main concern, how to make sense. [67]\n\nIn all cultural, speaking is the default form of language. The production of spoken language depends on the complex ability of the other components of the lip, tongue, and vocal devices, the ability to acoustically decode speech voice, and the neural devices required to obtain and produce language. [68] Research on the genetic basis of human language is in the early stage: the only gene associated with language generation is Foxp2, and if the mutation is affected, it may lead to a congenital language barrier. [69]\n\nThe brain is a coordination center of all language activities: it controls the generation of language cognition and meaning and the mechanism of speech. Despite the modern imaging technology, brain science research has made considerable progress, but our understanding of language neurological foundation is very limited. Neurological language is committed to studying the nervous system related to language. [70]\n\nThe initial work of neurological language is the language study of patients with brain lesions to understand how the lesions in specific areas affect language and speech. Through these studies, the 19th century neuroscience found two areas in the brain closely related to language processing. One is the rear of the temporal rear of the Temperature of the Potential Hemisher (usually the anti-side [71]) of the trend. In this brain area, there is a sensitive loss of illness, and its language understanding will be severely damaged, but the speech retains the natural rhythm and relatively normal sentence structure. The second area is a fabric area in the border, located in the forefront of a hemisphere. People with lesions in this area will have expressed illness (English: Expressive Aphasia), which means they know what they want, but they can't say it normally. [72] Patients with expressed loss of loss may also have fluent, clarity, vocabulary findings, words repeated, and difficult to form or understand syntax complicated sentences in verbal and written syntax. Those who have such loss of spellings are also difficult to say the words of the grammar and cannot use syntax information to determine the meaning of the sentence. Expressive and acceptance of incidents also affect the use of the sign language, similar to it affects the language, and patients with exposure to illness can only slowly play the incorrect syntax, and patients with receiving default can fluently use the sign language. But their sign language is difficult to understand, they are also difficult to understand the sign language of others. This indicates that brain damage is damaged by the use of language specific capabilities, not the physiological ability of voice. [73] [74]\n\nIn the late 20th century, with the advancement of technology, neurologians also use non-invasive techniques such as functional magnetic resonance imaging (FMRI) and electrophysiology to study language treatment without damaged individuals. [70]\n\nThe oral language relies on the human body to generate sound, that is, the ability to generate the longitudinal wave propagating in the air in the vibrating membrane, which depends on the physiology of the human language organ. These organs include lung throat and upper channels (throat, mouth and nose). By controlling different pronunciation portions, the airflow can be manipulated to produce different speech. [75]\n\nVoice can be divided into sound segment components and supersonic components. The sound segment is arranged before and after order, usually represented by different letters, such as Roman letters. In the free and smooth speech, there is no clear boundary between a sound segment and the next tone, and there is usually no obvious suspension between words, so the difference between the sound segment is different tuning methods when pronunciation. For example, the difference between vowels and consonants. The supersonic segmentation includes elements such as light reading, sound type, tone, sound rhyme or tone, all of which may affect multiple sound segments. [76]\n\nThe consonial and vowel sound portions form an syllable, and the syllable is combined to form a discourse; these phones can be distinguished from the gap between the two suction phases. In acoustics, these different tone segments are characterized by different resonance peak structures, which can be seen in the time spectrum (see the right figure). The resonance peak is the amplitude peak in the spectrum of a particular sound. [76] [77]\n\nThe meticone refers to the tone that the airflow is not hindered by the oral cavity without tuning. Their tone values ​​differ depending on the degree of opening and the position of the tongue in the oral cavity. [76] When the lobes are relatively closed, the vowel is closed, such as the metaphysque, the rhyme \"of Chinese\" according to the \"according to the\" according to the lip, \"as the vowel that is relatively open is open vowel, such as Yuan Yin [a] (Chinese \"ah\"). If the tongue is behind, the sound value will become [u] (Chinese \"\" rhyme) and other meticulum. The tone value will also change with the shape of the lip, for example [i] (not late lip-tone), the rounded lip is changed to [Y] (rounded lip tone, such as German \"u\" or Cantonese \"in\"). [78]\n\nThe consonant refers to a gas stream in a tuning (some parts of the upper channel narrowing or blocked), which is a sound that occurs or closed. The coupling value varies depending on the position of the tuning site, that is, the position of the airflow is blocked, and these locations are usually in the lips, teeth, tooth sump (English: alveolar ridge), hard palate, soft jaw, hanging or spoke. Each tuning position generates a set of different consonants, depending on the modulation method or blocking type, one is a completely blocked closed sound or succulent, and the other is a non-completely blocked scroll or a nearet. According to the vocal sound of the vocal, the consonant can also be durable, such as [S] in English, [s] is the purpet (咝 咝) and buzz [z] is a turbidity (turbid ggvy). [79]\n\nSome phonemes, including vowels and consonants, can utilize nasal tuning, which are called nasal sounds or nasal tone. Other sounds depend on the relative position of the tongue to the airflow, such as [L] (referred to as the edge, because the air flows along both sides of the tongue) and [ɹ] (referred to as the gums.). [77]\n\nBy calling the vocal organs and tuning portions, humans can produce hundreds of different sounds: Some sounds are very common in various languages ​​in the world, and some rare phones are only in certain languages, language, some language areas, and even single Language. [80]\n\nIt is generally seen as a symbolic communication system (English: Symbolic Communication): a symbol (English: SiGN (Semiotics) and a symbol (English: means) and the symbol of the two. Symbolics is responsible for studying symbolic processes (English: semiosis), how to combine, and the use and interpretation of the marker. The marker can be composed of sound, gestures, letters or symbols, depending on whether language is to say, to do a sign language or write, and they can be combined into complex marks, such as words and phrases. When used for communication, the marker is encoded by the sender and transmits it to the recipient through the channel, and the latter decodes it. [81]\n\nSome definitions distinguish between human language and other AC systems: language marks have no inevitable contact between language marks and its meaning; language system has binary, so language has a layered nested structure, such as The sound composition is word, and the word forms a phrase; language language elements have discrete, so the feature of building language marks is discrete units, such as sound and words can be distinguished from each other, and rearrange them in different modes; language systems have energy products. Therefore, limited language should be reasonable The on the combination of unlimited number can be combined. [81]\n\nThe rules combined into words and phrases are referred to as syntax or syntax, and the meaning associated with independent marks, phonemes, words, phrases, and text is called semantics. [82] Supor's Linguistics is the earlier language into independent but interconnected marks and meaning systems, now this point of view is almost adopted by all linguistics [83]\n\nPeople are expressed by linking a marker to a meaning. These language markers must be able to perceive people, such as sounds, images or gestures, which are contacted according to people's habits. Since their most basic meaning comes from the agreement in people's exchange. The agreement of language symbols is based in society and history, rather than a specific symbol, has a relationship between its significance. In this view, language symbols can be considered as definition.\n\nTherefore, the language must have vocabulary associated with a particular meaning. For example, English words \"DOG\" represents Canis Familiaris under gray wolf. In a language, a collection of any set of symbols associated with meaning is called the vocabulary, the single symbol associated with meaning is called the word. The language is not all meaning in words, in many cases, the meaning is embedded in the form of a language in the form of a language (syntax) in the form of a grammatical category. [84]\n\nAll languages ​​contain predicate semantic structures for expression properties, status, or behaviors. Semaning is generally regarded as a study on how the speaker is assigned to statements, which is intentionally regarded as a process of judging the predicate about a real estimate. For example, \"[x [Y]\" or \"[x [Y]\". Recently, this semantic model has been added for more dynamic models. These models combine some shared knowledge, which describes how the symbol is explained in language during meaning generation. This significance model has been explored in the field of language. [84]\n\nAccording to the form, the language structure can be based on sound (language), gesture (sign language), graphics or haptic symbol (text) system. Vocal sects have studied the language of language using sound and symbol expression. [85] Research on how to pronounce and perceive the sound is called voice. [86] In the spoken language, the meaning is generated as part of the sound as part of a system, and some sounds help express significance, while others are not. In any given language, only many different sounds of a limited number of objects can be sent by the human pronunciation to construct meaning. [80]\n\nSound as part of the language system is called a phoneme. [87] The phoneme is an abstract unit of sound, defined as a minimum of language that can distinguish between a word (so-called minimum pair of stereo), which can distinguish between a word (so-called minimum). In English, a word Bat [bæt] and PAT [Pʰʰt] form a minimum of three-dimensional, in this / b / and / p / distinguish between these two words. However, each language has different ways of distinguishing sounds. For example, in a language that does not distinguish between the dyness and the voiced sound, the voice [P] and [B] (if they all exist) can be considered a phoneme, so these two pronunciations have the same point. Similarly, English does not distinguish between consonants and non-air pronunciation, but many other languages ​​are distinguishable (such as Korean and Hindi): do not send aerobics / P / and words PIN in words spin [spɪn] The gas sound / P / is considered to be only the different pronunciation methods of the same phoneme (this change in a single phoneme is called the same line \", and in the official language, the same pronunciation difference difference word\" \"[Pʰá] And \"eight\" [pá] (á above the accent symbol indicates the high tone). [88]\n\nAll verbal languages ​​have at least two types of phones: vowels and consonants, which can be combined with constituent syllables. [76] At the same time as the phoneme such as consonants and vowels, some languages ​​also use sounds of other forms to convey significance. Many languages ​​use, for example, lightweight sound, high hypersonal, vowel length, and tone. Since these speech phenomena operate, they are called ultravailability components. [89] There are only a few speakers, such as Rotorca and Pihan language, only 11 and 10 vocals, while others may have 141 such phonemes like 141 languages. [88] In the sign language, the replacement of the phoneme (called sign language (English: chereme)) is defined as the basic element of the gesture, the shape, direction, position, and motion of the hand corresponding to the species. [90] [91] [92]\n\nWriting system uses a visual symbol representative language, which may or may not correspond to the voice of the language. Latin letters (and derived from it) are initially based on a single sound, so words are typically composed of letters representing a structure representing an consonant or vowel. In symbiotic text, if each symbol represents a symbol. In the morbid text, each symbol represents the entire word. [93] will generally not contact this word in the spoken pronunciation.\n\nSince all languages ​​have a lot of vocabulary, there is no texture of pure content. The written language represents the sound in the spoken language, and the text is followed by the scheduled display symbol mode to follow a specific direction. The writing order used by the writing system is completely arbitrary but has certain practices. Some writing systems use the horizontal direction (like Latin words from left to right or like Arabic words, there are some vertical directions, such as ancient Chinese (from top to bottom). Some writing systems use the way in reverse writing, or others, such as the ancient Maya text, can be written in any direction and rely on the direction of the reading to read the reading. [94]\n\nIn order to express the sound of the world language in writing, the voicemaker creates an international audio symbol to express all discrete sound in the human language to help understand the meaning of human language. [95]\n\nThe grammar is a research on the most basic elements of the language that can form a speech in the language. The morpheme can be used freely and can be connected together. When it is freely used in the discourse, generally referred to as words, and other words or morphology, referred to as stem or gar. The combination of morphemes is constrained in a combination of languages. The rules of the inner structure of the word internal structure are referred to as the rules of the phrase, phrase or internal structure of the sentence are called syntax. [96]\n\nThe grammatical category is a classification of semantic content and corresponding grammar forms embodied in sentence components. [97] [98] [99] The elements in the same grammatical areas (semantic content - grammar forms) are mutually peer, only one element can be expressed as the syntax. [100] For the position and the morphological changes (morphological changes) of the sentence composition, various words (nouns, verbs, etc.) can be shown to reflect sex, number, and the grammatical relationship between the modules and the predicate, reflect the subject, Syntax features such as English: grammatical_relation, the difference involving the difference between the grammatic formation of the above-in-laws). [101] The grammatical category covered by different languages ​​is not one, and some areas are very common, almost all languages ​​are common, such as hair.\n\nThe language is based on their grammatical functions and classifications of different words or known words. All languages ​​are distinguished from the words, concepts, representing the words or events, such as \"dog\" and \"song\" are nouns, and \"run\" and \"sing\" are verbs. There is also a term word is adjective, which describes the nature or quality of nature or quality, such as English \"Red\" or \"BIG\". If the new word can continue to join a certain word, then this word is open, and it is closed. In English, the pronouns are closed, while the adjective is open, some adjectives can be switched from the verbs (such as \"saddened\") or nouns (such as \"-like\" suffixed in the form of \"noun + like\") . In some languages, such as in Korean, the pronouns can be converted, but the number of adjectives is fixed. [102]\n\nWords can also reflect different grammatical functions. Typical as verb as predicates, and nouns are predicate, namely, subjects and objects. For example, sentence \"Sally Runs\", verb \"Runs\" as a predicate because it describes its specific state of the element \"Sally\". The number of yuan is called the price, and the different verbs can have different prices, holding one or more pairs. One price verb can only have a pair, and it is generally only the subject. This verb is generally called unusual vocabulary; the verb of divalent or more can have two or more pairs, the subject outside the subject For the object, this verb is generally referred to as and informative words. Therefore, the price is often called the property. [103]\n\nThere are other variations in different languages, such as two sentences, articles (pre-word) lead to nominal and generic name words, and exclamation, motion, etc. There are quantifiers in many languages, used to define the number of nouns, describe the names. Such as Japanese usage quantifiers \"people\" come: [104]\n\nWhen several trees:\n\nThe language of morphology and its processes in linguistics, the study of lexics, called the word law or morphology. In most languages, the synthetic words are composed of several morphemes. For example, the word \"unExpected\" can analyze the three morpons of Un-, Expect and -ed. [105]\n\nThe morpheme can be divided into roots and antiques, and the roots can be independent as the morpheme, and the affix must be attached to other morpons. Affixing is divided into prefix, prefixed, and suffix according to its relative positions of the roots. The garnish will change, explain the semantics of the ternary, and the method of adding a garbrose to create a synthetic word is called derived, such as the verb \"Sing\" plus -Rhange to \"Singer\". In contrast, flexural changes (morphological changes) change the word syntax function by changing the morphology of the morpheme, and then changing the meaning, but does not create new words. Some languages ​​change the word meaning by changing the flexographic structure of the word rhyme structure. For example, English words \"Sing\" becomes \"Sang\" and the past word \"sung\". [106]\n\nDifferent language dependent morphological changes are different, so the relationship based on morphology and grammar produces a formal classification. Isolated language is the language of Morpheme-Per-Word Ratio, and does not perform morphological changes, but in order to express a grammatism relationship, such as Chinese. Isolated is also an analyte, because most of the time words and the semantics are also one or one (but not Chinese is not derived), such as Chinese \"not easy to break\" is not, easy, broken, damaged four free mymeatons, no Synthetic words are composed of UN- (not free mymens), BREAK, BREAK, ABLE (not free tone) like English \"unbreakable\". [107] Most of the synthetic including English is allowed to have a synthetic word containing multiple morphemes, but depending on the degree of morphedu, the morphological word ratio is high, and can be divided into a flexographic, adhesive and multi-synthetic. Wait. The pencil is rich in flexible changes, and its morpheme can have multiple semantic or grammatical functions and can not decompose, but the combination of morphemes will be restricted. Most languages ​​in the world, especially the language of the Indo-European system, are induced. Such as Latin \"Bonus\", including the root BON- (Good) and suffix -us (positive main body). Although the adhesive speech has a flexible change, it is mainly adhered to alter the grammatical function in the root, and the syntax function of the gar is single, such as Turkish \"evlerinizden\" through the morin column EV-LER-INIZ-DEN. House - Multiple - The second person is said to be \"from) means\" from your home \". Traditionally, the so-called multi-syndrome is the most dependent on morphology, and the integration is also the highest, and a sentence is usually expressed in one word. Such as Persian \"فهفهفهییشش\" Nafāmidamesh (I didn't understand), is composed of morbid columns NA-FAHM-ID-AM-ESH (negative - understand - the first person - third party), the complete containment The Subjects and objects of FAHM-. Another example is the word \"Tuntussuqatarniksatengqiggtuq\" by the mori-ni-ksaite-ngqiggte-ni-ksaite-ngqiggte-uq (Reindeer - hunting - the future - Negate - Repeating - Third person singular statement) He hasn't said that he is going to catch the reindeer. \" In this example, in addition to Tuntu (reindeer), all of the other temperaments are not free, and they cannot independently exist. [108]\n\nIn many languages, the morphology of the words in its sentence will be consistent with each other in some grammar. For example, in many languages ​​of the Indo-European language, the shape of adjectives must be consistent with their modified nouns, so the form of Latin \"Bonus\" is in the form of a positive main body. The result of each other. In many multi-synthetic syndrome, the morphology of the phrase is consistent with the subject and the object of the object. Such as Basker phrase \"Ikusi Nauzu\" ikusi n-au-zu (see the second person - Action - the first person) means \"you saw me\", \"Nauzu\" in the past, the helping probe -Au- (do) At the same time, it is consistent with the prefix N- (you) and suffix-zu (I). [109]\n\nAnother way to pass the sense of language is that the word is constituted by a certain sequence, and the sequence sequence here is called syntax. The syntax rules determine the constraint form of the word sequence and sentence structure, and these restrictions on the meaning of meaning [110]. For example, in English, English sentences like \"I love you\" (I love you) are to say, and \"* love you i\" (love you, I), saying that [Note 4] is said. Another example is the \"The Slaves Were Cursing The Master\" and \"The Master Was Cursing The Slaves\" (the master is speaking slave) refers to different things, because the syntax is sensitive to the sequence, the noun in front of the verb The role of the subject, and the noun behind the verb is an object. Instead, in the Latin, Dominus Servos Vituperabat and Servos Vituperabat Dominus means that \"the owner is cursing slave\", because \"servos\" is in the form, indicating that they are sentences. The object, and \"Dominus\" is the main body, indicating that he is the subject, so the preface is changed to express the same meaning [111]. It can be seen that Latin uses lexic (morphology) to distinguish subjects and objects, while English uses sequence this sentence.\n\nAnother example of the syntactic rules is another example of a number of doubts of words in many languages. This rule explains why English sentence \"John Is Talking to Lucy\" (John Talking to? \"(John Is Talking to Lucy) is changed to the question sentence.\" WHO? \". The latter may emphasize \"who\", so that the meaning of the question has changed slightly. The rules of the phrase are also part of the syntax, the words can be connected to a larger syntax structure by constituting the phrase, and the phrase is connected to each other at different levels, and finally connects to the sentence [112]. Such as the right picture, in the syntactic analysis, the English sentence \"The cat sat on the mat\" is divided into noun phrase \"the cat\", the verb \"SIT\" and the term phrase \"on the mat\", The phrase \"The cat\" is composed of articles and nouns, the phrase phrase \"on the mat\" is composed of a preposition and noun phrase [113]. This phrase is moved as a single element when performing a syntax operation. When you want to emphasize \"on the mat\", you can use it as a whole, get \"[and] on the mat, the cat sat\" (on the mat \" The cat is sitting), so it should be considered a unit. [113] According to the different hypothetical assumptions and descriptions thereof, there are now various forms and functional frameworks to analyze sentences, describe the language structure. [20]\n\nLanguage can be classified according to its grammatical characteristics, although some languages ​​are submitted to different branches, but they still have many common features, and these common features are often associated. [114] For example, the language can be classified in terms of its basic quotes, ie, the statement is classified with the positional relationship between other sentence components. For example, the basic sequence and Chinese in English are active guests (SVO) such as \"The Snake (s) bit (v) The Man (O)\" (snake bite), while in Australian Aboriginal Language Kamiraro In the English: Gamilaraay Language, its basic sequence is the main mobile dynamics (SOV), such as \"D̪uyugu N̪ama Dhayn Yiyy\" (snake bite). [115] Because the basic sequence type corresponds to other series of syntax type, such as the relative order of the nouns and adjectives, pre-word or post-reference, etc., the grade type is also considered a type element. This interrelation is called the universality of the language (English: linguistic universal), [116], for example, most (but not all) of the language of the main Bage (SOV), there is back words instead of the front word, Place the adjectment before the noun. [117]\n\nAlthough all language sentences are composed of subjects, predicates, and objects, but different language processing grammar and semantic roles are different, that is, the formation of the relationship is different, so the above-in-law formation is also different. English belongs to the main Bedge language, whether it is not a mapping word (such as \"i run\" I run) or a mapping word sentence (such as \"I love you\" I love you), its subject (the agent Agent, no time The core zoning Subject is also the top name I, the equivalent of the same form. In the same manual language, such as Kamira Royi, the subject (application) of the matrix sentence is equivalent to the object of the empathy (the object, ie Object), and the objective movement The subject of the word sentence. [115] So, the semantic role can be rendered in different grid relationships such as \"Labor-Pen\" or \"Grid\", \"\" \"\" \"\" \",\" \" The subject and object of the matrix sentence, and the subjects of the missword sentences are expressed in three different grids, respectively. [118]\n\nEven if the language type is classified by two languages, the common feature is also possible to independently. These features are in groups, which may be due to the universality of the general language structure (English: linguistic universal), and may be the result of the growing solution in the process of constantly resolving communication issues. [119]\n\nLanguage is existed in the language of the words. \"SPEECH Community). Although human beings have the ability to learn any language, they will do this in human, especially children, especially children, only in the growth environment or companions use the language. Language is also used in social communication to address a large number of tasks, so many aspects of language can be considered as adjustments to these purposes. [119] The way in which language is transmitted between intergeneration or speech commutations can lead to changing languages, constantly differentiate new languages, or fused through language contacts. This process is similar to evolution, and the change in generations will eventually form a tree speech spectrum. [121]\n\nHowever, the difference between the language and the organism is that the language is easily integrated into other languages ​​in the process of diffusion because of the speaker of other languages. Humans often use multiple languages, in addition to the first language obtained by childhood, they also learn new languages ​​during growth. In today's globalization, the language has increased, resulting in many small languages ​​that are gradually endangered, and their users tempted the use of more influence, which can face a larger-wide speech community. [122]\n\n\"Significance and symbols are close to each other\", semantic research is based on this assumption, but does not study the formation of social practices and its influence language. Instead, there is usually in the study of words and symbols, words will have different meanings in different social contexts. For example, direct object (English: deixis), this type of word description speaker and some entities are talking about time and space relationships at the time, such as \"I\" (showing speaking), \"now\" (said talking Time) and \"here\" (indicating the location of the speech). With the changes in social customs, its marks will gradually change its meaning. Significance of language expressions in terms of literacy how to change, and DeiXis is an important means of using language refers to an entity. [123] Language is focused on the mode of use of language and how these modes have contributed. For example, language expressions in all languages ​​can be used to deliver information, and can also be used to act. Some behaviors can have actual effects only, such as creating a new name for an entity through \"Naming\", or using the \"someone and his wife\" to create a social contract. Such behavior is called speech behavior. Of course, they can also be implemented by writing or speaking. [124]\n\nThe form of language expression is often not corresponding to its practical significance in a particular social background. For example, if a person asks: \"Can you get salt?\", He is not really a long enough to take salt enough, but want people to help him. This significance is hints by the context used; the impact of these significances is called session meaning (English: Conversational Implicature). Social rules for these languages ​​are only suitable in certain specific circumstances, and different speech communies are different for understanding their social background, the understanding of language is different. Learning these contents is also a very large ring in communication (English: Communicative Competence). [125]\n\nAny normal health people will learn and use language. Children will learn their language that is fully contacted in a single or multi-door. Whether it is speech or spoken, children are basically the same for their learning. [126] This learning process is called the first language acquisition, which is different from many other types of learning, and does not require direct or professional teaching. In the \"Original\" of Human, the museum Charles Darwin said that this process is \"a kind of instinctivity of art\". [13]\n\nAlthough there is a big difference in the specific acquisition phase in the normal development of infants, the development of the first language acquisition is still quite regular. From birth, newborns are easier to respond to human speech compared to other sounds. When about a month, the baby seems to distinguish between different speech. When about six months old, the child will start jealous, go to the voice of them, or make the hand shape around (English: Handshape). Babies in 12 to 18 months, the infants will start using words, and the average vocabulary of about 18 months is about 50 words. Children will start using the monocho (English: Holophrasis), which is only one word to express their own ideas. Double-word language will appear in this month, and then generate a telegram-based language (English: Telegraphic Speech) or some short sentences, and these short sentences are simple than the syntax of the adult language, but from them. The syntax structure is visible. However, it is indeed a regular syntax structure. From three to five years old, the ability of children talk or doing sign language will develop to the extent of adults, and their language acquisition process is basically completed. [127] In 2013, research shows that unborn fetuses have been able to get a language to some extent. [129] [130]\n\nBy contacting daily life or courses, people can learn the second or even more languages ​​in any age. Children learning the second language is more likely to reach the native language than adults, but in general, the second language user is difficult to obtain the mother-speaking user. An important difference between the first language acquisition and additional language acquisition is that the process of additional language acquisition will be affected by the learner known language. [131]\n\nLanguage can be understood as specific language specifications within a particular speech common body (English: Speech Community), and part of the big culture of the community. The language is not only different in pronunciation, vocabulary and grammar, and its \"language culture\" is also five flowers. Human use language to identify a cultural group, distinguish other groups. Even the user of the same language will also use several different ways, each of which represents a particular sub-group affiliated with a big culture. Languageists and anthropologists, especially social linguists, human linguists and language human classes, special research, speaking, the variation between the speech community. [132]\n\nLinguists use the term \"language variant\" to refer to different ways of language, which contains dialects and language domains in geographic or social and cultural sense, as well as the language among the secondary culture (STYLE Shifting) ). Language Classics and Language Sociologists define the communication protocol as the way of using and understanding languages ​​in a particular culture. [133]\n\nSince the language usage specification is shared by a member of a particular group, the communication language has also become a way of displaying and building a group identity. Language differences may become a significant mark of division between social groups, for example, a language with a particular accent can represent a person's minority or a few social class identity, his ancestral, or he as a second language user. These differences are not part of the language system, but how people use languages ​​as an important social tool for building a group. [134]\n\nHowever, many languages ​​will also mark social levels or social opposes in some grammar practices, and highlight the absolute or relatively relative social status of the speaker. In many languages, between men and women, the difference between age, between the age, between the social classes, the difference in both the syntax, just like some languages, using different words based on the listeners. For example, in Dilbar in Australia, the married man must use a special word to mention daily necessities in front of his mother-in-law. [135] Another example, some cultures have exquisite \"Social Direct Language (English: Deixis) systems, or through language means to express social distance systems. [136] In English, social direct mystery identifies some people mainly by distinguishing between surname and other surnames, and \"lady\", \"doctors\" or \"you\". But in other languages, this system may be very complicated, and override into the entire grammar of the language and the vocabulary. For example, in East Asian language, such as Thai, Burmese and Java, the speaker uses different words according to the relative position of him and the auditor in the level system, with the lowest level of animals and children, the highest level of God and royal members. . [136]\n\nAmong the historical long rivers, humans invenously invented many ways to represent the language, which is called a writing system.\n\nWriting Language is more useful to humans. It can store a lot of information outside the human body and repeat the retrieval, allowing long-distance communication, which is originally not possible to do this only by speech and sign. Many languages ​​have different genre, language, distinctive written languages ​​and spoken language, and even in part of the language community, written words and spoken language are largely separate, such as Cantonese. There is evidence that the application of writing will also have an impact on human cognitive development, which may be because of the usual and regular education that you usually require correct and regular education. [137]\n\nThe writing system has begun to invent the first leaf of the bronze era of the bronze era in the late BC. Summer's ancient wedge text and Egyptian pictographs are often considered the earliest writing system, they all take off the original text symbol system that appears around 3400-3200 BC, and the earliest consisted text is around 2600 BC. appear. It is generally believed that the Sumeren's text is independent, and for the Egyptian text is completely independent of Sumeir, it is quite controversial. There are similar arguments for Chinese characters developed around 6000 BC. It is widely believed that the former Columbus's Central American Writing System (English: Mesoamerican Writing Systems) has independent origins. [94]\n\nAll languages ​​have changed as the speaker uses or invented new speaking methods, and these changes will spread in the case of speech. Language changes are all-round, and the language will change in terms of voice, vocabulary, morphology, grammar or even parallelism. Although language changes are primarily treated, these changes are often considered, this is a language to retreat or language It is natural and inevitable. [138]\n\nLanguage variations may affect specific voice or entire voice system (English: Phonological Change). Voice changes include replacement of speech or speech features, which will cause the original voice loss, and even completely become new voice. Voice will also vary depending on the speech before and after it. Voice changes usually have regularity, so that voice will become systematically changed regardless of whether or not they satisfy structural conditions, any non-speech factors can be ignored. However, the system changes are not absolute, and the speech changes often affect only one or several words. Sometimes individual changes will trigger a chain sound movement of the voice system. If all of the Germanian groups have happen to chain sound movement, the start * bʰ becomes / b /, resulting in the original * B change to / p /, Then lead to the original * p be changed to / f /. This process is called Green Law. This can also explain the word Paater and Pisces in the Italian language Pater and Pisces corresponding to the beginning of the beginning of the Father and Fish. [139] Another famous example of chain sound movement is the main reason for English's vowel, this is the main reason why modern English is correct and pronunciation.\n\nAnother reason for speech changes is the vowel condensation (English: Crasis), that is, due to pronunciation blur, the two independent words fall off, gradually shortening two syllables in one word or even two speech phenomenon. For example, Latin Mea Domina has become Madame in French and Ma'am in American English. [140]\n\nThe language will also change in the grammatical level, which often occurs when the word or morphemes fall off, and the grammatical system has no consciously reorganization to compensate. For example, Standard Spanish uses the flexural change-S to mark the verb second person, but a part of the Caribbean Spanish (English: caribbean spanish) is falling off, causing them to express the second person. Hiwang Como TE LLAMAS? [KOMO TE JAMAS] (\"What is your name?\") This sentence has become a Caribbean. Como tú telica? [komo tu te jama]. Therefore, subtle speech changes will also affect morphology and syntax. [141] Another common reason for grammar changes is that some specific discourse modes are synthesized, such as the formation of an apparent language. For example, English Going To has lost its meaning of its body and exercise, and has become a sign in the future, and this change in some English dialects is very complete (such as I'm Gonna).\n\nLanguage variations may be pushed by their internal factors, such as specific speech, can cause speech changes in the case where it is difficult to identify or pronunciation, or change some rare language structures. [142] Another factor in language changes are social, such as when certain pronunciation represents a specific group, social class or ideology group, people who want to enter these groups will imitate, using those pronunciation, objectively Voice changes have occurred. Therefore, identity builds and political issues will also have a profound impact on language structure. [143]\n\nLanguage contact is also an important reason for the propagation between language characteristics. Language contact occurs when the user of the two languages ​​or language variants is constantly interacted. [144] Multi-language may have always been a normal human history, most people in the modern world can speak multiple languages. Before the concept of nation-state, mono language is generally only the characteristics of island residents. However, nationalism ideology makes a country, a language of a language is widely accepted, and the monochrome is popular. Despite this, there are approximately 6,000 languages ​​in about 250 countries in the world, indicating that there are still many languages ​​in most countries, so most languages ​​are still closely contacted with other languages. [145]\n\nWhen users of different languages ​​are closely interacting, their language often affects each other. After the long language has been exposed, a language feature diffuses in different languages, making the language of different locations controversy. This may generate a language alliance in the region where many languages ​​are closely contacted, and the language of mutual discordment begins to share a lot of language characteristics. There is a recorded language alliance including the Balkan District (English: Balkan Language Area), Central American District (English: Mesoamerican Language Area) and Ethiopian Zone (English: Ethiopian Language Area). In addition, due to the wide spread of specific geographical features (English: AREAL Feature (LINGUISTICS), some larger regions such as South Asia, Europe and Southeast Asia are sometimes considered a language alliance. [146] [147]\n\nLanguage contacts can also cause other language phenomena, such as language fusion (English: language convergen), vocabulary borrowing or even vocabulary reset (English: relexification) (replaced by the borrowing of advantageous languages). Under extreme and continuous language contact, it may result in some new mixed languages, which are difficult to be classified into a single language helper. For example, Piqin language, this type of mixed language is formed on regular contact between adult users of different languages, usually they don't speak each other's language, but they can build a simplified grammar and voice system through Piqin language. But at the same time, there are two ways of communication. Piqin also there will be no native language users, and the user who defines the priests of Piqi uses another language as the first language. However, if a kind of Piqin is a primary language of a speech community, then Piqin language will become the mother tongue in this speech community and become more complicated in structure as these children grow up. These languages ​​are also known as Kreth, such as Papuki, which is the official language of Papua New Guinea, starting from English and South Island; and Haiti Kreth, and Canada's Mickey Farms (English: MICHIF LANGUAGE), etc. [148] [149] [150]\n\nThe \"National Language\" website defines the \"Live Language\" (the language still use) as \"a language that has at least one mother tanguo.\" The exact number of \"live language\" is currently 6,000-7,000 species, which can be attributed to the \"How to define language\" and \"how to distinguish language and dialect\". As of 2016, \"Ethnical\" recorded 7,097 living human languages. [153] \"Ethical\" Based on language-based mutual understandability research, the language species is more than a generally conservative classification, such as Danwish generally regarded as a single language, there are two dialects And \"Ethnic Language\" is the two independent languages ​​of Danish and Daide. [151]\n\nThe \"national language\" website also shows that 389 languages ​​(about 6% of total) reached more than 1 million. The total number of users in these languages ​​accounts for 94% of the world's total population, while the remaining 94% of the language only accounts for 6% of the world's population. The right table is \"national language\" estimates the number of languages ​​and its number of users in the world's number of users (2009 data). [151]\n\nLinguist Max Wein Riich has a very famous discussion, \"said language is a diamond and Navy.\" [154], despite this, language and dialect There is no significant boundary, and political boundaries tend to affect the language variants as a language or dialect. For example, guest speech, Cantonese and official words are often seen as Chinese dialects, although their difference is more different from Norwegian and its derivative language Swedish differences. Before Yugoslavian civil war, Serbia-Croatian is considered two dialects in the same language, but now Croatian and Serbian use Latin letters and Cyrilli alphabets, as well as different languages. In other words, the difference between language depends not only in cultural differences, text systems, mutual understandability, but also on political considerations. [155]\n\nThe language in the world can be based on the relative relationship between the common ancestors> Language> Language> Singles> Language> Dialect levels into different languages ​​classification, actually classification levels may be more complicated. The language system that has been identified is hundreds of organizers, but with more evidence in depth in the future, some associates may be classified in larger categories. At the same time, there are currently dozens of languages ​​are listed as isolated languages, and they cannot find associations between them with other languages, such as Basque, Spain, New Mexico, New Mexico, Mexican Tower. Rascans (English: Purépecha Language), Japan's Aiui and Pakistan's Brugski, and so on. [156] There are still some statements not listed.\n\nThe Ongo-language language is the most, 46% of the global population [157], including English, Spanish, Russian, Indussan (Hindi and Urdu). They first spread throughout the Eurasia (400 - 800 AD), [158] [159] and later the European colonial expansion has made political and large-scale dominant positions in Africa and Americas. The language of the Han Tibetan language accounts for 20% of the global population [157], mainly distributed in East Asia, including Chinese officials, Hakka diars, Cantonese, and more than hundreds of languages. [160] [161]\n\nThere are more language bits in Africa, where the most widely distributed is Niger-Congu, including Swahili, Monkey, and Joben, accounting for 6.9% of the world's population. [157] African language is slightly less in Africa, but there are a large number of users, including Arabic, Hebrew, etc., as well as the Hahara Desert, Halars and Berl. Speech. [160] [161]\n\nThe use of the South Island language accounts for 5.5% of the global population, covering the vast range from Madagascar to Southeast Asia and even Oceania. [157] South Island, including Malagas, Malaysia, Samoa, and Indonesia (English: Languages ​​Of Indonesia) and Aboriginal language in Taiwan. South Island language originated in Taiwan 3,000 in the first 3000 BC, and then spread along many island chains to Oceania after using advanced navigation technology. Other major language bits include the Darro Dragon Department of South Asia (including Kanada, Tamil and Telouu, Central Asian Turki) and South Asia, such as Turkish, Southeast Asia. Language (such as high cotton) and 语 语 (such as Thai). [160] [161]\n\nSome local languages ​​are very rich, such as the Americas, Papua New Guinea, West Africa, and South Asia, etc., there will be hundreds of small languages. Although the number does not account for excellent, the language of these places accounts for most of the total world language. There is mainly South America's Keemmara Ties (English: Quechumaran Languages), Alavak and Tutin - Guaraniology (English: Tupi-Guarani Languages), Central America Utah - Aztick Language, Europe TOE - Man Gong, Ma Ya, and North America's Na-German Department, Yulukui Department and the Algonqua Nationality. In Australia, most of the Aboriginal languages ​​belong to Pami-Yonggui Ties. In addition to South Island, New Guinea has a large number of small locations and language islands. [156]\n\nThis language is in an endangered state when most of the user dies or turns to another language. If there is no longer someone as a native language, then it will become a dead language; go down, if there is no one in this language, then it will extinct. Language extinction has been repeatedly happened in human history, but the new colonialism and globalization since the 20th century have exacerbated this trend, and the economic powerful language is still in other languages, and the language of the number of people is on the verge of crisis. [3]\n\nIt is still unclear how many languages ​​have a total of many languages ​​in the world, depending on many factors. Generally speaking as of 2010, there are 6,000 [162] to 7,000 languages ​​in the world, of which 50% to 90% will be extinct before 2100. [3] 50% of the world's population uses the top 20 languages, each language is more than 50 million, while many other languages ​​are only used in small range, most of whom's users are less than 10,000 users. [157]\n\nUNESCO divides the territility of the language into five levels: \"Fragile\" (children are only used in home), \"dangerous\" (no children), \"major hazard\" (main users), \"extremely dangerous\" (extremely dangerous \" The main users are only for the elderly, and they are not used as the first language (English: Speaker Types) and \"extinction\". Although there is always a common language that is unified to be English or Chinese language, it is considered that the disappearance of language will harm the world culture diversity. And the narrative of the Old Testament of the Bible is generally believed that language diversity will lead to political conflicts, but also think that this is contrary to many major violence in the world, such as Nort-North War and Yugoslavian civil war. Or Rwanda's race extinction, regional language diversity of these events is relatively low; and many stable political units are highly multilingual. [163]\n\nMany projects are committed to revitalizing the elderly language and promoting educational and literacy of minority languages ​​to prevent or slow down this loss. There are also languages ​​that may be specially legislated and stabilized in the world within the world, and the language of the Aboriginal Speech Community (English: Speech Community). A small number of linguists believe that language loss is used as a natural process, and it should not be offset, and the end-oriented endangered language is full. [164] "}