{"chinese_title": "tourism ", "chinese": "Travel is a travel tour. It refers to the industry of leisure facilities and services for passengers [1]. It is a complicated social phenomenon involving political, economic, cultural, historical, geographical, legal, etc. Tourism is also a kind of leisure and entertainment activity, which is characterized by sessile and temporary. In general, tourism has two different levels of tourism and travel, and the former is short, the experience is shallow; the latter is vice versa.\n\nTourists are called passengers, tourists.\nWhen traveling to group, the common travelers are called the same group.\nFree travel passengers, also known as backpackers.\n\nTravel is a travel tour.\n\nDifferent from the concept of travel.\n\nIt is a complicated social phenomenon, and tourism should involve social facilities such as politics, law, economy, culture, history, geography. Tourism is also an entertainment. The World Tourism Organization refers to the definition of passengers is a minimum of 55 miles away from home (88.5 km).\n\nFor consumption, leisure or public, visit activities in their place of residence and work. (At least stay more than 24 hours)\n\nTourism has become an important source of income in many countries and regions. At the 1980 meeting of the World Tourism Organization, the Manila declaration believes that tourism is a necessary activity in national life, because it directly affects social, cultural, education, and economic fields.\n\nThe tourism industry can earn a lot of income by providing tourists and services (English: Goods and services), which accounts for 30% of world service trade, and 6% of overall goods and service export trade. At the same time, it also provides the employment opportunity for the third industry related to it.\n\nService industry benefited from tourism includes transportation industry (aviation, cruise ships, rail trains, taxi), hotel industry (accommodation, resort), entertainment venues (amusement park, restaurant, casino, shopping mall, music performance site (English) : Music venue), theater). Of course, there are also items sold to tourists including souvenirs.\n\nIn ancient times, local tourism leisure outside of a person is limited to the wealthy class. They will occasionally go far away, enjoy the magnificent architecture and art, learn the new language, experience new culture, taste different cuisine. The earliest tourism can be traced back to the King Hurgun, although the king is in order to build a road and build a station, providing other travelers to provide convenience [3]. The earliest leisure tourism can be traced back to the ancient Egypt of 1500 BC [4]. During the Roman Republic, the rich is popular to Baya. This place is a spa and seaside vacation. Sannias Writing \"Greece Description\" in the 2nd Century Bive. In ancient China, Confucius spends 14 years around the country, arrived at Taishan [5], with Confucius \"Deng Dongshan and Xiaolu, Deng Taishan, Xiaoxiao\".\n\nIn the Middle Ages, Christian Pilgrimage and Buddhism have pilgrimage traditions. Joe's Canterbury story collection and Wu Chengn's Journey, respectively, the classics of English literature and Chinese literature.\n\nThe Song Dynasty in the 10th century has emerged, there are some tourist writers, Su Shi, Fan Chengda. Ming Dynasty has Xu Xiake. Italy's Petritrick wrote travels in 1336, I wrote this trip, but criticized him lack curiosity. Burgundy Duke Poet Michault Taillevent (French: Michault Taillevent) wrote terror memoirs after visiting the Julant 1430 [6].\n\nModern tourism can be traced back to Zhuangwang, refers to the young people in the European upper class to Europe (mainly Germany and Italy). In 1624, Prince Poland Wadishvawvi has conducted travel across Europe, which is customary habits in the Polish aristocrats at that time [7]. He visited the current Germany, Belgium, the Netherlands, and was admitted to the Spanish army, France, Switzerland, Italy, Austria, Czech Republic, Siege of Breda (1624). This is an education tour [8], one of the results is to introduce Italian opera (English: polish Opera) into Poland Lithuania [9].\n\nThe tradition has been active to about 1660, until the emergence of large-scale rail transportation in the 1840, forming a standard travel stroke (English: Travel itinerary). Although this is primarily limited to the British aristocrat (English: british noibility) and rich rural nobles (English: landed gentry), Nordic's newcomers have similar trips, and from the middle of the 18th century, there are South America, the United States and other overseas young people join . The emergence of railways and steam boats makes tourism, and the middle class will also benefit, which there is Thomas Cook, and there is a proverb called \"Trip of Cook\" (meaningful to take a horse-speaking travel).\n\nIn the 18th and 19th centuries, Zhuangyou became a symbol of the upper class, John Johnhim Wellkerman's hegemonic theory about classic culture was very popular with the European academic circles. Artists, writers, travelers (such as singing) affirmed Italy, France, Greece's hegemony in the traditional art field. For these reasons, the main destination of Zhuangyou is to go to these places.\n\nLeisure travel can be associated with the first industrial revolution in the UK, and people's leisure time increase [10]. At first, the beneficked group is the owner of the production of machines, oligarch, factory owners, traders. This also includes a new middle class [10]. Cutskin (English: Cox & Kings) founded in 1758 is the first formal travel company [11].\n\nThe industry has originated in the UK, which is reflected in many places. Vacation victory in the French CôzClass Coast, a famous beach poolway is called Anglo Street (meaning \"British walkway\"). There are many historical places in the European continent, and the Palace Hotel is named \"Bristol Hotel\", Kalton Hotel, Meiqi Hotel, which reflects the dominance of the UK.\n\nThomas Cook (English: Thomas Cook) is the first batch of travel business. On July 5, 1841, Cook Arrangement Railway Company received each passenger 1 command, including train tickets and meals on the trip.\n\nIn 1855, Cook launched the first foreigners, from Leicester to add and went to the World Expo, and the following year launched European big way [12]. In the 1860s, he group to Switzerland, Italy, Egypt, USA.\n\nMany tourists will travel to the seawater seawater bath, and the tropical beach is very popular in winter or in summer.\n\nVolkswagen tourism refers to the planned group tour in accordance with the planned group, usually under the leadership of the tour guide. [13] The form of tourism formed in the United Kingdom in the second half of the 19th century, and the starter is Thomas Cook. Cook took advantage of Europe's rapidly developed railway network, and founded a company, in addition to providing a price affordable day trip, it also provided to the rich, India, Asia, and western hemisphere. By the 1890s, 20,000 tourists buy THOMAS Cook & Son's tourism products [14].\n\nTourism traffic has begun to have a car in the early 20th century, and later there is a plane. The development of transportation has shorten the time spent in the journey.\n\nIn the European continent, the earliest sea bathing has been developed in 1793, which is located in the Baltic Sea.\n\nIn the middle of the 20th century, the Mediterranean coast became the popular destination of the public tourism.\n\nNiki tourism refers to a special tourist form that appears in recent years. More popular niche tourism markets are:\n\nOther tourist forms are:\n\nThe birthplace of winter tourism is the 1860s Switzerland San Marez. People go to the ski slopes [15] [16].\n\n[Edit in Wiki Data] "}