{"chinese_title": "Law ", "chinese": "Jurisprudence, Legal Theory, also known as legal, legal science [1], is a special discipline in social sciences, researching the legalization of this particular social phenomenon and its nature and law. All order can be said to be a \"law\", such as natural law, spiritual, logistic rule or aesthetics, and law is the law of research law [2]. Although many jurists, such as Friedrich Von Logau, Julus von Kirchmann, identification of law without academic nature, but law evolution is still there to be legal Philosophy, Legal History and Legal Sciences and other three departments. In addition, it is a consideration of social sciences such as political science, economics, financial, sociology and psychology, such as research objects.\n\nThe earliest thoughts originated in the East Zhou period, such as the pipe proposition: \"The law, so the screaming; the law, the score stops [3]\". The term \"law\" is the earliest to see the \"Please study help the teaching plan\" \"to find ancient name flow, more law\". However, its meaning is different from the \"law\" of modern times [4]. In the tradition of Europe and the United States, the definition of the word Urbian in the ancient Roman jurist is: \"The Concept of Personnel and Gods, Justice and Insugorie\", Dutch jurist Gerazi believes that law is human research Follow the disciplines living in justice. During the Renaissance During the Renaissance, law studied at universities, and was one of the most active department of the academic community at the time, with medical and theological three. In the process of history, there is a custom, and then the ethics is separated by ethics, and finally there is law, but relative to the customs and morality, the law has a fixed and mandatory characteristics, which also contains the realistic power in the people's life, and try to explain the ideal world. Atcaffirmation [5].\n\nJurg (English: Jurisprudence) From the Evil of Juris Prudentia in Ancient Latin, the original interest is the legal research, knowledge or learning, where Juris is all of JUS, meaning the law; Prudentia is cautious, it is considered thoughtful, First see, careful, especially in practical acting. In the American context, law usually refer to legal philosophy, mainly four major research, primarily to seek analysis, explanation, clarifying and criticizing legal body, the second is to compare legal as well as other learning such as literature, economy, religion, society The scientific content, the third is the history, moral or cultural background of the resolution of the legal specific theme, and finally the abstraction of \"How does the law?\", \"How Judge Judges\"? \"[6].\n\nIn China, since the west weeks, there is a complete administrative system, and Zhou Li is a book, which is also a big collection of government law and private law. The summary of the physical law and procedures [7], and academic 100 pairs, the ideological freedom is free and developed, from Quan Zhong started Including business, Shen, Yin Wen, cautious, Han Fei and others, the latter is called the Fa, and it has made it in the country because of the serious way. The word law, in the pre-Qin period, known as the literacy name, since the name of the law in the Han Dynasty, to the Tang Dynasty is a mature period, there is a rival, the law, Yonghuo Law and the Odia, and \"four \"The\" Tang Lishu \"instructions mentioned:\" The alator said that the Tang law is about to give the law, thinking that it is a clear standard for the traditional Chinese tradition, also It is the explanation of the ancient characters \"灋\" in \"Said Wen\": \"The punishment is also. It is like water, so from the water. 廌, I can't get it, so I will go.\"\n\nThere are certain rules in the behavior of people, and the ethical law of regulating human will and behaviors can distinguish between morality, customs and laws. The aforementioned law is the only law in which the following four characteristics, external care orientation, external judgment method, external purpose body, and external efficacy source [9]. That is to say, the results of the legal care behavior are not in the inner intention, as long as the behavior is in line with legal provisions, there is a subject of legal behavior, and the legislatives and arbiters have legislatives and arbiters. German famous jurists Gastav Radbruckand believes that the law has three major values: public interest, method clearness, justice, but because of the imperfect these three major values ​​of people are not always harmonious to total Among the law [10].\n\nIn the cultural content of morality, customs, laws, countries, science, art and religion, in accordance with different schools have three major systems to discuss legal purposes, to create legal contents such as national, cultural countries, and powerful countries . The first is the end of the 18th century, Kant, Schiller, Hongbobe, and others believe that the ethical personality of freedom is the highest value, and art and science is only the tools, laws and countries that are only a protection mechanism, so law only has personalism. The essence of ethics is worthy of their own value, which is generally believed that the law is only a technological norm of rational purpose. In the power of rights, there are more national, power and their growth are the highest mission in the world. The state gives all personal moral content, all cultural achievements are national services, such as Hegel, Heinrich von. These theors of Heinrich Von Treitschke will treat the state as a whole. Humans are limbs, and the limbs are in order to overall, and the law has a personal value. Finally, it is a cultural country, such as Fphae, Sinnis, in \"Social and Community\", the highest mission of life is not in personal or collective personality, and the sum of achievements and achievements, that is Culture, the highest mission of the country is also to protect these cultural work [11].\n\nThe law's formulation is not only organized or the nationality of the country, but also from the unmetable community, but the country is not only the main source of the law, but it is also a product of the law: the country's constitutionalism The status of the jurisprises is obtained from the Constitution and related legal interpretation. In other words, the state has preset the constitution, and the Constitution is based on the country. In fact, the country and the constitution are one sided, just like organic matter and its organizations are difficult to separate [12]. The third right of the constitutional thinking is seen in the Sany Subject of the Montessan \"The Spirit of the Disciplatics\", he advocates that if the state does not want to be authorized by the rule of law, the three powers of the country cannot completely fall into the same national organ, which is the people's participation of legislation. , Administrative must legal, the judiciary must be independent. Therefore, the freedom of the constitutional country has risen, in addition to the active facilities of the people to participate in national affairs, there is also a national guarantee that they cannot violate personal freeness [13].\n\nThe police countries do not know the boundaries of state power, but they are not only to protect the people from others, but also from their ignorant hazards, and thus sacrifice the freedom of the people to protect their well-being. However, when the constitutional country silently issued a transaction in certain areas, they broke this monitoring system, which was the 1789 \"Human Rights Declaration\", in the Constitution or other laws, to declare the rights of unable violapses, such as before the law Everyone equals, personal freedom, residential and communication privacy is not infringed, belief and cultural freedom, academic and theoretical freedom, free assembly, freedom, freedom of employment, freedom of migration, etc. [14]. In the form, the Constitution is the fundamental law of the country, which is superior to ordinary laws. Other general laws must be formulated according to the Constitution, and may not contradict the constitution, otherwise it will lose its effectiveness [15].\n\nIn the classical capitalist society, the essence of economic law is to ensure that the public has the right to let go of economic activities, especially the fundamental principles of ownership, the freedom of contract and the equality of the personality, and the main content of the law require the country's largest economy. Freedom of activity, with the market automatic adjustment mechanism, the so-called \"invisible hand\", used to form a reasonable economic order of the overall market, so the intervention of economic activities is actually an extreme attitude [16]. Starting from the World War, the legislators no longer only regard the economic relationship as fair compensation between the parties, mainly based on the economic common interest, production and saving concepts, so the economic law came into being, this is a tradition The third type of legal field between the Shang Dynasty and Private Law [17], representing the consumer protection law and fair trading law in the Republic of China [18], when the country is no longer only maintained in pure private freedom, but Attempting to grasp the operational rules of the sociobial significance, turn on the \"country's hand\" to ensure the reasonable economic order of the overall market and the extraordinary economic cycle.\n\nSince the human society, there has been a crime. I have no legal concepts since I started, and I'm always rescued by the criminal behavior, and I formed a revenge system of \"teeth and the eyes of the eye\". This is the original state of the penalty. [19]. In the rule of law, the criminal law is still in the direction of authoritative thinking, with the revenge and intellectualism as thinking, making the crime clearly correspond to the criminal penalty of the should, while playing the role of maintaining legal stability, to fight against the rule Abuse of authority. As liberalism and nationalism's ideological transformation into socialist people's countries, the criminal law of social protection and education has replaced the above tradition, even in criminal policies for the prevention of criminal law, there is also a judicial trust crisis. . Today's debate is no longer priority, but the protection of the rights of criminal justice and raising the judge's discretion, and the decision between the old narrow people or the benefits of the welfare culture [20].\n\nHowever, the issue of punishment also involves the root cause of the criminal law itself. The penalty means that it is deliberate to people, and anyone wants to use penalties to understand that he is entrusted higher. Each criminal act is a product of two factors: personal character and environmental status. According to the main motivation of criminal behavior, the crime can be divided into two major categories: opportunity prisoners, and always trainees. The behavior of opportunities prisoners is caused by external irritation or incentives, and there is no long-term crime. The nature of common crimes will be crime or crime based on habits. For the latter, experience shows that many of them will live up to the efforts of educators and reward again, so the penalties can only remove them, permanently or long time to ensure social security. For the chance committee, you should express it to be clearly reprimanded to warn them. Therefore, according to the three categories of the criminals, the penalties can be divided into three categories: penalty should warn the opportunity of the opportunity to improve the personality of personality that can be changed, as well as isolate unpleakeable personal probes. Compared to general education, adolescent criminals should be mainly based on education [21].\n\nModern law refers to the science of research, but there is different views on the relationship between law and science. This is mainly related to the research of value theory. Modern Germans raised humanities and social sciences to the status of natural science, and the modern universities since Hugong University in Berlin have promoted the development of social sciences. Law is understood to be related to this background. Law is the main core content of value theory, like Danish jurist Alf Rose (English: Alf Ross) said: \"Justice ... can not be used as the rule of law, or the ultimate standard of the law, advocating a method of not just just However, it is a harmful emotional word [22]. \"In essence, the core of law is just the center of thinking, not the body's body is value, the biggest characteristic is what behaving to reflect the value in the confirmation (or Say how to confirm the value is already achieved, this argument has formed all legal department branches. Whether the verification value is achieved or how to achieve demonstration is empirical, verified, and thus scientific. In terms of value derivation, laws also have a axiom theory. Law is not scientific, and it is the easiest to ask questions, jurisprises are in the core part of the value, but this is just a jurisprudence. In the form of jurisprudence, you can despise the science, but the morphology of the jurisprudence (the solution department method) must resort to comprehensive analysis, value is only one of the elements. The legal research cannot have the conclusion of \"Objective Research, or Legal Thinking\", which can only be \"mutual subjective\" [23]. Law and affirm the law for the norm and adjustment of society.\n\nIn addition, law has been closely connected with political science, and law research law is the main content, and laws often reflect national political measures. Political type and system, often manifested by law. Political science is based on the country as the main object, and believes that the country is an legal person, legal rights obligations, and legal identification of natural persons and legal persons have the right to obligations. Therefore, law and political science are inseparable, and the relationships in the table [24].\n\nHow to classify the law according to various scholars, there is a variety of research scope and is divided into two types of general law and special law. General law research on all the concepts of law, such as legal ottery, law, law summary, special law research Learning about special legal phenomena, such as constitutional, civil law, criminal law, administrative law, commercial law, international law, etc. There are also three kinds of research content as a distinction, divided into three kinds of legal philosophy, legal history and legal science. Legal philosophy is the principle of research law, and explore the ultimate ideal of law and its use value, and the legal department of universities. A Class of Science to explore the scope of legal philosophy. Legal history, also known as the legal epithelial, mainly studying the changes in the laws and future trends, and now there are many laws and other learning, and the historical scope of legal history is now. Legal science discusses the principles of common principles, as well as the concepts, content and scope of laws, which can be divided into subjects, such as the constitution, administrative law, civil law, criminal law and other legal research [25].\n\nLegal education to teach legal knowledge, law knowledge system and cultivation of education systems and ways to develop legal profession. Modern legal education is generally divided into two basic parts of legal education and legal profession training.\n\nThe purpose of law education is cultivated in the field of law, including various legal theories and surgery. Some people divide legal education into law undergraduate education and legal postgraduate education. The former is the first academic qualifications in law (the bacterior and legal doctors), the latter is a legal education for continuing training after learning undergraduate graduation, such as Master of Law and JD. However, some people think that the law is the first academic qualification in law, but it is a graduate degree, so it is considered that the classification should be named by basic law education and advanced law education.\n\nLegal vocational training is divided into two categories:\n\nAfter the Qing Dynasty, in the early years of the Republic of China, all kinds of universities have established, including many law schools. Among them, the National Law School still has the most famous of the Beijing University of Beijing University, and the private law school is the most famous for the School of Law, East Wugu University and Chaoyang University, and \"South East\" Wu, Bei Chaoyang \".\n\nAfter the founding of the People's Republic of China, China's education community has experienced a variety of changes, and the law school is most famous with the \"Five Hospital\", which is: Beijing Political and Law School, Southwest Political Science and Law School, East China University of Political Science and Law, Central South China Law School, Beijing Department of Law, Renmin University of China, Law of Wuhan University Department of Law, Jilin University. However, the current \"five hospitals\" has become the University of Political Science and Law, and the \"four series\" has also become a law school. [26]\n\nSince the ancient Chinese students do not require legal knowledge in the Juan's Jinjin pathway, China is not very valued by legal education. And after the discovery system was canceled, under the legal reform of Shen Jiaota, it is the most ideal way to join the Beijing Square University, combined with the opportunity of law reform, and the capital of Jingshi University is a maximum of students. One of the schools read. And now, China's legal educational institutions are huge, and the number of law students in China has been in November 2008. In the thirty years of reform and opening up, the number of law students and legal teachers increased by 100. Double and 10 times. [27]\n\nCurrently, Taiwan is a representative law school:\n\nOnly research institutes have lack of law schools at the University Department:\n\nIn Taiwan, the law has a graduate from the University of the University, with the qualifications of the judiciary (judge, prosecutor), and lawyer exam. Therefore, the legal school has become one of the three-class groups, in all universities. The admission scores are often the highest in the department of the first class (including political humanistic design, business management accounting, other social sciences). In recent years, Taiwan has considering the repair of the law, and will participate in the judicial official (judge, the prosecutor) examination. The test qualification to have the legal professional research institute must be applied. If the fake, the implementation is bound to affect the Department of Legal, High School The admitted score has not been fooled.\n\nIn Hong Kong, there are legal education in the Legal College of Hong Kong University, the Legal College, Hong Kong University of China, and three universities in the Hong Kong Urban University.\n\nIn Macau, the University of Macao University of Law, two universities in Macao University of Science and Technology have legal education.\n\nThe American Law School offers a legal education of three degrees: Ph.D., a master's degree in law, and a doctor. Dr. Legal is the core of American legal education. It is both cultivating legal practitioners to cultivate legal researchers, almost all lawyers, judges, and proceedings of law are doctors graduated from law. [28] "}