{"chinese_title": "country ", "chinese": "National or country (French: Pays; English: Country or nation; Spanish: país; German: land), sometimes it is still blessing, modern and multi-point sovereign state. [Suspicious] From a broad perspective, the country refers to a common language, cultural, race, religion, territory, regime or historical social group; from a narrow perspective, the country is a common form of a crowd within a certain range. The general national administrative authority is a symbol of the country. It is a national institution with power to govern a society, with external and internal sovereignty in a certain territory.\n\nNational entities in international law should have to hold the following conditions:\n\nThe word \"national\" in Chinese, the ancients known as the country, the oracle text word is 戓 (later developed or the word), symbolizing the territory of the weapons. Add \"囗\" (ie \"(ie\") in Jin Wen, symbolizing the wall, forming the current country, there is a city, city, capital of the city [1]. The domain is also differentiated. In addition, there is a state of the state, with the nature, and the oracle text is a tree planting in the fields of field.\n\nThe meaning of ancient Chinese \"national\" is similar but not, the \"country\" in the modern concept, and \"national\" and \"home\" are initially distinguished [3]. Such as \"Zhou Yi\": \"It is to be safe and the country can be guaranteed.\" \"Country\" from the clan land of the tribal alliance, to the Shang Zhou Become the seal of the vassal [4] [5] [6]. After the Qin Han, the world was in the world. Because Confucian culture emphasized the \"home country\", the family refers to the family, the family, thus forming the \"home\" \"national\" and mentioned the conditions, \"the country\" refers to the whole country, Such as the Western Han Dynasty \"said Yuan\": \"There is a national, the people\", \"Ming History\": \"Country is Lei Gong\". However, the \"national\" of Chinese ancient books refers to the dynasty [7] formed by a surname family [7], is not the concept of modern nation. In the West, only the term \"state\" in the Western State [8].\n\nIn English, Country refers to a range of land and government political entities, which may be an independent sovereign country or a region of a sovereign country [9].\n\nSuch as French: Pays, Spanish: País, this is a single word derived from the Roman language, and is also translated as a country. The earliest from Latin: Pagus is the meaning of the territory.\n\nAnother synonym stat State emphasizes the status of government rule and is a commonly used term. The earliest version of the Italian's Thinking Map: Statos is from the word from Latin: Status, the presentation is \"status\".\n\nAnother synonym, the community (English: Commonwealth), is the corresponding word of \"Latin: Res Publica), refers to the national wealth and strength of the people, the government.\n\nAnother English single word nation sometimes translated as a country is the meaning of the nation, because the ethnic groups have been promoted to the country in certain paragraphs, in some paragraphs. If the word \"nation\" is in the sense of modern English, \"nation\" not only refers to Chinese \"countries\" (ie English's synonym stat State, Country, Commonwealth, can also refer to \"nation\" (ie The synonymness people, TRIBE, TRIBE, NATIONALITY, and when a \"national\" is pursuing independent autonomous, \"national\" can also be understood as a \"national\" or \"national state\" (ie nation) -state or national state) (Jiang Yihua 1998, P.7).\n\nIn social sciences and human geography, the country refers to the territory of people, culture, language, geographicity; a territory that is distinguished by political autonomy; a territory or the people of the state; region with specific people .\n\nAccording to the definition of Max Weber, the state has a legal use of violence [10]. Therefore, the state includes some government agencies such as armed forces, official personnel or national bureaucrats, courts, and police. In theory of international relations, as long as the independent status of a country is recognized by other countries, this country can enter the international area, and this is also an important key to prove its own sovereignty.\n\nAlthough the term state is usually widely used to repist all government agencies or ruling behavior - ancient or modern, many of the characteristics of modern national systems have to begin to appear until Western Europe in the 15th century.\n\nIn the late 20th century, the globalization of the world economy - the mobility of people and capital, and the rise of many international institutions has restricted the country's governance capabilities, but most countries still have the foundation of the base sovereign functions. Therefore, the country is still one of the most important fields in political research, and the country's definition is often the focus of scholars arguing.\n\nIn political sociology, Carl Marx and Max Weber's theory usually tends to relax the definition of the country to increase the attention of institutions with forced power.\n\nSince the late 19th century, all the world-lived land have been divided by countries; but before this, the large area of ​​land is not unreal, and there is no country to claim its sovereignty, or only the nomadic nation. By 2016, there were nearly 200 countries in the world, 197 of which were universally recognized sovereignty countries (including United Nations Member States and United Nations countries), and 10 \"actual sovereignty\" but sovereignty is disputed. Country [11], most of which (193) are members of the United Nations [12].\n\nJonathan Has summarizes the model of two countries: one is a conflict, and believes that the emergence of the country is derived from the needs of the inherent conflicts in the social hierarchy; one is a combination, believes that the emergence of the country is society. Collaborative needs. [13]\n\nHas summarizes the ways to produce, there are three main types:\n\nMarxism believes that the country has only occurred after the birth of the primitive society, and only the classic commune based on the blood relationship. Based on some research on archeology and anthropology of ancient Europe and China, the clan commune has two modes to the country: directly from the clan society; evolution in the elevation of the clan social disintegration. [14]\n\nThe first country in the history of human history in Ancient Egypt, the first empire was established by the Akaders. In Europe, the history of the country began in Ancient Greece. In ancient times, the state has many forms, such as the king and army of the Greek era, or the emperor and nobles of Rome. In the first 4th century, the Social free people will be teached with citizenship. The \"democracy\" of these city-states has continued until the Alexander Emperor is gradually captured by each kingdom or colonial.\n\nIn contrast, Rome did not use direct democracy, but from the development of the king system into the Republican system, the Roman aristocratic leader is ruled. The Greek City State has promoted the concept of direct democracy, and Rome has contributed to the concept of Roman law, as well as distinguishing between private and public domain.\n\nThe Wattrack of the Roman Empire makes the original empire land by the aristocrats from all over the world, and these nobles are in politics, justice, and military roles with economic production. In the early mid-aira, the power of Western Europe was feudal and institutionalized, and the place of property owners got the land and got political power. In this case, according to Marxism, their real estate is the basic economic unit of society, and it is also equivalent to one country.\n\nThe national system feudal Europe is an unstable architecture consisting of feudal owners and kings. The king is in the form of sovereign, but in fact, there is no absolute power can rule; the relationship between the aristocrats and the king is mediated by different degrees of affiliated relationships, and there is no central system of tax. This situation ensures that the rulers must obtain the \"consent\" of each landlord in the territory. The Roman Catholic Church has the same legislative power with the ruler, not the authority of the world. Therefore, the concept of \"modern countries\" has not yet appeared in the medieval feudal era.\n\nIn the West, \"Modern Countries\" as a power structure consisting of the highest political power and the established territories, it has been to begin in Western Europe in the late 15th century, and peak in the rise of autocratism and capitalism.\n\nSeveral European king countries - Under England under the Tudor Dynasty, Spain, Habsburg Dynasty, and the French under the rulings of the Wave Dynasty launched a variety of plans to enhance centralized centralization and economic control. They gradually develop Many features are known today as \"modern countries\". This process of central centralism involves the division of political borders, European kings gradually beat other powers - such as aristocrats with less forces. Replaced the system under feudal rule, changed a large-scale, unified country to dominate the established territory. This process has developed high-level centralization power, and gradually increases the bureaucratic political form of autocratic kings. In the 17th and 18th centuries, the basic characteristics of modern national systems have formed, including the system of the standing army, the central tax system, diplomatic relationship And the Embassy of Chang, as well as the development of national economic policies - Qibism.\n\nThe homogeneration of cultural and nation also plays significant roles in the development of modern national systems. Since the era of authoritarianism, the state has been organized in a large part of the country. However, even in society in racial homogenization, the state and nations do not necessarily meet, so the country often actively promotes nationalism to emphasize nationalism and the identity of the common symbols.\nThe formation of the country is driven by internal motivation and conflicts, or caused by international power such as war, imperialism, or economic domination. Marxists often advocate that the emergence of capitalism is an important sign in this process, which is also in line with the formation of national countries.\n\nDiscussion on political philosophy of national nature is mainly divided into the community to say two geography.\n\nAs a political community, the country is a classical political concept that has been formed since ancient Greece. Aristotle believes that people achieve value in the community in the city state, otherwise people are only economic animals, not real people. Sizhiro, Kant et al. Believes that the Republic is a collection of common interests in accordance with the law [15] [16].\n\nThe contractor believes that the country is based on individual interests, and people are based on certain common interests and serve personal interests. People seek peace by formulating a contract, the country is a \"contract of the sword\" to punish those who violate the contract. Hobbes refers to the state as \"Levitan\" [8].\n\nIn political science, the \"national theory\" is divided into three types: Marxism, multi-draft, and institutionalism. These three theories are used as interpreting the country. There are several problems that make the country become quite complicated. First, the definition of the country is incomplete and often changes. Second, the country is not only a stage that is struggling with each other, but is also a stage for conflicting in the outside of the group. Some scholars often file \"national interests\", but in fact, there are various stakeholders in the country, which is not only a separate country or society, but in different groups and different countries in civil society. It is developed between people.\n\nMarxism believes that the country is that social development to a certain historical phase, and the role played by modern countries is determined by their position in the capitalist society. Many contemporary Marxists have quoted Marx's theory in the Communist Declaration - the country is a ruling agency for the general matter of bourgeois management. Marxist's classic definition from Engels's \"home, private ownership and country origin\" [17]:\n.mw-parser-output .templatequote {margin-top: 0; overflow: hidden} .mw-parser-output .templatequote .templatequotecite {line-height: 1em; text-align: left; padding-left: 2em; margin- Top: 0} .mw-parser-output .templatequote .TemplateQuotecite cite {font-size: small}\n\nThe country said: This society has fallen into unresolved self-contradictory, splitting into an uncomfortable opposite side and unable to get rid of these opposes. In order to make these opposes, these economic interests have conflictful classes, not in unstruthful struggles, they need to have a force on the society on the society, this power should be moderate, keep conflicts In the range of 'order'; this kind of power is generated from society and is increasingly separated from the society, it is the country.\nMarxist, such as Rarff Mille, believes that the country is a group of class contradictions and class struggles, and advocates the rule of ruling class to use the country as a means of dominating society, and the country is ruled by a group of elites as the capitalist class. The official of the country has also enjoyed the same interests with the owners of the capital and links both by the bundle between politics and people. Lenin believes that: \"The country is a class oppressed another class's violent machine, which is a class-controlled machine by a class control.\"\n\nIn contrast, some other Marxist theorists focus on the \"Who Control Country\". Nicos Poulantzas believes that the capitalist country is not always in accordance with the benefit of the ruling class, even if this happens, it is not to do so even in this situation. But because the country's \"structural\" position arrangement ensures that the long-term benefits of capital can always dominate this society. Praranus's main contribution to Marxist work is the concept of \"national autonomy\", the concept of autonomy, clarifies and specifically indicated Marxism to the country's concept. His theory is later called structural functionism.\n\nThe New Marxist Theory has influential in Europe and the 1970s in Europe, while multiperness is influential in the United States. Multi-arametrist Robert A. Dahl believes that the country is neither a competition for interest, nor is the representative agency of certain interest groups. Power is competing in social architecture, and national policies are the results made by periodic negotiations. Although multi-diversity recognizes unequal existence, they claim that all Groups have the opportunity to apply to the country. Multiculturalism believes that the behavior of the country is produced by the pressure of multi-political and various interest groups.\n\nMarxism and multi-diversity believe that the country is caused by groups of groups in society, such as a class or a stakeholder. Therefore, some scholars criticize the two \"Society\" to understand the country, these scholars emphasize the country's autonomy, but also pay attention to the power of society.\n\n\"New Institutionalism\" The behavior of people is the basic model of institutions, claiming that the country is not a \"tool\" or \"arena\", nor will it \"operation\" according to the interests of a class. Scholars who accept this theory emphasize the intervention between civil society in the economy and the country to explain the changes in national forms.\n\nThe new institutionalism in theory of the country, advocates that the country is autonomous. In other words, the state's official personnel have their own interests, and they will also independently (also conflict with it) pursue the role of players in society. Since the state controls forced tools, and the groups in many civil society must rely on the country, national official staff will also apply their own preferences to civil society in their extent.\n\nThe new institutionalists claim to support Max Weber's theory, usually distinguish the so-called \"strong countries\" and \"vulnerable countries\", advocate the \"relative autonomy\" of the country from social application stress to determine the power size of the country - this The theory is also some supporters in the field of international political economy.\n\nDue to the development of national development, all partial civil society has increasing roles that have exposed national institutions and development public policies, and the country's boundaries are increasingly difficult to distinguish. The country's boundaries are always changing, for example, such as privatization, nationalization, and foundation of the new regulatory mechanism. The essence of semi-autonomous organizations is often vague, in which they have also argued that they have argued that there is a debate between politicalologists.\n\nIn Jurgen Habermas discusses the concept of public domain, he defines civil society as public interests outside the national system. Compared with the early Western philosophers, such as Thomas Hobbes and Hegel, stressed the status of the country transcended society.\n\nSome Marxist theorists, such as Antonio Grani, which is all doubts about the distinction between national and civil society. He advocates that the country is combined by some parts of many societies. Louis Pierre Alo Squi claims that the organization of civil society is like churches, schools, and even trade unions are part of the national institution. Therefore, there are many groups in a country in society. These groups are in principle, but they still need to rely on national support.\n\nInternational relations theorists often assume that there is an international system in the world, and the country conducts their own strategies, and the actions that may be taken in other countries. From this point of view, countries involved in international systems will face two difficulties in external and internal security and legitimacy. Recently, the term \"International Community\" has been used to call countries that have established international rules, routines, and systems, which lead to them between them. The foundation of international law, diplomacy, official regime, and tissue is also derived from here.\n\nIn the late 20th century, the phenomenon of globalization has also triggered the controversy about whether the country can maintain the freedom of action. Globalization limits the freedom of action in certain areas, especially in Western Europe, and the most prominent example is the integration of the EU.\n\nThe legal standards in the state are unclear. Usually the law in this area is around the political situation. However, the Montevo Convention signed in 1933 often quoted, the first provision of this convention statement:\n\nNational entities in international law should have to have the following conditions: "}