{"chinese_title": "Mechanical engineering ", "chinese": "Mechanical Engineering (English: Mechanical Engineering) is an engineering subject involving the use of physical law as mechanical systems for analysis, design, production and maintenance.\n\nMechanical Engineering is the most widely scope in many engineering disciplines. Any modern industry and engineering areas need to be applied to machinery, such as agriculture, forestry, mining, etc. need agricultural machinery, forestry machinery, mining machinery; metallurgical engineering and chemical engineering require metallurgical machinery, chemical machinery; textile and food processing industries need textile machinery, Food processing machinery; water conservancy, civil buildings, roads and bridges require construction machinery; electric power projects need electric power machinery; transportation industry requires various vehicles, ships, aircraft, etc .; various commodities, packaging, storage, and unloading requires various corresponding Working machine.\n\nThe development of various engineering areas require the development of mechanical engineering to adapt to the mechanical engineering to provide mechanical engineering. Some mechanical invention and improvement lead to the emergence and development of new engineering techniques and new industries, such as the successful manufacture of large machinery, which has promoted the establishment of power systems; the invention has led to the rise of railway projects and railway undertakings Invention and progress of internal combustion engines, gas turbines, rocket engines, and ships, the development of ships, aircraft and aircraft leads to the rise of nautical engineering, navigation, aviation engineering and aviation cause; high voltage equipment (including compressors, reactors, sealing technologies, etc. The development has led to success of many new synthetic chemical engineering. The mechanical engineering is to achieve development momentum under the pressure of continuously improved demand, while also improving and innovating from various disciplines and technologies.\n\nHuman beings become a \"modern person\" sign is a manufacturing tool. The small stone ax, stone hammer, wood bow and wood, and the simple rough tool of the leather, the simple rough tool of the leather is the pioneer of the machine. From the manufacturing simple tool to the manufacture of modern machinery, the manufacturing is made up of a long process.\n\nThousands of years ago, human beings have created, for example, with cereals shells and smashing, with oranges and hobs used to raise water, with wheels, sailing in the river, their paddle, 橹, rudder Wait. The power used, from the person's own physical strength, develops to the use of animal strength, wind and hydraulic. The materials used have developed from natural stone, soil, wood, leather to artificial materials. The earliest artificial material is ceramic. Ceramics for manufacturing ceramic vessels have been a complete machine with three parts of power, drive and work.\n\nHumans enter the copper era from the stone era, and then in the Iron Age, the development of the blowers of the blowing furnace will play an important role in the development of blowers. There is a strong strong blower to enable the metallurgical furnace to get enough furnace temperature to refine metal from ore. In China 1000 BC, there has been a blower for casting in 900 years, and gradually evolved from human blowing to animal strength and hydraulic blow.\n\nAs early as BC, China has applied complex gear systems in the guide car, and applied a 10-handed cross-rigor in the incense burner. The ancient Greece has a cylindrical gear, a conical gear and a worm drive. However, the relationship between gear transmission transient speed and tooth shape, the choice of toothed curve until the 17th century has a theoretical statement. Hand-shaking and pedal agencies are the pioneer of crank links, with a long history in all civilizations, but the form, exercise and power of the crank link mechanism is the achievement of modern mechanics.\n\nMechanics as a course in the early 19th century in the 19th century, in the first time, the first time in the first time in the University of Technology (Paris Engineering College). [Source Request] Through theoretical research, people can accurately analyze various machinery, including complex spatial linkage mechanisms, and can further integrate new institutions as needed.\n\nBefore the 15-16th century, the development of mechanical engineering was slow. But in the practice of Millennium, it has accumulated considerable experience and technical knowledge in mechanical development, and has become an important potential for the development of mechanical engineering. After the 17th century, capitalism appeared in English, law and Western Europe, and commodity production began to become the center of society. Many high talents of mechanical traits and intellectuals with production concepts are committed to improving the work machinery and new power machinery required for various industries - steam engines. In the late 18th century, the application of steam engine was promoted from the mining industry to the textile, flour, metallurgy and other industries. The main materials for making machinery are gradually modified from wood, but it is difficult to use manually processed metal. The mechanical manufacturing industry began to form and became an important industry in decades. The mechanical engineering has gradually developed into atrically guided, systematic and independent engineering techniques that have become atrioretical, systematic and independent engineering techniques. The mechanical engineering is the main technical factors that contribute to the 18-19th century industrial revolution and the large number of capitalist machinery production.\n\nPower is an important factor in developing production. In the late 17th century, with the improvement and development of various machinery, with the increase in the need for coal and metal ore, people feel that the production of human and animal is not able to increase production to a new stage. In British, textile, grinding and other industries are increasingly located on the river, using water wheel to drive work machine. However, there is a certain scale of coal mines, tin mines, aluminum mines, iron mines, copper mines, silver deposits, and gold mines, still can only be upgraded and excluded with a large amount of animal.\n\nUnder such production needs, the air steam engine of Thomas Newcomen will drive the mine drain pump in the early 18th century. However, the fuel consumption rate of this steam engine is very high, basically applied to coal mines.\n\nIn 1765, British Watt invented the steam machine with separate condenser and reduced the fuel consumption rate. In 1781, Waart created a steam engine that provides rotation power, expanded the application range of steam engines. The invention and development of steam engines make mineral and industrial production, railways and shipping are mechanically dynamic.\n\nThe steam machine is almost the only power source in the 19th century. However, the steam engine and its boiler, condenser, cooling water system are large, cumbersome, and it is very inconvenient. At the end of the 19th century, the power supply system and the motor began development and promotion. At the beginning of the 20th century, the motor has replaced the steam engine in industrial production, which has become the basic driving force for driving various work machines. Mechanization of production has been inseparable from electrification, while electrification is mechanized to play a role.\n\nThe steam engine is applied as the original motion station. At the beginning of the 20th century, there was a high-efficiency, high speed, high-power steam turbine, and a large and small power of various hydraulic resources were also emerged, and the vigorous development of the power supply system was promoted.\n\nThe internal combustion engine invented in the late 19th century has been improved year by year, which is small, high efficiency, easy to manipulate, and can start at any time. It is first used to drive on land work machines without power supply, and later used in vehicles, mobile machinery (such as: tractors), aircraft and ships, and started for railway vehicles in the mid-20th century. The steam engine is no longer an important power machine under the crust of steam turbines and internal combustion engines. Internal combustion engines and later invented gas turbine engine, development of jet engines, or one of the basic technical factors such as ships, aircraft, spacecrafts.\n\nBefore the industrial revolution, most of the machinery is wood structure, and is made by woodworking. Metal (mainly copper, iron) is only used to make small parts on the instrument, lock, clock, pump and wood structure. Metal processing mainly relying on the mechanism of the mechanic to achieve the required accuracy. The promotion of steam engine power devices, and the development of large-scale machinery such as mines, metallurgical, vehicles, ships, aircraft, more and more metal parts, which require forming processing and cutting and machining, more and more, and the accuracy of the requirements The higher. The metal material applied from copper, the iron is developed to steel. Machinery includes fitter, drilling machine, lathe, milling machine, grinding machine, sawing machine, punch, planer, mold, casting, forging, sheet metal, welding and heat treatment, etc., and cutting technology, tools, measuring, etc., rapid development, It is guaranteed the supply of mechanical equipment required for various industries.\n\nThe development of social economy has soared on mechanical products. The increase in mass production and the progress of precision machining technology have promoted a large number of production methods (parts interchangeability, professional division of labor and collaboration, flow water processing lines and water distribution lines, etc.).\n\nSimple interchange parts and professional division of labor work have emerged in ancient times. In mechanical engineering, interchangeability reflects the bolts and nuts produced by Henry Mozley in 1797 using their created threaded lathes. At the same time, American engineers were produced with interchangeability production methods, showing the feasibility and superiority of interchangeability. This production method is gradually promoted in the United States, forming a so-called \"American production method\".\n\nBefore the 18th century, the mechanical production of the mechanical trammunications was made by experience, intuition and craftsmanship, and there was little contact with science. By the 18th-19th century, under the promotion of emerging capitalist economies, people who master scientific knowledge began to pay attention to production, and the tramptoms of direct production were started to learn scientific and cultural knowledge. The exchanges between them have achieved great results. During this process, a complete set of basic theories surrounding the mechanical engineering.\n\nThe power machine is first combined with the advanced science at the time. The inventors of the steam engine T. Saverry, Watt applies physicist D. Papan and J. Black 's theory. On the basis of steam engine practice, physicist S. Kano, W.j.m. Lanjin and Kelvin established a new science-thermodynamics. The most important theoretical foundation of the internal combustion engine is France's AeBDe Rosha found in 1862, Nikolaus August Otto applied Luosha's theory, thoroughly improved his roarness, noise, large noise, Thermally efficient internal combustion engine has laid the position of the internal combustion engine. Other, such as: steam turbines, gas turbines, and turbines, etc., are developed under theoretical guidance, and theory is also improved and improved in practice.\n\nPrior to the industrial revolution, most projects were limited to military and urban development. Engineers engaged in military, responsible for the development of war tools and systems; engineers engaged in urban development are responsible for architecture and ground facilities. In the early 19th century, the mechanical engineer became an emerging industry, which is responsible for providing the driving force required for industrial machinery and driving machinery. In 1818, the first professional civil engineer organized its establishment, while mechanical engineers were also organized in 1847.\n\nAt the beginning of the 20th century, Ford, h. In the automotive manufacturing, it created a pipeline wiring. A large number of production technologies plus Taylor, F.W. The scientific management method founded in the 19th century, making the production efficiency of vehicles and other large production mechanical products quickly reached the height of the past could not imagine.\n\nIn the middle of the 20th century, the main feature of machining is: continuously improve the machining speed and accuracy of the machine tool, reducing the dependence on hand technique; develop less long-cut processing technology; improving the mechanization and automation of forming processing, cutting and assembly. Automated automation from mechanical control development to automation of electrical control and fully automation of computer program control, until unmanned workshop and unmanned factory; use numerical control machine tools, processing centers, group technologies, development of flexible processing systems, make medium and small batch, more The production efficiency of variety production is raised to a level near a large number of production; research and improve the formation and cutting technology of new metal and non-metallic materials.\n\nThe earliest mechanical engineering group in the world is the British Mechanical Engineer Imeche. Founded in 1847, the first chairman is George Stephen, a railway locomotive. [1] The establishment of the British Mechanical Engineer Society marks that mechanical engineering has established an independent discipline, and the mechanical engineer is recognized as a respected title by society.\n\nPrior to this, people engaged in mechanical manufacturing, use and repair, known as the machines, and the social status is not high.\n\nAs the mechanical manufacturing is growing as an independent industrial sector, the mechanical engineer students have established, which largely reflects the initial stage of the machinery industry, and the business owners and technical staff are free to carry out academic exchanges, safeguard common interests, and strive for improvement. The common wishes of social status.\n\nAt the same time of the West, Mechanical Engineer Society and Mechanical Engineering, it has played an important role in promoting discipline development and improving the social status of mechanical engineers. The British Mechanical Engineer Society has the right to assess engineers according to national laws and awarded the title of a franchisee.\n\nThe German Engineer Society (VDI) was established in 1856, and the main activities range are mechanical engineering. It is in a leading position in the development of guided technical documents. The US Mechanical Engineer Society (ASME) was established in 1880. It undertakes the formulation of US machinery industry standards. The Japanese Mechanical Engineer Society (JSME) was established in 1897. Indian Mechanical Engineer Society was established in 1920. China (Huimin) National Mechanical Engineering Society was established in 1936.\n\nThe main activities of various mechanical engineers Society are substantially the same, such as organize academic seminars, coordinate scientific research tasks, popularize scientific and technical knowledge. At the same time, the students of the countries have developed their respective advantages according to their respective social and historical background, so that all the mechanical engineers' students have different characteristics.\n\nIn terms of organizational construction, the Mechanical Engineering Society has been explored, on the one hand, establishing a professional branch or a professional committee, conducting professional academic activities, and establishing regional branches, organizing regional academic activities. This organizational structure has gradually developed into common characteristics and traditions of various mechanical engineering society. As mechanization extends to all industrial sectors, the field is constantly expanding, and the mechanical engineering students of various countries are many historical, largest, largest members, the most widely accepted academic groups.\n\nIn the 20th century, especially since the Second World War, various mechanical engineering academic groups have a large-scale development. International academic exchanges are also increasingly frequent. Some professional branches of mechanical engineering have established a world-oriented academic group, such as: International Welding Society (IIW), International Foundry Society (Ciatf), International Material Heat Treatment Federation (IFHT), International Machine Theory and Institutional Association (IFTOMM), International Pressure Vessel Council (ICPV), International Nondestructive Test Council (ICNDT), International Tribology Council (ITC), International Production Engineering Research Association (CIRP), etc.\n\nWith the various branches of mechanical engineering and adjacent professional disciplines, a group of international engineering groups, such as the 1950 International Association Union (UITA), 1958 World Engineering Commonwealth WFEO, etc., participated in engineering organizations in nearly 100 countries and has obtained the support of UNESCO. In these international engineering organizations, mechanical engineering disciplines and academic groups are often a backbone.\n\nMechanical engineering is the nature of material, application mechanics, material mechanics, thermodynamics, fluid mechanics, structural mechanics, destruction mechanics, elastic mechanics, plastic force, motor electronics and calculations, design and manufacture various types of mechanical products and systems, such as: Engine, machine, instrument, consumer goods and Machinery, hydraulic, thermal or heat transmission system. With the current chance of technology; computer-aided mapping and computer-aided manufacturing technology have been widely used. In general, mechanical engineers will focus on a certain aspect, such as hydraulic, heat transfer, heat machine, motor, electromechanical integration, control system, machinery manufacturing, air conditioning, refrigeration, lifts and elevators, or certain types of products Such as: machine, propulsion system, mechanic and maneuvers.\n\nThe working object of mechanical engineering is a dynamic machinery, which means that its work will have changed. This change is sometimes randomly and not foreseeable; the material of the actual application is not completely uniform, there may be various defects; the processing accuracy has a certain deviation. Compared with civil engineering with static structures for work objects, various problems in mechanical engineering are more difficult to use theoretical exact solution. Therefore, early mechanical engineering only uses simple theoretical concepts, combining practical experience. Design calculations rely more empirical formulas; in order to ensure safety, they are contrasting. As a result, the machine is cumbersome and large, high cost, low productivity, and energy consumption.\n\nSince the 18th century, design calculations have continuously improved accuracy from two aspects: in terms of material strength, from early static strength divided by the safety factor (considering all the intra-accuracy and dispersible factors), improvement To consider the fatigue of materials (the second half of the 19th century); from the unlimited fatigue life of the material, it is changed to a limited life design according to the actual service life (the first half of the 20th century); from the consideration of the material, there is no crack, It is based on the basis of breaking mechanics, considering the strength and life of crack materials. In terms of structural mechanics analysis, various force and torques are determined from application experience formulas and simplified mechanical analysis to develop complicated mechanical analysis and mathematical calculation methods.\n\nIn the 20th century, various experimental stress analysis methods occurred. It has been able to measure the stress of the model and the actual parts in the experimental method, and the necessary adjustments may be made when the stress is too low. After the second half of the 20th century, people began to apply the rapid and reliable numerical calculation of finite element methods and electronic computers, for complex mechanical and components, components, torque, strength, stress, strain, etc. For mechanical or elements that have sufficient practice or experimental data, statistical techniques can be used to scientifically, according to the requirements of reliability, or according to the actual situation of machinery (actual quality, actual use conditions, etc.) Judging its reliability and life. However, in many mechanical engineering work, some empirical methods, empirical formulas and empirical coefficients, but the scientific components are increasing, and the empirical ingredients are constantly decreasing.\n\nIn the 19th century, the total knowledge of mechanical engineering is also very limited. In the European university college, it is usually compliant with water conservancy projects, civil engineering and construction projects as a discipline, known as civil engineering, the second half of the 19th century I have gradually become an independent discipline.\n\nIn the 20th century, with the development of mechanical engineering technology, the growth of the knowledge of knowledge, the mechanical engineering began to decompose, and specialized branch disciplines have emerged. This trend of decomposition has reached the highest peak during the mid-20th century, that is, during the front and rear period of the Second World War. Due to the total knowledge of mechanical engineering has expanded to far from all, certain specialization is essential.\n\nHowever, excessive specialization has caused excessive segmentation, vision stenosis, and unordered the whole structure and overall scale of engineering, and reduces the scope of technology exchange, hindering the emergence of new technologies and the overall advancement of technology, changes to external conditions (The emergence of new technologies, new materials and new products, new environmental protection regulations, raw materials and energy supply and price changes, and personal work mobilization, job improvement, etc.)\n\nClosed professional experts have experienced knowledge, considering problems, and cooperate with coordination in collaborative work, it is not conducive to continuing self-study. Therefore, since the 20th century, a comprehensive trend has occurred. People pay more attention to basic theory, broaden their professional fields, combined and differentiated throughout.\n\nComprehensive → Professional Differentiation → Reproduction Recycling Recycling is a reasonable and necessary process for knowledge development. However, comprehensive recovery cannot be a simple merge of existing professional, but a comprehensive level of higher levels, the purpose is to better play professional knowledge. Experts from different professionals have exquisite expertise, and have sufficient comprehensive knowledge to understand, understand the problems of other disciplines and the overall appearance of the project, to form a strong collective that works with each other. It is the main topic of cultivating mechanical engineering talents in the new technical revolutionary era.\n\nComprehensive and professional is multi-level. There is a comprehensive and professional contradiction in the mechanical engineering; comprehensive and professional issues are also equally comprehensively engineered. In all knowledge of humans, including social science, natural science and engineering technology, there is also a higher level, more macro-integrated and professional issues.\n\nIn the United States, mechanical engineering courses are regulated by ABET to ensure that graduates have the minimum cognition of relevant projects. So although the content of the courses provided by each institution is different, the general mechanical engineering course includes at least the following basic subjects [2] [3]:\n\nThe service sector of mechanical engineering has broadly and more, where mechanical, tools, so that energy and material production are used, and there is no need for mechanical engineering services. Summary, modern machinery projects have five services.\n\nRegardless of which field serving, the work content of the mechanical engineering is basically the same, and according to its working properties can be divided into six aspects.\n\nSince most of the mechanical engineering areas, most scientists and scholars choose one of the branches in the field of masterpiece, and conduct a highly basic theoretical research or extensive application scientific research.\n\nProfessional engineers must have logical thinking, systematically study and analyze problems. Due to the work of mechanical engineering often emphasize overall cooperation, engineers must be good at getting along with people, and clearly explain the arrangement of production procedures. In order to cooperate with the rapid development of technology, engineers must continue to repair, pay attention to the development of new technology such as computer-assisted mapping computer-assisted manufacturing. Common title is:\n\nSince the technician must clearly master the idea of ​​engineers and put it into practice, he must have the technical knowledge required. In addition, he must have good judgment and organizational skills. Technicians who are supervised and must have to stimulate their work and clearly express their guidelines. He should also continue to repair the latest technology knowledge.\n\nThe mechanic must be pragmatic and loved to make items with hands and tools. In addition to the basic theoretical knowledge, he also has the practical technology required for its work.\n\nWith the increasingly prosperity of the economy, manufacturing and service industry demand has received a large number of mechanical engineers and technicians that have been specially trained. Although new technology leads to automation of production procedures and computerization, most of the procedures related to industrial operations and instruments are still based on mechanical principles. In view of the development of various industries, it is believed that the demand for mechanical technicians at all levels will continue to grow.\n\nMechanical engineering can be seen as a collection of all machinery. The following is a major course with a short intergeneration and common application description. Some of them are characteristic of mechanical engineering. Mechanical engineers are mostly used by methods and techniques learned from these and other more professional courses. Among them, the application mechanics (static and dynamics), material mechanics and fluid mechanics are three major protagonists. More professional courses are in the research institute.\n\nThe solid power is intended to explore the balance, movement and rotational movement, vibration, stress, strain, friction, plastic flow and damage, etc., respectively, corresponding courses, such as: Static Studies , Dynamics, material mechanics, elastic mechanics, plastic force, damage mechanics, damage mechanics, fracture, contact mechanics, lubrication theory, corrosion, etc. The analysis of solid strength is also the basic consideration of any design. Designing machinery must be the balance consideration of solid strength, sequential to vibration, intensity, etc., sometimes careful considerations, such as fatigue, impact, high temperature Variable strength, etc. Then, if the fluid machine is calculated, then its energy source is added to the heat machine, and the thermodynamic calculation is added to improve the efficiency. If the electric energy is calculated by the motor, then the design of the control system is completed. Work, then it is mechanical manufacturing, industrial engineering, commercial management, business economics, etc. It can be seen from this sequence to the top of the top rushing mechanical engineering. Related Discipline:\n\nFluid mechanics is to discuss various properties of fluids and various flow fields, pressure, buoyancy, resistance, lift, speed, acceleration, energy, fluctuations, etc., and widely used in water conservancy, civil buildings, aviation, navigation, hydraulic, air pressure, Chemical procedures and other projects. The study of how the fluid reacts. Fluid mechanics can be further divided into fluid static and fluid dynamics, and it is a branch under the linkage. Related Discipline:\n\nDesigning is a comprehensive application of a comprehensive application, it is necessary to calculate solid mechanics, thermodynamics and fluid mechanics, and must select appropriate materials. Design control systems must be designed for manufacturing convenience and economy. It is necessary to know the market status and Demand psychology, it is also necessary to use all possible use safety and more user-friendly, the mission is significant, because it is a sense of realistic intermediate role. This is the main reason for the compulsory course, and a \"person\" usually cannot be proficient in these, so it has highlighted the importance of scientific and technological integration. Related Discipline:\n\nThe manufacturing class is a comprehensive subject, which requires solid mechanics (application mechanics (static, dynamics), material mechanics), thermodynamics, fluid mechanics, thermogravure, electrical, magnetology, chemistry, etc., is achieved as finished products. This manufacturing process must meet the requirements or strength of the finished product that can be produced, manufactured by the finished product, and can be systematically, automated production. In addition, manufacturing and experiments are the most useful use of measurement techniques and free to say. The procedure of manufacturing is substantially material surface treatment, heat treatment, mold, casting, forging, welding, powder metallurgy, cutting principle, normal temperature plastic processing, high temperature plastic processing and automation manufacturing system. Related Discipline:\n\nThe thermal courses are to discuss the spread of heat and energy, utilization and the influence of his cultural system (physical system or chemistry). Related Discipline:\n\nIntegrated mechanical engineering and motor engineering power, electronics and circuits reach so-called electromechanical integration, such as electromechanical integration devices for motor design. Further automation is achieved through the auxiliary assistance of the control theory and program design. Related Discipline:\n\nThe microelectromechanical system is a micron-sized mechanical system, including a system of three-dimensional plate printing of different shapes. These systems are generally between microns to millimeters. Daily physics experience in this size is often not applicable. For example, because the area of ​​the microcomputer system is much larger than the mechanical system than the normal daily life, its surface phenomenon such as static electricity, moisturizing, etc., such as: inertia or heat capacity, etc. They are generally manufactured by techniques similar to the production of semiconductors such as surface micro-processes, body micro-machined techniques. These include modified silicon machining methods such as calendering, electroplating, wet etching, dry etching, electric spark processing, and the like.\n\nThe size of the company producing a microelectromechanical system is different. Big companies focus on producing a large amount of cheap system for vehicles, biomedica or electronics industries. Successful small companies focus on production innovation technology. All of these companies are committed to research and development. With the development of the microelectromechanical system, the complexity and efficiency of the microelectromechanical system are constantly increasing.\n\nNami Technology is an emerging application science, and its purpose is to study the design method, composition, characteristics, and application of matter and equipment when studying in Nai meters. Nimm Technology is many of the technical secondary classifications such as biological, physics, chemistry, and the United States's national Nim Technology launch plan will be defined as \"1 nanometers to 100 nano size, especially existing technology in Nimei. Extension during scale. Nami Technology's world is atomic, molecular, polymer, quantum dots, and polymer collection, and is controlled by the surface effect, such as Van Defarks, hydrogen bond, charge, ion bond, covalent bond, hydrophobicity, The inertial and inertial effects such as inertia and inertia and turbulence are smaller can be ignored. For example, when the scale of the surface area has increased dramatically, it has opened a scientific and new possibility such as a surface-oriented.\n\nThe continuous exploration of tinity is to make new tools, such as: atomic force microscope and scanning tunnel microscope. Combining an accurate procedure such as electron beam gradient, these devices will allow us to function precisely and generate a nano structure. Nano material, whether it is made from top to bottom (blocking the block to the nanometer scale, the main method is to get as small as possible by cutting, etching, grinding, etc. (such as super-precision processing, difficulty) from the block The tiny structure must be precise). Or is made from bottom to top (a large structure, the main method is chemically synthesized, self-assembly, and fixed-point assembly. The difficulty is that the macro is to achieve efficient and stable The quality is not just a further tiny. The energy quantization of electrons in the object has also begun to have an effect on the properties of the material, referred to as quantum scale effects, describing the physical properties of electrons within the material in the scale. This effect Not because the scale is generated by the giant gain, it is really important in the nanometers. When the substance is in the nanometer scale, it will have a big difference in giants, for example: opaque The substance will become transparent (copper), the inert substance becomes a catalyst (platinum), stable substance becomes flammable (aluminum), the solid becomes liquid (gold) at room temperature, the insulator becomes a conductor ( ).\n\nNami Technology's magic comes from its quantum and surface phenomenon in the nanometer scale, and therefore there may be many important applications and many interesting materials.\n\nIn terms of energy, in recent improvement of nuclear fission power devices, develop solar energy, geothermal, tidal energy, sea water, etc., can reduce dependence on fossil energy of non-regenerative fossils. From a long-term point of view, nuclear fusion is very promising and almost endless future energy. Based on the current and future achievements of nuclear physics, mechanical engineering and other engineering technologies, the development and promotion of nuclear polyvert force devices in the 21st century may completely solve the world's energy problems. Use this new energy to eliminate carbon dioxide pollution to the atmosphere.\n\nThe amount of metal mineral in the middle and sea water is extremely rich. As long as the process of mining and mineralization and mineralization, the performance of the mining, the properties of the mineral machinery can reduce the ore grade energy-utilized, and the metal waste can be fully recycled. Under the conditions of sufficient energy supply, the metal material resources are not scarce.\n\nAfter the coal, oil, gas, etc. is no longer used in a large amount of fuel as a fuel, and the supply of non-metallic materials can also be reached long-term guarantees.\n\nEnvironmental pollution sources such as chemical engineering, metallurgical engineering and other production processes, improve process, increase purification machinery and facilities, and improve their purification efficiency, in technology can be eliminated.\n\nMechanical engineering has always increased production, improve labor productivity, and improve production Economic, which is to develop new mechanical products with the goal of improving the recent interests of humans. In the future, the development of new products will reduce resource consumption, development of clean renewable energy, governance, and deepening environmental pollution as a target task of ultra-economic.\n\nMechanical engineering is traditional engineering technology. Machinery can accomplish the person with both hands and binocular and the double-foot bulls directly and cannot be completed directly, and complete faster, better. Modern mechanical engineering creates more and more intricate and increasingly complex machinery, making many fantasies in the past become reality. Human now has been able to go upstream sky and universe, dive the ocean deep, oscillogenous, neighboring cells and molecules. Emerging electronic computer hardware, software science has enabled human beings to strengthen and partially replace the human brain technology means, which is artificial intelligence. This new development has shown a huge impact, and it will continue to create miracles that people can't imagine in the future.\n\nThe growth of human wisdom does not reduce the role of both hands, but the opposite is required to have more, more delicate and more complex work, thereby promoting the functionality of the hand. The practice of hand is in turn promotes the wisdom of the human brain. During the entire evolution of humans, and during the growth of each person, brain and hands are evolving to each other. The relationship between artificial intelligence and mechanical engineering is approximately the relationship between brain and hands. Its difference is only that manually intelligent hardware needs to be manufactured using mechanical manufacturing. In the past, various mechanical deposits were unable to open, and their reaction rate and operational accuracy were subject to a very slow human brain and nervous system. Artificial intelligence eliminates this limit. Mechanical engineering can make full use of this new huge possibility. Mutual promotion between computer science and mechanical engineering, parallel advancement will enable mechanical engineering to start a new round of great development at a higher level. "}