{"chinese_title": "photography ", "chinese": "Photography (English: photography) refers to the process of using some special equipment for image records. Generally, we use a mechanical camera or a digital camera for static picture photography, and static photography will also be called photograph. The camera (camera amplifier) ​​can be photographed, such as television, movies. Currently, some of the digital cameras, digital cameras, and features static photography and dynamic photography.\n\nIn photography, a camera or a photocolisser is usually used as a photocilule or a digital memory card as a recording medium. However, there are also exceptions, such as the Men Lei, the active projection method (RAYOGRAPHS) is imaging with shadow on the photo paper without the need to use the camera.\n\nMulti-camera is a lens consisting of a series of lenses, and refracts light after refracting the light after the film or the CCD optical sensing medium, the film itself is also a storage medium, and the signal is stored in a chemical change. The CCD will be stored in digital memory card after converting light into the electronic signal. The stored signal can be restarted to the optical signal through some ways, and then view it with a photo or display. In addition to the lens composed of lens, a few lens is composed of a mirror or a mirror with a lens.\n\nThe front of the camera is a dark box [Note 1] (Camera Obscura) [1] [2], also known as the cassette. The original dark box, just use a hole in a wall of a dark house to project the outside of the scene to the plane. In fact, the literal meaning of Camera Obscura is \"Dark House\" [1] [3]. It is said that the nomads in the ancient Middle East pay attention to this phenomenon: when they are during the day, they hide in the tun, occasionally see the inverted image of the tent, and these images are from the rear of the tent [3].\n\nAncient scholars, such as Mozi, also noticed that the light passed through the small hole [2] [3]. Aristotle refers to the concept of a dark box in his works \"Problemata\" [3]. Haishu uses pinhole units to observe the eclipse [3]. These pinhole devices, the working principle, and tools we are now called pinhole cameras, are exactly the same.\n\nIt is worth mentioning that although the concept of \"dark box\" has appeared in BC, it is about 1604, the word Camera Obscura appears. Mathematician Cople is the first person using this word [3].\n\nIn the 15th century, artists began to use a mount to draw a auxiliary tool. Brunettiki uses the principle of small hole imaging [3], and creates a perspective painting method. With the advancement of technology, some people in the 16th century came up with the convex lens for the dark box [2] [3], making the image more clear and bright. It is worth mentioning that most of these darkboxes are tools that cannot be moved casually.\n\nDa Vinci left a sketch of the blackbox in the \"Atlantic Manuscript\" [3] [1] [3]. Thereafter, it can carry it with you, and install a lens, the lens is installed [2], such a dark box has a focus mechanism, with a mirror, a frosted glass on the mirror can be pair of focus screen, and translucent paper Drawing on glass [2]. In order to make the image clearer, some people want to install a diaphragm-like aperture [2] in the dark box [2].\n\nThe dark box has been developed to the 18th century, and it has been very complete. It has emerged, and has become a good companion of amateur painters and the mason giant on the road. By the early 19th century, the photography pioneer in the British and Japan and other countries began to experiment with a dark box, and a series of photos [2] [3]. However, because the image is not fixed (fixed), the photo is illuminated by light, the image disappears [2], I believe that there is no physical vision. The earliest camera, its appearance and the dark box used by the home is very similar [2]. In fact, there are many photographic pioneers are painters.\n\nThe earliest photo was taken by French Nipps [Note 2] in 1826 [Note 3] [1] [2] [3]. Neps will coated Jewish asphalt (English: Bitumen of Judea) [2] in white [1] [3] version, exposed 8 hours to get this image [1]. He said this technology is a sunlight etching method (English: helikeraphy) [Note 4], but he did not experience this technology [2]. His partner [2] French painter Dair continued to study, invented Darier Photography [1] [2] [3], also known as the silver version of the photography method, bought patent by the French government in 1839 [ 1] [2], and on August 19, the same year [2] announced the birth of photography.\n\nThe advantage of the silver version of the photographic method is the realistic picture, and it is just like [1] [2]. The disadvantage is to watch from different angles, and the photo will become a negative image [1]. Further, since the image is formed on a thin layer of silver, it is easy to damage, and it may also be damaged with a finger. [2]. Later, French physicists thought of gilding for photos, and in the 1840 invention \"gold-plated law\" protection measures, the method is to add chloride to aqueous solution of sodium thiosulfate, then sprinkle on the photo, then use Alcohol lamps are heated to form a gold guard [2]. A photographer wants to get a more direct way, seal the photo in the glass frame [2] [4]. Also, because mercury steam developing [1] [2] [3], it is possible to cause mercury to poison. Other disadvantages include the picture to be left to reverse [1] [2] [3], copy the photos difficult, and shooting costs [2].\n\nHowever, since the technology has been disclosed [1] [2] [3], the silver version of the photographic method is widely circulated around the world, and it has become a mainstream photographing method, until the 1850s, the wet padded photographic method (English) : Collodion process and other new methods are replaced.\n\nAs another important founder, British Tarbot (William Henry Fox Talbot) [Note 5] [1] [2] [3] Carriga was published in 1841 [2] [3]. It is reported that Tarbo is in 1835 [1] [2] [3], with the high-level writing paper with photosensitive materials [2] [3], the first negative photo of the world \"[1] [2] [3 ], That is, the so-called negative piece. By contacting type printed (English: contact print) [1] [2] [3], a positive image photo can be obtained, thereby creating a negatively turningant photographing process [2] [3].\n\nCarriga's shooting cost is lower [2], but also printed the same photo [1] [2] [3]. However, due to the use of paper as a negative film, the image is also relatively fuzzy [1] [2]. The invention of Tarbot is not caused by too much attention relative to the big success of Da Gal. [2] [3]. However, as the first photographic process, Tarbot is still as one of the starters of photography.\n\nTarbot's \"The Pencil of Nature\" was published between 1844 and 1866, which was regarded as the first book in history as a book as an illustration [1]. However, opponents refers to the \"British Algae Photo: Photographs of British Algae: Cyanotype Impressions\" is [3].\n\nOther people who make important contributions to photography include John Herchur Jazz, who created photography [3], and found sodium thiosulfate can be dissolved in water [2] [3], solve Fixed this problem [2]. Other important contributions include Blue Method (English: cyanotype) This classical photography process [3], which became the predecessor of industrial blueprints.\n\nOutth, Tom Mas Weiwood (English: Thomas Wedgwood (photographer), starting to study the reaction of silver nitrate on the rays in the 19790, and try to take a photo with a dark box, but in failure [2]. Weiwood put the leaves on white leather coated with silver nitrate, and the result of unstead of leather became black [2]. Weiwood put some objects on the treated paper, \"copy\" out of these objects, but cannot fix images, time long, the image disappears [2]. It is generally believed that the photos of Weiwood are not saved.\n\nBut in recent years, some scholars have referred to, one of which is considered to be Tarbot works, which may be Wood of Woodwood. If it is true, the photo will be the oldest photo in the world, with more than 200 years of history. [5]\n\nEarly silver version of the photographic method, the exposure time of the photo is long [1] [2], it takes more than ten minutes, it is difficult to capture the portraits and objects. At this stage, the most common photographic theme is landscape and still life, while the most commercial potential is portrait [2].\n\nIn 1841 [1] [2], French photographer Claude (English: Antoine Claudet) was processed with iodine chloride, and the exposure time was successfully shortened to in seconds [2]. Claude to the United Kingdom, bought the silver version of the photography method in the UK's patent, opened a studio in London, England, is a very successful photographer, gaining a lot of honor, but a fire made his portrait works into Wu Have [2 ], Only a small amount of post-world. He left the world is a patented invention, which is a red safety lamp in the dark [2].\n\nThe evolution of the lens also plays a key role [2]. The earliest Darier camera is assembled, and the aperture is only f / 16 [2] [Note 6]. The emergence of large-diameter lenses, shortening the exposure time of the photo, making the photographing more convenient [2]. Among them, Petzfar (English: Joseph Petzval), the University of Vienna, is designed in 1840, the so-called Petzval Lens (English: Petzval Lens), the aperture is f / 3.6 [Note 7] ,Popular. Among them, the same lenses produced by Fulunda are particularly famous, the United Kingdom and the United States also have companies producing such lenses. Due to the numerous manufacturers, the specifications are different, the size is not equal, but the aperture is generally f / 3 to f / 6 [6].\n\nAlthough the exposure time is significantly shortened, the exposure time is still in seconds. If the subject is slightly shaking, the photos taken will not be clear. In order to get a clear image, the photographer will let the guests sit on the chair [2], with almost hidden brackets to fix the head [2] [7], try the danger, try to keep do not move.\n\nIn terms of light source, more natural light is mainly [1] [2] [Note 8], the studio at that time will open in the top of the building [2] [8] [9]. Early studou is generally equipped with a glass curtain wall toward north [8] [10], or the window of the north [8] [10] [Note 9] (located in the middle of the Southern Half Conversion [10]), with diffuse light instead of direct shooting Light shooting [2].\n\nThe camera was quite cumbersome, and to be fixed on a special wooden frame, the height of the wooden frame can be adjusted [2]. According to the weather conditions at the time, the photographer decided to expose [2]. When shooting, the photographer removes the lens cover, the exposure begins, and the photographer times when pocket watch [2]. Cover the lens cover, exposure completed [2], then remove the photosensitive version, get the darkroom treatment.\n\nEarly photographers, there are many painters who are painters [1], portrait photos taken by them, not ugly to see shadows with painting, especially half-length portrait. For example, photographers will imitate the lighting techniques of the Dutch painter Lin Bumbah [1], and the oil painting is used in the background [1].\n\nFire cotton photographic method (English: collodion processes), also known as rubbish printing process, down the wesch (wet rubber printing process, wet pad photography, wet version of the cotton photographic method), and the dry version (Dry rubber printing process, dry version photography, dry version of the cotton photographic method) Two kinds, the fire cotton photographic method is a photographic method in the 1850s, and its appearance has almost replaced the silver version of the photographic law. Flow cotton glue is a viscous liquid, which can be adhered to a glossy glass plate, and can be used as a carrier of silver nitrate, which makes this photosensitive material to the glass plate and form a photosensitive version.\n\nIn 1851 [2] [11], the British sculptor [11] Archer (English: Frederick Scott Archer) [2] [11] published a wet photographic method, but did not apply for patents [11], so there is not much Wealth [2]. Archer was passed away in 1857 [2] [11], the death of the death [2], his invent of the world.\n\nThe wet version of the photographic method is negative with a glass plate [2], and the photosensitive paper can be copied with multiple photos [2], not only reduced photographic cost [2], you can also send photos to friends and family [2]. With the so-called \"business card photography\", the customer took a small photo to the studio, and then put the photo on a personal business card, on the social situations [2], people compete and imitate, become a fashion. Due to the violent money, the big and small film buildings have grown, the competition is very intense.\n\nEquipment manufacturers also take the opportunity to introduce special cameras with multiple lenses, and can take multiple small photos on the same glass plate [2]. With this type of special camera, photographers print more photos with the same cost and workload, charge higher fees [2]. Later, people began to turn their eyes outdoors, to the outdoor phase, becoming a new photographing business. The foldable camera appears.\n\nTo outdoor shooting, a foldable camera, a retractable wooden tripod, and a portable tent and a box used to carry a medicated water, which is simply moving the entire dark room to outdoor. Because the photographic photography method is taken, it is necessary to prepare the photosyrics and take pictures before the photosensitive version. The photosensitive version cannot be stored for a long time. Once drying, you can't take photos. Despite this, early photographers still take pictures outdoors in this technology.\n\nBefore the Crime war broke out, there was already a photographer to shoot a war. Anonymous photographer uses the silver version of the photographic method to shoot in ink war in 1847. Later, the Crimea war broke out.\n\nIn 1914, Germany's \"Lez\" microscope factory designer Oscar Balnak tried to make the use of film film double specifications (24 x 36 mm; 135) camera (movie slices of 18 × 24 mm), and in 1924 The Leica camera began in the year. 135 The specification has become the most popular film specification, which greatly reduces the camera volume, making the mainstream of photography to documentary photography, and quickly accepted by the public.\n\nDigital camera technology started research in special fields in the middle and late 20th century, and entered the civilian market at the end of the last century. In 1995, Kodak issued a consumer digital camera DC40, marking the start of digital camera civil market. With the advancement of digital technologies and Internet applications, photography is more in-depth into social life, digital music player, mobile phone and other digitized products began to match photography functions, the picture of shooting can be wirelessly propagated with MMS, photography starts diversified development .\n\nThe essence of photography is the art of capturing light, so the exposure is accurate or not, it has become the core of the technical level.\n\nExposure is the camera to pass (usually the external image After the lens group inside the lens is focused) Record the process in the in-in-light medium. The light is strong, so it is imaged by a combination of accurate aperture, shutter and sensitivity. And accurate exposure has a combination of different apertures, shutters and sensitivity, which is the art of photography. Large aperture reducing expansion highlights the theme, and the small aperture increases the depth of view. Fast shutter solidification, wonderful moment, slow shutter, usually slow shutter to increase the motion, such as water, car flow in the evening, etc. When using a slow shutter, the photographic device is often fixed with a tripod to protect the image.\n\nYou must pay attention to the choice of brightness during photography, and it is not too dark, and it is not too bright, and the middle adjustment of the HD curve must be maintained. Because in the shaded part and the high light part, the contrast is small, the detachment disappears, and it shows a black or one white.\n\n\n\n\n\n\n\n\n\n\n\nAfter the phase is completed, the image information stored in the medium must be read again by the conversion. Specific methods depends on photosensitive means and media characteristics. For film camera, there will be a process of developing, fixing, enlargement. For digital cameras, you need to calculate the data with your computer, and then output by the electronic device.\n\nPhotographic developer\n\n\n\n\n\nWith the widespread use of digital cameras, use computer image processing software (such as Photoshop) to process the photographing digital file, and carry out the second creation, you can get the image of the author you want, the development of digital technology, bringing a quality leap to photography .\n\nDigital picture post-processing is a very large industry, and now the business picture is a very professional, very detailed post image processing, the color, bright, contrast, etc. of the picture, the overall adjustment, so that the picture is bright Beautiful visual effect. Its industry application covers many fields such as advertising, online shopping, art. With the development of mobile phones, the post-processing function of the picture is now integrated, so that the pictures you taken are more beautified and diverse.\n\nDepth of Field, the depth of field, is a clear level, range, with a focus protagonist, forward, and then relatively clear space, we can simply say that the depth of field is \"clear\" in a photo, Not blurred place.\n\nThe starting point (leading edge) of the depth of field is the beginning of the depth of field, from here to start, until the depth of field (trailing edge) is becoming, so the depth of field is a small calculation method, the \"Jingxiang Type - Jing Shen starting point\". [16]\n\nGenerally speaking, people use visible light, most commonly used by cameras. The camera has a lot of categories due to the differences between scenes and purposes. In integrated, there are several basic parts to ensure exposure process, including:\n\nSometimes, people will also take photographic experimental equipment, which requires only a small hole, photosensitive medium, and control light time method.\n\nSince some media can feel the irradiation of electromagnetic waves outside the visible light, the corresponding photographic technique is developed. The most popular is infrared photography, and even many civil camera can make infrared photography without modification. In the ordinary camera, an infrared photosensitive rubber roll can be performed. However, the corresponding radiation intensity calculation is not enough to give the time required for expulsiveness. Similar situations also appear in stars photography. The electromagnetic wave radiation of different wavelengths can be stored by the medium, and it appears as a picture readable. Ordinary photography is to record the scenes seen by people, rather than visible light, showing images that the human eye is not possible to identify.\n\nChina Doll - Wang Xiaociting\n\nA photo is on the final chemistry.\n\nJuan Mro\n\nCavalry Camp Near Balaklava - CRIMEAN WAR\n\nThe Valley of The Shadow of Death - Roger Fenton (English: Roger Fenton)\n\nX-ray - William Lunqin\n\nView from the window at le gras\n\nThe Horse In Motion (English: Sallie Gardner At A Gallop) - Mai Bridge\n\nMIGRANT MOTHER (English: Florence Owens Thompson) - Database & Sql Blog Articles\n\nEarthrise - William Anders\n\nModern still life photography\n\nArchitecture\n\nstill painting\n\nPortrait Photography\n\nChristmas cake photography - food photography\n\nNature photography\n\nPortrait of a woman photography\n\nPhotography "}