{"topic": "Awareness", "english_title": "Awareness", "english": "Awareness is the state of being conscious of something. More specifically, it is the ability to directly know and perceive, to feel, or to be cognizant of events. Another definition describes it as a state wherein a subject is aware of some information when that information is directly available to bring to bear in the direction of a wide range of behavioral actions. The concept is often synonymous to consciousness and is also understood as being consciousness itself.The states of awareness are also associated with the states of experience so that the structure represented in awareness is mirrored in the structure of experience.\n\n\n== Concept ==\nAwareness is a relative concept. It may be focused on an internal state, such as a visceral feeling, or on external events by way of sensory perception. It is analogous to sensing something, a process distinguished from observing and perceiving (which involves a basic process of acquainting with the items we perceive). Awareness or \"to sense\" can be described as something that occurs when the brain is activated in certain ways, such as when the color red is what is seen once the retina is stimulated by light waves. This conceptualization is posited amid the difficulty in developing an analytic definition of awareness or sensory awareness.Awareness is also associated with consciousness in the sense that this concept denotes a fundamental experience such as a feeling or intuition that accompanies the experience of phenomena. Specifically, this is referred to as awareness of experience.\n\n\n== Self-awareness ==\n\nPopular ideas about consciousness suggest the phenomenon describes a condition of being aware of oneself (self-awareness). Modern systems theory, which offers insights into how the world works through an understanding that all systems follow system rules, approach self-awareness within its understanding of how large complex living systems work. According to Gregory Bateson, the mind is the dynamics of self-organization and that awareness is crucial in the existence of this process. Modern systems theory maintains that humans, as living systems, have not only awareness of their environment but also self-awareness particularly with their capability for logic and curiosity.Efforts to describe consciousness in neurological terms have focused on describing networks in the brain that develop awareness of the qualia developed by other networks. As awareness provides the materials from which one develops subjective ideas about their experience, it is said that one is aware of one's own awareness state. This organization of awareness of one's own inner experience is given a central role in self-regulation.\n\n\n== Neuroscience ==\nNeural systems that regulate attention serve to attenuate awareness among complex animals whose central and peripheral nervous systems provide more information than cognitive areas of the brain can assimilate. Within an attenuated system of awareness, a mind might be aware of much more than is being contemplated in a focused extended consciousness.\n\n\n=== Basic awareness ===\nBasic awareness of one's internal and external world depends on the brain stem. Bjorn Merker, an independent neuroscientist in Stockholm, Sweden, argues that the brain stem supports an elementary form of conscious thought in infants with hydranencephaly. \"Higher\" forms of awareness including self-awareness require cortical contributions, but \"primary consciousness\" or \"basic awareness\" as an ability to integrate sensations from the environment with one's immediate goals and feelings in order to guide behavior, springs from the brain stem which human beings share with most of the vertebrates. Psychologist Carroll Izard emphasizes that this form of primary consciousness consists of the capacity to generate emotions and awareness of one's surroundings, but not an ability to talk about what one has experienced. In the same way, people can become conscious of a feeling that they cannot label or describe, a phenomenon that is especially common in pre-verbal infants.\nDue to this discovery medical definitions of brain death as a lack of cortical activity face a serious challenge.\n\n\n=== Basic interests ===\nThroughout the brain stem, there are interconnected regions that regulate eye movement that are also involved in organizing information about what to do next, such as reaching for a piece of food or pursuing a potential mate.\n\n\n=== Changes in awareness ===\nThe ability to consciously detect an image when presented at near-threshold stimulus varies across presentations. One factor is \"baseline shifts\" due to top down attention that modulates ongoing brain activity in sensory cortex areas that affects the neural processing of subsequent perceptual judgments. Such top down biasing can occur through two distinct processes: an attention driven baseline shift in the alpha waves, and a decision bias reflected in gamma waves.\n\n\n== Living systems view ==\nOutside of neuroscience biologists, Humberto Maturana and Francisco Varela contributed their Santiago theory of cognition in which they wrote:\nLiving systems are cognitive systems, and living as a process is a process of cognition. This statement is valid for all organisms, with or without a nervous system.\nThis theory contributes a perspective that cognition is a process present at organic levels that we don't usually consider to be aware. Given the possible relationship between awareness and cognition, and consciousness, this theory contributes an interesting perspective in the philosophical and scientific dialogue of awareness and living systems theory.\n\n\n== Communications and information systems ==\nIn cooperative settings, awareness is a term used to denote \"knowledge created through the interaction of an agent and its environment — in simple terms 'knowing what is going on'\". In this setting, awareness is meant to convey how individuals monitor and perceive the information surrounding their colleagues and the environment they are in. This information is incredibly useful and critical to the performance and success of collaborations. Awareness can be further defined by breaking it down into a set of characteristics:\nIt is knowledge about the state of some environment\nEnvironments are continually changing, therefore awareness knowledge must be constantly maintained\nIndividuals interact with the environment, and maintenance of awareness is accomplished through this interaction.\nIt is generally part of some other activity – generally making it a secondary goal to the primary goal of the activity.Different categories of awareness have been suggested based on the type of information being obtained or maintained:\nInformal awareness is the sense of who’s around and what are they up to. E.g. Information you might know from being collocated with an individual\nSocial awareness is the information you maintain about a social or conversational context. This is a subtle awareness maintained through non-verbal cues, such as eye contact, facial express, etc.\nGroup-structural awareness is the knowledge of others roles, responsibilities, status in a group. It is an understanding of group dynamics and the relationship another individual has to the group.\nWorkspace awareness – this is a focus on the workspace’s influence and mediation of awareness information, particularly the location, activity, and changes of elements within the workspace.These categories are not mutually exclusive, as there can be significant overlap in what a particular type of awareness might be considered. Rather, these categories serve to help understand what knowledge might be conveyed by a particular type of awareness or how that knowledge might be conveyed. Workspace awareness is of particular interest to the CSCW community, due to the transition of workspaces from physical to virtual environments.\nWhile the type of awareness above refers to knowledge a person might need in a particular situation, context awareness and location awareness refer to information a computer system might need in a particular situation. These concepts of large importance especially for AAA (authentication, authorization, accounting) applications.\nThe term of location awareness still is gaining momentum with the growth of ubiquitous computing. First defined by networked work positions (network location awareness), it has been extended to mobile phones and other mobile communicable entities. The term covers a common interest in whereabouts of remote entities, especially individuals and their cohesion in operation. The term of context awareness is a superset including the concept of location awareness. It extends the awareness to context features of an operational target as well as to the context of an operational area.\n\n\n== Covert awareness ==\n\nCovert awareness is the knowledge of something without knowing it. Some patients with specific brain damage are for example unable to tell if a pencil is horizontal or vertical. They are however able to grab the pencil, using the correct orientation of the hand and wrist. This condition implies that some of the knowledge the mind possesses is delivered through alternate channels than conscious intent.\n\n\n== Other uses ==\nIn general, \"awareness\" may also refer to public or common knowledge or understanding about a social, scientific, or political issue, and hence many movements try to foster \"awareness\" of a given subject, that is, \"raising awareness\". Examples include AIDS awareness and multicultural awareness.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n Media related to Awareness at Wikimedia Commons\nLaBar KS, Disterhoft JF (1998). \"Conditioning, awareness, and the hippocampus\". Hippocampus. 8 (6): 620–6. doi:10.1002/(SICI)1098-1063(1998)8:6<620::AID-HIPO4>3.0.CO;2-6. PMID 9882019.\nCornell University: Recent findings in the awareness of brain damaged people.", "chinese_title": "", "chinese": ""}