{"topic": "Optometry", "english_title": "Optometry", "english": "Optometry is a health care profession that involves examining the eyes and applicable visual systems for defects or abnormalities as well as prescribing the correction of refractive error with glasses or contact lenses and the treatment of eye diseases. \nTraditionally, the field of optometry began with the primary focus of correcting refractive error through the use of spectacles. Modern-day optometry, however, has evolved through time so that the educational curriculum additionally includes significant training in the diagnosis and management of ocular disease, in most of the countries of the world, where the profession is established and regulated.\nOptometrists (also known as doctors of optometry in the United States and Canada, by a higher degree in the United Kingdom and worldwide for those holding the O.D. degree) are health care professionals who usually provide primary eye care through comprehensive eye examinations. They diagnose and manage various vision abnormalities including refractive errors as well as various eye diseases. Being a regulated profession, an optometrist's scope of practice may differ depending on the location. Optometrists typically work closely together with other eye care professionals such as ophthalmologists and opticians to deliver quality and efficient eyecare to the general public.\n\n\n== Etymology ==\nThe term \"optometry\" comes from the Greek words ὄψις (opsis; \"view\") and μέτρον (metron; \"something used to measure\", \"measure\", \"rule\"). The word entered the language when the instrument for measuring vision was called an optometer, (before the terms phoropter or refractor were used). The root word opto is a shortened form derived from the Greek word ophthalmos meaning, \"eye.\" Like most healthcare professions, the education and certification of optometrists are regulated in most countries. Optometric professionals and optometry-related organizations interact with governmental agencies, other healthcare professionals, and the community to deliver eye and vision care.\n\n\n== Definition of optometry and optometrist ==\n\nThe World Council of Optometry,  World Health Organization and about 75 optometry organisations from over 40 countries have all over the world adopted the following definition, to be used to describe optometry and optometrist.\nOptometry is a healthcare profession that is autonomous, educated, and regulated (licensed/registered), and optometrists are the primary healthcare practitioners of the eye and visual system who provide comprehensive eye and vision care, which includes refraction and dispensing, detection/diagnosis and management of disease in the eye, and the rehabilitation of conditions of the visual system.\n\n\n== History ==\n\nOptometric history is tied to the development of\n\nvision science (related areas of medicine, microbiology, neurology, physiology, psychology, etc.)\noptics, optical aids\noptical instruments, imaging techniques\nother eye care professionsThe history of \"optometry\" (refracting opticians) can be traced back to the early studies on optics and image formation by the eye. The origins of optical science (optics, as taught in a basic physics class) date back a few thousand years BC as evidence of the existence of lenses for decoration has been found in Greece and the Netherlands.It is unknown when the first spectacles were made. The British scientist and historian Sir Joseph Needham, in his Science and Civilization in China, reported the earliest mention of spectacles was in Venetian guild regulations circa 1300. \nHe suggested that the occasional claim that spectacles were invented in China may have come from a paper by Laufer.  Per Needham, the paper by Laufer had many inconsistencies, and that the references in the document used by Laufer were not in the original copies but added during the Ming dynasty.  Early Chinese sources mention the eyeglasses were imported.Alternatively, research by David A. Goss in the United States shows they may have originated in the late 13th century in Italy as stated in a manuscript from 1305 where a monk from Pisa named Rivalto stated \"It is not yet 20 years since there was discovered the art of making eyeglasses\". Spectacles were manufactured in Italy, Germany, and the Netherlands by 1300. Needham stated spectacles were first made shortly after 1286.In 1907, Professor Berthold Laufer, who was a German American anthropologist, stated in his history of spectacles 'the opinion that spectacles originated in India is of the greatest probability and that spectacles must have been known in India earlier than in Europe'.  However, as already mentioned, Joseph Needham showed that the references Laufer cited were not in the older and best versions of the document Laufer used, leaving his claims unsupported. \nIn Sri Lanka, it is well-documentedthat during the reign of King Bhuvanekabahu the IV (AD 1346 – 1353) of the Gampola period the ancient tradition of optical lens making with a natural stone called Diyatarippu was given royal patronage. A few of the craftsmen still live and practice in the original hamlet given to the exponents of the craft by royal decree.  But the date of King Bhuvanekabahu is decades after the mention of spectacles in the Venetian guild regulations  and after the 1306 sermon by Dominican friar Giordano da Pisa, where da Pisa said the invention of spectacles was both recent and that he had personally met the inventor \nThe German word brille (eyeglasses) is derived from Sanskrit vaidurya. Etymologically, brille is derived from beryl, Latin beryllus, from Greek beryllos, from Prakrit verulia, veluriya, from Sanskrit vaidurya, of Dravidian origin from the city of Velur (modern Belur). Medieval Latin berillus was also applied to eyeglasses, hence German brille, from Middle High German berille, and French besicles (plural) spectacles, altered from old French bericle.Benito Daza de Valdes published the first full book on opticians in 1623, where he mentioned the use and fitting of eyeglasses. In 1692, William Molyneux wrote a book on optics and lenses where he stated his ideas on myopia and problems related to close-up vision. The scientists Claudius Ptolemy and Johannes Kepler also contributed to the creation of optometry. Kepler discovered how the retina in the eye creates vision. From 1773 until around 1829, Thomas Young discovered the disability of astigmatism and it was George Biddell Airy who designed glasses to correct that problem that included sphero-cylindrical lens.Although the term optometer appeared in the 1759 book A Treatise on the Eye: The Manner and Phenomena of Vision by Scottish physician William Porterfield, it was not until the early twentieth century in the United States and Australia that \"optometry\" began to be used to describe the profession. By the early twenty-first century, however, marking the distinction with dispensing opticians, it had become the internationally accepted term.\n\n\n== Training, licensing, representation and scope of practice ==\n\nOptometry is officially recognized in many jurisdictions. Most have regulations concerning education and practice. Optometrists, like many other healthcare professionals, are required to participate in ongoing continuing education courses to stay current on the latest standards of care.  The World Council of Optometry has a web resource that provides basic information on eye care providers for more than 46 countries.\n\n\n=== Africa ===\nIn 1993 there were five countries in Africa with optometric teaching institutes: Sudan, Ghana, Nigeria, South Africa and Tanzania.\n\n\n==== Sudan ====\nSudan's major institution for the training of optometrists is the Faculty of Optometry and Visual Sciences (FOVS), originally established in 1954 as the Institute of Optometry in Khartoum; the Institute joined with the Ministry of Higher Education in 1986 as the High Institute of Optometry, and ultimately was annexed into Alneelain University in 1997 when it was renamed to the FOVS. Currently, the FOVS has the following programs: 1) BSc optometry in 5 years with sub-specialization in either orthoptics, contact lenses, ocular photography or ocular neurology; 2) BCs in ophthalmic technology, requiring four 4 years of training; and BCs in the optical dispensary, achieved in 4 years. The FOVS also offers MSc and PhD degrees in Optometry. The FOVS is the only institute of its kind in Sudan and was the first institution of higher education in Optometry in the Middle East and Africa. In 2010, Alneelain University Eye Hospital was established as part of the FOVS to expand training capacity and to serve broader Sudanese community.\n\n\n==== Ghana ====\nThe Ghana Optometric Association (GOA) regulates the practice of Optometry in Ghana. After the six-year training at any of the two universities offering the course, the O.D degree is awarded. The new optometrist must write a qualifying exam, after which the optometrist is admitted as a member of the GOA, leading to the award of the title MGOA.\n\n\n==== Mozambique ====\nThe first optometry course in Mozambique was started in 2009 at Universidade Lurio, Nampula. The course is part of the Mozambique Eyecare Project. University of Ulster, Dublin Institute of Technology and Brien Holden Vision Institute are supporting partners. As of 2019, 61 Mozambican students had graduated with optometry degrees\nfrom UniLúrio (34 male and 27 female).\n\n\n==== Nigeria ====\nIn Nigeria, optometry is regulated by the Optometry and Dispensing Opticians Registration Board of Nigeria established under the Optometry and Dispensing Opticians ( Registration ETC ) Act of 1989 (Cap O9 Laws of Federation of Nigeria 2004). The Boards publishes from time to time lists of approved qualifications and training institutions in the federal government gazette. The Doctor of Optometry degree is awarded after a six-year training at one of the accredited universities in Imo, Edo and Abia states.\n\n\n=== Asia ===\n\n\n==== Bangladesh ====\nFrom 2010 Optometry was first introduced in Bangladesh in Institute of Community Ophthalmology Under Medicine Faculty of University of Chittagong http://icoedu.org. This institute offers a four years Bachelor of Science in Optometry (B.Optom) course. Currently, there are 120 Graduated Optometrists in Bangladesh. The association which controls the quality of Optometry practice all over the country is named as 'Optometrists Association of Bangladesh' which is also a country member of World Council of Optometry(WCO).\nIn the year 2018, Chittagong Medical University formed and the Bsc. in Optometry course shifted to this University.\nIn Bangladesh, Optometrists perform primary eye care like Diagnosis and primary management of some ocular diseases, Prescribe Eye Glasses, Low vision rehabilitation, provide vision therapy, contact lens practice and all type of Orthoptic evaluations and management.\n\n\n==== China ====\nIn China, optometric education only began in 1988 at the Wenzhou Medical University. Since that time, the discipline and the profession have emerged as a five-year, medically-based program within the medical education system of China. Students in the program receive the highest level of training in Optometry and are provided with the credentials needed to assume positions of leadership in China’s medical education and health care systems. In 2000, the Ministry of Health formally accepted Optometry as a subspecialty of medicine.\n\n\n==== Hong Kong ====\nThe Optometrists Board of the Supplementary Medical Professions Council regulates the profession in Hong Kong. Optometrists are listed in separate parts of the register based on their training and ability. Registrants are subject to restrictions depending on the part they are listed in. Those who pass the examination on refraction conducted by the Board may be registered to Part III, thereby restricted to practice only work related to refraction. Those who have a Higher Certificate in Optometry or have passed the Board's optometry examination may be registered to Part II, thereby restricted in their use of diagnostic agents, but may otherwise practice freely. Part I optometrists may practice without restrictions and generally hold a bachelor's degree or a Professional Diploma.There are around 2000 optometrists registered in Hong Kong, 1000 of which are Part I. There is one Part I optometrist to about 8000 members of the public. The Polytechnic University runs the only optometry school. It produces around 35 Part I optometrists a year.\n\n\n==== India ====\nIn 2010, it was estimated that India needs 115,000 optometrists; whereas India has approximately 9,000 optometrists (4-year trained) and 40,000 optometric assistants/vision technicians (2-year trained). In order to prevent blindness or visual impairment more well-trained optometrists are required in India. The definition of optometry differs considerably in different countries of the world. India needs more optometry schools offering four-year degree courses with a syllabus similar to that in force in those countries where to practise of optometry is statutorily regulated and well established with an internationally accepted definition.\nIn 2013, it was reported in the Indian Journal of Ophthalmology that poor spectacle compliance amongst school children in rural Pune resulted in significant vision loss.In 2015, it was reported in the Optometry and Vision Science that, optometrists need to be more involved in providing core optometry services like binocular vision and low vision.\n\n\n===== Training in India =====\nAt present, there are more than fifty schools of optometry in India.  In the year 1958, two schools of optometry were established, one at Gandhi Eye Hospital, Aligarh in Uttar Pradesh and another one at Sarojini Devi Eye Hospital, Hyderabad in Telangana, under the second five-year plan by Director General of Health Services of Government of India. These schools offered diplomas in optometry courses of two years duration validated by State Medical Faculties.\nSubsequently, four more schools were opened across India situated at Sitapur Eye Hospital, Sitapur in Uttar Pradesh, Chennai (formerly Madras) in Tamil Nadu, Bengalooru (formerly Bangalore) in Karnataka and Regional Institute of Ophthalmology, Thiruvananthapuram (formerly Trivandrum) in Kerala.The Elite School of Optometry (ESO) was established in 1985 at Chennai and was the first to offer a four-year degree course.\nAcademic degrees such as Bachelor of Optometry, Master of Optometry and Doctor of Philosophy in Optometry are awarded in India by the universities recognised by University Grants Commission (India), a statutory body responsible for the maintenance of standards of higher education in India.\nOptometrists across India are encouraged to register with the Optometry Council of India, a self-regulatory body registered under the Indian Company Act.\n\n\n==== Malaysia ====\nIt takes four years to complete a degree in Optometry. Today, optometry courses are well received by citizens. More universities and higher education studies are about to implement the courses, e.g., National Institute of Ophthalmic Sciences in Petaling Jaya whereby it is the academic arm of The Tun Hussein Onn National Eye Hospital. Other public universities that provide this course are University Kebangsaan Malaysia (UKM), Universiti Teknologi Mara (UiTM), and International Islamic University Malaysia (IIUM). There is also a private university that provides this course such as Management and Science University (MSU) and SeGi University.\nAfter completing the study in Degree in Optometry, the optometrist who practices in Malaysia must register under the Malaysian Optical Council (MOC) which is the organization under the Ministry of Health.\nThe Association of Malaysian Optometrist (AMO) is the only body that represents the Malaysian optometrist profession. All of the members are either local or overseas graduates in the field of Optometry. \n\n\n==== Pakistan ====\nOptometry is taught as a five/four-year Doctor/ Bachelors/ Bachelors with Honors course at many institutions notable among which are Department of Optometry & Vision Sciences (DOVS) FAHS, ICBS, Lahore, Pakistan Institute of Community Ophthalmology (PICO) Peshawar, Pakistan institute of Rehabilitation science Isra University campus Islamabad (PIRS),College of Ophthalmology & Allied Vision Sciences (COAVS) Lahore and Al-Shifa Institute of Ophthalmology Islamabad. After graduation, the optometrists can join a four-tiered service delivery level (Centre of Excellence, Tertiary/Teaching, District headquarter and sub-district /Tehsil headquarters). M.Phil in Optometry is also available at select institutions such as King Edward Medical University, Lahore\nDepartment of Optometry & Vision Sciences (DOVS) FAHS, ICBS, Lahore started bridging programmes for Bachelors/ Bachelors with Honors to become Doctor of Optometry OD, Post Professional Doctor of Optometry(PP-OD), Transitional Doctor of Optometry(t-OD).\nOptometry is not yet a regulated field in Pakistan as there is no professional licensing board or authority responsible for issuing practise licenses to qualified optometrists. This creates difficulty for Pakistani optometrists who wish to register abroad.\nThe University of Lahore has recently launched Doctor of optometry (OD).\nImam Hussain Medical University also has launched Doctor of Optometry Program. Chairman Imam Hussain Medical University Dr Sabir Hussain Babachan has vowed to regulate OD curriculum according to international standard.\n\n\n==== Philippines ====\nOptometry is regulated by the Professional Regulation Commission of the Philippines. To be eligible for licensing, each candidate must have satisfactorily completed a doctor of optometry course at an accredited institution and demonstrate good moral character with no previous record of professional misconduct. Professional organizations of optometry in the Philippines include Optometric Association of the Philippines and Integrated Philippine Association of Optometrists, Inc. (IPAO).\n\n\n==== Saudi Arabia ====\nIn Saudi Arabia, optometrists must complete a five-year doctor of optometry degree from Qassim University and King Saud University also they must complete a two-year residency.\n\n\n==== Singapore ====\nTertiary education for optometrists takes 3 years at the following institutions.\nSingapore Polytechnic - Diploma in Optometry Singapore Polytechnic\nNgee Ann Polytechnic - Diploma in Optometry Ngee Ann Polytechnic\n\n\n==== Taiwan ====\nThe education of Optometry in Taiwan commenced in 1982 at Shu-Zen College of Medicine and Management. Currently, Bcahelor degrees in Optometry can be obtained from seven universities (North to South): University of Kang Ning, Yuanpei University of Medical Technology, Asia University, Central Taiwan University of Science and Technology, Chung Shan Medical University, Dayeh University, and Chung Hwa University of Medical Technology; where as Associate degrees in Optometry can be obtained from Mackay Junior College of Medicine, Nursing and Management, Hsin Sheng College of Medical Care and Management, Jen-Teh Junior College of Medicine, Nursing, and Management, and Shu-Zen College of Medicine and Management.The Law of Optometrists was established in Taiwan in 2015, since then, Optometry students after obtaining Optometry degrees need to pass the National Optometry Examination of Taiwan to be registed as Optometrists. Currently, there are approximately 4,000 Optometrists in Taiwan (2020), and around 400 new Optometrists rigister annunally (2018-2020).\n\n\n==== Thailand ====\nSince late 1990, Thailand has set a goal to provide more than 600 optometrists to meet the minimal public demands and international standards in vision care. There are more than three university degree programs in Thailand. Each program accepts students that have completed grade 12th or the third year in high school (following US education model). These programs offer \"Doctor of Optometry\" degree to graduates from the program that will take six years to complete the courses. Practising optometrists will also be required to pass licensing examination (three parts examinations) that is administrated through a committee under the Ministry of Public Health.\nNowadays, the number of practising optometrists in Thailand is still less than one hundred (2015). However, it has projected that the number of practising optometrists in Thailand will greatly increase within the next ten years. In the theoretical scenario, the number of optometrists should be able to meet minimal public demands around 2030 or earlier.\n\n\n=== Europe ===\nSince the formation of the European Union, \"there exists a strong movement, headed by the Association of European Schools and Colleges of Optometry (AESCO), to unify the profession by creating a European-wide examination for optometry\" and presumably also standardized practice and education guidelines within EU countries. The first examinations of the new European Diploma in Optometry were held in 1998 and this was a landmark event for optometry in continental Europe.\n\n\n==== France ====\nThere is no regulatory framework and optometrists are sometimes trained by completing an apprenticeship at an ophthalmologists' private office.\n\n\n==== Germany ====\nOptometric tasks are performed by ophthalmologists and professionally trained and certified opticians.\n\n\n==== Greece ====\nHellenic Ministry of Education founded the first department of Optometry at Technological Educational Institute of Patras in 2007. After protests from the department of Optics at Technological Educational Institute of Athens (the only department of Optics in Greece, until 2006), the Government changed the names of the departments to \"Optics and Optometry\" and included lessons in both optics and optometry. Optometrists-Opticians have to complete a 4-year undergraduate honours degree. Then the graduates can be admitted to postgraduate courses in Optometry at universities around the world.\nSince 2015, a Master of Science (MSc) course in Optometry is offered by the Technological Educational Institute of Athens.\nThe Institute of Vision and Optics (IVO) of the University of Crete focuses on the sciences of vision and is active in the fields of research, training, technology development and provision of medical services. Professor Ioannis Pallikaris has received numerous awards and recognitions for the Institute's contribution to ophthalmology. In 1989 he performed the first LASIK procedure on a human eye.\n\n\n==== Hungary ====\nOptometrist education takes 4 years in the medical universities in Hungary, and they will get a Bachelor of Science degree. They work in networks and retail stores and private optics, very few are located in the Health Care care system as ophthalmologists as an assistant.\n\n\n==== Ireland ====\nThe profession of Optometry has been represented for over a century by the Association of Optometrists, Ireland [AOI]. In Ireland an optometrist must first complete a four-year degree in optometry at Dublin Institute of Technology. Following successful completion of the degree, an optometrist must then complete professional qualifying examinations to enter the register of the Opticians Board [Bord na Radharcmhaistoiri]. Optometrists must be registered with the Board to practice in the Republic of Ireland.\nThe A.O.I. runs a comprehensive continuing education and professional development program on behalf of Irish optometrists. The legislation governing optometry was drafted in 1956. Some feel that the legislation restricts optometrists from using their full range of skills, training and equipment for the benefit of the Irish public. The amendment to the Act in 2003 addressed one of the most significant restrictions: the use of cycloplegic drugs to examine children.\n\n\n==== Italy ====\nIn Italy Optometry is an unregulated profession. It is taught at seven universities: Padua, Turin, Milan, Salento, Florence, Naples and Rome, as three years course (like a BSc) of \"Scienze e tecnologie fisiche\" as a sector of the Physics Department. Additionally, courses are available at some private institutions (as at Vinci Institute near Firenze) that offer advanced professional education for already qualified opticians (most of the Italian optometrists are also qualified opticians, i.e. \"ottico abilitato\"). In the last thirty years several verdicts from High Court (Cassazione) proof that optometry is a free practice and has truly education path.\n\n\n==== Norway ====\nIn Norway, the optometric profession has been regulated as a healthcare profession since 1988. After a three-year bachelor program, one can practice basic optometry. At least one year in clinical practice qualify for a post-degree half-year sandwich course in contact lens fitting, which is regulated as a healthcare speciality. A separate regulation for the use of diagnostic drugs in optometric practice was introduced in 2004.\n\n\n==== Russia ====\nIn Russia, optometry education has been accredited by the Federal Agency of Health and Social Development.\nThere are only two educational institutions that teach optometry in Russia: Saint Petersburg Medical Technical College, formerly known as St. Petersburg College of Medical Electronics and Optics, and The Helmholtz Research Institute for Eye Diseases. They both belong and are regulated by the Ministry of Health. The optometry program is a four-year program. It includes one to two science foundation years, one year focused on clinical and proficiency skills, and one year of clinical rotations in hospitals. Graduates take college/state examinations and then receive a specialist diploma. This diploma is valid for only five years and must be renewed every five years after receiving additional training at state-accredited programs.\nThe scope of practice for optometrists in Russia includes refraction, contact lens fitting, spectacles construction and lens fitting (dispensing), low vision aids, foreign body removal, referrals to other specialists after clinical condition diagnoses (management of diseases in the eye).\n\n\n==== United Kingdom ====\n\n\n===== Licensing =====\nOptometrists in the United Kingdom are regulated by the General Optical Council under the Opticians Act 1989 and distinguished from medical practitioners. Registration with the GOC is mandatory to practice optometry in the UK. Members of the College of Optometrists (incorporated by a Royal Charter granted by Her Majesty Queen Elizabeth II) may use the suffix MCOptom.\nThe National Health Service provides free sight tests and spectacle vouchers for children and those on very low incomes. The elderly and those with some chronic conditions like diabetes get free periodic tests. Treatment for eye conditions such as glaucoma and cataracts is free and checked for during normal eye examinations.\n\n\n===== Training =====\nIn the United Kingdom, optometrists have to complete a 3 or 4 (Scotland) year undergraduate honours degree followed by a minimum of a one-year \"pre-registration period\", (internship), where they complete clinical practice under the supervision of a qualified and experienced practitioner. During this year the pre-registration candidate is given a number of quarterly assessments, often including temporary posting at a hospital, and on successfully passing all of these assessments, a final one-day set of examinations (details correct for candidates from 2006 onwards). Following successful completion of these assessments and having completed one year's supervised practice, the candidate is eligible to register as an optometrist with the General Optical Council (GOC) and, should they so wish, are entitled to membership of the College of Optometrists.  Twelve universities offer Optometry in the UK: Anglia Ruskin, Aston, Bradford, Cardiff, City, Glasgow Caledonian, Hertfordshire, Manchester, University of Plymouth, Ulster University at Coleraine, University of Portsmouth and University of the West of England.\nIn 2008 the UK moved forward to offer the Doctor of Optometry postgraduate program. This became available at the Institute of Optometry in London in partnership with London South Bank University.  The Doctor of Optometry postgraduate degree is also offered at one other UK institution.Aston University\n\n\n===== Scope of Practice =====\nIn 1990, a survey of the opinions of British medical practitioners regarding the services provided by British optometrists was carried out by Agarwal at City, University of London. A majority of respondents were in favour of optometrists extending their professional role by treating external eye conditions and prescribing broad-spectrum topical antibiotics through additional training and certification.\nSince 2009, optometrists in the UK have been able to undertake additional postgraduate training and qualifications that allow them to prescribe medications to treat and manage eye conditions.  There are currently three registerable specialities:\n\nAdditional supply speciality  - to write orders for, and supply in an emergency, a range of drugs in addition to those ordered or supplied by a normal optometrist.\nSupplementary prescribing speciality  -  to manage a patient's clinical condition and prescribe medicines according to a clinical management plan set up in conjunction with an independent prescriber, such as a GP or ophthalmologist or qualified optometrist.\nIndependent prescribing specialty - to take responsibility for the clinical assessment of a patient, establish a diagnosis and determine the clinical management required, including prescribing where necessary.\n\n\n=== North America ===\n\n\n==== Canada ====\n\n\n===== Training =====\nIn Canada, Doctors of Optometry (O.D.) typically complete four years of undergraduate studies followed by four to five years of optometry studies (graduate level), accredited by the Accreditation Council on Optometric Education. There are two such schools of optometry located in Canada — the University of Waterloo and the Université de Montreal. Canada also recognizes degrees from the twenty US schools.\n\n\n===== Licensing =====\nIn Canada, Doctors of Optometry must write national written and practical board exams. Additionally, optometrists are required to become licensed in the province in which they wish to practice. Regulation of professions is within provincial jurisdiction. Therefore, regulation of optometry is unique to individual provinces and territories. In Ontario, optometrists are licensed by the College of Optometrists of Ontario.\n\n\n===== Representation =====\nIn Canada, the profession is represented by the Canadian Association of Optometrists.  In the province of Ontario, the Ontario Association of Optometrists is the designated representative of optometrists to the provincial government.\n\n\n===== Scope of Practice =====\nOptometrists in Canada are trained and licensed to be primary eye care providers. They provide optical and medical eye care. They are able to diagnose and treat most eye diseases and can prescribe both topical and oral medications\n\n\n==== United States ====\nOptometrists are Doctors of Optometry (O.D.) who usually function as primary eye care providers. They provide comprehensive optical and medical eye care, but usually not surgery. They are trained and licensed to prescribe all topical medications (prescription eye drops), most oral medications, as well as administer diagnostic agents. In some states, optometrists may also be licensed to perform certain types of eye surgery.\n\n\n===== Scope of Practice =====\nOptometrists are Doctors of Optometry (O.D.) who may prescribe corrective lenses (glasses and contacts) to aid refractive errors (e.g., myopia, hyperopia, presbyopia, astigmatism, double vision). They manage vision development in children including amblyopia diagnosis/treatment. Some perform vision therapy. They are trained and state-licensed to diagnose and manage all eye diseases (by definition: ophthalmology - the branch of medicine diagnosing and treating eye disease) and their associations with systemic health. Optometrists can prescribe any topical medication (eye drops) and most oral medications (taken by mouth) including schedule controlled substances. Common eye conditions managed include infections (bacterial/viral), allergy, inflammation (uveitis), diabetic/hypertensive retinopathy, macular degeneration etc. They may also remove ocular foreign bodies and can order blood panels or imaging studies (CT/MRI). However, optometrists are not trained to perform invasive surgery (i.e. cataract surgery) like ophthalmologists are - which is the practical difference between the two professions, although in Oklahoma and Louisiana, optometrists may perform minor surgeries within the anterior segment of the eye. Moreover, legislation permits optometrists in Oklahoma and Kentucky to perform certain laser procedures. Optometrists may co-manage with other healthcare professionals when certain eye diseases are associated with underlying systemic causes eg: AIDS/HIV, neuro, rheumatology, oncology. \nOphthalmologists are Doctors of Medicine (MD/DO) who usually provide speciality eye care - their training is heavily focused on surgery (hence longer program than Optometry). In modern times, many Ophthalmologists choose to pursue fellowship training and specialize in one or more particular areas of the eye: eg: cornea, retina, glaucoma, strabismus, oculoplastics. Moreover, they typically deal with a late-stage eye disease which often can only be managed with surgery. \nOpticians are not doctors; however, they are an important part of eye care. They are trained and licensed to cut, fit and adjust eyeglass frames/lenses. They are experts in lens types and wearing modalities: eg. progressive, bifocal, single vision, lens index, coatings.\n\n\n===== Regulation =====\nDoctors of optometry in the United States are regulated by state boards, which vary from state to state. \nThe Association of Regulatory Boards of Optometry (ARBO) assists these state board licensing agencies in regulating the practice of optometry.\n\n\n===== Licensing =====\nOptometrists must complete all course work and graduate from an accredited College of Optometry. This includes passage of all parts of the national board examinations as well as local jurisprudence examinations, which vary by state.\n\n\n===== Education and Training =====\nDoctors of Optometry (O.D.) (Optometrist) typically complete four years of undergraduate studies followed by four years of Optometry school. Some complete an optional year of additional training. Optometry's program is highly specific to the eyes and related structures. Optometrists receive their medical eye training in optometry school. Training takes place in colleges of optometry, hospitals, clinics and private practices. Instructors may be optometrists, ophthalmologists, or professors (Ph.D.). The program includes classroom and clinical training in geometric, physical, physiological and ophthalmic optics, speciality contact lens evaluation, general anatomy, ocular anatomy, ocular disease, pharmacology, ocular pharmacology, neuroanatomy and neurophysiology of the visual system, pediatric visual development, gerontology, binocular vision, color vision, form, space, movement and vision perception, systemic disease, histology, microbiology, sensory and perceptual psychology, biochemistry, statistics and epidemiology.Optometrists are required to obtain continuing education credit hours to maintain licensure.\n\n\n=== Oceania ===\n\n\n==== Australia ====\nAustralia currently has five recognized courses in optometry, and one course seeking to obtain accreditation with the Optometry council of Australia and New Zealand :\n\nBachelor of Vision Science and Master of Optometry (BVisSci MOptom), Deakin University\nBachelor of Medical Science (Vision Science) and Master of Optometry, Flinders University\nBachelor of Vision Science and Master of Clinical Optometry (BVisSc MClinOptom), University of New South Wales\nBachelor of Vision Science and Master of Optometry, Queensland University of Technology\nDoctor of Optometry, Melbourne University (post-graduate)\nBachelor of Vision Science and Master of Optometry, University of Canberra (Seeking accreditation)To support these courses the Australian College of Optometry provides clinical placements to undergraduate students from Australian Universities and abroad.\nin 2016, almost 5000 optometrists in general practice were licensed with their regulatory body, the Optometry Board of Australia.  Of these, approximately 2300 were registered with the scheduled medicines endorsement, which enables them to prescribe some medicines for the treatment of conditions of the eye.\n\n\n==== New Zealand ====\nNew Zealand currently has one recognised course in optometry:\n\nBachelor of Optometry (BOptom), The University of AucklandIn July 2014, the Medicines Amendment Act 2013 and Misuse of Drugs Amendment Regulations 2014 came into effect.  Among other things, the changes to the Act name optometrists as authorised prescribers.  This change enables optometrists with a therapeutic pharmaceutical agent (TPA) endorsement to prescribe all medicines appropriate to their scope of practice, rather than limiting them to a list of medicines specified in the regulation; this recognises the safe and appropriate prescribing practice of optometrists over the previous nine years.\n\n\n=== South America ===\n\n\n==== Brazil ====\nThe Brazilian Government does not state rules about optometry, and the Brazilian Council of Ophthalmology recommends against its official legal recognition.The CBOO (Brazilian Council of Optics and Optometry), which is affiliated to the WCO (World Council of Optometry), represents Brazilian optometrists. In conjunction with organizations representative weight of Brazilian companies, including the National Commerce Confederation for goods, services and tourism (CNC), through the CBÓptica/CNC, its defence arm of the optometric and optical industry, are defending the right of free and independent practice of optometrists, even if it is against the interests of ophthalmologists.\nThe Federal Supreme Court (STF), the Brazilian Court of Justice and the Superior Court of Justice (STJ), another important National Court, ruled several processes granting inquestionable victories to ophthalmologists.\nIn Brazilian law, however, there is an explicit recommendation that the one prescribing corrective lenses are prohibited to sell them. This restricting rule to the ophthalmologists has to keep the optic shops away from Hospitals and Eye Care Clinics since 1930, and it has to be reviewed before any further regulation for the optometrists.\n\n\n==== Colombia ====\nIn Colombia, optometry education has been accredited by the Ministry of Health. The last official revision to the laws regarding healthcare standards in the country was issued in 1992 through the Law 30. Currently there are eight official universities that are entitled by ICFES to grant the optometrist certification. The first optometrists arrived in the country from North America and Europe circa 1914. These professionals specialized in optics and refraction. In 1933, under Decrees 449 and 1291, the Colombian Government officially set the rules for the formation of professionals in the field of optometry. In 1966 La Salle University opened its first Faculty of Optometry after a recommendation from a group of professionals. At present optometrists are encouraged to keep up with new technologies through congresses and scholarships granted by the government or the private sector (such as Bausch & Lomb).\n\n\n== See also ==\nWorld Council of Optometry\nAmerican Academy of Optometry\nBehavioral optometry\nEyeglass prescription\nLeast distance of distinct vision\nOphthalmology\nVisual neuroscience\n\n\n== References ==\n\n\n== Sources ==\nhttp://www.oregonoptometry.org\nhttp://oaop.org/oaop\nhttp://idaho.aoa.org\nhttps://web.archive.org/web/20131021065719/http://washington.aoa.org/\nhttp://www.njsop.org/aws/NJSOP/pt/sp/home_page\nhttp://www.ijo.in/article.asp?issn=0301-4738;year=2012;volume=60;issue=5;spage=401;epage=405;aulast=De\nhttps://www2.aston.ac.uk/study/courses/doctor-of-optometry\n\n\n== External links ==\nDMOZ optometry page", "chinese_title": "", "chinese": ""}