{"topic": "Wikipedia", "english_title": "Wikipedia", "english": "Wikipedia ( (listen) wik-ih-PEE-dee-ə or  (listen) wik-ee-) is a free, multilingual online encyclopedia written and maintained by a community of volunteer contributors through a model of open collaboration, using a wiki-based editing system. Wikipedia is the largest and most-read reference work in history, and is consistently one of the 15 most popular websites as ranked by Alexa; as of 2021, it ranked as the 13th most popular site. The project carries no advertisements and is hosted by the Wikimedia Foundation, an American non-profit organization funded mainly through individual donations.Wikipedia was launched on January 15, 2001, by Jimmy Wales and Larry Sanger; Sanger coined its name as a portmanteau of \"wiki\" and \"encyclopedia\". Initially available only in English, versions in other languages were quickly developed. The English Wikipedia, with 6.3 million articles as of June 2021, is the largest of the 321 language editions. Combined, Wikipedia's editions comprise more than 56 million articles, and attract more than 17 million edits and more than 1.7 billion unique visitors per month.Wikipedia has received praise for its enablement of the democratization of knowledge, extent of coverage, unique structure, culture, and reduced amount of commercial bias, but has also been criticized for its perceived unreliability and for exhibiting systemic bias, namely geographical bias, racial bias, gender bias against women, and alleged ideological bias. Its coverage of American politics and of the COVID-19 pandemic have received substantial media attention. At various points, Wikipedia has been censored by world governments, ranging from the blocking of specific pages to bans on the entire site. Wikipedia has become an element of popular culture, with references in books, films and academic studies. In 2006, Time magazine stated that the policy of allowing anyone to edit had made Wikipedia the \"biggest (and perhaps best) encyclopedia in the world\", and is \"a testament to the vision of one man, Jimmy Wales\". In 2018, Facebook and YouTube announced that they would help users detect fake news by suggesting fact-checking links to related Wikipedia articles.\n\n\n== History ==\n\n\n=== Nupedia ===\n\nOther collaborative online encyclopedias were attempted before Wikipedia, but none were as successful. Wikipedia began as a complementary project for Nupedia, a free online English-language encyclopedia project whose articles were written by experts and reviewed under a formal process. It was founded on March 9, 2000, under the ownership of Bomis, a web portal company. Its main figures were Bomis CEO Jimmy Wales and Larry Sanger, editor-in-chief for Nupedia and later Wikipedia. Nupedia was initially licensed under its own Nupedia Open Content License, but even before Wikipedia was founded, Nupedia switched to the GNU Free Documentation License at the urging of Richard Stallman. Wales is credited with defining the goal of making a publicly editable encyclopedia, while Sanger is credited with the strategy of using a wiki to reach that goal. On January 10, 2001, Sanger proposed on the Nupedia mailing list to create a wiki as a \"feeder\" project for Nupedia.\n\n\n=== Launch and early growth ===\nThe domains wikipedia.com (redirecting to wikipedia.org) and wikipedia.org were registered on January 12, 2001, and January 13, 2001, respectively, and Wikipedia was launched on January 15, 2001, as a single English-language edition at www.wikipedia.com, and announced by Sanger on the Nupedia mailing list. Wikipedia's policy of \"neutral point-of-view\" was codified in its first few months. Otherwise, there were relatively few rules initially and Wikipedia operated independently of Nupedia. Originally, Bomis intended to make Wikipedia a business for profit.\n\nWikipedia gained early contributors from Nupedia, Slashdot postings, and web search engine indexing. Language editions were also created, with a total of 161 by the end of 2004. Nupedia and Wikipedia coexisted until the former's servers were taken down permanently in 2003, and its text was incorporated into Wikipedia. The English Wikipedia passed the mark of two million articles on September 9, 2007, making it the largest encyclopedia ever assembled, surpassing the Yongle Encyclopedia made during the Ming Dynasty in 1408, which had held the record for almost 600 years.Citing fears of commercial advertising and lack of control in Wikipedia, users of the Spanish Wikipedia forked from Wikipedia to create the Enciclopedia Libre in February 2002. Wales then announced that Wikipedia would not display advertisements, and changed Wikipedia's domain from wikipedia.com to wikipedia.org.Though the English Wikipedia reached three million articles in August 2009, the growth of the edition, in terms of the numbers of new articles and of contributors, appears to have peaked around early 2007. Around 1,800 articles were added daily to the encyclopedia in 2006; by 2013 that average was roughly 800. A team at the Palo Alto Research Center attributed this slowing of growth to the project's increasing exclusivity and resistance to change. Others suggest that the growth is flattening naturally because articles that could be called \"low-hanging fruit\"—topics that clearly merit an article—have already been created and built up extensively.\nIn November 2009, a researcher at the Rey Juan Carlos University in Madrid found that the English Wikipedia had lost 49,000 editors during the first three months of 2009; in comparison, the project lost only 4,900 editors during the same period in 2008. The Wall Street Journal cited the array of rules applied to editing and disputes related to such content among the reasons for this trend. Wales disputed these claims in 2009, denying the decline and questioning the methodology of the study. Two years later, in 2011, Wales acknowledged the presence of a slight decline, noting a decrease from \"a little more than 36,000 writers\" in June 2010 to 35,800 in June 2011. In the same interview, Wales also claimed the number of editors was \"stable and sustainable\". A 2013 article titled \"The Decline of Wikipedia\" in MIT Technology Review questioned this claim. The article revealed that since 2007, Wikipedia had lost a third of its volunteer editors, and those still there have focused increasingly on minutiae. In July 2012, The Atlantic reported that the number of administrators is also in decline. In the November 25, 2013, issue of New York magazine, Katherine Ward stated \"Wikipedia, the sixth-most-used website, is facing an internal crisis\".\n\n\n=== Milestones ===\n\nIn January 2007, Wikipedia entered for the first time the top-ten list of the most popular websites in the US, according to comscore Networks. With 42.9 million unique visitors, Wikipedia was ranked at number 9, surpassing The New York Times (No. 10) and Apple (No. 11). This marked a significant increase over January 2006, when the rank was 33rd, with Wikipedia receiving around 18.3 million unique visitors. As of March 2020, Wikipedia ranked 13th among websites in terms of popularity according to Alexa Internet. In 2014, it received eight billion page views every month. On February 9, 2014, The New York Times reported that Wikipedia has 18 billion page views and nearly 500 million unique visitors a month, \"according to the ratings firm comScore\". Loveland and Reagle argue that, in process, Wikipedia follows a long tradition of historical encyclopedias that accumulated improvements piecemeal through \"stigmergic accumulation\". \nOn January 18, 2012, the English Wikipedia participated in a series of coordinated protests against two proposed laws in the United States Congress—the Stop Online Piracy Act (SOPA) and the PROTECT IP Act (PIPA)—by blacking out its pages for 24 hours. More than 162 million people viewed the blackout explanation page that temporarily replaced Wikipedia content.On January 20, 2014, Subodh Varma reporting for The Economic Times indicated that not only had Wikipedia's growth stalled, it \"had lost nearly ten percent of its page views last year. There was a decline of about two billion between December 2012 and December 2013. Its most popular versions are leading the slide: page-views of the English Wikipedia declined by twelve percent, those of German version slid by 17 percent and the Japanese version lost nine percent.\" Varma added that \"While Wikipedia's managers think that this could be due to errors in counting, other experts feel that Google's Knowledge Graphs project launched last year may be gobbling up Wikipedia users.\" When contacted on this matter, Clay Shirky, associate professor at New York University and fellow at Harvard's Berkman Klein Center for Internet & Society indicated that he suspected much of the page view decline was due to Knowledge Graphs, stating, \"If you can get your question answered from the search page, you don't need to click [any further].\" By the end of December 2016, Wikipedia was ranked fifth in the most popular websites globally.In January 2013, 274301 Wikipedia, an asteroid, was named after Wikipedia; in October 2014, Wikipedia was honored with the Wikipedia Monument; and, in July 2015, 106 of the 7,473 700-page volumes of Wikipedia became available as Print Wikipedia. In April 2019, an Israeli lunar lander, Beresheet, crash landed on the surface of the Moon carrying a copy of nearly all of the English Wikipedia engraved on thin nickel plates; experts say the plates likely survived the crash. In June 2019, scientists reported that all 16 GB of article text from the English Wikipedia have been encoded into synthetic DNA.\n\n\n== Openness ==\n\nUnlike traditional encyclopedias, Wikipedia follows the procrastination principle regarding the security of its content. It started almost entirely open—anyone could create articles, and any Wikipedia article could be edited by any reader, even those who did not have a Wikipedia account. Modifications to all articles would be published immediately. As a result, any article could contain inaccuracies such as errors, ideological biases, and nonsensical or irrelevant text.\n\n\n=== Restrictions ===\nDue to the increasing popularity of Wikipedia, some editions, including the English version, have introduced editing restrictions for certain cases. For instance, on the English Wikipedia and some other language editions, only registered users may create a new article. On the English Wikipedia, among others, particularly controversial, sensitive or vandalism-prone pages have been protected to varying degrees. A frequently vandalized article can be \"semi-protected\" or \"extended confirmed protected\", meaning that only \"autoconfirmed\" or \"extended confirmed\" editors are able to modify it. A particularly contentious article may be locked so that only administrators are able to make changes. A 2021 article in the Columbia Journalism Review identified Wikipedia's page protection policies as \"[p]erhaps the most important\" means at Wikipedia's disposal to \"regulate its market of ideas\".In certain cases, all editors are allowed to submit modifications, but review is required for some editors, depending on certain conditions. For example, the German Wikipedia maintains \"stable versions\" of articles, which have passed certain reviews. Following protracted trials and community discussion, the English Wikipedia introduced the \"pending changes\" system in December 2012. Under this system, new and unregistered users' edits to certain controversial or vandalism-prone articles are reviewed by established users before they are published.\n\n\n=== Review of changes ===\nAlthough changes are not systematically reviewed, the software that powers Wikipedia provides tools allowing anyone to review changes made by others. The \"History\" page of each article links to each revision. On most articles, anyone can undo others' changes by clicking a link on the article's history page. Anyone can view the latest changes to articles, and anyone registered  may maintain a \"watchlist\" of articles that interest them so they can be notified of any changes. \"New pages patrol\" is a process whereby newly created articles are checked for obvious problems.In 2003, economics Ph.D. student Andrea Ciffolilli argued that the low transaction costs of participating in a wiki create a catalyst for collaborative development, and that features such as allowing easy access to past versions of a page favor \"creative construction\" over \"creative destruction\".\n\n\n=== Vandalism ===\n\nAny change or edit that manipulates content in a way that purposefully compromises the integrity of Wikipedia is considered vandalism. The most common and obvious types of vandalism include additions of obscenities and crude humor. Vandalism can also include advertising and other types of spam. Sometimes editors commit vandalism by removing content or entirely blanking a given page. Less common types of vandalism, such as the deliberate addition of plausible but false information to an article can be more difficult to detect. Vandals can introduce irrelevant formatting, modify page semantics such as the page's title or categorization, manipulate the underlying code of an article, or use images disruptively.\n\nObvious vandalism is generally easy to remove from Wikipedia articles; the median time to detect and fix vandalism is a few minutes. However, some vandalism takes much longer to repair.In the Seigenthaler biography incident, an anonymous editor introduced false information into the biography of American political figure John Seigenthaler in May 2005. Seigenthaler was falsely presented as a suspect in the assassination of John F. Kennedy. The article remained uncorrected for four months. Seigenthaler, the founding editorial director of USA Today and founder of the Freedom Forum First Amendment Center at Vanderbilt University, called Wikipedia co-founder Jimmy Wales and asked whether he had any way of knowing who contributed the misinformation. Wales replied that he did not, although the perpetrator was eventually traced. After the incident, Seigenthaler described Wikipedia as \"a flawed and irresponsible research tool\". This incident led to policy changes at Wikipedia, specifically targeted at tightening up the verifiability of biographical articles of living people.In 2010, Daniel Tosh encouraged viewers of his show, Tosh.0, to visit the show's Wikipedia article and edit it at will. On a later episode, he commented on the edits to the article, most of them offensive, which had been made by the audience and had prompted the article to be locked from editing.\n\n\n=== Edit warring ===\nWikipedians often have disputes regarding content, which may result in repeatedly making opposite changes to an article, known as \"edit warring\". The process is widely seen as a resource-consuming scenario where no useful knowledge is added. This practice is also criticized as creating a competitive, conflict based editing culture associated with traditional masculine gender roles, which contributes to the gender bias on Wikipedia.\n\n\n== Policies and laws ==\n\nContent in Wikipedia is subject to the laws (in particular, copyright laws) of the United States and of the US state of Virginia, where the majority of Wikipedia's servers are located. Beyond legal matters, the editorial principles of Wikipedia are embodied in the \"five pillars\" and in numerous policies and guidelines intended to appropriately shape content. Even these rules are stored in wiki form, and Wikipedia editors write and revise the website's policies and guidelines. Editors can enforce these rules by deleting or modifying non-compliant material. Originally, rules on the non-English editions of Wikipedia were based on a translation of the rules for the English Wikipedia. They have since diverged to some extent.\n\n\n=== Content policies and guidelines ===\nAccording to the rules on the English Wikipedia, each entry in Wikipedia must be about a topic that is encyclopedic and is not a dictionary entry or dictionary-style. A topic should also meet Wikipedia's standards of \"notability\", which generally means that the topic must have been covered in mainstream media or major academic journal sources that are independent of the article's subject. Further, Wikipedia intends to convey only knowledge that is already established and recognized. It must not present original research. A claim that is likely to be challenged requires a reference to a reliable source. Among Wikipedia editors, this is often phrased as \"verifiability, not truth\" to express the idea that the readers, not the encyclopedia, are ultimately responsible for checking the truthfulness of the articles and making their own interpretations. This can at times lead to the removal of information that, though valid, is not properly sourced. Finally, Wikipedia must not take sides. All opinions and viewpoints, if attributable to external sources, must enjoy an appropriate share of coverage within an article. This is known as a \"neutral point of view\" (NPOV).\n\n\n== Governance ==\n\nWikipedia's initial anarchy integrated democratic and hierarchical elements over time. An article is not considered to be owned by its creator or any other editor, nor by the subject of the article.\n\n\n=== Administrators ===\nEditors in good standing in the community can run for one of many levels of volunteer stewardship: this begins with \"administrator\", privileged users who can delete pages, prevent articles from being changed in case of vandalism or editorial disputes (setting protective measures on articles), and try to prevent certain people from editing. Despite the name, administrators are not supposed to enjoy any special privilege in decision-making; instead, their powers are mostly limited to making edits that have project-wide effects and thus are disallowed to ordinary editors, and to implement restrictions intended to prevent certain persons from making disruptive edits (such as vandalism).By 2012, fewer editors were becoming administrators than in earlier years, in part because the process of vetting potential Wikipedia administrators had become more rigorous.Bureaucrats name new administrators solely upon the recommendations from the community.\n\n\n=== Dispute resolution ===\nOver time, Wikipedia has developed a semi-formal dispute resolution process to assist in such circumstances. To determine community consensus, editors can raise issues at appropriate community forums, or seek outside input through third opinion requests or by initiating a more general community discussion known as a \"request for comment\".\n\n\n==== Arbitration Committee ====\n\nThe Arbitration Committee presides over the ultimate dispute resolution process. Although disputes usually arise from a disagreement between two opposing views on how an article should read, the Arbitration Committee explicitly refuses to directly rule on the specific view that should be adopted. Statistical analyses suggest that the committee ignores the content of disputes and rather focuses on the way disputes are conducted, functioning not so much to resolve disputes and make peace between conflicting editors, but to weed out problematic editors while allowing potentially productive editors back in to participate. Therefore, the committee does not dictate the content of articles, although it sometimes condemns content changes when it deems the new content violates Wikipedia policies (for example, if the new content is considered biased). Its remedies include cautions and probations (used in 63% of cases) and banning editors from articles (43%), subject matters (23%), or Wikipedia (16%). Complete bans from Wikipedia are generally limited to instances of impersonation and anti-social behavior. When conduct is not impersonation or anti-social, but rather anti-consensus or in violation of editing policies, remedies tend to be limited to warnings.\n\n\n== Community ==\n\nEach article and each user of Wikipedia has an associated \"talk\" page. These form the primary communication channel for editors to discuss, coordinate and debate.\n\nWikipedia's community has been described as cultlike, although not always with entirely negative connotations. The project's preference for cohesiveness, even if it requires compromise that includes disregard of credentials, has been referred to as \"anti-elitism\".Wikipedians sometimes award one another \"virtual barnstars\" for good work. These personalized tokens of appreciation reveal a wide range of valued work extending far beyond simple editing to include social support, administrative actions, and types of articulation work.Wikipedia does not require that its editors and contributors provide identification. As Wikipedia grew, \"Who writes Wikipedia?\" became one of the questions frequently asked on the project. Jimmy Wales once argued that only \"a community ... a dedicated group of a few hundred volunteers\" makes the bulk of contributions to Wikipedia and that the project is therefore \"much like any traditional organization\". In 2008, a Slate magazine article reported that: \"According to researchers in Palo Alto, one percent of Wikipedia users are responsible for about half of the site's edits.\" This method of evaluating contributions was later disputed by Aaron Swartz, who noted that several articles he sampled had large portions of their content (measured by number of characters) contributed by users with low edit counts.\nThe English Wikipedia has 6,308,697 articles, 41,646,160 registered editors, and 135,801 active editors. An editor is considered active if they have made one or more edits in the past 30 days.\nEditors who fail to comply with Wikipedia cultural rituals, such as signing talk page comments, may implicitly signal that they are Wikipedia outsiders, increasing the odds that Wikipedia insiders may target or discount their contributions. Becoming a Wikipedia insider involves non-trivial costs: the contributor is expected to learn Wikipedia-specific technological codes, submit to a sometimes convoluted dispute resolution process, and learn a \"baffling culture rich with in-jokes and insider references\". Editors who do not log in are in some sense second-class citizens on Wikipedia, as \"participants are accredited by members of the wiki community, who have a vested interest in preserving the quality of the work product, on the basis of their ongoing participation\", but the contribution histories of anonymous unregistered editors recognized only by their IP addresses cannot be attributed to a particular editor with certainty.\n\n\n=== Studies ===\nA 2007 study by researchers from Dartmouth College found that \"anonymous and infrequent contributors to Wikipedia ... are as reliable a source of knowledge as those contributors who register with the site\". Jimmy Wales stated in 2009 that \"[I]t turns out over 50% of all the edits are done by just .7% of the users ... 524 people ... And in fact, the most active 2%, which is 1400 people, have done 73.4% of all the edits.\" However, Business Insider editor and journalist Henry Blodget showed in 2009 that in a random sample of articles, most content in Wikipedia (measured by the amount of contributed text that survives to the latest sampled edit) is created by \"outsiders\", while most editing and formatting is done by \"insiders\".A 2008 study found that Wikipedians were less agreeable, open, and conscientious than others, although a later commentary pointed out serious flaws, including that the data showed higher openness and that the differences with the control group and the samples were small. According to a 2009 study, there is \"evidence of growing resistance from the Wikipedia community to new content\".\n\n\n=== Diversity ===\nSeveral studies have shown that most of the Wikipedia contributors are male. Notably, the results of a Wikimedia Foundation survey in 2008 showed that only 13 percent of Wikipedia editors were female. Because of this, universities throughout the United States tried to encourage women to become Wikipedia contributors. Similarly, many of these universities, including Yale and Brown, gave college credit to students who create or edit an article relating to women in science or technology. Andrew Lih, a professor and scientist, wrote in The New York Times that the reason he thought the number of male contributors outnumbered the number of females so greatly was because identifying as a woman may expose oneself to \"ugly, intimidating behavior\". Data has shown that Africans are underrepresented among Wikipedia editors.\n\n\n== Language editions ==\n\nThere are currently 321 language editions of Wikipedia (also called language versions, or simply Wikipedias). As of June 2021, the six largest, in order of article count, are the English, Cebuano, Swedish, German, French, and Dutch Wikipedias. The second and third-largest Wikipedias owe their position to the article-creating bot Lsjbot, which as of 2013 had created about half the articles on the Swedish Wikipedia, and most of the articles in the Cebuano and Waray Wikipedias. The latter are both languages of the Philippines.\nIn addition to the top six, twelve other Wikipedias have more than a million articles each (Russian, Italian, Spanish, Polish, Egyptian Arabic, Japanese, Waray, Vietnamese, Chinese, Arabic, Ukrainian and Portuguese), seven more have over 500,000 articles (Persian, Catalan, Serbian, Indonesian, Norwegian, Korean and Finnish), 44 more have over 100,000, and 82 more have over 10,000. The largest, the English Wikipedia, has over 6.3 million articles. As of January 2021, the English Wikipedia receives 48% of Wikipedia's cumulative traffic, with the remaining split among the other languages. The top 10 editions represent approximately 85% of the total traffic.\nThe unit for the numbers in bars is articles.\n\nSince Wikipedia is based on the Web and therefore worldwide, contributors to the same language edition may use different dialects or may come from different countries (as is the case for the English edition). These differences may lead to some conflicts over spelling differences (e.g. colour versus color) or points of view.Though the various language editions are held to global policies such as \"neutral point of view\", they diverge on some points of policy and practice, most notably on whether images that are not licensed freely may be used under a claim of fair use.Jimmy Wales has described Wikipedia as \"an effort to create and distribute a free encyclopedia of the highest possible quality to every single person on the planet in their own language\". Though each language edition functions more or less independently, some efforts are made to supervise them all. They are coordinated in part by Meta-Wiki, the Wikimedia Foundation's wiki devoted to maintaining all its projects (Wikipedia and others). For instance, Meta-Wiki provides important statistics on all language editions of Wikipedia, and it maintains a list of articles every Wikipedia should have. The list concerns basic content by subject: biography, history, geography, society, culture, science, technology, and mathematics. It is not rare for articles strongly related to a particular language not to have counterparts in another edition. For example, articles about small towns in the United States might be available only in English, even when they meet the notability criteria of other language Wikipedia projects.\n\nTranslated articles represent only a small portion of articles in most editions, in part because those editions do not allow fully automated translation of articles. Articles available in more than one language may offer \"interwiki links\", which link to the counterpart articles in other editions.\nA study published by PLOS One in 2012 also estimated the share of contributions to different editions of Wikipedia from different regions of the world. It reported that the proportion of the edits made from North America was 51% for the English Wikipedia, and 25% for the simple English Wikipedia.\n\n\n=== English Wikipedia editor numbers ===\n\nOn March 1, 2014, The Economist, in an article titled \"The Future of Wikipedia\", cited a trend analysis concerning data published by the Wikimedia Foundation stating that \"[t]he number of editors for the English-language version has fallen by a third in seven years.\" The attrition rate for active editors in English Wikipedia was cited by The Economist as substantially in contrast to statistics for Wikipedia in other languages (non-English Wikipedia). The Economist reported that the number of contributors with an average of five or more edits per month was relatively constant since 2008 for Wikipedia in other languages at approximately 42,000 editors within narrow seasonal variances of about 2,000 editors up or down. The number of active editors in English Wikipedia, by sharp comparison, was cited as peaking in 2007 at approximately 50,000 and dropping to 30,000 by the start of 2014.\nIn contrast, the trend analysis published in The Economist presents Wikipedia in other languages (non-English Wikipedia) as successful in retaining their active editors on a renewable and sustained basis, with their numbers remaining relatively constant at approximately 42,000. No comment was made concerning which of the differentiated edit policy standards from Wikipedia in other languages (non-English Wikipedia) would provide a possible alternative to English Wikipedia for effectively ameliorating substantial editor attrition rates on the English-language Wikipedia.\n\n\n== Reception ==\n\nVarious Wikipedians have criticized Wikipedia's large and growing regulation, which includes more than fifty policies and nearly 150,000 words as of 2014.Critics have stated that Wikipedia exhibits systemic bias. In 2010, columnist and journalist Edwin Black described Wikipedia as being a mixture of \"truth, half-truth, and some falsehoods\". Articles in The Chronicle of Higher Education and The Journal of Academic Librarianship have criticized Wikipedia's Undue Weight policy, concluding that the fact that Wikipedia explicitly is not designed to provide correct information about a subject, but rather focus on all the major viewpoints on the subject, give less attention to minor ones, and creates omissions that can lead to false beliefs based on incomplete information.Journalists Oliver Kamm and Edwin Black alleged (in 2010 and 2011 respectively) that articles are dominated by the loudest and most persistent voices, usually by a group with an \"ax to grind\" on the topic. A 2008 article in Education Next Journal concluded that as a resource about controversial topics, Wikipedia is subject to manipulation and spin.In 2006, the Wikipedia Watch criticism website listed dozens of examples of plagiarism in the English Wikipedia.\n\n\n=== Accuracy of content ===\n\nArticles for traditional encyclopedias such as Encyclopædia Britannica are carefully and deliberately written by experts, lending such encyclopedias a reputation for accuracy. However, a peer review in 2005 of forty-two scientific entries on both Wikipedia and Encyclopædia Britannica by the science journal Nature found few differences in accuracy, and concluded that \"the average science entry in Wikipedia contained around four inaccuracies; Britannica, about three.\" Joseph Reagle suggested that while the study reflects \"a topical strength of Wikipedia contributors\" in science articles, \"Wikipedia may not have fared so well using a random sampling of articles or on humanities subjects.\" Others raised similar critiques. The findings by Nature were disputed by Encyclopædia Britannica, and in response, Nature gave a rebuttal of the points raised by Britannica. In addition to the point-for-point disagreement between these two parties, others have examined the sample size and selection method used in the Nature effort, and suggested a \"flawed study design\" (in Nature's manual selection of articles, in part or in whole, for comparison), absence of statistical analysis (e.g., of reported confidence intervals), and a lack of study \"statistical power\" (i.e., owing to small sample size, 42 or 4 × 101 articles compared, vs >105 and >106 set sizes for Britannica and the English Wikipedia, respectively).As a consequence of the open structure, Wikipedia \"makes no guarantee of validity\" of its content, since no one is ultimately responsible for any claims appearing in it. Concerns have been raised by PC World in 2009 regarding the lack of accountability that results from users' anonymity, the insertion of false information, vandalism, and similar problems.\nEconomist Tyler Cowen wrote: \"If I had to guess whether Wikipedia or the median refereed journal article on economics was more likely to be true after a not so long think I would opt for Wikipedia.\" He comments that some traditional sources of non-fiction suffer from systemic biases, and novel results, in his opinion, are over-reported in journal articles as well as relevant information being omitted from news reports. However, he also cautions that errors are frequently found on Internet sites and that academics and experts must be vigilant in correcting them.Critics argue that Wikipedia's open nature and a lack of proper sources for most of the information makes it unreliable. Some commentators suggest that Wikipedia may be reliable, but that the reliability of any given article is not clear. Editors of traditional reference works such as the Encyclopædia Britannica have questioned the project's utility and status as an encyclopedia. Wikipedia co-founder Jimmy Wales has claimed that Wikipedia has largely avoided the problem of \"fake news\" because the Wikipedia community regularly debates the quality of sources in articles.\nWikipedia's open structure inherently makes it an easy target for Internet trolls, spammers, and various forms of paid advocacy seen as counterproductive to the maintenance of a neutral and verifiable online encyclopedia.\nIn response to paid advocacy editing and undisclosed editing issues, Wikipedia was reported in an article in The Wall Street Journal, to have strengthened its rules and laws against undisclosed editing. The article stated that: \"Beginning Monday [from the date of the article, June 16, 2014], changes in Wikipedia's terms of use will require anyone paid to edit articles to disclose that arrangement. Katherine Maher, the nonprofit Wikimedia Foundation's chief communications officer, said the changes address a sentiment among volunteer editors that, 'we're not an advertising service; we're an encyclopedia.'\" These issues, among others, had been parodied since the first decade of Wikipedia, notably by Stephen Colbert on The Colbert Report.A Harvard law textbook, Legal Research in a Nutshell (2011), cites Wikipedia as a \"general source\" that \"can be a real boon\" in \"coming up to speed in the law governing a situation\" and, \"while not authoritative, can provide basic facts as well as leads to more in-depth resources\".\n\n\n=== Discouragement in education ===\nMost university lecturers discourage students from citing any encyclopedia in academic work, preferring primary sources; some specifically prohibit Wikipedia citations. Wales stresses that encyclopedias of any type are not usually appropriate to use as citable sources, and should not be relied upon as authoritative. Wales once (2006 or earlier) said he receives about ten emails weekly from students saying they got failing grades on papers because they cited Wikipedia; he told the students they got what they deserved. \"For God's sake, you're in college; don't cite the encyclopedia,\" he said.In February 2007, an article in The Harvard Crimson newspaper reported that a few of the professors at Harvard University were including Wikipedia articles in their syllabi, although without realizing the articles might change. In June 2007, former president of the American Library Association Michael Gorman condemned Wikipedia, along with Google, stating that academics who endorse the use of Wikipedia are \"the intellectual equivalent of a dietitian who recommends a steady diet of Big Macs with everything\".\nIn contrast, academic writing in Wikipedia has evolved in recent years and has been found to increase student interest, personal connection to the product, creativity in material processing, and international collaboration in the learning process.\n\n\n==== Medical information ====\n\nOn March 5, 2014, Julie Beck writing for The Atlantic magazine in an article titled \"Doctors' #1 Source for Healthcare Information: Wikipedia\", stated that \"Fifty percent of physicians look up conditions on the (Wikipedia) site, and some are editing articles themselves to improve the quality of available information.\" Beck continued to detail in this article new programs of Amin Azzam at the University of San Francisco to offer medical school courses to medical students for learning to edit and improve Wikipedia articles on health-related issues, as well as internal quality control programs within Wikipedia organized by James Heilman to improve a group of 200 health-related articles of central medical importance up to Wikipedia's highest standard of articles using its Featured Article and Good Article peer-review evaluation process. In a May 7, 2014, follow-up article in The Atlantic titled \"Can Wikipedia Ever Be a Definitive Medical Text?\", Julie Beck quotes WikiProject Medicine's James Heilman as stating: \"Just because a reference is peer-reviewed doesn't mean it's a high-quality reference.\" Beck added that: \"Wikipedia has its own peer review process before articles can be classified as 'good' or 'featured'. Heilman, who has participated in that process before, says 'less than one percent' of Wikipedia's medical articles have passed.\"\n\n\n=== Quality of writing ===\n\nIn 2008, researchers at Carnegie Mellon University found that the quality of a Wikipedia article would suffer rather than gain from adding more writers when the article lacked appropriate explicit or implicit coordination. For instance, when contributors rewrite small portions of an entry rather than making full-length revisions, high- and low-quality content may be intermingled within an entry. Roy Rosenzweig, a history professor, stated that American National Biography Online outperformed Wikipedia in terms of its \"clear and engaging prose\", which, he said, was an important aspect of good historical writing. Contrasting Wikipedia's treatment of Abraham Lincoln to that of Civil War historian James McPherson in American National Biography Online, he said that both were essentially accurate and covered the major episodes in Lincoln's life, but praised \"McPherson's richer contextualization ... his artful use of quotations to capture Lincoln's voice ... and ... his ability to convey a profound message in a handful of words.\" By contrast, he gives an example of Wikipedia's prose that he finds \"both verbose and dull\". Rosenzweig also criticized the \"waffling—encouraged by the NPOV policy—[which] means that it is hard to discern any overall interpretive stance in Wikipedia history\". While generally praising the article on William Clarke Quantrill, he quoted its conclusion as an example of such \"waffling\", which then stated: \"Some historians ... remember him as an opportunistic, bloodthirsty outlaw, while others continue to view him as a daring soldier and local folk hero.\"Other critics have made similar charges that, even if Wikipedia articles are factually accurate, they are often written in a poor, almost unreadable style. Frequent Wikipedia critic Andrew Orlowski commented, \"Even when a Wikipedia entry is 100 percent factually correct, and those facts have been carefully chosen, it all too often reads as if it has been translated from one language to another then into a third, passing an illiterate translator at each stage.\" A study of Wikipedia articles on cancer was conducted in 2010 by Yaacov Lawrence of the Kimmel Cancer Center at Thomas Jefferson University. The study was limited to those articles that could be found in the Physician Data Query and excluded those written at the \"start\" class or \"stub\" class level. Lawrence found the articles accurate but not very readable, and thought that \"Wikipedia's lack of readability (to non-college readers) may reflect its varied origins and haphazard editing\". The Economist argued that better-written articles tend to be more reliable: \"inelegant or ranting prose usually reflects muddled thoughts and incomplete information\".\n\n\n=== Coverage of topics and systemic bias ===\n\nWikipedia seeks to create a summary of all human knowledge in the form of an online encyclopedia, with each topic covered encyclopedically in one article. Since it has terabytes of disk space, it can have far more topics than can be covered by any printed encyclopedia. The exact degree and manner of coverage on Wikipedia is under constant review by its editors, and disagreements are not uncommon (see deletionism and inclusionism). Wikipedia contains materials that some people may find objectionable, offensive, or pornographic. The \"Wikipedia is not censored\" policy has sometimes proved controversial: in 2008, Wikipedia rejected an online petition against the inclusion of images of Muhammad in the English edition of its Muhammad article, citing this policy. The presence of politically, religiously, and pornographically sensitive materials in Wikipedia has led to the censorship of Wikipedia by national authorities in China and Pakistan, amongst other countries.\n\nA 2008 study conducted by researchers at Carnegie Mellon University and Palo Alto Research Center gave a distribution of topics as well as growth (from July 2006 to January 2008) in each field:\nCulture and the arts: 30% (210%)\nBiographies and persons: 15% (97%)\nGeography and places: 14% (52%)\nSociety and social sciences: 12% (83%)\nHistory and events: 11% (143%)\nNatural and physical sciences: 9% (213%)\nTechnology and the applied sciences: 4% (−6%)\nReligions and belief systems: 2% (38%)\nHealth: 2% (42%)\nMathematics and logic: 1% (146%)\nThought and philosophy: 1% (160%)These numbers refer only to the number of articles: it is possible for one topic to contain a large number of short articles and another to contain a small number of large ones. Through its \"Wikipedia Loves Libraries\" program, Wikipedia has partnered with major public libraries such as the New York Public Library for the Performing Arts to expand its coverage of underrepresented subjects and articles.A 2011 study conducted by researchers at the University of Minnesota indicated that male and female editors focus on different coverage topics. There was a greater concentration of females in the \"people and arts\" category, while males focus more on \"geography and science\".\n\n\n==== Coverage of topics and selection bias ====\nResearch conducted by Mark Graham of the Oxford Internet Institute in 2009 indicated that the geographic distribution of article topics is highly uneven. Africa is the most underrepresented. Across 30 language editions of Wikipedia, historical articles and sections are generally Eurocentric and focused on recent events.An editorial in The Guardian in 2014 claimed that more effort went into providing references for a list of female porn actors than a list of women writers. Data has also shown that Africa-related material often faces omission; a knowledge gap that a July 2018 Wikimedia conference in Cape Town sought to address.\n\n\n==== Systemic bias ====\nWhen multiple editors contribute to one topic or set of topics, systemic bias may arise, due to the demographic backgrounds of the editors. In 2011, Wales claimed that the unevenness of coverage is a reflection of the demography of the editors, citing for example \"biographies of famous women through history and issues surrounding early childcare\". The October 22, 2013, essay by Tom Simonite in MIT's Technology Review titled \"The Decline of Wikipedia\" discussed the effect of systemic bias and policy creep on the downward trend in the number of editors.Systemic bias on Wikipedia may follow that of culture generally, for example favoring certain nationalities, ethnicities or majority religions. It may more specifically follow the biases of Internet culture, inclining to be young, male, English-speaking, educated, technologically aware, and wealthy enough to spare time for editing. Biases, intrinsically, may include an overemphasis on topics such as pop culture, technology, and current events.Taha Yasseri of the University of Oxford, in 2013, studied the statistical trends of systemic bias at Wikipedia introduced by editing conflicts and their resolution. His research examined the counterproductive work behavior of edit warring. Yasseri contended that simple reverts or \"undo\" operations were not the most significant measure of counterproductive behavior at Wikipedia and relied instead on the statistical measurement of detecting \"reverting/reverted pairs\" or \"mutually reverting edit pairs\". Such a \"mutually reverting edit pair\" is defined where one editor reverts the edit of another editor who then, in sequence, returns to revert the first editor in the \"mutually reverting edit pairs\". The results were tabulated for several language versions of Wikipedia. The English Wikipedia's three largest conflict rates belonged to the articles George W. Bush, anarchism, and Muhammad. By comparison, for the German Wikipedia, the three largest conflict rates at the time of the Oxford study were for the articles covering Croatia, Scientology, and 9/11 conspiracy theories.Researchers from Washington University developed a statistical model to measure systematic bias in the behavior of Wikipedia's users regarding controversial topics. The authors focused on behavioral changes of the encyclopedia's administrators after assuming the post, writing that systematic bias occurred after the fact.\n\n\n=== Explicit content ===\n\nWikipedia has been criticized for allowing information about graphic content. Articles depicting what some critics have called objectionable content (such as feces, cadaver, human penis, vulva, and nudity) contain graphic pictures and detailed information easily available to anyone with access to the internet, including children.\nThe site also includes sexual content such as images and videos of masturbation and ejaculation, illustrations of zoophilia, and photos from hardcore pornographic films in its articles. It also has non-sexual photographs of nude children.\nThe Wikipedia article about Virgin Killer—a 1976 album from the German rock band Scorpions—features a picture of the album's original cover, which depicts a naked prepubescent girl. The original release cover caused controversy and was replaced in some countries. In December 2008, access to the Wikipedia article Virgin Killer was blocked for four days by most Internet service providers in the United Kingdom after the Internet Watch Foundation (IWF) decided the album cover was a potentially illegal indecent image and added the article's URL to a \"blacklist\" it supplies to British internet service providers.In April 2010, Sanger wrote a letter to the Federal Bureau of Investigation, outlining his concerns that two categories of images on Wikimedia Commons contained child pornography, and were in violation of US federal obscenity law. Sanger later clarified that the images, which were related to pedophilia and one about lolicon, were not of real children, but said that they constituted \"obscene visual representations of the sexual abuse of children\", under the PROTECT Act of 2003. That law bans photographic child pornography and cartoon images and drawings of children that are obscene under American law. Sanger also expressed concerns about access to the images on Wikipedia in schools. Wikimedia Foundation spokesman Jay Walsh strongly rejected Sanger's accusation, saying that Wikipedia did not have \"material we would deem to be illegal. If we did, we would remove it.\" Following the complaint by Sanger, Wales deleted sexual images without consulting the community. After some editors who volunteer to maintain the site argued that the decision to delete had been made hastily, Wales voluntarily gave up some of the powers he had held up to that time as part of his co-founder status. He wrote in a message to the Wikimedia Foundation mailing-list that this action was \"in the interest of encouraging this discussion to be about real philosophical/content issues, rather than be about me and how quickly I acted\". Critics, including Wikipediocracy, noticed that many of the pornographic images deleted from Wikipedia since 2010 have reappeared.\n\n\n=== Privacy ===\nOne privacy concern in the case of Wikipedia is the right of a private citizen to remain a \"private citizen\" rather than a \"public figure\" in the eyes of the law. It is a battle between the right to be anonymous in cyberspace and the right to be anonymous in real life (\"meatspace\"). A particular problem occurs in the case of a relatively unimportant individual and for whom there exists a Wikipedia page against her or his wishes.\nIn January 2006, a German court ordered the German Wikipedia shut down within Germany because it stated the full name of Boris Floricic, aka \"Tron\", a deceased hacker. On February 9, 2006, the injunction against Wikimedia Deutschland was overturned, with the court rejecting the notion that Tron's right to privacy or that of his parents was being violated.Wikipedia has a \"Volunteer Response Team\" that uses the OTRS system to handle queries without having to reveal the identities of the involved parties. This is used, for example, in confirming the permission for using individual images and other media in the project.\n\n\n=== Sexism ===\n\nWikipedia has been described as harboring a battleground culture of sexism and harassment. The perceived toxic attitudes and tolerance of violent and abusive language are also reasons put forth for the gender gap in Wikipedia editors. In 2014, a female editor who requested a separate space on Wikipedia to discuss improving civility had her proposal referred to by a male editor using the words \"the easiest way to avoid being called a cunt is not to act like one\". Edit-a-thons have been held to encourage female editors and increase the coverage of women's topics.\n\n\n== Operation ==\n\n\n=== Wikimedia Foundation and Wikimedia movement affiliates ===\n\nWikipedia is hosted and funded by the Wikimedia Foundation, a non-profit organization which also operates Wikipedia-related projects such as Wiktionary and Wikibooks. The foundation relies on public contributions and grants to fund its mission. The foundation's 2013 IRS Form 990 shows revenue of $39.7 million and expenses of almost $29 million, with assets of $37.2 million and liabilities of about $2.3 million.In May 2014, Wikimedia Foundation named Lila Tretikov as its second executive director, taking over for Sue Gardner. The Wall Street Journal reported on May 1, 2014, that Tretikov's information technology background from her years at University of California offers Wikipedia an opportunity to develop in more concentrated directions guided by her often repeated position statement that, \"Information, like air, wants to be free.\" The same Wall Street Journal article reported these directions of development according to an interview with spokesman Jay Walsh of Wikimedia, who \"said Tretikov would address that issue (paid advocacy) as a priority. 'We are really pushing toward more transparency ... We are reinforcing that paid advocacy is not welcome.' Initiatives to involve greater diversity of contributors, better mobile support of Wikipedia, new geo-location tools to find local content more easily, and more tools for users in the second and third world are also priorities,\" Walsh said.Following the departure of Tretikov from Wikipedia due to issues concerning the use of the \"superprotection\" feature which some language versions of Wikipedia have adopted, Katherine Maher became the third executive director of the Wikimedia Foundation in June 2016. Maher has stated that one of her priorities would be the issue of editor harassment endemic to Wikipedia as identified by the Wikipedia board in December. Maher stated regarding the harassment issue that: \"It establishes a sense within the community that this is a priority ... (and that correction requires that) it has to be more than words.\"Wikipedia is also supported by many organizations and groups that are affiliated with the Wikimedia Foundation but independently-run, called Wikimedia movement affiliates. These include Wikimedia chapters (which are national or sub-national organizations, such as Wikimedia Deutschland and Wikimédia France), thematic organizations (such as Amical Wikimedia for the Catalan language community), and user groups. These affiliates participate in the promotion, development, and funding of Wikipedia.\n\n\n=== Software operations and support ===\n\nThe operation of Wikipedia depends on MediaWiki, a custom-made, free and open source wiki software platform written in PHP and built upon the MySQL database system. The software incorporates programming features such as a macro language, variables, a transclusion system for templates, and URL redirection. MediaWiki is licensed under the GNU General Public License (GPL) and it is used by all Wikimedia projects, as well as many other wiki projects. Originally, Wikipedia ran on UseModWiki written in Perl by Clifford Adams (Phase I), which initially required CamelCase for article hyperlinks; the present double bracket style was incorporated later. Starting in January 2002 (Phase II), Wikipedia began running on a PHP wiki engine with a MySQL database; this software was custom-made for Wikipedia by Magnus Manske. The Phase II software was repeatedly modified to accommodate the exponentially increasing demand. In July 2002 (Phase III), Wikipedia shifted to the third-generation software, MediaWiki, originally written by Lee Daniel Crocker.\nSeveral MediaWiki extensions are installed to extend the functionality of the MediaWiki software.\nIn April 2005, a Lucene extension was added to MediaWiki's built-in search and Wikipedia switched from MySQL to Lucene for searching. Lucene was later replaced by CirrusSearch which is based on Elasticsearch.In July 2013, after extensive beta testing, a WYSIWYG (What You See Is What You Get) extension, VisualEditor, was opened to public use. It was met with much rejection and criticism, and was described as \"slow and buggy\". The feature was changed from opt-out to opt-in afterward.\n\n\n=== Automated editing ===\n\nComputer programs called bots have often been used to perform simple and repetitive tasks, such as correcting common misspellings and stylistic issues, or to start articles such as geography entries in a standard format from statistical data. One controversial contributor, Sverker Johansson, creating articles with his bot was reported to create up to 10,000 articles on the Swedish Wikipedia on certain days. Additionally, there are bots designed to automatically notify editors when they make common editing errors (such as unmatched quotes or unmatched parentheses). Edits falsely identified by bots as the work of a banned editor can be restored by other editors. An anti-vandal bot is programmed to detect and revert vandalism quickly. Bots are able to indicate edits from particular accounts or IP address ranges, as occurred at the time of the shooting down of the MH17 jet incident in July 2014 when it was reported that edits were made via IPs controlled by the Russian government. Bots on Wikipedia must be approved before activation.According to Andrew Lih, the current expansion of Wikipedia to millions of articles would be difficult to envision without the use of such bots.\n\n\n=== Hardware operations and support ===\n\nWikipedia receives between 25,000 and 60,000-page requests per second, depending on the time of the day. As of 2021, page requests are first passed to a front-end layer of Varnish caching servers and back-end layer caching is done by Apache Traffic Server. Further statistics, based on a publicly available 3-month Wikipedia access trace, are available. Requests that cannot be served from the Varnish cache are sent to load-balancing servers running the Linux Virtual Server software, which in turn pass them to one of the Apache web servers for page rendering from the database. The web servers deliver pages as requested, performing page rendering for all the language editions of Wikipedia. To increase speed further, rendered pages are cached in a distributed memory cache until invalidated, allowing page rendering to be skipped entirely for most common page accesses.\n\nWikipedia currently runs on dedicated clusters of Linux servers with Debian. As of December 2009, there were 300 in Florida and 44 in Amsterdam. By January 22, 2013, Wikipedia had migrated its primary data center to an Equinix facility in Ashburn, Virginia. in 2017, Wikipedia had installed a caching cluster in an Equinix facility in Singapore, the first of its kind in Asia.\n\n\n=== Internal research and operational development ===\nFollowing growing amounts of incoming donations exceeding seven digits in 2013 as recently reported, the Foundation has reached a threshold of assets which qualify its consideration under the principles of industrial organization economics to indicate the need for the re-investment of donations into the internal research and development of the Foundation. Two of the recent projects of such internal research and development have been the creation of a Visual Editor and a largely under-utilized \"Thank\" tab which were developed to ameliorate issues of editor attrition, which have met with limited success. The estimates for reinvestment by industrial organizations into internal research and development was studied by Adam Jaffe, who recorded that the range of 4% to 25% annually was to be recommended, with high-end technology requiring the higher level of support for internal reinvestment. At the 2013 level of contributions for Wikimedia presently documented as 45 million dollars, the computed budget level recommended by Jaffe and Caballero for reinvestment into internal research and development is between 1.8 million and 11.3 million dollars annually. In 2016, the level of contributions were reported by Bloomberg News as being at $77 million annually, updating the Jaffe estimates for the higher level of support to between $3.08 million and $19.2 million annually.\n\n\n=== Internal news publications ===\nCommunity-produced news publications include the English Wikipedia's The Signpost, founded in 2005 by Michael Snow, an attorney, Wikipedia administrator, and former chair of the Wikimedia Foundation board of trustees. It covers news and events from the site, as well as major events from other Wikimedia projects, such as Wikimedia Commons. Similar publications are the German-language Kurier, and the Portuguese-language Correio da Wikipédia. Other past and present community news publications on English Wikipedia include the Wikiworld webcomic, the Wikipedia Weekly podcast, and newsletters of specific WikiProjects like The Bugle from WikiProject Military History and the monthly newsletter from The Guild of Copy Editors. There are also several publications from the Wikimedia Foundation and multilingual publications such as Wikimedia Diff and This Month in Education.\n\n\n== Access to content ==\n\n\n=== Content licensing ===\nWhen the project was started in 2001, all text in Wikipedia was covered by the GNU Free Documentation License (GFDL), a copyleft license permitting the redistribution, creation of derivative works, and commercial use of content while authors retain copyright of their work. The GFDL was created for software manuals that come with free software programs licensed under the GPL. This made it a poor choice for a general reference work: for example, the GFDL requires the reprints of materials from Wikipedia to come with a full copy of the GFDL text. In December 2002, the Creative Commons license was released: it was specifically designed for creative works in general, not just for software manuals. The license gained popularity among bloggers and others distributing creative works on the Web. The Wikipedia project sought the switch to the Creative Commons. Because the two licenses, GFDL and Creative Commons, were incompatible, in November 2008, following the request of the project, the Free Software Foundation (FSF) released a new version of the GFDL designed specifically to allow Wikipedia to relicense its content to CC BY-SA by August 1, 2009. (A new version of the GFDL automatically covers Wikipedia contents.) In April 2009, Wikipedia and its sister projects held a community-wide referendum which decided the switch in June 2009.The handling of media files (e.g. image files) varies across language editions. Some language editions, such as the English Wikipedia, include non-free image files under fair use doctrine, while the others have opted not to, in part because of the lack of fair use doctrines in their home countries (e.g. in Japanese copyright law). Media files covered by free content licenses (e.g. Creative Commons' CC BY-SA) are shared across language editions via Wikimedia Commons repository, a project operated by the Wikimedia Foundation. Wikipedia's accommodation of varying international copyright laws regarding images has led some to observe that its photographic coverage of topics lags behind the quality of the encyclopedic text.The Wikimedia Foundation is not a licensor of content, but merely a hosting service for the contributors (and licensors) of the Wikipedia. This position has been successfully defended in court.\n\n\n=== Methods of access ===\nBecause Wikipedia content is distributed under an open license, anyone can reuse or re-distribute it at no charge. The content of Wikipedia has been published in many forms, both online and offline, outside the Wikipedia website.\n\nWebsites: Thousands of \"mirror sites\" exist that republish content from Wikipedia: two prominent ones, that also include content from other reference sources, are Reference.com and Answers.com. Another example is Wapedia, which began to display Wikipedia content in a mobile-device-friendly format before Wikipedia itself did.\nMobile apps: A variety of mobile apps provide access to Wikipedia on hand-held devices, including both Android and iOS devices (see Wikipedia apps). (see also Mobile access.)\nSearch engines: Some web search engines make special use of Wikipedia content when displaying search results: examples include Microsoft Bing (via technology gained from Powerset) and DuckDuckGo.\nCompact discs, DVDs: Collections of Wikipedia articles have been published on optical discs. An English version, 2006 Wikipedia CD Selection, contained about 2,000 articles. The Polish-language version contains nearly 240,000 articles. There are German- and Spanish-language versions as well. Also, \"Wikipedia for Schools\", the Wikipedia series of CDs / DVDs produced by Wikipedians and SOS Children, is a free, hand-checked, non-commercial selection from Wikipedia targeted around the UK National Curriculum and intended to be useful for much of the English-speaking world. The project is available online; an equivalent print encyclopedia would require roughly 20 volumes.\nPrinted books: There are efforts to put a select subset of Wikipedia's articles into printed book form. Since 2009, tens of thousands of print-on-demand books that reproduced English, German, Russian and French Wikipedia articles have been produced by the American company Books LLC and by three Mauritian subsidiaries of the German publisher VDM.\nSemantic Web: The website DBpedia, begun in 2007, extracts data from the infoboxes and category declarations of the English-language Wikipedia. Wikimedia has created the Wikidata project with a similar objective of storing the basic facts from each page of Wikipedia and the other WMF wikis and make it available in a queriable semantic format, RDF. As of April 2021, it has 93,337,731 items.Obtaining the full contents of Wikipedia for reuse presents challenges, since direct cloning via a web crawler is discouraged. Wikipedia publishes \"dumps\" of its contents, but these are text-only; as of 2007 there was no dump available of Wikipedia's images.Several languages of Wikipedia also maintain a reference desk, where volunteers answer questions from the general public. According to a study by Pnina Shachaf in the Journal of Documentation, the quality of the Wikipedia reference desk is comparable to a standard library reference desk, with an accuracy of 55 percent.\n\n\n==== Mobile access ====\n\nWikipedia's original medium was for users to read and edit content using any standard web browser through a fixed Internet connection. Although Wikipedia content has been accessible through the mobile web since July 2013, The New York Times on February 9, 2014, quoted Erik Möller, deputy director of the Wikimedia Foundation, stating that the transition of internet traffic from desktops to mobile devices was significant and a cause for concern and worry. The article in The New York Times reported the comparison statistics for mobile edits stating that, \"Only 20 percent of the readership of the English-language Wikipedia comes via mobile devices, a figure substantially lower than the percentage of mobile traffic for other media sites, many of which approach 50 percent. And the shift to mobile editing has lagged even more.\" The New York Times reports that Möller has assigned \"a team of 10 software developers focused on mobile\", out of a total of approximately 200 employees working at the Wikimedia Foundation. One principal concern cited by The New York Times for the \"worry\" is for Wikipedia to effectively address attrition issues with the number of editors which the online encyclopedia attracts to edit and maintain its content in a mobile access environment.Bloomberg Businessweek reported in July 2014 that Google's Android mobile apps have dominated the largest share of global smartphone shipments for 2013 with 78.6% of market share over their next closest competitor in iOS with 15.2% of the market. At the time of the Tretikov appointment and her posted web interview with Sue Gardner in May 2014, Wikimedia representatives made a technical announcement concerning the number of mobile access systems in the market seeking access to Wikipedia. Directly after the posted web interview, the representatives stated that Wikimedia would be applying an all-inclusive approach to accommodate as many mobile access systems as possible in its efforts for expanding general mobile access, including BlackBerry and the Windows Phone system, making market share a secondary issue. The latest version of the Android app for Wikipedia was released on July 23, 2014, to generally positive reviews, scoring over four of a possible five in a poll of approximately 200,000 users downloading from Google. The latest version for iOS was released on April 3, 2013, to similar reviews.Access to Wikipedia from mobile phones was possible as early as 2004, through the Wireless Application Protocol (WAP), via the Wapedia service. In June 2007 Wikipedia launched en.mobile.wikipedia.org, an official website for wireless devices. In 2009 a newer mobile service was officially released, located at en.m.wikipedia.org, which caters to more advanced mobile devices such as the iPhone, Android-based devices or WebOS-based devices. Several other methods of mobile access to Wikipedia have emerged. Many devices and applications optimize or enhance the display of Wikipedia content for mobile devices, while some also incorporate additional features such as use of Wikipedia metadata, such as geoinformation.Wikipedia Zero was an initiative of the Wikimedia Foundation to expand the reach of the encyclopedia to the developing countries. It was discontinued in February 2018.Andrew Lih and Andrew Brown both maintain editing Wikipedia with smartphones is difficult and this discourages new potential contributors. The number of Wikipedia editors has been declining after several years and Tom Simonite of MIT Technology Review claims the bureaucratic structure and rules are a factor in this. Simonite alleges some Wikipedians use the labyrinthine rules and guidelines to dominate others and those editors have a vested interest in keeping the status quo. Lih alleges there is a serious disagreement among existing contributors on how to resolve this. Lih fears for Wikipedia's long-term future while Brown fears problems with Wikipedia will remain and rival encyclopedias will not replace it.\n\n\n== Cultural impact ==\n\n\n=== Trusted source to combat fake news ===\nIn 2017–18, after a barrage of false news reports, both Facebook and YouTube announced they would rely on Wikipedia to help their users evaluate reports and reject false news. Noam Cohen, writing in The Washington Post states, \"YouTube's reliance on Wikipedia to set the record straight builds on the thinking of another fact-challenged platform, the Facebook social network, which announced last year that Wikipedia would help its users root out 'fake news'.\" As of November 2020, Alexa records the daily pageviews per visitor as 3.03 and the average daily time on site as 3:46 minutes.\n\n\n=== Readership ===\nIn February 2014, The New York Times reported that Wikipedia was ranked fifth globally among all websites, stating \"With 18 billion page views and nearly 500 million unique visitors a month ... Wikipedia trails just Yahoo, Facebook, Microsoft and Google, the largest with 1.2 billion unique visitors.\" However, its ranking dropped to 13th globally by June 2020 due mostly to a rise in popularity of Chinese websites for online shopping.In addition to logistic growth in the number of its articles, Wikipedia has steadily gained status as a general reference website since its inception in 2001. About 50 percent of search engine traffic to Wikipedia comes from Google, a good portion of which is related to academic research. The number of readers of Wikipedia worldwide reached 365 million at the end of 2009. The Pew Internet and American Life project found that one third of US Internet users consulted Wikipedia. In 2011 Business Insider gave Wikipedia a valuation of $4 billion if it ran advertisements.According to \"Wikipedia Readership Survey 2011\", the average age of Wikipedia readers is 36, with a rough parity between genders. Almost half of Wikipedia readers visit the site more than five times a month, and a similar number of readers specifically look for Wikipedia in search engine results. About 47 percent of Wikipedia readers do not realize that Wikipedia is a non-profit organization.\n\n\n==== COVID-19 pandemic ====\n\nDuring the COVID-19 pandemic, Wikipedia's coverage of the pandemic received international media attention, and brought an increase in Wikipedia readership overall.\n\n\n=== Cultural significance ===\n\nWikipedia's content has also been used in academic studies, books, conferences, and court cases. The Parliament of Canada's website refers to Wikipedia's article on same-sex marriage in the \"related links\" section of its \"further reading\" list for the Civil Marriage Act. The encyclopedia's assertions are increasingly used as a source by organizations such as the US federal courts and the World Intellectual Property Organization—though mainly for supporting information rather than information decisive to a case. Content appearing on Wikipedia has also been cited as a source and referenced in some US intelligence agency reports. In December 2008, the scientific journal RNA Biology launched a new section for descriptions of families of RNA molecules and requires authors who contribute to the section to also submit a draft article on the RNA family for publication in Wikipedia.Wikipedia has also been used as a source in journalism, often without attribution, and several reporters have been dismissed for plagiarizing from Wikipedia.In 2006, Time magazine recognized Wikipedia's participation (along with YouTube, Reddit, MySpace, and Facebook) in the rapid growth of online collaboration and interaction by millions of people worldwide.\nIn July 2007, Wikipedia was the focus of a 30-minute documentary on BBC Radio 4 which argued that, with increased usage and awareness, the number of references to Wikipedia in popular culture is such that the word is one of a select group of 21st-century nouns that are so familiar (Google, Facebook, YouTube) that they no longer need explanation.\nOn September 28, 2007, Italian politician Franco Grillini raised a parliamentary question with the minister of cultural resources and activities about the necessity of freedom of panorama. He said that the lack of such freedom forced Wikipedia, \"the seventh most consulted website\", to forbid all images of modern Italian buildings and art, and claimed this was hugely damaging to tourist revenues.\n\nOn September 16, 2007, The Washington Post reported that Wikipedia had become a focal point in the 2008 US election campaign, saying: \"Type a candidate's name into Google, and among the first results is a Wikipedia page, making those entries arguably as important as any ad in defining a candidate. Already, the presidential entries are being edited, dissected and debated countless times each day.\" An October 2007 Reuters article, titled \"Wikipedia page the latest status symbol\", reported the recent phenomenon of how having a Wikipedia article vindicates one's notability.Active participation also has an impact. Law students have been assigned to write Wikipedia articles as an exercise in clear and succinct writing for an uninitiated audience.A working group led by Peter Stone (formed as a part of the Stanford-based project One Hundred Year Study on Artificial Intelligence) in its report called Wikipedia \"the best-known example of crowdsourcing ... that far exceeds traditionally-compiled information sources, such as encyclopedias and dictionaries, in scale and depth.\"In a 2017 opinion piece for Wired, Hossein Derakhshan describes Wikipedia as \"one of the last remaining pillars of the open and decentralized web\" and contrasted its existence as a text-based source of knowledge with social media and social networking services, the latter having \"since colonized the web for television's values\". For Derakhshan, Wikipedia's goal as an encyclopedia represents the Age of Enlightenment tradition of rationality triumphing over emotions, a trend which he considers \"endangered\" due to the \"gradual shift from a typographic culture to a photographic one, which in turn mean[s] a shift from rationality to emotions, exposition to entertainment\". Rather than \"sapere aude\" (lit. ''dare to know''), social networks have led to a culture of \"[d]are not to care to know\". This is while Wikipedia faces \"a more concerning problem\" than funding, namely \"a flattening growth rate in the number of contributors to the website\". Consequently, the challenge for Wikipedia and those who use it is to \"save Wikipedia and its promise of a free and open collection of all human knowledge amid the conquest of new and old television—how to collect and preserve knowledge when nobody cares to know.\"\n\n\n==== Awards ====\n\nWikipedia won two major awards in May 2004. The first was a Golden Nica for Digital Communities of the annual Prix Ars Electronica contest; this came with a €10,000 (£6,588; $12,700) grant and an invitation to present at the PAE Cyberarts Festival in Austria later that year. The second was a Judges' Webby Award for the \"community\" category. Wikipedia was also nominated for a \"Best Practices\" Webby award.\nIn 2007, readers of brandchannel.com voted Wikipedia as the fourth-highest brand ranking, receiving 15 percent of the votes in answer to the question \"Which brand had the most impact on our lives in 2006?\"In September 2008, Wikipedia received Quadriga A Mission of Enlightenment award of Werkstatt Deutschland along with Boris Tadić, Eckart Höfling, and Peter Gabriel. The award was presented to Wales by David Weinberger.In 2015, Wikipedia was awarded both the annual Erasmus Prize, which recognizes exceptional contributions to culture, society or social sciences, and the Spanish Princess of Asturias Award on International Cooperation. Speaking at the Asturian Parliament in Oviedo, the city that hosts the awards ceremony, Jimmy Wales praised the work of the Asturian language Wikipedia users. The night of the ceremony, members of the Wikimedia Foundation held a meeting with Wikipedians from all parts of Spain, including the local Asturian community.\n\n\n==== Satire ====\n\nMany parodies target Wikipedia's openness and susceptibility to inserted inaccuracies, with characters vandalizing or modifying the online encyclopedia project's articles.\nComedian Stephen Colbert has parodied or referenced Wikipedia on numerous episodes of his show The Colbert Report and coined the related term wikiality, meaning \"together we can create a reality that we all agree on—the reality we just agreed on\". Another example can be found in \"Wikipedia Celebrates 750 Years of American Independence\", a July 2006 front-page article in The Onion, as well as the 2010 The Onion article \"'L.A. Law' Wikipedia Page Viewed 874 Times Today\".In an episode of the television comedy The Office U.S., which aired in April 2007, an incompetent office manager (Michael Scott) is shown relying on a hypothetical Wikipedia article for information on negotiation tactics to assist him in negotiating lesser pay for an employee. Viewers of the show tried to add the episode's mention of the page as a section of the actual Wikipedia article on negotiation, but this effort was prevented by other users on the article's talk page.\"My Number One Doctor\", a 2007 episode of the television show Scrubs, played on the perception that Wikipedia is an unreliable reference tool with a scene in which Perry Cox reacts to a patient who says that a Wikipedia article indicates that the raw food diet reverses the effects of bone cancer by retorting that the same editor who wrote that article also wrote the Battlestar Galactica episode guide.In 2008, the comedic website CollegeHumor produced a video sketch named \"Professor Wikipedia\", in which the fictitious Professor Wikipedia instructs a class with a medley of unverifiable and occasionally absurd statements.The Dilbert comic strip from May 8, 2009, features a character supporting an improbable claim by saying \"Give me ten minutes and then check Wikipedia.\"In July 2009, BBC Radio 4 broadcast a comedy series called Bigipedia, which was set on a website which was a parody of Wikipedia. Some of the sketches were directly inspired by Wikipedia and its articles.On August 23, 2013, the New Yorker website published a cartoon with this caption: \"Dammit, Manning, have you considered the pronoun war that this is going to start on your Wikipedia page?\" The cartoon referred to Chelsea Elizabeth Manning (born Bradley Edward Manning), an American activist, politician, and former United States Army soldier and a trans woman.\nIn December 2015, John Julius Norwich stated, in a letter published in The Times newspaper, that as a historian he resorted to Wikipedia \"at least a dozen times a day\", and had never yet caught it out. He described it as \"a work of reference as useful as any in existence\", with so wide a range that it is almost impossible to find a person, place, or thing that it has left uncovered and that he could never have written his last two books without it.\n\n\n=== Sister projects – Wikimedia ===\n\nWikipedia has also spawned several sister projects, which are also wikis run by the Wikimedia Foundation. These other Wikimedia projects include Wiktionary, a dictionary project launched in December 2002, Wikiquote, a collection of quotations created a week after Wikimedia launched, Wikibooks, a collection of collaboratively written free textbooks and annotated texts, Wikimedia Commons, a site devoted to free-knowledge multimedia, Wikinews, for citizen journalism, and Wikiversity, a project for the creation of free learning materials and the provision of online learning activities. Another sister project of Wikipedia, Wikispecies, is a catalogue of species. In 2012 Wikivoyage, an editable travel guide, and Wikidata, an editable knowledge base, launched.\n\n\n=== Publishing ===\n\nThe most obvious economic effect of Wikipedia has been the death of commercial encyclopedias, especially the printed versions, e.g. Encyclopædia Britannica, which were unable to compete with a product that is essentially free. Nicholas Carr wrote a 2005 essay, \"The amorality of Web 2.0\", that criticized websites with user-generated content, like Wikipedia, for possibly leading to professional (and, in his view, superior) content producers' going out of business, because \"free trumps quality all the time\". Carr wrote: \"Implicit in the ecstatic visions of Web 2.0 is the hegemony of the amateur. I for one can't imagine anything more frightening.\" Others dispute the notion that Wikipedia, or similar efforts, will entirely displace traditional publications. For instance, Chris Anderson, the editor-in-chief of Wired Magazine, wrote in Nature that the \"wisdom of crowds\" approach of Wikipedia will not displace top scientific journals, with their rigorous peer review process.There is also an ongoing debate about the influence of Wikipedia on the biography publishing business. \"The worry is that, if you can get all that information from Wikipedia, what's left for biography?\" said Kathryn Hughes, professor of life writing at the University of East Anglia and author of The Short Life and Long Times of Mrs Beeton and George Eliot: the Last Victorian.\n\n\n=== Research use ===\nWikipedia has been widely used as a corpus for linguistic research in computational linguistics, information retrieval and natural language processing. In particular, it commonly serves as a target knowledge base for the entity linking problem, which is then called \"wikification\", and to the related problem of word-sense disambiguation. Methods similar to wikification can in turn be used to find \"missing\" links in Wikipedia.In 2015, French researchers José Lages of the University of Franche-Comté in Besançon and Dima Shepelyansky of Paul Sabatier University in Toulouse published a global university ranking based on Wikipedia scholarly citations. They used PageRank \"followed by the number of appearances in the 24 different language editions of Wikipedia (descending order) and the century in which they were founded (ascending order)\".A 2017 MIT study suggests that words used on Wikipedia articles end up in scientific publications.Studies related to Wikipedia have been using machine learning and artificial intelligence to support various operations. One of the most important areas—automatic detection of vandalism and data quality assessment in Wikipedia.\n\n\n== Related projects ==\nSeveral interactive multimedia encyclopedias incorporating entries written by the public existed long before Wikipedia was founded. The first of these was the 1986 BBC Domesday Project, which included text (entered on BBC Micro computers) and photographs from more than a million contributors in the UK, and covered the geography, art, and culture of the UK. This was the first interactive multimedia encyclopedia (and was also the first major multimedia document connected through internal links), with the majority of articles being accessible through an interactive map of the UK. The user interface and part of the content of the Domesday Project were emulated on a website until 2008.Several free-content, collaborative encyclopedias were created around the same period as Wikipedia (e.g. Everything2), with many later being merged into the project (e.g. GNE). One of the most successful early online encyclopedias incorporating entries by the public was h2g2, which was created by Douglas Adams in 1999. The h2g2 encyclopedia is relatively lighthearted, focusing on articles which are both witty and informative.\nSubsequent collaborative knowledge websites have drawn inspiration from Wikipedia. Some, such as Susning.nu, Enciclopedia Libre, Hudong, and Baidu Baike likewise employ no formal review process, although some like Conservapedia are not as open. Others use more traditional peer review, such as Encyclopedia of Life and the online wiki encyclopedias Scholarpedia and Citizendium. The latter was started by Sanger in an attempt to create a reliable alternative to Wikipedia.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n=== Academic studies ===\n\n\n=== Books ===\n\n\n=== Book review-related articles ===\n\n\n=== Learning resources ===\n\n\n=== Other media coverage ===\n\n\n==== General articles ====\n\n\n==== Articles re Wikipedia usage patterns ====\nWikipedia's Year-End List Shows What the Internet Needed to Know in 2019. Alyse Stanley, December 27, 2019, Gizmodo.\n\"Is Wikipedia Cracking Up?\" The Independent, February 3, 2009.\n\n\n== External links ==\n\nOfficial website (Mobile) – multilingual portal (contains links to all language editions) (wikipedia.com still redirects here)\nWikipedia at Curlie\nWikipedia collected news and commentary at The Guardian \nWikipedia topic page at The New York Times\nVideo of TED talk by Jimmy Wales on the birth of Wikipedia\nWikipedia on Twitter", "chinese_title": "Wikipedia ", "chinese": "Wikipedia (English: wikipedia, / ˌW ɪɪpiːpiːː / or / ˌWɪkipiːːə /) is a multilingual online encyclopedia for the Wiki Media Foundation, and to create and maintain as an open collaborative cooperation project, feature free content, free editing, Free copyright. It is currently the largest and most popular reference tool book on the global network, ranked 20th most popular websites worldwide, which is ranked in the search engine. Wikipedia is currently operated by the Non-profit organization Wiki Media Foundation. Wikipedia is a mixed word, which is taken from the website core technology \"Wiki\" and \"EncyClopedia\" in English in the English Encyclopedia. As of early 2021, the number of Wikipedia entries in all languages ​​reached 55 million.\n\n\n== History ==\n\nWikipedia was earliered in the cooperation of Jimmy Wales and Larry Sange, on January 13, 2001, on the Internet, on the Internet, officially launched online encyclopedia on January 15th painting. Among them, Sange combines the \"Wiki\" of Wikipedia website and \"EncyClopedia\" with the meaning of the encyclopedia, \"Wikipedia\". At the beginning of the founding, Wikipedia's goal is to provide free encyclopedia to all mankind, and hope that people around the world can participate in editing entries. Other written encyclopedia is mostly dominated by experts, then print and sell it by publisher. Wikipedia is a global knowledge that is free to access and edited in nature, which also means that Wikipedia can also include non-academic but still have certain media concerns in addition to the information included in the traditional encyclopedia. event. In the \"Times\" magazine selected the era of \"you\", it is mentioned that millions of people in the world have promoted the rapid growth of Wikipedia in the line, and other important websites mentioned in the same year are also YOUBE. MySpace and Facebook.\nWikipedia is emphasizing CopyleFT free content, collaborative editing, and a multilingual version of a network encyclopedia, with Internet and Wiki technology as a medium, has developed into a worldwide encyclopedia collaboration program. The project is responsible for the relevant development of the Non-profit organization Wiki Media Foundation. Wikipedia has compiled compiled by volunteers around the world. As of 2020, the entire Wikipedia has included more than 55 million items, of which English Wikipedia ranks first in quantity with more than 6 million items. Wikipedia allows access to the website's user free reading and modification of the content of the majority of the page, the total number of websites has exceeded 1 billion times, and the entire Wikipedia has more than 300 independent language versions, and has been generally considered as a scale. The largest and most popular network encyclopedia. According to well-known Alexa Internet, its network traffic statistics pointed out that there are nearly 365 million people in the world to use Wikipedia, and Wikipedia is also ranked 13th website in the world. It is also the world's largest website. . Based on estimation, Wikipedia has nearly 270 million US people to browse every month.\nSince Wikipedia can quickly organize information related to recent events, and anyone can in depth, it has gradually regarded Wikipedia as a source of news. At the same time, for the convenience of general students or to browse the masses, you can easily understand the contents of the entries, and most entries in Wikipedia can explain the complex concepts as simple words. With the popularity of Wikipedia, Wiki News, Wiki Textbook, etc. sisters are also encouraged. Although Wikipedia has resolutely supported the two requirements of the official policy, Wikipedia is still criticized by many people in the society because anyone can participate in the editor, including the quality and information of the entry. The objectivity of the degree, the presentation attitude, and the unable to provide consistent exact content. Some people alleged the problem in Wiki technology used by Wikipedia, they believe that anyone can edit Wikipedia content This method is the most vicissitious and unable to change in Wikipedia. This hammer can easily cause disputes. Add false content to the political and religious entry, delete correct information or any addition of prejudice content. Jonathan ZitTrain, Jonathan ZitTrain, etc., as well as the controversy of Jonathan ZitTrain, and the UK Oxford University, believe that this is derived from others to Wikipedia. In order to solve the question of the entry quality as much as possible, Wikipedia also puts forward many corresponding policies and guidance to protect the quality of the article, and it is desirable to collaborate to edit the source of information sufficient for others to verify, review, and confirm. However, the critics also mentioned that many of Wikipedia have made the people who advocate their favorite projects such that they have become a favorite project, which means that the website is very susceptible to various reasons to be destroyed. Critics also pointed out that even if some reports confirmed that many entries were quickly easy to recover after being destroyed, Wikipedia still contains a lot of unconfirmed or contradictory information. However, \"Nature\" believes in the 2005 survey that Wikipedia has similar accuracy in the field of scientific articles and the \"British Encyclopedia\" as the traditional encyclopedia representative, but both have some degree of content. \"Severe missing\".\n\n\n== Using ==\n\n\n=== Edit mode ===\n\nCompared with traditional encyclopedia, Wikipedia has its most important feature to take open spirit. This means that whether it is a user who has a Wikipedia account or other anonymous viewers, it can also add the content you think to the article at the same time; but it is particularly sensitive or easily destroyed. The content will give varying degrees of \"protection\" to temporarily prohibit the permissions for some articles editing. However, there are more or less websites of different language versions, such as in English Wikipedia, only registered users can create new entries. However, Wikipedia's entry content does not belong to the creator or any editor, and it will not require any article to be reviewed by the recognized authority; the editor's content and architectures must be reached Treatment.\nUnder normal circumstances, the edited articles can review and fix immediately. Some time to edit Wikipedia may add content inaccurate, with a meaningful discourse, and these editing results must wait for another editorial Enemy to find and correct the content. In this case, Different language versions of Wikipedia have their own administrative architectures, and also allow this phenomenon to freely modify relevant policies. For example, in German Wikipedia, the \"Stable Version\" policy is adopted, that is, the editorial content will appear to the general viewer after checking the general view. However, the English Wikipedia has not taken the model of German Wikipedia, with the former decided to test the decision for 2 months in 2010. English Wikipedia's promoters hoped to avoid newly joined users' editing \"Controvers\" content or easily destroy the content of the article by \"Review Change\", so that the general viewer will only see the article before reading the article. . However, after this test, the English Wikipedia community did not reach a consensus on the \"Temporary Modification\" system, and finally deleted all the \"tentative modifications\" content in the text page in May 2011.\n\nRegardless of whether it is registered in Wikipedia, the article contributor can edit the content by the software. Each entry has been named \"History\" to record the revision of each article in the past, but it may also be deleted in the past record while the copyright, crime threat record or copyright violation. For example, Japanese Wikipedia's real names for some victims of the attention will choose to delete processing, and even interfere with other language versions. However, the general editor can also revoke the improper changes in the content or restore the previously deleted content on this page option. And each entry also has the \"Discussion\" page associated with it, which can coordinate editing activities for this entry. In addition, the number editor can also seek \"consensus\" in the fixed \"Discussion\" page, and often decide the contents of the entry or architectures in voting.\nIn addition, editors can view the recently modified entry at the \"Recent Change\" website, take here to learn about other participants. Some long-term editorial members will be interested in entries in the \"Monitoring List\", so that these users can easily track the latest changes to these entries. Many have a certain degree of development of language versions of Wikipedia editor often review the changes in the \"Monitoring List\" because the growth of the Nikki Encyclopedia will make the \"Recent Change\" list project significantly. In addition, each language version of Wikipedia will also have a list of information to be inspected, and there is an obvious problem in the newly created entry. The entry that is often disrupting can be applied for \"semi-protection\" on the content of the article, so that only the registered user of Wikipedia can edit; and when a certain entry is over-controversial, the entry is also possible to become only system management. The \"full protection\" situation that can be modified.\nIn addition to volunteers involved in Wikipedia, Wikipedia also widely used the design-designed computer program \"robot\" to correct the usual scrabble error or grammar issues, and even some \"robots\" automatically analyzed statistics and prepared in the same format. The basic content of geographic entries. In addition, some \"robots\" are designed to detect others' attack or destruction of Wikipedia, in addition to automatic or semi-automatic repair of these articles, the settings through the content filter can also be warned to the user's editing \"unspole\". Through the lock of the network address, \"Robots\" can also prevent other users from being adding advertising webpages that may have commercial nature, or use the 傀儡 account or IP address to destroy. However, many language versions of Wikipedia have been able to operate through the community approval after designing \"Robots\".\n\n\n=== entry classification ===\n\nThe entry content of Wikipedia first appears is much loose and has not been organized. However, there will be a volunteer to modify it, and according to the content expansion and entry theme, it can help other users by classification. It is easier to review each article in accordance with content and properties. A new entry If there are only some shallow definitions and entry, the items are usually columns \"small work\" and require others to assist in modification. On the other hand, if the entry content is extremely perfect, it may be nominated as \"Feature Article\" (Feature Article, and later, the Chinese Wiki is a model entry). Giacomo Poderi found that such an article listed as \"feature entry\" is often achieved by several Wiki editor in intensive modification. \"Feature entry\" will be demonstrated by other editing users after nominating, and in the \"Feature entry\", it will usually turn on the Wikipedia homepage to display, in English Wikipedia, averaged a feature entry every day. . However, in 2010, a study found that the quality of the articles in the characteristic entries in Wikipedia has not been consistent, which makes the researchers believe that the Wikipedia community is actually \"no effect\" on the assessment of the entry content.\nIn 2007, when preparing to make Wikipedia printing versions, English Wikipedia decided to arrange a variety of college quality of the quality of the articles in accordance with the proportion of the quality of the articles at the time. In addition, the number of editorial users of the Wikipedia community may also organize the \"Topics\" to edit the entry article of specific field topics, and coordinate the structure and terms of many articles by the relevant discussion page.\n\n\n=== Destroy behavior ===\n\nThe most common and obvious destruction types include inserting false information, advertising words, high-party opinions, is a self-opinion, or other type of spam, etc., in most cases, when these damage behavior, Wikipedia community can be edited Modifying ways to delete errors, and even eliminate the damage record of a specific page. However, some less destruction can be more difficult to detect, which includes tough modifications to become their favorite format content, the destruction of the entry or the interpretation of the categorical page, or even directly modify the entry article. Bottom code, etc. However, due to the number of damage and feasibility, Wikipedia has long been facing this unique challenge than other encyclopedia. And this also makes Wikipedia have been criticized by the vision. It is unable to affirm that the current article is destroyed. At a certain chance, the article may be inserted into false information, or the actual important content is deleted, etc. damage. Former \"Big Bank of Book\", Robert McHenry mentioned that Wikipedia faced the destruction threat:\n\nObvious destruction is often easily removed from Wikipedia's articles, depending on the experimental Wikipedia in detection and the average time of repairing damage is approximately a few minutes. However, the American political figures John Sherang Tandle participated in false information in their personal experience, but it has been discovered four months after this destruction editor, and will be greatly reported by the news media. In this incident, John Sang Tak, found the \"Freedom Forum\", \"Freedom Forum,\" Freedom Forum, the University of Van Tebmer, asked Wells to know who Wells can know who Edit these error information, Wales replied that there is no way to answer in the first time. Although events can eventually be successfully traced to the perpetrators and ask for an apology, this incident also leads to the revision of the policy of the Wikipedia's website, especially for those who are in the Biographic articles. Validation standards.\n\n\n=== Rule is set ===\nWikipedia's content is basically limited by the US copyright and related legal restrictions, and it is also necessary to comply with local laws in the state of Wikipedia servers in Florida. In addition to legal provisions related to real life, Wikipedia's editorial users are also asked to comply with all kinds of polits and guidelines developed in accordance with the \"Five Pillars\", and hope to create many suitable entry content under this norm. These regulations are also stored on Wiki systems with Wikipedia's entry, however, if you want to write or modify the policies and guidance of Wikipedia, you must pass through the Wikipedia community, but the same can also be easily deleted or modified. The specified rules. Many non-English version of Wikipedia Initially most of the rules of English Wikipedia came as their own basis, and afterwards, they will gradually have a certain extent in rules in accordance with their own development.\n\n\n==== Content policy ====\nThe Wikipedia Plan, such as English Wikipedia and other languages, Wikipedia has also set a number of relevant rules for entry, most of which require article content to be written in encyclopedia, and oppose the contents of the same dictionary. In addition, whether the event as a topic is included in this section in Wikipedia, it is also required that the user should pay attention to the \"attention guidelines\" when editing; this usually means that the entry must be able to act as an independent theme in mainstream media or major academic publications. The article can be founded in a significant sufficient and reliable secondary source to support the entry. In addition, Wikipedia places in order to build a recognized communication knowledge media, which makes it unable to have fictional information or original research in the entry content. In order to avoid the question of other browsing, Wikipedia also requires a reliable message source as a reference. However, the content of this Viki Encyclopedia has become \"more than checks to check,\" Many Wiki Encyclopedia editor, instead ignores the Wikipedia's practice and adds to their own ideas; this makes the entry often reviewing its correctness. There will be a major problem, but in fact, the content of the article has been interpretable by Wiki users. Over time, it has made the correct information more difficult to be effectively presented, which hinders information growth in Wikipedia's book, and even after the end of the final, Wikipedia cannot be adopted. To do this, if there is a positive anti-two-sided opinions and views, it has the corresponding external source as auction. Wikipedia often requires the information about the appropriate amount of information in the articles.\n\n\n==== Dispute resolution ====\n\nThere are many ways to solve disputes in Wikipedia communities, which are often called \"Bold, Return and Discuss Cycle\" editing cycle, which is often a editor for the entry. To make changes, another editor will return it back to the unwaver version, and the last two editors are easy to discuss on the discussion page to discuss the problems encountered with each other and their solutions. However, some editors may ignore this process in some time, in turn, the editorial battle is burst on the content or structure, that is, a user editor that occurs, and then retreats by another user.\nEditor wants to solve the problem, in addition to the discussion page discussion, it is also possible to obtain a wider range of community consensus in the relevant Wiki special page, or in invite third parties and consult relevant advice. And if the two sides have burst out conflicts on the problems, the editor can also report the other party to violate the etiquette or uncivilized response. In addition, Wikipedia also provides the \"Mutual Help\" or \"Mediation Committee\" service to assist between the two sides to edit the problem, but in fact, the processing of the two parties is not binding or disposing, but the weight is to communicate Way to get a consensus. And if you delete the entry, there is another page in Wikipedia. However, although Wikipedia will be treated by mediation, some Wikipedia users believe that mediation is not effective to solve the problem with certain dispute.\n\n\n==== Arbitration processing ====\n\nIn a Wikipedia, including the English Wikipedia, an arbitration committee is an arbitration committee as a final dispute resolution. Although many disputes in Wikipedia are often broke out by editing by two opposition opinions on the content editing of entry articles, the Arbitration Commission clearly refuses such views of controversial case and believes that both parties should be able to solve the content directly. . According to statistical analysis, it is pointed out that the Committee usually ignores the contents of the two sides outbreak, and will focus on the way of disputes. The reason for this approach is that the Arbitration Commission does not set its own purpose to solve dispute disputes and maintain the peaceful environment of editing. The opposite is more biased towards an unforgettable problem editor to attract potential more enthusiast editing users. Also, although the Committee will condemn new editing content in the review of the dispute, it will condemn the policies for Wikipedia (for example, the content is not neutralized after modification), but there will be no absolute provisions on the contents of the article. These include warnings and suspension of punishment (63.3%), prohibiting editing articles (43.3%), prohibiting participation topics (23.7%) or prohibits browsing Wikipedia (15.7%), where the Wikipedia is mainly due to confirmation Counterfeit others have appeared; and if the user is fake others or showing anti-social tendencies, the opposite is only a violation of the community consensus or editing policies, the arbitration commission will always issue a warning. Come to work.\n\n\n=== Privacy problem ===\nIn the premise of respecting privacy, Wikipedia has made ordinary citizens to protect their own privacy; however, Wikipedia will mention the \"private life\" of general civilians, but appears in the entry The character character is not all the \"public figure\" mentioned by the law, which leads to Wikipedia to refer to anonymous network space or require some interest in the real life (Real Life). Micro conflict. Wikipedia Watch believes that Wikipedia is a potential threat to those who value privacy, and mentioned that \"Wikipedia is used in the structure of responsibility system will be the first step in solving privacy issues\". Another particular case is that although I don't matter compared to other important people, it still appears in the entry of Wikipedia in the case of violation of their own wishes.\nIn January 2006, the German Court ordered the German Wikipedia to close its site in Germany because German Wikipedia will have passed the chaotic computer club (Chaos Computer Club) \"Tron\", \"TRON\" Boris Flori Skch was published, and then Flussk's parents put forward a lawsuit to the court and asked their son's name to be removed from Wikipedia. Subsequently, the court requested that the German domain name \"www.wikipedia.de\" is re-directed in German Wikipedia, but Germany users are still able to directly access the headquarters servers' servo website \"de.wikipedia.org\" in Florida, USA. However, on February 9, 2006, the ban on Wikipedia was once again overthrown by the German court, and the veto of his parents insisted on only an anonymous \"TRON\" to maintain privacy. The plaintiff requested an appeal again in May 2006, but it was rejected by the Berlin State Court.\n\n\n=== Community activity ===\n\n\n==== Organizational structure ====\n\nAlthough Wikipedia is not always conveying relevant negative information content, Wikipedia community is often described as \"cult organization\", and this kind of statement is often criticized by users who fail to adapt to the community. However, Wikipedia pays more attention to the cohesiveness of the community in some things, which means that even if there is no eligibility, it is also possible to participate in compromise or discussions, and this method of seeking consensus is sometimes criticized. It is \"anti-elite\".\nIn today, Wikipedia community has established a \"various bureaucratic system\", which in order to effectively grasp the editorial modification trend of Wikipedia's entry, so that many language versions of Wikipedia have organized \"clear\" by volunteers. Authority. The \"administrator\" of these volunteer assisted management often has a good reputable editorial user in the Wikipedia community, and has the ability to delete the page after becoming some privileged \"admin\", blocking the article being corrupted or When the community is seriously arguing, the insulting dialogue is deleted, and even the editorial rights of illegal users can be stopped. However, \"administrator\" power exercises should be in the exercise of editing, expect to prevent users from destructive editing for Wikipedia, and have no jurisdiction for ordinary editing users. In addition, administrators do not have any special powers in decision decision.\n\n\n==== New user ====\nAccording to statistics, nearly 60% of registered users are not edited and entry within 24 hours after their registration. In the face of this data, the possible explanation is that these users are registered to join Wikipedia just for some purposes, or they are afraid of their experiences, but they cannot communicate with Wikipedia community. Eric Goldman, one of the main reasons is that it is afraid that there is no understanding of the basic culture in Wikipedia, including the signature, editing practice, and etiquette, etc., and even worry User familiar with Wikipedia will deliberately regard their contribution they just join the Wikipedia as a destruction. To this end, Wikipedia encourages new users to gradually familiarize with the practice of Wiki Encyclopedia, in addition to editing entries, can establish exclusive user pages, learn some specific techniques and specifications and specifications of Wikipedia and to understand the disputes, even It is possible to learn \"the plenty of Wiki Encyclopedia culture jokes and various discussion references\". But on the other hand, non-registered users are often considered \"Second-class citizens\" when using Wikipedia. The reason is that all Wikipedia communities recognize these registered participants, I believe they are gaining stakeholders. On the basis of continuous participation in maintenance work, the history of IP addresses is often unable to determine that there is a full record as a reference, and some specific users are often converted to non-registered users when they encounter conflicts to maintain their own views.\nIn 2009, Business Insider launched a research report on Wikipedia, a Henry Blodget, which was a post-editor of journalists, said that most of the recent article text editing in Wikipedia. The record is mainly contributed by \"outsiders\" (freshly participated in creating or editing users), and the survey of the most articles is responsible for the \"own people\" (Wikipedia registered users).\n\n\n==== Edit entry ====\n\nWikipedia does not require the user to identify its identity, however, Wikipedia's book has a non-traditional mode growth model to promote \"Wikipedia?\" This type of problem is one of the topics of several Web 2.0 topics today, even This kind of problem is also explored many technologies such as Digg. Wells once said that Wikipedia has only \"a community ... and hundreds of volunteers responsible for the special group\", and said that the contribution of Wikipedia and other teams in many areas \"are very similar to any traditional organization.\" When Wales surveyed 524 Viki Encyclopedia users, there were more than 50% of the contents of 0.7% of Wiki users. However, Aaron Swatts got different views when assessing the contributors of Wikipedia entries in the same method, and he pointed out that several articles they sampled have a large part of the content (by the text bitmine calculation) Instead, it is contributed by users with low editing times. The 2007 Dadmouth College researchers have pointed out: \"Anonymous and occasionally contributors in Wikipedia's revision, but become the judgment of Wikipedia website registrar as reliable knowledge sources.\" Although these anonymous contributions Often only modify the relevant fields related to themselves, but most Wikipedia gives support for these users, and even expects them to provide information sources for verification while providing content information.\nIn 2003, the University of Economics Andrea Ciffolilli believes that the Wiki software creates a common development environment, with a low transaction cost and the \"creative construction\", making Wikipedia successfully encouraged others. participate. In the book of \"The Future of the Internet\" published in Jonathan Zittrain, the case of successful Wikipedia has opened a study of how to open cooperation and also expect. This will cultivate innovation ideas on the Internet. However, in 2008, it was found that Wikipedia's users did not agree that they would pay attention to openness than other organizations. Even in 2009, there was a research report alleged: \"There are signs that the Wiki Encyclopedia community gives more and more resistance to the new content.\" At the OOPSLA conference held in 2009, the Chief of Wiki Media Foundation Technical officers and high-end Software designers Breon Vibber have published \"Community Performance Optimization: Let you run your web page smoothly\" (Community Performance Optimization: Making Your People Run As Smoothly As Your Site) One text. And in the meeting, Wikipedia has faced the next challenge of the software development process in addition to the fundraising issues of the large community.\n\n\n==== User communication ====\n\nUnder the assistance of Wiki software, each entry except for editing pages, while also has the corresponding \"Discussion\" page, and the member of Wikipedia will discuss this, and by \"user conversation Pages can also be able to contact specific Wikipedia users. Through these pages, you can help Wikipedia users reach a consensus, and to assist the Wikipeda website by talking by talking, this includes what the contents of the related articles should contain, and how to modify the rules of the Wikipedia website or to promote communities for any problem. Take action.\nOn the other hand, under the leader of the English Wikipedia Administrator and Wiki Media Foundation, the English Wikipedia launched the \"Wiki Newsletter\" (Wikipedia Signpost) as a community newspaper. In \"Wiki Newsletter\", in addition to introducing news and events that occur in Wikipedia, it also assists in promoting large-scale activities from sister plans from sister plans, including Wiki shared resources.\nIn addition, Wikipedia may sometimes pay based on the excellent contribution of the other party, and the \"Wiki Star Chapter\" is provided as a reward. It is expected to promote the progress of the Wikipedia community through individual design \"Wiki Star\", and these \"Wiki Stamps\" commendation include a simple editing entry, community assistance, administrative work to and other Wiki Encyclopedia Skister's connection work, etc. At the same time, many research analysis believed that Wikipedia's \"Wiki-star Chapter\" was awarded to the system, which prompted the entire Wikipedia community to engage in a wide range of cooperation.\n\n\n==== Information statistics ====\n\nAccording to a study, Wikipedia's contributor's contributor \"only 13% is women, and the average age of contributors is around 25 years old.\" To this end, Su Gardner, Executive Director of the Wiki Media Foundation, said that in 2015, it is hoped to increase the women's editorial users participating in Wikipedia to about 25%. Linda Basch, the National Women's Research Committee (National Council For Research On Women), pointed out that more than 50% of the US Bachelor degree, Master, based on statistics, based on statistics Degree and doctoral course.\nIn 2012, Tagha Yasier and János Kertész were published in \"Plos One\", and the day and night activity model in various Wikipedia communities is relative. Comparison foundation, thereby estimating that different regions of other worlds have enabled users to contribute to Vikipeda in various languages. For example, the report shows that in English Wikipedia, the number of edits from North America is limited to approaching 50%, and this ratio is reduced to 25% in Ease English Wikipedia. For this report, the Wiki Media Foundation is hoped to increase the number of users editing users in the Southern Hemisphere in 2015 to 37%.\n\n\n=== Upper content ===\n\nWikipedia established its purpose in receiving the knowledge of all human knowledge in a network encyclopedia, which means that the entry included in the encyclopedia will cover each topic. In particular, Wikipedia can include an entry that will be near TB grade disk space, which enables Wikipedia compared to other traditional printed encyclopedies to include more topics and content, which also includes people who may be disgusted or Acoustic types of erotic types. Although Wikipedia's ideas do not need to debate, it is still considered a dispute point in some cases. For example, Wikipedia cited this policy in 2008, which made a decision for the idea of ​​online contact asking English Wikipedia to remove the entry of \"DEPICMMMMAD\" entry. However, since Wikipedia has included the relevant political, religious, pornographic, etc., which has caused the implementation review system for Wikipedia. British Internet suppliers have masked a page that is thought to involve child abuse. Mainland China and Pakistan have also fully enclosed Wikipedia.\nIn 2008, Carnegie Mellong University and Paro Modeo Research Center conducted a study of Wikipedia in January 2006 to January 2006, the content of the subject content, and various fields of growth, all of which The proportion of proportionality and growth is about 30% of the \"cultural art\" type (growth of 210%), \"Biography\" accounts for about 15% (increased by 97%), \"Geographic location\" is about 14% (growth 52%) \"Social Science\" type accounts for about 12% (increased by 83%), \"historical event type accounts for approximately 11% (increased by 143%),\" Natural Science \"type accounts for about 9% (growth 213%),\" Application Technology \"type About 4% (growth - 6%), \"Religious belief\" type accounts for about 2% (growth of 38%), \"Physical Health\" type accounts for about 2% (increased by 42%), \"mathematical logic\" type accounts for about 1% (Amazing 146%) and the type of \"philosophical thinking\" account for about 1% (an increase of 160%). However, the size calculated in this study is merely the number of entry, so the topic of the proportion of proportion of the proportion is a short article, and the proportion of the proportion of the proportion has the contents of its entry. More description. In order to compensate for the type and entry of concern related themes, English Wikipedia has planned the activities of \"Wikipedia Loves Libraries in 2011,\" I hope to take this public library with New York public libraries. The library cooperates to improve the articles in this field of performance. However, while contributor assistance and related entry growth plans, Wikipedia has continuously edited users to question, even with the so-called \"reservedism\" and \"deleted\" concepts.\nAs of 2009, it is estimated that there are nearly 5 billion people in the Earth to browse Wikipedia's entry. However, Oxford Internet Institute (Oxford Internet Institute) is pointed out in its research report, Wikipedia is extremely uneven in the geographical distribution of entries, and most of them are described in describing the contents of North America, Europe and East Asia. And the entries related to most of the developments in most developers are only a small part. However, in many editor users from the same point of view, when modifying topics or entries, there may be a case of systemic bias, which in turn leads to different entry views that may differ from the mainstream or potential reader group at the time. Wells pointed out that the imbalance of the entry content in 2011 is mainly limited to the ratio of editorial users, and it is mainly mastered in developed countries and has been accepted by higher education. In addition, the contents of the Wikipedia also have \"possible selective bias\", especially those of many public figures, but more comments from the opponents as the spindle. Although many cases there will be a prejudice for editing users, and Wikipedia will sometimes launch a large-scale discussion on these disputes. However, Wales pointed out political figures for dispute political issues or polarization perspectives. There is still a prejudice content.\n\n\n=== Language version ===\n\nCurrently, Wikipedia has 285 languages, English, Bomb, Swedish, German, French, Dutch, Russian, Italy, Spanish, Polish, War Rative, Vietnamese, Japanese, Chinese, etc. The 14 versions have more than 1 million items, and there are more than 10,000 articles of more than 100,000 articles and 136 language versions of Wikipedia. Among them, the largest language version in all Wikipedia places is English Wikipedia. According to statistical light, it has exceeded 3.9 million articles, which followed by the top five sequences arranged in the entry. German Wikipedia, French Wikipedia, Dutch Wikipedia and Italy Vikipedia. According to Alexa's statistics, the Subdomain name \"en.wikipedia.org\" in English Wikipedia accounts for about 54% of all Wikipedia's accumulated browsing, and the number of browsing of the remaining language versions is Japanese. Wikipedia (10%), German Wikipedia (8%), Spanish Wikipedia (5%), Russian Wikipedia (4%), French Wikipedia (4%) and Italy Wikipedia (3%).\nSince Wikipedia is running on the Internet, contributors from all over the world may use different dialects when browsing the same language version, or they have used different dialects, or they are influenced by the habitual terminology of different countries. . These differences may lead to the text spelling of the entry or conflicts in the use of law (such as English users, \"Color\" and \"Colour\", or Chinese users' simple-only conversion problems, or have different locations social environment. The view is different from the viewpoint of the entry. In addition, although there is also a policy of \"neutral view\" in various language versions, many language versions of Wikipedia must still restrict their legal restrictions on their own country, which makes each Wikipedia Painting is not consistent in the policy and the practice. The most obvious example is that Wikipedia must decide whether to adopt free content or rationally use according to the license according to the license.\nWales supported Wikipedia developing a variety of language versions, and mentioned that \"should be as possible to use their own language to create and fully promote high quality free encyclopedia\". However, although each language version is more or less has its own independent function and practices, there will still be relevant organizations to monitor the operation of Wikipedia, including the operation of each Wiki Encyclopedia and All language versions of Wikipedia's important statistics are provided, and there is also a Wiki Media Foundation responsible for maintaining Wikipedia and related places associated with it. In addition, the Yuan Wiki also provides a list of entries that each Wikipedia should have, which involves basic content including biography, history, geographic, social, cultural, scientific, technology, food and mathematics. However, on the other hand, when a particular language version of Wikipedia has a related article article, it does not mean that another language version of Wikipedia can also have the same quality article, such as some small town entries in the United States. There is only the English version to provide a reference. Even some entries may be able to create in Wikipedia in the relevant languages, but does not mean able to meet the \"Concern\" standards of other language versions.\nMost language versions of Wikipedia have more other language versions of the article only account for only a small part, the main reason is that most Wikipedia plans do not allow users to directly post the article content, but some Wiki Encyclopedia Groups often encourage editorial users to translate other language versions in manively. In the Wikipedia, if the entry content exists in other language versions of Wikipedia, the entry content of several different languages ​​can be connected to the left or right list of the same page through the \"Technical\" technology across Wiki links. In addition, in multimedia uses this part, each language version of Wikipedia is connected to the image, sound and videos such as Wiki shared resources.\n\n\n== Browse ==\n\n\n=== Content authorization ===\n\nWikipedia's plans have been created in 2001. It is decided to use the GNU free document authorization clause that is originally designed to be free software. It allows the article to propagate again through the copy of the copy, and to create extension works, allowing us to use in business Use and remain copyrighted by Wikipedia. But this is a very bad choice for reference to Wikipedia as a reference material. The reason is that the GNU Free Document License Text requires these quoted Wikipedia's documents must fully observe the license of the GNU free document license. In December 2002, CREATIVE COMMONS license was created for the first time. Unlike the GNU General Public Authorization Terms to settle the software authorization, creating CC authorization is designed to give a variety of design creations. After creating CC licenses, including many netizes and works created on the Internet have also been published. But at first, Wikipedia is still unable to directly convert the license into creation of CC authorization. The reason is that the GNU General Public Authorization Terms and Create CCs are not compatible. From November 2008, the Free Software Foundation returned to the GNU free document authorization clause; this made Wikipedia and its sister project invited community members in April 2009 to hold discussions and vote, and book in June 2009. Complete the work of the Change Authorization Terms. Final Wikipedia changed its entry to create a 3.0 protocol in the same way when it was launched on August 1, 2009, while Wikipedia's content is also applicable to the new version of the GNU free document authorization terms.\nHowever, for multimedia files, each language version of Wikipedia has its own processing method. Language versions, including English Wikipedia, allow for use of non-free files in the case of reasonable use, but other language versions of Wikipedia are prohibited due to the lack of reasonable use basis for main use countries, such as the Japanese Wikipedia is limited \"Copyright Law\" is not allowed to use a non-free file. For multimedia files such as deliberate content such as creating CC names - the same manner, the 3.0 protocol, etc., it is often uploaded to the Wiki shared resource managed by the Wiki Media Foundation, and can be used to simultaneously provide Valentine's Venkae. The Wiki Media Foundation does not allow uploading to the Wiki shared resource file, which is managed by Wikipedia as a contributor to the contributor, and the Wiki Media Foundation of the Legal Cases related to the entry content is not required.\n\n\n=== Communication medium ===\n\nSince the content of Wikipedia is based on an open license as an authorization terms, this means that anyone can repeat the article in Wikipedia, and does not need to pay when re-released. In addition to Wikipedia's own website, Wikipedia's content has been published out of the line or offline, including:\n\nWebsite content: Thousands of \"mirror sites\" have once again released the contents of Wikipedia, and some websites can even provide the reference source quoted in Wikipedia, the most famous website in this, including Answers.com And Reference.com. In addition, in Wikipedia launched the friendly interface of the action device, there is an unofficial WAPEDIA to spread Wikipedia.\nApplication: Wikipedia itself also introduces many applications operating on action to promote Wikipedia's content, including Android, iOS, Windows Phone, BlackBerry and Firefox OS, etc., can browse Wikipedia's entry.\nSearch Engine: Some Internet Search Engines will be able to list the contents of Wikipedia as special options in its own search results, including Bing and DuckduckGo, etc.\nVarious discs: Wikipedia has repeatedly launched a disc, such as the \"Wikipedia CD Selection\" in English Wikipedia in 2006, Poland Wikipedia also launched a total of including a total of 2,000 items. 240,000 envelopes, while German and Spanish, Wikipedia have similar plans. In addition, Wikipedia has also collaborated with SOS Children's Village UK, and launched the \"Wikipedia Campus\" as the content of Wikipedia. The CD / DVD series of the Wikipedia for School, and is equally free, manually reviewed and non-commercial licensed, and the contents of the expected CD can bring positive help to the English world. The content included in the disc is mainly based on the National Curriculum as a standard, but it can also assist in connecting the entry on the Wikipedia website, and if it is published in the form of a encyclopedia, there must be 20 Call left and right.\nBooks Publications: Many Wikipedia users expect to assemble their own entry content, and try to promote traditional publishing books. These include the US Publishing Company Books LLC and German Publisher VDM Publishing has worked with Wikipedia, and users who include English, German, Russian, and French Wikipedia have published their own entries since 2009. Book publication.\nLanguage query: Since 2007, Dbpedia starts from English Wikipedia's \"InfoXes\" and \"Page Category\" to extract data, and create a semantic network plan for the query by the technology description framework. At the same time, through the assistance including Semantic MediaWiki and other conversion techniques, the data data of Wikipedia can be extended to read the statement on the website. And these data information to other websites can also be reused in Wikipedia, in addition to citing in the same language version of the Wikipedia article, while also capable of providing information to other language versions of Wikipedia. However, Wikipedia re-uses the complete entry of other websites to other websites, which is not fully encouraged, especially against others to copy the article content through the network spiders. However, these Database DUMP technologies in the past can only be transferred to Wikipedia's articles, and there is only related technologies to give image transfer at the same time until 2007. Another digital version of Wikipedia also sets more services in the \"Inquiry\", and the volunteers will answer the various issues raised by other network users by Volunteers. Among them, based on the statistics of PNINA Shachaf, the statistics of PNINA Shachaf, the Journal of Documentation, and the answer to the Question of its \"inquiry office\" is quite equivalent to the standard library. There is still 55% of all reply, there is still its accuracy.\n\n\n=== Mobile version ===\n\nWikipedia originally preset media is a standard web browser via a connection Internet network to provide user browsing and editing services, and additional users can also browse in action web pages (Mobile Web). In 2004, mobile phone users can browse Wikipedia with Wi-Fi Agreement with Wapedia's service. In June 2007, Wikipedia launched the official website \"En.Mobile.wikipedia.org\" specially used by wireless equipment, which also supports action including more advanced iPhone, Android platform equipment and Palm pre. Device. After that, Wikipedia also introduces a wide variety of equipment and application software in order to support operational browsing, thereby optimizing or improving the content of Wikipedia in the action device, and some even have metadata and geographic information, etc. .\n\n\n== Support ==\n\n\n=== Management organization ===\n\nWikipedia is responsible for hosting and funding by the Wiki Media Foundation belonging to non-profit organization, and the Wiki Media Foundation also manages the Wiki-dictionary and Wiki Textbook. Wiki Media Foundation is mainly based on public or business donation and subsidies, and important donors include American investment, Walen Buffett, former US President Jimmy Carter, and Viji Group Jeff Betzon, Craigslist, founder Jeff Beslist, Craig Newmark, etc. The number of single fund donations is 2010, the $ 2 million subsidy provided by Internet company Google. In addition to assisting users from users to develop their Wikipedia, funding also helps promote the preparations of Wikipedia plans and related funding. Among them, in the 2008 and 2009 fiscal year, the Wiki Media Foundation's expenditure is $ 470,000 per month, of which about 40% of them pay 30 salary of employees, and there is nearly $ 70,000 to provide Gold expenses required for Internet hosting services. In the 2009 and 2010 financial year budget, the Wiki Media Foundation increases the required amount to $ 9,700,000. In addition to the Wiki Media Foundation, other language versions of Wikipedia can also choose pay employees, such as the German Viki Encyclopedia to hire 20 people to help manage Wikipedia communities, maintain system operations and Organized activities, etc.\n\n\n=== Hardware device ===\n\nEarly Wikipedia still still uses only one server to support the software architecture. After 2004, the servo is used to change the distributed multi-level architecture (Multitier Architecture). In January 2005, Wikipedia moved its own website to 39 proprietary servo located in Tanpa, Florida, which was used as the main database Server to run mysql, and there are more Table is used as a database server used; there are still 21 as a web server running an Apache server-side software, and there are seven running Squid as a network cache server. Wikipedia These servers computer clusters are mainly based on the Linux operating system (where Ubuntu accounts for most), and a small part is to run ZFS using the OpenSolaris job system. As of December 2009, Wikipedia has a total of 300 servants in Florida to cope with the needs of major Wikipedia, and also set up 44 servo to provide caching services in Amsterdam, Netherlands, and Yahoo also provides The 23 servo is located in Seoul, the Republic of Korea.\nIf you have a statistical standard in one day, Wikipedia will receive nearly 25,000 to 60,000 page updates per second, where the request is not encrypted to balance the cache server with the front-end to the front-end cache server, the encrypted request with HTTPS will be LVS load balancing to the SSL terminal server running NGINX is still not encrypted, and then sent to the cache server. These cache servers are originally running Squid, running Varnish, and then more constantly updated data and 3 months Browse Wikipedia records will also be stored here. In the cached server, the request is sent to the LVS software and loads balanced to the application server, and these servers currently run the PHP program MediaWiki in Apache, and have planned to migrate to HHVM in the future. The application server is then responsible for sending the request to the page to Vikipedia, reaching the effect of the website page after the update. In order to effectively increase the browsing speed, Wikipedia's web display uses a distributed cache design before deletion, which allows web pages to quickly enter the frequent page content.\n\n\n=== Software use ===\n\nThe earliest Wikipedia is the use of the USEMODWIKI engine written by CLIFFORD ADAMS, and writes the syntax of the super-ended syntax with hump type case. Later, this feature is also included in the MediaWiki double architecture used. Syntax. Beginning in January 2002, Wikipedia made PHPWIKI written in Wikipedia, also supported the use of the mysql database. However, although the soft body is constantly modified to accommodate the demand for the Wikipedia's its own index growth. In July 2002, Wikipedia decided to transfer to another, the same mysql, using PHP to write and open the original code-based MediaWiki to operate. MediaWiki also adopts GNU General Public Authorization Terms, which makes it possible to use all language versions of Wikipedia and related sisters. As a free open source Wiki engine, the MediaWiki written by Lee Daniel Crocker has also owned programming, gauge, variables, web template embedded including and domain name destinations, and then Other Wikipedia users have also designed and extended features based on MediaWiki. For example, in April 2005, Wikipedia added a built-in search function in MediaWiki, which also enables the search results to change from the original mysql design. The search engine used today Wikipedia is Lucene Search2.1, which is particularly particularly written based on the LUCENE Database 2.3 version of Java.\n\n\n== Impact ===\n\n\n=== Sister Plan ===\nUnder the lending of the Wiki Media Foundation, Wikipedia also spawned several sisters. The first related places are the \"mourning: ninth one Wiki\" (in Memoriam: September 11 Wiki) established in October 2002, and the content is a detailed introduction of the Journal of one attack. In December 2002, a Wiki-British dictionary with a dictionary function was introduced, while a worship Wiki Media Foundation launched a wiki quotes of the recorded discourse, as well as Wiki Teaching books that equally cooperated to provide free textbooks and annotations. After this, the Wiki Media Foundation also launched Wiki shared resources for the collection of free content, providing Wiki News for all the people prepared by various people, as the Wiki species of the species catalog, including GNU free document authorization clause or other public domain Wikikin, and online learning resources that are included in the liberticle, as well as the Wiki Academy of Wiki, which provides free line teaching environment. However, in all places, only Wiki shared resources have their integrity compared to Wikipedia.\n\n\n=== Publishing vendor ===\nSome observers pointed out that the emergence of Wikipedia represents the threat of the traditional encyclopedia, because the publishing manufacturers responsible for the latter are unable to compete with free Wikipedia. Nikolars Carl's article \"The Amorality Of Web 2.0) written in 2005, criticized Web 2.0 strongly developed by Wikipedia created content by users. It may replace more professional content industry publishers, because \"Free quality is more than quality\". Carl and said: \"In the ecstatic Web 2.0 dream, hidden people are dominant, I don't think there is something more terrible than this.\" But for Wikipedia or similar planning will be completely replaced Traditional publishing publications remains one of the concepts that are constantly questioned by the academic circles; such as \"Connection\" magazine editorial group editor Chris Anderson mentioned in \"Nature\", Wikipedia adopted \"group The way of wisdom will not replace the SCIENTIFIC JOURNAL in rigorous peer review.\n\n\n=== Social interaction ===\n\nAs the number of Wikipedia entries has been stable in 2001, Wikipedia has also gradually increased as a reference website in the status of logistic function. According to the statistics of Alexa Internet and Comscore, Wikipedia once is one of the top ten people in the world. The rapid growth of Wikipedia has also prompted it to have an important role in Google search results, while Wikipedia's browsing engine has a search engine from Google Search. With the development of Internet network, Wikipedia has gradually become an important reference for academic research. According to the statistics at the end of 2009, the number of people using Wikipedia using Wikipedia is as high as 365 million; the Phiral Research Center investigates the use of American people in life, and found that nearly one-third of Americans will refer to Wikipedia. opinion. In October 2006, another survey for Wikipedia was promulgated that the market value of the website was nearly 580 million US dollars.\nToday, Wikipedia's content is also used in academic research, book publications, meeting reports, and bills of bills. For example, in the Canadian Congress website, it is easy to provide Wikipedia's entry to introduce the same-sex marriage, and in \"further browsing\" also provides information on the National Marriage Act. However, although the US federal court and the World Intellectual Property Organization and other landlores are used as credentials, these organizations are often used by Tiwiki Encyclopedia as their own view, but will not take the Wiki. The content of the encyclopedia is based on the basis of judgment. In addition, Wikipedia's entry is often used as a main source, and some American intelligence systems have also been in Wikipedia as their own source in the report. In December 2008, the Scientific Magazine \"RNA Biology\" said that if you want to publish a research report on RNA in the magazine, the author must first assist Wikipedia edited RNA related to data data on RFAM. entry.\nWikipedia is also used as a source of news, however, due to the nature of Wikipedia free use, a reporter's plagiarism entries have also occurred. In July 2007, the BBC Radio 4, BBC Radio 4, also took a 30-minute record short film as the theme as the theme. The BBC believes that the use of Wikipedia in pop societies has also deepened people's understanding of Wikipedia, which also made the word \"Wikipedia\" becomes one of the important nouns of the 21st century. The BBC also mentioned that Wikipedia and Google, Facebook and YouTube have become a familiar word, even as the Hoover Vacuum Corporation in the 20th Century and Coca-Cola as a brand. Need to explain again. In September 16, 2007, the Washington Post reported that Wikipedia has become one of the important rendezvous points of the US presidential election in 2008. \"Washington Post\" said this: \"When using Google Search for the name of one of the candidates, the first search result is Wikipedia website. This makes the content of these entrys, as the importance of the candidate is general. At the same time, every day, the content related to the president is constantly edited, analyzed, and debates numerous times. \"In October 2007, Reuters published\" Wikipedia Page The Latest Status Symbol). The article mentioned in this report that Wikipedia has been enough to judge the visibility of things.\nHowever, Wikipedia's high-level name also attracted the society to start to speculate on the negative meaning and impact of the society, such as many critics believe that the content of the editing entries, the students with legal professional are more clear than the text of the general public. And concise. In September 28, 2007, Vantimi's Franco Grillini is facilitated in the Parliament, and the Minister of Cultural Resources is questioned, requiring the Government to the Government of Wikipedia and Freedom of Panorama. Expand the review. Grieriti claims that as a seventh consultation website, Wikipedia's use of free scenery has violated the stipulations of the photos of the photos of modern buildings and artworks, and even thus cause serious impact on the national tourism revenue of Vantage. .\n\n\n=== Get award ===\nIn May 2004, Wikipedia won two important awards. The first is to obtain the first place in the \"Electronic Community\" project established in the Annual Electronic Art Award, Wikipedia also uses 10,000 Euro bonuses issued by the Electronic Art Award as a donation, and participates in Austrian Electronics at the end of the same year. The activities held by ARS ELECTRONICA. In addition, Wikipedia also won the \"Community\" award from the Weimi Award, and is also nominated as \"Best Practice\" category by the International Academy of Digital Arts and Sciences (INTERNATIONAL ACADEMY OF Digital ARTS and Sciences). At January 26, 2007, the Brand Channel (Brandchannel) ranked 4th high-quality brand in the user's evaluation, while \"which brand has the greatest impact on our life in 2006?\" Get 15% support rate. September 2008, Wikipedia and Boris Tidi and Peter Gabriel won the German German Four-Maffer Foundation (QUADRIGA), which was quadriga, and by WERKSTATT DEUTSCHLAND. David WEINBERGER issued award award award award for Wells, which represents Wikipedia, and donated 25,000 Euro to German Wikipedia as a bonus.\n\n\n=== Caricature of the opposite side ===\n\nWikipedia is edited by its open nature and a certain number of wrong information, as well as anyone can easily edit the contents of the article, this feature has also prompted Wikipedia to become a mediator of many media. Comedy actor Steffin House continuously refers to the information on Wikipedia in many plots of the Colbert Report; and also created him also created a new word \"WikiAlity\", and said the word means \"We can work together to create a fact that everyone agrees - just actually it is our just agreed.\" In July 2006, \"The Onion\" also published the \"Wikipedia celebrate the 750th Anniversary of Wikipedia\" in its own first version, to satirize the accuracy of the contents of the Wikipedia's entry.\nIn the TV scene comedy, Wikipedia's characteristics have also been mentioned, for example, in the \"negotiation\" of the \"Office\" in the 2005 TV series, Michael Scott Tell: \"Wikipedia is the best thing ever. Anyone in this world can write the theme you like, so you can know what you want to get the best.\" And TV in 2007 In the \"My Number One Doctor\" \"My Number One Doctor\", \"Internship Doctor Growth\", Wikipedia can be used as a reference tool in some slight diseases; but Pai Rui in the plot. Dr. Cox also mentioned the contents of Wikipedia to his patient, indicating that Wikipedia prepared eggotism (Raw Foodism) can contribute to users of bone tumor, in fact, in the past The list of episodes have been written \"Space Fortress Karaica\".\nIn 2008, the comedy sharing website university laughed without the short film of \"PROFESSOR Wikipedia\", and the content of the fictional professor taught himself to mix and unable to verify the information. There will be an extremely ridiculous statement. In July 2009, the Fourth Radio of the British Broadcasting Company launched a funny work Bigipedia. The content is to imitate Wikipedia placed other ridiculous content on the website. In 2010, the comedy actor Daniel Tosh encouraged himself to host the audience \"Du Shu\" (TOSH.0), and went to the program entry to navigate to Wikipedia and assisted.\n\n\n== Comment ==\n\nAlthough Wikipedia will often provide improved markers for writing inappropriate entries, the critics also point out that the style and quality of individual articles still have a very large change. In particular, for controversial topics, public figures or historical figures, there will often be edited users to hold inherent prejudices and join them as facts. Although Wikipedia's task is tuned as a simple provider, there is no more conclusive value, but there are often some articles that must be reviewed and modified. However, there are also some articles that are required to strictly review because of more personal factors, this includes unpleasant, content is too strong, and the article is too trivial, or even because the entry refers to the rest of the matter, etc. . In 2006, Wikipedia Watch criticized a case where dozens of editorial users plagiarized other articles in English versions of the Wikipedia Wikipedia Watch; Fortio Encyclopedia infringement of other articles rights, Wales said: \"We need to deal with such an attitude that must be absolutely tough and unopened, because this plagiarism is 100% with all our core principles.\"\n\n\n=== Accuracy ===\n\nThe general traditional encyclopedia is mostly arranged in the \"British Encyclopedia\", and therefore the accuracy of these encyclopedia will be able to bring a reputation for the encyclopedia. But on the other hand, Wikipedia, which is also expected to be a encyclopedia, often referred to in fact that the facts stated in its entry, and even if there is a wrong information constantly referred to. Australian National University is mainly prepared by Wikipedia, which is mainly composed of unreaculated users, and mentions the most common editorial entries often not related types of experts, but also invested in Wikipedia. A certain degree still can be used as a role of tool books. In December 2005, in the magazine \"Nature\" a non-scientific report, the accuracy of English Wikipedia in some scientific articles is actually close to the level of \"British Broke\". \"Nature\" invites experts from various fields to randomly check the same entry content and check the entry errors, and found that both have extremely close probability of \"serious mistakes\". According to the statistics, Wikipedia found that the frequency of \"British Broke\" has averaged 3 errors, and the \"natural\" also mentioned that the structural arrangement of Wikipedia's articles in the article is often poor. But \"Nature\" said that many disputes have been raised, especially the accuracy of the accuracy of both Wikipedia and the \"Big Bank\". In 2014, in accordance with a study of the University of Campbell, Wikipedia and the disease related to the disease have in fact errors.\nDue to the editing architecture of Wikipedia Wiki and allows anyone to add, modify, and delete entries, it is made to make any edit user claim or responsibility on the issue of content, which also allows Wikipedia to guarantee the guarantee The content of the entry. However, although Wikipedia lacks the relevant accountability system to make improvements, still more or less, some anonymous users will join false information and constantly debate the correctness of these messages, facing similar situations often can only be able to The name of \"destroying\". However, critics still believe that Wikipedia's open nature and most of the information lack the correct source, so that Wikipedia cannot say it is very reliable. Some critics believe that Wikipedia may be reliable in some entries, but any entry cannot simply determine if it is really reliable. Some of the traditional reference books such as \"British Encyclopedia\" have repeatedly questioned whether Wikipedia has the utility and status of the encyclopedia. However, most of the most high quality entries in Wikipedia can often maintain its level for a long time, which means that the destruction describes such a huge impact on the content, and there is no critics; the vast majority Wikipedia administrator is active Politics, religion, etc. The content of controversial nature or have been used for a long time to be destroyed. It is often maintained in the way of inspected editing behavior, and even incorporates measures to adopt an entry protection when serious damage. Taylor Kewen of this economist said: \"If I have to pick it from Wikipedia or the medium-sized economic magazine article, I will still choose Wikipedia.\" He said that even if it is traditional The source of sources is a non-fictional thing, and it is still a prejudice of the article in the article or its own opinion. In his opinion, the excessive report of the magazine will make people ignore the relevant news report. News. However, he also reminded that incorrect information is often found in the Internet, which means that scholars and experts must keep alert and correct their errors.\nOn the other hand, Wikipedia adopts an open structure that makes it an easily attack on the Internet, which means that many destroyers can drive a large number of messages or spam to affect Wikipedia. At the same time, including the US House of Representatives, other special interest groups often require their organization members, deliberately to edit related entries and beautify, and even Microsoft also provide money to reward for Wikipedia users to assist \"modification\" Related entries. This problem has also been confirmed by mimics, and the most attractive thing is that Steffen Hut is directly ironically filed in the Holbook Report (The Colbert Report). In addition, the Wiki scanner was officially operated in August 2007, and the beginning of the use of the Wikipedia account to modify the identity of the Wikipedia enamel by the anonymous editing function; where the website investigation and comparison, many companies are found or Members of government agencies, staff or employees often modify the content related to their own in anonymous way.\n\n\n=== Article quality ===\nSince Wikipedia's contributors usually only modify a small part of the entry content, and a few will cost a long time to revise all articles, which may mix high and uneven quality content at the same entry. . History Professor Roy Rosenweig believes that \"American National Biography\" has a line version of the online version of Wikipedia, which is that \"the American Biographical Dictionary\" has \"clear and This is a very important part of many excellent historical works. Rosenwi believes in the \"American Biographical Dictionary\" online version of James M. MCPHERSON, which is written in James M. MCPHERSON, which is written in James M. MCPHERSON, which is written in James M. MCPHERSON. Both are basically able to accurately describe the main content of Lin Lin's life; but he also mentioned: \"McReforn has a rich context change ... His words cleverly capture Lincoln's voice ... and also have the ability to use very little sentence The discourse can communicate deep plot. \"The opposite Wikipedia's article was criticized as\" lengthy and dull \". At the same time, Rosenwi also criticized: \"Encourage NPOV policy is just Hu Jun's idea, this is not to see any overall interpretation of history in Wikipedia.\" He quoted Williace Kunte William Quantrill as an example, although this entry gains a positive evaluation in terms of content, Russenvi criticizes the contents of the criticism. He said: \"Some historians will describe him as opportunistic molecules and bloodthirsty fugitives, but people can regard him as a bold soldier and local folk hero.\"\nOther critics also have similar views on the article that even if the content of Wikipedia is correct, it is often written in a lack of literary and almost unreadable style. Overview of Wikipedia andrew Orlowski commented: \"Even if the entry of Wikipedia is actually 100% correct, and these facts often have careful choice; however, when reading enamections As if the article is first translated from a foreign language, it is once again translated into a third language, and every translation is responsible for those who don't understand words. \"About Toma Jefferson University (Thomas\" Jefferson University Cancer Center Jacob Lawrence (Yaacov Lawrence) When commenting Wikipedia's cancer entries, it will mention most of the contents of the entry, but for internal medical inquiry data inventory of nine-grade reading levels. (Physician Data Query) content is often described in English in English. This makes him think The reason why Base is lacks \"readability\" because it comes from different sources and messy editing. The \"Economist\" believes that there is a perfect article that is often more reliable, however \"indecent or 谩 谩 format is often reflecting the thoughts and imperfect information\". \"\n\n\n=== Reliability ===\n\nLecture, a college lecturer (LeCTure), does not encourage students to replace the function of a literature on academic works, and some universities have even highlighted the provision of Wikipedia content. At the same time, Wales also emphasized whether any type of encyclopedia is usually not suitable as an academic source, and Wikipedia should not be deemed to be cited by authority.\nIn February 2007, \"The Harvard Crimson\" issued an article to report that several Harvard University teaches Wikipedia as one of its sources of syllabus, but there is a difference in the use of Wikipedia. In 2011, the Harvard Institute published in the Harva University of Harvard will mention that open Wikipedia as a reference source will become a great \"gospel\" in the case of strengthening relevant regulations and effective management. It is believed that although Wikipedia has no authoritative certification, openness can provide some basic facts, and can also assist in the ability to lead more difficulties.\nIn addition, in June 2007, the US Library Association, MICHAEL Gorman, who made Wikipedia made Wikipedia with Google, and considered that academic circles agreed to use Wikipedia as a source of \"a nutrition Teacher recommends that he is often consumed to eat Marah Hamburg and a variety of foods. He said that students learn only the source of the source of the Internet is despite, especially the current increasing document data is referenced in academic materials, and most of them are the main source of newspapers or network messages. In the same article, Jenny Fry, a researcher, an Oxford Internet Institute (Oxford Internet Institute), comments, Quasiki, as a source, said: \"You can't say that children use internet networks. It is a lazy behavior. In fact, many scholars will use the search engine to query information while they study. But different is that the latter has more experience to determine what is what he wants to find and whether the source is authoritative? Therefore, children should be teaching how to use internet inquiry in the correct and appropriate timing. \"\n\n\n=== Dispute content ===\n\nDue to the use of image convey information, Wikipedia has been criticized to some extent, some of which contain an inheatly content such as feces, autopsy, human organs, and Wikipedia, including some special description erotic The image of the content, the image of the hard-tuning porn with masturbating and ejaculation. These images related to Wikipedia entries can be viewed by the Internet to communicate through the Internet, which includes children who have not yet perfect judgment. Among them, Larry Sange, one of the Wikipedia founders, said Wikipedia can have some pornographic content, but it can make children browse the practice dissatisfaction, and he also criticizes Wikipedia has too extreme and deliberately Photos and videos in it.\nFor this controversial content, Wikipedia has also been often demanded by many people, such as English Wikipedia, which describes Germany heavy metal orchestra, and its album entry \"Virgin\" is questioned. Among the album entries of \"Virgin\", Wikipedia directly cited the original cover as an introduction; however, the content of the cover is a photo of Preadolescence, in many countries, due to the initial cover Replaced by another image. In December 2008, the Internet Observatory referred to whether the British people included in Wikipedia contained it as a blacklist, and alleged that the same arrangement of non-profit civil organizations would only make people Feeling \"insequent\", the British main Internet service provider also landed to prohibit users from accessing Wikipedia 4 days.\nIn April 2010, Larry Sanger sent a letter to the Federal Investigation Bureau to worry about the image of children's pornography in two categories of Wiki shared resources, and believe that this may have violated \"United States\" (United States \" The provisions of ObsCenity LAW). Sange later said that although these images involved in love or Loli control are not photographing real children, their \"Patient\" for children's permanent abuse is already in violation of the 2003 Protection Act (Protect Act Of 2003) It is stipulated that he also believes that these images are not suitable for people to browse Wikipedia at the school agency. According to the Legal Regulations of the 2003 Protection Act, the law prohibits the spread of children in the United States including photography, cartoon images or paintings, etc. Jay Walsh, Jay Walsh, strongly opposed Sange allegations, stressed that there is no thing in Wikipedia, \"Let us feel illegal\", and say if there is really It has been deleted by us. However, after the Sange complaints Wikipedia, Wells immediately deleted these images without inquiry with the community, so that some volunteers of this type of entry considered deleted moves too much. Later, Wah said voluntarily abandoned some of the special powers obtained at the same founder, and wrote at the Wiki Media Foundation's mailing list: \"We encourage this kind of discussion because of the true philosophical and content issues Interest choices, rather than critical, how fast the performance of this behavior is. \"\n\n\n== Similar plans ==\n\n\n=== Previous concept ===\nBefore you open the website in Wikipedia, you have prepared an entry by the people and interact with multimedia encyclopedia. The first in 1986, along with the BBC microcomputer system (BBC Micro), the BBC Domesday Project, which included the documentation and photo information provided by more than 1 million British contributors. The content includes the geography, art and cultural aspects of the UK. The Planning of the BBC's end-day trial book became the first interactive multimedia encyclopedia, and the first one to presented a large number of multimedia files through internal links, and the BBC did the end of the Trial Trial and many UK Interactive map system cooperation. In 2008, the end of the Trial Capency was modified to the user system used in the website.\nBut the earliest idea is the encyclopedia of the encyclopedia with the Internet, and Rick Gates, one of the pioneers of the network, is proposed in the USENET news group in October 1993. Conception, but in the end, Interpedia, which is derived, has been in the plan. The early and successful network encyclopedia, which is more successful and combined with the people, including EVERYTHING2 assisted by SlashDot in 1998, and Douglas Adams H2G2 opened in 1999. These two network encyclopedia compared to many media encyclopedians in the past, their respective editing environments are relatively easy, but they also start focusing on more and more detailed entries. But although these plans are essentially similar to Wikipedia itself, there is no more convenient editing function such as Wiki technology, and the gauge does not give general public users full editorial privileges.\n\n\n=== in the same period ===\nIn the Wikipedia website, I just found the original Nupedia, in addition to the original Nupedia, another similar concept in January 2001, the GNE network encyclopedia launched by the Free Software Richard Stormman plan. However, although Wikipedia, Nupedia and GNE have been used as the independent encyclopedia of each other as the independent encyclopedic book, today Nupedia and GNE have announced the cessation of operation and transfer their website content on Wikipedia webpage. With the rapid growth of Wikipedia, many websites also followed the core concept of collaborative editing to establish a knowledge base. In this, such as sustening.nu and free Encyclopedia are still using the core value of Wikipedia, there are also such as headline encyclopedia, Baidu Encyclopedia, and conservative encyclopedia decision to implement informal autonomous review systems for users. In addition, some online encyclopedia is trying to solve the problem of Wikipedia known content, and in order to provide more reliable and high-quality entries, this type of encyclopedia includes Scholarpedia. With the mass encyclopedia. In addition, there are many networks that have a Software Technology and Team of Wiki Media Foundation, and also cooperate with Wikipedia to construct an open-use Biological Database Life Mate Encyclopedia and include MAREFA with an ancient book information.\n\n\n== See ==\n\nInterpedia\nQrpedia\nWikipedia Review\nWiki list\nEditing Wikipedia involving conflicts of interest\nReview and blockade of Wiki Media\nKnowledge democratization\nOnline encyclopedia\nWikipedia: Press Release\nWikipedia: FAQ\nNetwork external\nConsenscious initiative\nWiki Media Plan\n\n\n== Reference ==\n\n\n=== Quote ===\n\n\n=== Source ===\nAcademic research literature\n\nOther publications\n\n\n== External link ==\nOfficial website\n\nOther websites "}