{"topic": "Massage", "english_title": "Massage", "english": "Massage is the manipulation of the body's soft tissues. Massage techniques are commonly applied with hands, fingers, elbows, knees, forearms, feet, or a device. The purpose of massage is generally for the treatment of body stress or pain. A person professionally trained to give massages is traditionally known as a masseur (male) or a masseuse (female) in European countries.  In the United States, these individuals are often referred to as massage therapists because they must be certified and licensed as \"Licensed Massage Therapists.\"\nIn professional settings, clients are treated while lying on a massage table, sitting in a massage chair, or lying on a mat on the floor. There are many different modalities in the massage industry including but not limited to: Swedish, deep tissue, structural integration, trigger point, manual lymphatic drainage, sports massage, Thai massage, and medical-massage.\n\n\n== Etymology ==\nThe word comes from the French massage \"friction of kneading,\" which, in turn, comes from the Arabic word مَسَّ massa meaning \"to touch, feel.\"Others claim an origin from the Portuguese amassar \"knead,\" from the Latin massa meaning \"mass, dough,\" from the Greek verb μάσσω (massō) \"to handle, touch, to work with the hands, to knead dough.\" In distinction the ancient Greek word for massage was anatripsis, and the Latin was frictio.\n\n\n== History ==\n\n\n=== Ancient times ===\nArchaeological evidence of massage has been found in many ancient civilizations including China, India, Japan, Korea, Egypt, Rome, Greece, and Mesopotamia.\nBC 2330: The Tomb of Akmanthor (also known as \"The Tomb of the Physician\") in Saqqara, Egypt, depicts two men having work done on their feet and hands, possibly massage.\n\nBC 2000: The word muššu'u (\"massage\") is written for the first time, and its use is described, in some Sumerian and Akkadian texts found at the beginning of the 21st century in ancient Mesopotamia.BC 722–481: Huangdi Neijing is composed during the Chinese Spring and Autumn period. The Nei-jing is a compilation of medical knowledge known up to that date, and is the foundation of traditional Chinese medicine. Massage is referred to in 30 different chapters of the Nei Jing. It specifies the use of different massage techniques and how they should be used in the treatment of specific ailments, and injuries. Also known as \"The Yellow Emperor's Inner Canon,\" the text refers to previous medical knowledge from the time of the Yellow Emperor (approx 2700 BC), misleading some into believing the text itself was written during the time of the Yellow Emperor (which would predate written history).BC 762 \"In the Iliad and the Odyssey the massage with oils and aromatic substances is mentioned as a means to relax the tired limbs of warriors and a way to help the treatment of wounds.\"BC 700 Bian Que, the earliest known Chinese physician uses massage in medical practice.BC 500 Jīvaka Komarabhācca. According to the Pāli Buddhist Canon, Jivaka was Shakyamuni Buddha's physician. Jivaka is mistakenly credited with founding and developing a style of massage that led to the type of massage practiced in current-day Thailand. He was a doctor and a surgeon, but not a massage therapist.\nBC 493: A possible biblical reference documents daily \"treatments\" with oil of myrrh as a part of the beauty regimen of the wives of Xerxes (Esther, 2:12).BC 460: Hippocrates wrote \"The physician must be experienced in many things, but assuredly in rubbing.\"BC 300 Charaka Samhita believed to be the oldest of the three ancient treatises of Ayurvedic medicine, including massage. Sanskrit records indicate that massage had been practiced in India long before the beginning of recorded history.AD 581: Dr Sun Si Miao introduces ten new massage techniques and systematizes the treatment of childhood diseases using massage therapy.AD 581: China establishes a department of massage therapy within the Office of Imperial Physicians.\n\n\n=== Middle Ages ===\nMedical knowledge, including that of massage, made its way from Rome to Persia in the Middle Ages. Many of Galen's manuscripts, for instance, were collected and translated by Hunayn ibn Ishaq in the 9th century. Later in the 11th-century copies were translated back into Latin, and again in the 15th and 16th centuries, when they helped enlighten European scholars as to the achievements of the Ancient Greeks. This renewal of the Galenic tradition during the Renaissance played a very important part in the rise of modern science.\nOne of the greatest Persian medics was Avicenna, also known as Ibn Sina, who lived from 980 AD to 1037 AD. His works included a comprehensive collection and systematization of the fragmentary and unorganized Greco-Roman medical literature that had been translated Arabic by that time, augmented by notes from his own experiences. One of his books, Al-Qānūn fī aṭ-Ṭibb (The Canon of Medicine) has been called the most famous single book in the history of medicine in both East and West. Avicenna excelled in the logical assessment of conditions and comparison of symptoms and took special note of analgesics and their proper use as well as other methods of relieving pain, including massage.\nAD 1150: Evidence of massage abortion, involving the application of pressure to the pregnant abdomen, can be found in one of the bas reliefs decorating the temple of Angkor Wat in Cambodia. It depicts a demon performing such an abortion upon a woman who has been sent to the underworld. This is the oldest known visual representation of abortion.\n\n\n=== 18th and 19th centuries ===\nAD 1776: Jean Joseph Marie Amiot, and Pierre-Martial Cibot, French missionaries in China translate summaries of Huangdi Neijing, including a list of medical plants, exercises, and elaborate massage techniques, into the French language, thereby introducing Europe to the highly developed Chinese system of medicine, medical-gymnastics, and medical-massage.AD 1776 Pehr Henrik Ling, a Swedish physical therapist, and teacher of medical-gymnastics is born. Ling has often been erroneously credited for having invented \"Classic Massage\" aka \"Swedish Massage,\" and has been called the \"Father of Massage.\"AD 1779: Frenchman Pierre-Martial Cibot publishes \"Notice du Cong-fou des Bonzes Tao-see\" also known as \"The Cong-Fou of the Tao-Tse,\" a French language summary of medical techniques used by Taoist priests. According to Joseph Needhan, Cibot's work \"was intended to present the physicists and physicians of Europe with a sketch of a system of medical gymnastics which they might like to adopt—or if they found it at fault they might be stimulated to invent something better. This work has long been regarded as of cardinal importance in the history of physiotherapy because it almost certainly influenced the Swedish founder of the modern phase of the art, Per Hendrik Ling. Cibot had studied at least one Chinese book, but also got much from a Christian neophyte who had become expert in the subject before his conversion.\"AD 1813 The Royal Gymnastic Central Institute for the training of gymnastic instructors was opened in Stockholm, Sweden, with Pehr Henrik Ling appointed as principal. Ling developed what he called the \"Swedish Movement Cure.\" Ling died in 1839, having previously named his pupils as the repositories of his teaching. Ling and his assistants left a little proper written account of their methods.AD 1878: Dutch massage practitioner Johan Georg Mezger applies French terms to name five basic massage techniques, and coins the phrase \"Swedish massage system.\" These techniques are still known by their French names (effleurage (long, gliding strokes), petrissage (lifting and kneading the muscles), friction (firm, deep, circular rubbing movements), tapotement (brisk tapping or percussive movements), and vibration (rapidly shaking or vibrating specific muscles)).\n\n\n=== Modern times ===\n\n\n==== China ====\nMassage in China is an extremely popular therapy, the city of Shanghai alone playing host to over 1500 foot massage centers while there are more than 3000 in Shenzhen. It is one of the biggest service industries in China with workers in Shanghai numbering in the tens of thousands. The average rate of pay for a worker in the massage industry in China is over 10,000 yuan per month, making it among the highest paid jobs in China's service sector. China's massage parlors are frequently linked to the sex industry and the government has taken a number of measures in recent times to curb prostitution and the spread of disease. In a nationwide crackdown known as the yellow sweep (\"Yellow\" in Mandarin Chinese refers to sexual activities or pornographic content), limitations on the design and operation of massage parlors have been placed, going so far as requiring identification from customers who visit massage establishments late at night and logging their visits with the local police.\n\n\n==== United States ====\nMassage started to become popular in the United States in the middle part of the 19th century and was introduced by two New York physicians, George and Charles Taylor, based on Per Henrik Ling's techniques developed in Sweden.During the 1930s and 1940s massage's influence decreased as a result of medical advancements of the time, while in the 1970s massage's influence grew once again with a notable rise among athletes. Until the 1970s, nurses used massage to reduce pain and aid sleep. The massage therapy industry is continuously increasing. In 2009, U.S. consumers spent between $4 and $6 billion on visits to massage therapists. In 2015, research estimates that massage therapy was a $12.1 billion industry.All but 6 States require massage therapists to be licensed, and licensure requires the applicant to receive training at an accredited school, and to pass a comprehensive exam.  Those states that require licensure also typically require continuing education in massage techniques and in ethics.\n\n\n==== United Kingdom ====\nThe service of massage or \"physiological shampooing\" was advertised in The Times from as early as 1880. Adverts claimed it as a cure for obesity amongst other chronic ailments.\n\n\n==== Sports, business and organizations ====\nMassage developed alongside athletics in both Ancient China and Ancient Greece. Taoist priests developed massage in concert with their Kung Fu gymnastic movements, while Ancient Greek Olympians used a specific type of trainer (\"aleiptes\") who would rub their muscles with oil. Pehr Ling's introduction to massage also came about directly as a result of his study of gymnastic movements.\nThe 1984 Summer Olympics in Los Angeles was the first time that massage therapy was televised as it was being performed on the athletes. And then, during the 1996 Summer Olympics in Atlanta massage therapy was finally offered as a core medical service to the US Olympic Team. Massage has been employed by businesses and organizations such as the U.S. Department of Justice, Boeing and Reebok. Notable athletes such as Michael Jordan and LeBron James have personal massage therapists that at times even travel with them.\n\n\n== Types and methods ==\n\n\n=== Acupressure ===\n\nAcupressure [from Latin acus \"needle\" (see acuity) + pressure (n.)] is a technique similar in principle to acupuncture. It is based on the concept of life energy which flows through \"meridians\" in the body. In treatment, physical pressure is applied to acupuncture points with the aim of clearing blockages in those meridians. Pressure may be applied by fingers, palm, elbow, toes or with various devices.\nSome medical studies have suggested that acupressure may be effective at helping manage nausea and vomiting, for helping lower back pain, tension headaches, stomach ache, among other things, although such studies have been found to have a high likelihood of bias.\n\n\n=== Aquatic bodywork ===\n\nAquatic bodywork comprises a diverse set of massage and bodywork forms performed in water.  This includes land-based forms performed in water (e.g., Aquatic Craniosacral Therapy, Aquatic Myofascial Release Therapy, etc.), as well as forms specific to warm water pools (e.g., Aquatic Integration, Dolphin Dance, Healing Dance, Jahara technique, WaterDance, Watsu).\n\n\n=== Ashiatsu ===\n\nIn shiatsu, the practitioner uses their feet to deliver treatment. The name comes from the Japanese, ashi for foot and atsu for pressure. This technique typically uses the heel, sesamoid, arch, and/or whole plantar surface of foot, and offers large compression, tension and shear forces with less pressure than an elbow, and is ideal for large muscles, such as in thigh, or for long-duration upper trapezius compressions. Other manual therapy techniques using the feet to provide treatment include Keralite, Barefoot Lomilomi, and Chavutti Thirumal.\n\n\n=== Ayurvedic massage ===\nAyurvedic massage is known as Abhyangam in Sanskrit. According to the Ayurvedic Classics Abhayngam is an important dincharya (Daily Regimen) that is needed for maintaining a healthy lifestyle. The massage technique used during Ayurvedic Massage aims to stimulate the lymphatic system. Practitioners claim that the benefits of regular Ayurvedic massage include pain relief, reduction of fatigue, improved immune system, and improved longevity.\n\n\n=== Burmese massage ===\n\nKnown in Myanmar as Yoe Yar Nhake Nal Chin, meaning \"traditional massage,\" Burmese massage has its ancient origins from Thai, Chinese and Indian medicine. Currently, Burmese massage also includes the use of local natural ingredients such as Thanaka, which helps to promote smooth skin and prevents sunburn.\nBurmese massage is a full body massage technique that starts from head to toes, drawing on acupuncture, reflexology, and kneading. Signature massage strokes include acupressure using the elbows, quick gentle knocking of acupressure points, and slow kneading of tight muscles. The massage aims to improve blood circulation and quality of sleep, while at the same time help to promote better skin quality.\n\n\n=== Bio-mechanical stimulation (BMS) massage ===\nBio-mechanical stimulation (BMS) is a term generally used for localised biomechanical oscillation methods, whereby local muscle groups are stimulated directly or via the associated tendons by means of special hand held mechanical vibration devices. Biomechanical oscillation therapy and training is offered in a variety of areas such as competitive sports, fitness, rehabilitation, medicine, prevention, beauty, and used to improve performance of the muscles and to improve coordination and balance. It is often used in myofascial trigger point therapy to invoke reciprocal inhibition within the musculoskeletal system. Beneficial effects from this type of stimulation have been found to exist; the efficacy of the BMS Matrix therapy was proven in an independent study carried out by TÜV-Süd which was commissioned by German health insurer BKK Gesundheit.\n\n\n=== Biodynamic massage ===\n\nBiodynamic massage was created by Gerda Boyesen as part of Biodynamic Psychotherapy. It uses a combination of hands-on work and \"energy work\" and also uses a stethoscope to hear the peristalsis.\n\n\n=== Craniosacral therapy ===\n\nCraniosacral therapy (CST) is a pseudoscience that aims to improve fluid movement and cranial bone motion by applying light touch to the skull, face, spine, and pelvis.\n\n\n=== Erotic massage ===\n\nA type of massage that is done in an erotic way via the use of massage techniques by a person on another person's erogenous zones to achieve or enhance their sexual excitation or arousal and to achieve orgasm.\nIt was also once used for medical purposes as well as for the treatment of \"female hysteria\" and \"womb disease.\"\n\n\n=== Lomilomi and indigenous massage of Oceania ===\n\nLomilomi is the traditional massage of Hawaii. As an indigenous practice, it varies by island and by family. The word lomilomi also is used for massage in Samoa and East Futuna. In Samoa, it is also known as lolomi and milimili.  In East Futuna, it is also called milimili, fakasolosolo, amoamo, lusilusi, kinikini, fai’ua.  The Māori call it romiromi and mirimiri.  In Tonga massage is fotofota, tolotolo, and amoamo. In Tahiti it is rumirumi.  On Nanumea in Tuvalu, massage is known as popo, pressure application is kukumi, and heat application is tutu.  Massage has also been documented in Tikopia in the Solomon Islands, in Rarotonga and in Pukapuka in Western Samoa.\n\n\n=== Lymphatic drainage ===\n\nManual lymphatic drainage is a technique used to gently work and stimulate the lymphatic system, to assist in reduction of localized swelling. The lymphatic system is a network of slow moving vessels in the body that carries cellular waste toward the liver, to be filtered and removed. Lymph also carries lymphocytes, and other immune system agents. Manual lymphatic drainage claims to improve waste removal and immune function.\n\n\n=== Medical massage ===\n\nMedical massage is a controversial term in the massage profession. Many use it to describe a specific technique.  Others use it to describe a general category of massage and many methods such as deep tissue massage, myofascial release and triggerpoint therapy as well as osteopathic techniques, cranial-sacral techniques and many more can be used to work with various medical conditions.Massage used in the medical field includes decongestive therapy used for lymphedema which can be used in conjunction with the treatment of breast cancer. Light massage is also used in pain management and palliative care. Carotid sinus massage is used to diagnose carotid sinus syncope and is sometimes useful for differentiating supraventricular tachycardia (SVT) from ventricular tachycardia. It, like the valsalva maneuver, is a therapy for SVT. However, it is less effective than management of SVT with medications.A 2004 systematic review found single applications of massage therapy \"reduced state anxiety, blood pressure, and heart rate but not negative mood, immediate assessment of pain, and cortisol level,\" while \"multiple applications reduced delayed assessment of pain,\" and found improvements in anxiety and depression similar to effects of psychotherapy. A subsequent systematic review published in 2008 found that there is little evidence supporting the use of massage therapy for depression in high quality studies from randomized controlled trials.\n\n\n=== Myofascial release ===\nMyofascial release refers to the manual massage technique that claims to release adhered fascia and muscles with the goal of eliminating pain, increasing range of motion and equilibrioception. Myofascial release usually involves applying shear compression or tension in various directions, cross fiber friction or by skin rolling.\n\n\n=== Reflexology ===\nReflexology also known as \"zone therapy,\" is an alternative medicine involving application of pressure to the feet and hands with specific thumb, finger, and hand techniques without the use of oil or lotion. It is based on a pseudoscientific system of zones and reflex areas that purportedly reflect an image of the body on the feet and hands, with the premise that such work effects a physical change to the body.\n\n\n=== Shiatsu ===\nShiatsu (指圧) (shi meaning finger and atsu meaning pressure) is a type of alternative medicine consisting of the fingers and palm pressure, stretches, and other massage techniques. There is no convincing data available to suggest that shiatsu is an effective treatment for any medical condition.\n\n\n=== Sports massage ===\nSports massage is the use of specific massage therapy techniques in an athletic context to improve recovery time, enhance performance and reduce the risk of injury. This is accomplished using techniques that stimulate the flow of blood and lymph to and from muscles. Sports massage is often delivered before or after physical activity depending on the subject's needs, preferences and goals.\n\n\n=== Structural Integration ===\n\nStructural Integration's aim is to unwind the strain patterns in the body's myofascial system, restoring it to its natural balance, alignment, length, and ease. This is accomplished by hands-on manipulation, coupled with movement re-education. There are about 15 schools of Structural Integration as recognized by the International Association of Structural Integration, including the Dr. Ida Rolf Institute (with the brand Rolfing), Hellerwork, Guild for Structural Integration, Aston Patterning, Soma, and Kinesis Myofascial Integration.\n\n\n=== Swedish massage ===\nThe most widely recognized and commonly used category of massage is the Swedish massage. The Swedish massage techniques vary from light to vigorous. Swedish massage uses five styles of strokes. The five basic strokes are effleurage (sliding or gliding), petrissage (kneading), tapotement (rhythmic tapping), friction (cross fiber or with the fibers) and vibration/shaking.The development of Swedish massage is often inaccurately credited to Per Henrik Ling, though the Dutch practitioner Johann Georg Mezger applied the French terms to name the basic strokes. The term \"Swedish massage\" is actually only recognized in English- and Dutch-speaking countries, and in Hungary. Elsewhere the style is referred to as \"classic massage.\"\nClinical studies have found that Swedish massage can reduce chronic pain, fatigue, joint stiffness, and improve function in patients with osteoarthritis of the knee.\n\n\n=== Thai massage ===\n\nKnown in Thailand as Nuat phaen boran, meaning \"ancient/traditional massage,\" traditional Thai massage is generally based on a combination of Indian and Chinese traditions of medicine.\nThai massage combines both physical and energetic aspects. It is a deep, full-body massage progressing from the feet up, and focusing on sen or energy lines throughout the body, with the aim of clearing blockages in these lines, and thus stimulating the flow of blood and lymph throughout the body. It draws on yoga, acupressure and reflexology.\nThai massage is a popular massage therapy that is used for the management of conditions such as musculoskeletal pain and fatigue. Thai Massage involves a number of stretching movements that improve body flexibility, joint movement and also improve blood circulation throughout the body.  In one study scientists found that Thai Massage showed comparable efficacy as the painkiller ibuprofen in the reduction of joint pain caused by osteoarthritis (OA) of the knee.\n\n\n=== Traditional Chinese massage ===\n\nMassage of Chinese Medicine is known as An Mo (按摩, pressing and rubbing) or Qigong Massage, and is the foundation of Japan's Anma. Categories include Pu Tong An Mo (general massage), Tui Na An Mo (pushing and grasping massage), Dian Xue An Mo (cavity pressing massage), and Qi An Mo (energy massage). Tui na (推拿) focuses on pushing, stretching, and kneading muscles, and Zhi Ya (指壓) focuses on pinching and pressing at acupressure points. Technique such as friction and vibration are used as well.\n\n\n=== Trigger point therapy ===\nSometimes confused with pressure point massage, this involves deactivating trigger points that may cause local pain or refer pain and other sensations, such as headaches, in other parts of the body. Manual pressure, vibration, injection, or other treatment is applied to these points to relieve myofascial pain. Trigger points were first discovered and mapped by Janet G. Travell (President Kennedy's physician) and David Simons. Trigger points have been photomicrographed and measured electrically and in 2007 a paper was presented showing images of Trigger Points using MRI. These points relate to dysfunction in the myoneural junction, also called neuromuscular junction (NMJ), in muscle, and therefore this technique is different from reflexology, acupressure and pressure point massage.\n\n\n=== Tui na ===\n\nTui na is a Chinese manual therapy technique that includes many different types of strokes, aimed to improve the flow of chi through the meridians.\n\n\n=== Turkish bath massage ===\nIn traditional Turkish baths, massage involves not just vigorous muscle kneading, but also joint cracking, \"not so much a tender working of the flesh as a pummelling, a cracking of joints, a twisting of limbs...\" An 18th-century traveler reported:\n\n...one of the attendants begins to press and handle the tops of the shoulders, the muscles of the arm, and successively the whole body; first gently, then by degrees increasing the pressure, till he comes to handle pretty roughly, but without giving pain. This is repeated at short intervals till the skin is perfectly softened. The attendant then taking hold of the bather's fingers, with a dexterous jerk makes each joint crack successively; after which, laying him flat on his back, and bringing the arms across the breast, the shoulder joints are made to crack in like manner.\n\n\n=== Watsu ===\n\nWatsu, developed by Harold Dull at Harbin Hot Springs, California, is a type of aquatic bodywork performed in near-body-temperature water, and characterized by continuous support by the practitioner and gentle movement, including rocking, stretching of limbs, and massage.  The technique combines hydrotherapy floating and immersion with shiatsu and other massage techniques. Watsu is used as a form of aquatic therapy for deep relaxation and other therapeutic intent. Related forms include Waterdance, Healing Dance, and Jahara technique.\n\n\n== Facilities, equipment, and supplies ==\n\n\n=== Massage tables and chairs ===\nSpecialized massage tables and chairs are used to position recipients during massages. A typical commercial massage table has an easily cleaned, heavily padded surface, and horseshoe-shaped head support that allows the client to breathe easily while lying face down and can be stationary or portable, while home versions are often lighter weight or designed to fold away easily. An orthopedic pillow or bolster can be used to correct body positioning.\nErgonomic chairs serve a similar function as a massage table. Chairs may be either stationary or portable models. Massage chairs are easier to transport than massage tables, and recipients do not need to disrobe to receive a chair massage. Due to these two factors, chair massage is often performed in settings such as corporate offices, outdoor festivals, shopping malls, and other public locations.\n\n\n=== Warm-water therapy pools ===\nTemperature-controlled warm-water therapy pools are used to perform aquatic bodywork. For example, Watsu requires a warm-water therapy pool that is approximately chest-deep (depending on the height of the therapist) and temperature-controlled to about 35 °C (95 °F).\n\n\n=== Dry-water massage tables ===\nA dry-water massage table uses jets of water to perform the massage of the client's muscles. These tables differ from a Vichy shower in that the client usually stays dry. Two common types are one in which the client lies on a waterbed-like mattress which contains warm water and jets of water and air bubbles and one in which the client lies on a foam pad and is covered by a plastic sheet and is then sprayed by jets of warm water, similar to a Vichy shower. The first type is sometimes seen available for use in malls and shopping centers for a small fee.\n\n\n=== Vichy showers ===\nA Vichy shower is a form of hydrotherapy that uses a series of shower nozzles that spray large quantities of water over the client while they lie in a shallow wet bed, similar to a massage table, but with drainage for the water. The nozzles may usually be adjusted for height, direction, and temperature to suit the client's needs.\n\n\n=== Cremes, lotions, gels, and oils ===\nMany different types of massage cremes, lotions, gels, and oils are used to lubricate and moisturize the skin and reduce the friction between skin (hands of technician and client).\n\n\n=== Massage tools ===\nThese instruments or devices are sometimes used during massages.  Some tools are for use by individuals, others by the therapist.\n\n\n==== Tools used by massage therapists ====\nInstrument-assisted soft-tissue massage can deploy stainless-steel devices to manipulate tissue in a way that augments hands-on work.\nA body rock is a serpentine-shaped tool, usually carved out of stone. It is used to amplify the therapist's strength and focus pressure on certain areas. It can be used directly on the skin with a lubricant such as oil or corn starch or directly over clothing.\nBamboo and rosewood tools are also commonly used. They originate from practices in southeast Asia, Thailand, Cambodia, and Burma.  Some of them may be heated, oiled, or wrapped in cloth.\n\n\n==== Tools used by both individuals and massagers ====\nHand-held battery-operated massaging and vibrating instruments are available, including devices for massaging the scalp following a haircut.\nVibrating massage pads come in a range of sizes, some with the option of heating.\nVibrating massage chairs can provide an alternative for therapy at home.\nThere is a widespread market in erotic massage instruments, including electric dildos and vibrators such as the massage wand.\n\n\n== Medical and therapeutic use ==\nThe main professionals that provide therapeutic massage are massage therapists, athletic trainers, physical therapists and practitioners of many traditional Chinese and other eastern medicines. Massage practitioners work in a variety of medical settings and may travel to private residences or businesses. Contraindications to massage include deep vein thrombosis, bleeding disorders or taking blood thinners such as warfarin, damaged blood vessels, weakened bones from cancer, osteoporosis, or fractures, and fever.\n\n\n=== Beneficial effects ===\n\nPeer-reviewed medical research has shown that the benefits of massage include pain relief, reduced trait anxiety and depression, and temporarily reduced blood pressure, heart rate, and state of anxiety. Additional testing has shown an immediate increase and expedited recovery periods for muscle performance. Theories behind what massage might do include enhanced skeletal muscle regrowth and remodeling, blocking nociception (gate control theory), activating the parasympathetic nervous system, which may stimulate the release of endorphins and serotonin, preventing fibrosis or scar tissue, increasing the flow of lymph, and improving sleep.Massage is hindered from reaching the gold standard of scientific research, which includes placebo-controlled and double blind clinical trials. Developing a \"sham\" manual therapy for massage would be difficult since even light touch massage could not be assumed to be completely devoid of effects on the subject. It would also be difficult to find a subject that would not notice that they were getting less of a massage, and it would be impossible to blind the therapist. Massage can employ randomized controlled trials, which are published in peer reviewed medical journals. This type of study could increase the credibility of the profession because it displays that purported therapeutic effects are reproducible.\n\n\n==== Single-dose effects ====\n\nPain relief:  Relief from pain due to musculoskeletal injuries and other causes is cited as a major benefit of massage. A 2015 Cochrane Review concluded that there is very little evidence that massage is an effective treatment for lower back pain. A meta-analysis conducted by scientists at the University of Illinois at Urbana-Champaign failed to find a statistically significant reduction in pain immediately following treatment. Weak evidence suggests that massage may improve pain in the short term for people with acute, sub-acute, and chronic lower back pain.\nState anxiety: Massage has been shown to reduce state anxiety, a transient measure of anxiety in a given situation.\nBlood pressure and heart rate: Massage has been shown to temporarily reduce blood pressure and heart rate.\n\n\n==== Multiple-dose effects ====\nPain relief: Massage may reduce pain experienced in the days or weeks after treatment.\nTrait anxiety: Massage has been shown to reduce trait anxiety; a person's general susceptibility to anxiety.\nDepression: Massage has been shown to reduce subclinical depression.\n\n\n==== Neuromuscular effects ====\nMassage has been shown to reduce neuromuscular excitability by measuring changes in the Hoffman's reflex (H-reflex) amplitude.  A decrease in peak-to-peak H-reflex amplitude suggests a decrease in motoneuron excitability. Others explain, \"H-reflex is considered to be the electrical analogue of the stretch reflex...and the reduction\" is due to a decrease in spinal reflex excitability. Field (2007) confirms that the inhibitory effects are due to deep tissue receptors and not superficial cutaneous receptors, as there was no decrease in H-reflex when looking at light fingertip pressure massage.  It has been noted that \"the receptors activated during massage are specific to the muscle being massaged,\" as other muscles did not produce a decrease in H-reflex amplitude.\n\n\n=== Regulations ===\nBecause the art and science of massage is a globally diverse phenomenon, different legal jurisdictions sometimes recognize and license individuals with titles, while other areas do not. Examples are:\n\nRegistered Massage Therapist (RMT) Canada\nRemedial Massage Therapist (RMT) New Zealand\nCertified Massage Therapist (CMT) New Zealand\nLicensed Massage Practitioner (LMP)\nLicensed Massage Therapist (LMT)\nLicensed Massage and Bodywork Therapist (LMBT) North Carolina\nTherapeutic Massage Therapist (TMT) South AfricaIn some jurisdictions, practicing without a license is a crime. One such jurisdiction is Washington state, where any health professionals practicing without a license can be issued a fine and charged with a misdemeanor offense.\n\n\n==== Canada ====\nIn regulated provinces massage therapists are known as Registered Massage Therapists, in Canada six provinces regulate massage therapy: British Columbia, Ontario, Newfoundland and Labrador, Prince Edward Island, Saskatchewan, and New Brunswick. Registered Massage Therapy in British Columbia is regulated by the College of Massage Therapists of British Columbia (CMTBC). Regulated provinces have, since 2012, established inter-jurisdiction competency standards. Quebec is not provincially regulated. Massage therapists may obtain a certification with one of the various associations operating. There is the Professional Association of Specialized Massage Therapists of Quebec, also named Mon Réseau Plus, which represents 6,300 massage therapists (including ortho therapist, natural therapists, and others), the Quebec Federation of massage therapists (FMQ), and the Association québécoise des thérapeutes naturals; however, none of these are regulated by provincial law.\nCanadian educational institutions are undergoing a formal accreditation process through the Canadian Massage Therapy Council for Accreditation (CMTCA).\n\n\n==== China ====\nMost types of massage, with the exception of some traditional Chinese medicine, are not regulated in China. Although illegal in China, some of the smaller businesses are fronts for prostitution. J.K., anti-prostitution operation has established sting operations to combat the situation. These are called falangmei (发廊妹 \"hairdressing salon sisters\").\n\n\n==== France ====\nFrance requires three years of study and two final exams in order to apply for a license.\n\n\n==== Germany ====\nIn Germany, massage is regulated by the government on a federal and national level.  Only someone who has completed 3,200 hours of training (theoretical and practical) can use the professional title \"Masseur und Medizinischer Bademeister\" 'Masseur and Medical Spa Therapist'.  This person can prolong his training depending on the length of professional experience to a Physiotherapist (1 year to 18 months additional training).  The Masseur is trained in Classical Massage, Myofascial Massage, Exercise, and Movement Therapy.  During the training, they will study Anatomy, Physiology, Pathology, Gynecology, Podiatry, Psychiatry, Psychology, Surgery, and probably most importantly Dermiatry and Orthopedics.  They are trained in Electrotherapy, and Hydrotherapy.  Hydrotherapy includes Kneipp, Wraps, underwater Massage, therapeutic washing, Sauna, and Steambath.  A small part of their training will include special forms of massage which are decided by the local college, for example, Foot reflex zone massage, Thai Massage, etc.  Finally, a graduate is allowed to treat patients under the direction of a doctor.  He is regulated by the professional body which regulates Physiotherapists.  This includes the restriction on advertising and the oath of confidentiality to clients.\n\n\n==== India ====\nIn India, massage therapy is licensed by The Department of Ayurveda, Yoga & Naturopathy, Unani, Siddha, and Homoeopathy (AYUSH) under the Ministry of Health and Family Welfare (India) in March 1995. Massage therapy is based on Ayurveda, the ancient medicinal system that evolved around 600 BC. In ayurveda, massage is part of a set of holistic medicinal practices, contrary to the independent massage system popular in some other systems. In Siddha, Tamil traditional medicine from south India, massage is termed as \"Thokkanam\" and is classified into nine types, each for a specific variety of diseases.\n\n\n==== Japan ====\n\nIn Japan, shiatsu is regulated but oil massage and Thai massage are not. Prostitution in Japan is not heavily policed, and prostitutes posing as massage therapists in \"fashion health\" shops and \"pink salons\" are fairly common in the larger cities.\n\n\n==== Myanmar ====\nIn Myanmar, massage is unregulated. However, it is necessary to apply for a spa license with the government to operate a massage parlor in major cities such as Yangon. Blind and visually impaired people can become masseurs, but they are not issued licenses. There are a few professional spa training schools in Myanmar but these training centers are not accredited by the government.\n\n\n==== Mexico ====\nIn Mexico massage therapists, called sobadores, combine massage using oil or lotion with a form of acupuncture and faith. Sobadores are used to relieve digestive system problems as well as knee and back pain. Many of these therapists work out of the back of a truck, with just a curtain for privacy. By learning additional holistic healer's skills in addition to massage, the practitioner may become a curandero.In some jurisdictions, prostitution in Mexico  is legal, and prostitutes are allowed to sell sexual massages. These businesses are often confined to a specific area of the city, such as the Zona Norte in Tijuana.\n\n\n==== New Zealand ====\nIn New Zealand, massage is unregulated.  There are two levels of registration with Massage New Zealand, the professional body for massage therapists within New Zealand, although neither of these levels are government recognized.  Registration at the Certified Massage Therapist level denotes competency in the practice of relaxation massage.  Registration at the Remedial massage therapist denotes competency in the practice of remedial or orthopedic massage.  Both levels of registration are defined by agreed minimum competencies and minimum hours.\n\n\n==== South Africa ====\nIn South Africa, massage is regulated, but enforcement is poor.  The minimum legal requirement to be able to practice as a professional massage therapist is a 2-year diploma in Therapeutic Massage and registration with The Allied Health Professions Council of SA (AHPCSA). The 2-year qualification includes 240 credits, about 80 case studies, and about 100 hours of community service.\n\n\n==== South Korea ====\nIn South Korea,  blind and visually impaired people can become licensed masseurs.\n\n\n==== Thailand ====\nIn Thailand, Thai massage is officially listed as one of the branches of traditional Thai medicine, recognized and regulated by the government. It is considered to be a medical discipline in its own right and is used for the treatment of a wide variety of ailments and conditions. Massage schools, centers, therapists, and practitioners are increasingly regulated by the Ministries of Education and Public Health in Thailand.\n\n\n==== United Kingdom ====\nTo practice commercial massage or massage therapy in the UK, an ITEC or VTCT certificate must be obtained through training which includes Beauty and Spa Therapy, Hairdressing, Complementary Therapies, Sports & Fitness Training, and Customer Service.\nTherapists with appropriate paperwork and insurance may join the Complementary and Natural Healthcare Council (CNHC), a voluntary, government regulated, professional register. Its key aim is to protect the public.In addition, there are many professional bodies that have a required minimum standard of education and hold relevant insurance policies including the Federation of Holistic Therapists (FHT), the Complementary Therapists Association (CThA), and the Complementary Health Professionals (CHP). In contrast to the CNHC these bodies exist to support therapists rather than clients.\n\n\n==== United States ====\nAccording to research done by the American Massage Therapy Association, as of 2012 in the United States, there are between 280,000 and 320,000 massage therapists and massage school students.  As of 2011, there were more than 300 accredited massage schools and programs in the United States.  Most states have licensing requirements that must be met before a practitioner can use the title \"massage therapist,\" and some states and municipalities require a license to practice any form of massage. If a state does not have any massage laws then a practitioner need not apply for a license with the state. Training programs in the US are typically 500 hours to 1000 hours in total training time and can award a certificate, diploma, or degree depending on the particular school. There are around 1,300 programs training massage therapists in the US; study will often include anatomy and physiology, kinesiology, massage techniques, first aid and CPR, business, ethical and legal issues, and hands-on practice along with continuing education requirements if regulated. The Commission on Massage Therapy Accreditation (COMTA) is one of the organizations that works with massage schools in the U.S. and there are approximately 300 schools that are accredited through this agency.Forty-three states and the District of Columbia currently offer some type of credential to professionals in the massage and bodywork field—usually licensure, certification or registration. Thirty-eight states and the District of Columbia require some type of licensing for massage therapists. In the US, 39 states use the National Certification Board for Therapeutic Massage and Bodywork's certification program as a basis for granting licenses either by rule or statute. The National Board grants the designation Nationally Certified in Therapeutic Massage and Bodywork (NCTMB). There are two tests available and one can become certified through a portfolio process with equivalent training and experience. Between 10% and 20% of towns or counties regulate the profession. The National Certification offered by the NCBTMB does not mean that someone can practice massage in any state. These local regulations can range from prohibition on opposite sex massage, fingerprinting and venereal checks from a doctor, to prohibition on house calls because of concern regarding sale of sexual services.In the US, licensure is the highest level of regulation and this restricts anyone without a license from practicing massage therapy or calling themselves by that protected title. Certification allows only those who meet certain educational criteria to use the protected title and registration only requires a listing of therapists who apply and meet an educational requirement.  It is important to note that a massage therapist may be certified, but not licensed. Licensing requirements vary per state, and often require additional criteria be met in addition to attending an accredited massage therapy school and passing a required state-specified exam (basically the certification requirements in many states). In the US, most certifications are locally based. Some states still do not require a license or a certification, but this is changing as more regulatory bodies governing the profession of massage are established in each state. Some states allow license reciprocity, where licensed massage therapists who relocate can relatively easily obtain a license in their new state.In late 2007, the Federation of State Massage Therapy Boards launched a new certification exam titled the MBLEx. Currently, 40 states have accepted this certification exam, along with the District of Columbia, Puerto Rico, and the US Virgin Islands.\nIn 1997 there were an estimated 114 million visits to massage therapists in the US. Massage therapy is the most used type of alternative medicine in hospitals in the United States.  Between July 2010 and July 2011 roughly 38 million adult Americans (18 percent) had a massage at least once.People state that they use massage because they believe that it relieves pain from musculoskeletal injuries and other causes of pain, reduces stress and enhances relaxation, rehabilitates sports injuries, decreases feelings of anxiety and depression, and increases general well being.In a poll of 25–35-year-olds, 79% said they would like their health insurance plan to cover massage. In 2006 Duke University Health System opened up a center to integrate medical disciplines with CAM disciplines such as massage therapy and acupuncture. There were 15,500 spas in the United States in 2007, with about two-thirds of the visitors being women.The number of visits rose from 91 million in 1999 to 136 million in 2003, generating a revenue that equals $11 billion. Job outlook for massage therapists is also projected to grow at 20% between 2010 and 2020 by the Bureau of Labor Statistics,  faster than the average.\n\n\n== See also ==\nManual therapy\nMassage chair\nSpa\n\n\n== References ==\n\n\n== External links ==\nShadwell, Arthur (1911). \"Massage\" . Encyclopædia Britannica (11th ed.).", "chinese_title": "", "chinese": ""}