{"topic": "Immunology", "english_title": "Immunology", "english": "Immunology is a branch of biology that covers the study of immune systems in all organisms. Immunology charts, measures, and contextualizes the physiological functioning of the immune system in states of both health and diseases; malfunctions of the immune system in immunological disorders (such as autoimmune diseases, hypersensitivities, immune deficiency, and transplant rejection); and the physical, chemical, and physiological characteristics of the components of the immune system in vitro, in situ, and in vivo. Immunology has applications in numerous disciplines of medicine, particularly in the fields of organ transplantation, oncology, rheumatology, virology, bacteriology, parasitology, psychiatry, and dermatology.\nThe term was coined by Russian biologist Ilya Ilyich Mechnikov, who advanced studies on immunology and received the Nobel Prize for his work in 1908. He pinned small thorns into starfish larvae and noticed unusual cells surrounding the thorns. This was the active response of the body trying to maintain its integrity. It was Mechnikov who first observed the phenomenon of phagocytosis, in which the body defends itself against a foreign body.\nPrior to the designation of immunity, from the etymological root immunis, which is Latin for \"exempt\", early physicians characterized organs that would later be proven as essential components of the immune system. The important lymphoid organs of the immune system are the thymus, bone marrow, and chief lymphatic tissues such as spleen, tonsils, lymph vessels, lymph nodes, adenoids, and liver. When health conditions worsen to emergency status, portions of immune system organs, including the thymus, spleen, bone marrow, lymph nodes, and other lymphatic tissues, can be surgically excised for examination while patients are still alive.\nMany components of the immune system are typically cellular in nature and not associated with any specific organ, but rather are embedded or circulating in various tissues located throughout the body.\n\n\n== Classical immunology ==\nClassical immunology ties in with the fields of epidemiology and medicine. It studies the relationship between the body systems, pathogens, and immunity. The earliest written mention of immunity can be traced back to the plague of Athens in 430 BCE. Thucydides noted that people who had recovered from a previous bout of the disease could nurse the sick without contracting the illness a second time. Many other ancient societies have references to this phenomenon, but it was not until the 19th and 20th centuries before the concept developed into scientific theory.\nThe study of the molecular and cellular components that comprise the immune system, including their function and interaction, is the central science of immunology. The immune system has been divided into a more primitive innate immune system and, in vertebrates, an acquired or adaptive immune system. The latter is further divided into humoral (or antibody) and cell-mediated components.\nThe immune system has the capability of self and non-self-recognition. An antigen is a substance that ignites the immune response. The cells involved in recognizing the antigen are Lymphocytes. Once they recognize, they secrete antibodies. Antibodies are proteins that neutralize the disease-causing microorganisms. Antibodies do not directly kill pathogens, but instead, identify antigens as targets for destruction by other immune cells such as phagocytes or NK cells.\nThe humoral (antibody) response is defined as the interaction between antibodies and antigens. Antibodies are specific proteins released from a certain class of immune cells known as B lymphocytes, while antigens are defined as anything that elicits the generation of antibodies (antibody generators). Immunology rests on an understanding of the properties of these two biological entities and the cellular response to both.\nIt is now getting clear that the immune responses contribute to the development of many common disorders not traditionally viewed as immunologic, including metabolic, cardiovascular, cancer, and neurodegenerative conditions like Alzheimer’s disease. Besides, there are direct implications of the immune system in the infectious diseases (tuberculosis, malaria, hepatitis, pneumonia, dysentery, and helminth infestations) as well. Hence, research in the field of immunology is of prime importance for the advancements in the fields of modern medicine, biomedical research, and biotechnology.\nImmunological research continues to become more specialized, pursuing non-classical models of immunity and functions of cells, organs and systems not previously associated with the immune system (Yemeserach 2010).\n\n\n== Clinical immunology ==\nClinical immunology is the study of diseases caused by disorders of the immune system (failure, aberrant action, and malignant growth of the cellular elements of the system). It also involves diseases of other systems, where immune reactions play a part in the pathology and clinical features.\nThe diseases caused by disorders of the immune system fall into two broad categories:\n\nimmunodeficiency, in which parts of the immune system fail to provide an adequate response (examples include chronic granulomatous disease and primary immune diseases);\nautoimmunity, in which the immune system attacks its own host's body (examples include systemic lupus erythematosus, rheumatoid arthritis, Hashimoto's disease and myasthenia gravis).Other immune system disorders include various hypersensitivities (such as in asthma and other allergies) that respond inappropriately to otherwise harmless compounds.\nThe most well-known disease that affects the immune system itself is AIDS, an immunodeficiency characterized by the suppression of CD4+ (\"helper\") T cells, dendritic cells and macrophages by the Human Immunodeficiency Virus (HIV).\nClinical immunologists also study ways to prevent the immune system's attempts to destroy allografts (transplant rejection).\n\n\n== Developmental immunology ==\nThe body’s capability to react to antigens depends on a person's age, antigen type, maternal factors and the area where the antigen is presented. Neonates are said to be in a state of physiological immunodeficiency, because both their innate and adaptive immunological responses are greatly suppressed.  Once born, a child’s immune system responds favorably to protein antigens while not as well to glycoproteins and polysaccharides. In fact, many of the infections acquired by neonates are caused by low virulence organisms like Staphylococcus and Pseudomonas.  In neonates, opsonic activity and the ability to activate the complement cascade is very limited.  For example, the mean level of C3 in a newborn is approximately 65% of that found in the adult. Phagocytic activity is also greatly impaired in newborns. This is due to lower opsonic activity, as well as diminished up-regulation of integrin and selectin receptors, which limit the ability of neutrophils to interact with adhesion molecules in the endothelium. Their monocytes are slow and have a reduced ATP production, which also limits the newborn's phagocytic activity.  Although, the number of total lymphocytes is significantly higher than in adults, the cellular and humoral immunity is also impaired. Antigen-presenting cells in newborns have a reduced capability to activate T cells.  Also, T cells of a newborn proliferate poorly and produce very small amounts of cytokines like IL-2, IL-4, IL-5, IL-12, and IFN-g which limits their capacity to activate the humoral response as well as the phagocitic activity of macrophage.  B cells develop early during gestation but are not fully active.\n\nMaternal factors also play a role in the body’s immune response.  At birth, most of the immunoglobulin present is maternal IgG. These antibodies are transferred from the placenta to the fetus using the FcRn (neonatal Fc receptor). Because IgM, IgD, IgE and IgA do not cross the placenta, they are almost undetectable at birth. Some IgA is provided by breast milk. These passively-acquired antibodies can protect the newborn for up to 18 months, but their response is usually short-lived and of low affinity.  These antibodies can also produce a negative response.  If a child is exposed to the antibody for a particular antigen before being exposed to the antigen itself then the child will produce a dampened response. Passively acquired maternal antibodies can suppress the antibody response to active immunization. Similarly, the response of T-cells to vaccination differs in children compared to adults, and vaccines that induce Th1 responses in adults do not readily elicit these same responses in neonates. Between six and nine months after birth, a child’s immune system begins to respond more strongly to glycoproteins, but there is usually no marked improvement in their response to polysaccharides until they are at least one year old. This can be the reason for distinct time frames found in vaccination schedules.During adolescence, the human body undergoes various physical, physiological and immunological changes triggered and mediated by hormones, of which the most significant in females is 17-β-estradiol (an estrogen) and, in males, is testosterone. Estradiol usually begins to act around the age of 10 and testosterone some months later. There is evidence that these steroids not only act directly on the primary and secondary sexual characteristics but also have an effect on the development and regulation of the immune system, including an increased risk in developing pubescent and post-pubescent autoimmunity. There is also some evidence that cell surface receptors on B cells and macrophages may detect sex hormones in the system.The female sex hormone 17-β-estradiol has been shown to regulate the level of immunological response, while some male androgens such as testosterone seem to suppress the stress response to infection. Other androgens, however, such as DHEA, increase immune response. As in females, the male sex hormones seem to have more control of the immune system during puberty and post-puberty than during the rest of a male's adult life.\nPhysical changes during puberty such as thymic involution also affect immunological response.\n\n\n== Ecoimmunology and behavioural immunity ==\n\nEcoimmunology, or ecological immunology, explores the relationship between the immune system of an organism and its social, biotic and abiotic environment.\nMore recent ecoimmunological research has focused on host pathogen defences traditionally considered \"non-immunological\", such as pathogen avoidance, self-medication, symbiont-mediated defenses, and fecundity trade-offs. Behavioural immunity, a phrase coined by Mark Schaller, specifically refers to psychological pathogen avoidance drivers, such as disgust aroused by stimuli encountered around pathogen-infected individuals, such as the smell of vomit. More broadly, \"behavioural\" ecological immunity has been demonstrated in multiple species. For example, the Monarch butterfly often lays its eggs on certain toxic milkweed species when infected with parasites. These toxins reduce parasite growth in the offspring of the infected Monarch. However, when uninfected Monarch butterflies are forced to feed only on these toxic plants, they suffer a fitness cost as reduced lifespan relative to other uninfected Monarch butterflies. This indicates that laying eggs on toxic plants is a costly behaviour in Monarchs which has probably evolved to reduce the severity of parasite infection.Symbiont-mediated defenses are also heritable across host generations, despite a non-genetic direct basis for the transmission. Aphids, for example, rely on several different symbionts for defense from key parasites, and can vertically transmit their symbionts from parent to offspring. Therefore, a symbiont that successfully confers protection from a parasite is more likely to be passed to the host offspring, allowing coevolution with parasites attacking the host in a way similar to traditional immunity.\n\n\n== Immunotherapy ==\n\nThe use of immune system components or antigens to treat a disease or disorder is known as immunotherapy. Immunotherapy is most commonly used to treat allergies, autoimmune disorders such as Crohn’s disease and rheumatoid arthritis, and certain cancers. Immunotherapy is also often used in the immunosuppressed (such as HIV patients) and people suffering from other immune deficiencies.\nThis includes regulating factors such as IL-2, IL-10, GM-CSF B, IFN-α.\n\n\n== Diagnostic immunology ==\n\nThe specificity of the bond between antibody and antigen has made the antibody an excellent tool for the detection of substances by a variety of diagnostic techniques. Antibodies specific for a desired antigen can be conjugated with an isotopic (radio) or fluorescent label or with a color-forming enzyme in order to detect it. However, the similarity between some antigens can lead to false positives and other errors in such tests by antibodies cross-reacting with antigens that are not exact matches.\n\n\n== Cancer immunology ==\n\nThe study of the interaction of the immune system with cancer cells can lead to diagnostic tests and therapies with which to find and fight cancer. The immunology concerned with physiological reaction characteristic of the immune state.\n\n\n== Reproductive immunology ==\n\nThis area of the immunology is devoted to the study of immunological aspects of the reproductive process including fetus acceptance. The term has also been used by fertility clinics to address fertility problems, recurrent miscarriages, premature deliveries and dangerous complications such as pre-eclampsia.\n\n\n== Theoretical immunology ==\nImmunology is strongly experimental in everyday practice but is also characterized by an ongoing theoretical attitude. Many theories have been suggested in immunology from the end of the nineteenth century up to the present time. The end of the 19th century and the beginning of the 20th century saw a battle between \"cellular\" and \"humoral\" theories of immunity. According to the cellular theory of immunity, represented in particular by Elie Metchnikoff, it was cells – more precisely, phagocytes – that were responsible for immune responses. In contrast, the humoral theory of immunity, held by Robert Koch and Emil von Behring, among others, stated that the active immune agents were soluble components (molecules) found in the organism's \"humors\" rather than its cells.In the mid-1950s, Macfarlane Burnet, inspired by a suggestion made by Niels Jerne, formulated the clonal selection theory (CST) of immunity. On the basis of CST, Burnet developed a theory of how an immune response is triggered according to the self/nonself distinction: \"self\" constituents (constituents of the body) do not trigger destructive immune responses, while \"nonself\" entities (e.g., pathogens, an allograft) trigger a destructive immune response. The theory was later modified to reflect new discoveries regarding histocompatibility or the complex \"two-signal\" activation of T cells. The self/nonself theory of immunity and the self/nonself vocabulary have been criticized, but remain very influential.More recently, several theoretical frameworks have been suggested in immunology, including \"autopoietic\" views, \"cognitive immune\" views, the \"danger model\" (or \"danger theory\"),  and the \"discontinuity\" theory. The danger model, suggested by Polly Matzinger and colleagues, has been very influential, arousing many comments and discussions.\n\n\n== See also ==\nHistory of immunology\nImmunomics\nInternational Reviews of Immunology\nList of immunologists\nOsteoimmunology\nOutline of immunology\n\n\n== References ==\n\n\n== External links ==\nAmerican Association of Immunologists\nBritish Society for Immunology\nFederation of Clinical Immunology Societies", "chinese_title": "Immunology ", "chinese": "Immunology (English: Immunology) is a major big branch of biomedical, which explores an immune response produced by immune system in each organ to resist \"non-adhered\" foreign matter. It is mainly discussed in health or the physiological function role played by the immune system when sick; some diseases caused by diseases in some immune systems (such as autologous immune responses, allergic reactions, immune dysfunction); in vivo or in vitro Physical, chemical, physiological properties of the immune system constitute molecules. Immunology has also been widely used in the following areas.\n\n\n== History of immune system ==\nThe main immune systems include thymoid, spleen, bone marrow, lymphatic, lymphatic and secondary lymphatic tissue (such as tonsil gland or prime gland), skin. In terms of histological examination, the main organs, thymus, and spleen can only be understood after death, but similar to lymph nodes or secondary lymphatic tissues can be recognized via surgical surgery in survival. Many of the immune systems are more than half of the cells in various organs and tissues in the form of cells.\n\n\n== Classical immunology ==\nIf ancients found a person who got some kind of infectious disease, it could no longer have this disease for a long time or for life. Some even if it is sick, it is also relatively slight and not dead. People are inspired, know how to \"toxic attacks\", that is, before it is not ill, first take or vaccinate the poisonous pathogenic substance, so that the human body produces special resistance to these diseases, this idea contains modern medical immunity. Germination.\nUnder the guidance of \"toxic attack\" ideas, China is also looking for methods for preventing ceiling. The Ming Dynasty Guo Zizhang \"Boji Rapid Pony\" (1557), Li Shizhen \"Compendium of Materia Medica\", records (white) buffalo and powder cakes or burning ash and porridge, to prevent the label. Although this method has not yet been practical, it indicates that the ancients are looking for methods for prevention and treatment of the ceiling under the \"poison attack\" thinking. After long-term exploration and multi-faceted clinical experiment, it has finally found a valid vaccinia vaccination method.\n\n\n== Clinical immunology ==\nClinical immunology mainly studies the disease caused by the immune system, or the immune system caused by other medical treatment. Most of the immune diseases can be mainly divided into two major items. First, the defects in the immune system deficiency are defects in this portion, which will not produce diseases that adapt to immune responses (such as chronic granuloma) and autoimmunity, that is, the immune system attacks their own antigen (more than one) Lupus erythematosus, arthritis Rheumatoid Arthritis or severe inflatics Myasthenia gravis et al. The other is because other immune systems have levodes, including causing allergic reactions, such as the production of harmless molecular compounds (such as gas Asthma, allergies) or high reactive transition.\nAIDS is a famous immune system disease that is caused by HIV viruses. It is now understood that AIDS is in the case of HIV virus infection, which results in lymphocytes (adjuvant T cells) and macrophages and some kind of B cells containing CD4 + (CD4 positive) receptors, and ultimately enable immune systems. collapse.\nClinical immunology also studies many methods to avoid excessive intense immune responses caused by many organ tissue transplants. Such as: Avoid the same type of allograft or heterogeneous transplantation Xenograf is rejected by the immune system, destroyed.\n\n\n== Immunotherapy ==\nThe use of immune system components to treat diseases, that is, the so-called immunotherapy. In the treatment of cancer, it is often accompanied by chemothenerapy or radiotherapy. However, usually immunotherapy is used as immunosuppression such as AIDS, or other immunodeficiency diseases, or autologous immune disease patients.\n\n\n== Diagnostic immunology ==\nThe special bond formed by the combination of antibodies and antigens is a specially advantageous tool for diagnosing science. In the antibody, the radiation material can be labeled, which can be colored, as well as a fluorescent substance. It can be used as a probe to mark the antigen.\nCommonly used techniques are immunological ink descriptions, ELISA, or immunoch tissue dyeing on a slice. Today, some antibodies are often produced rapid and accurate and simple test reagents for detecting diseases, or special substances, etc.\n\n\n== Evolution immunology ==\nThe immune system of existing biological species is mainly, so that we can use the differences in the immune system to understand the evolution of species and the differences in the immune system between species. From the perspective of evolution, the complexity of the immune system can be carried out by a simple microorganism, or the antibacterial protein in the insect, to the lymphatic system of the vertebrate. Also as insects or other arthropods are not adapted to the immune system, only the innate immune system. Incidentally, adapting to the immune system is only vertebrates.\n\n\n== Psychological neurogenic immunology ==\nPsychoneuroimmunology is a discipline involving the results of the study of psychology, nervous system and immune system.\n\n\n== Reference ==\n\nGoldsby Ra, Kindt Tk, Osborne Ba and Kuby J (2003) Immunology, 5th Edition, W.H. Freeman and Company, New York, New York, ISBN 0-7167-4947-5\nTemplate: Public Health Year "}