{"topic": "Cell", "english_title": "", "english": "", "chinese_title": "Cell (microprocessor) ", "chinese": "Cell Microprocessor architecture (Cell Broadband Engine Architecture, usually referred to as Cell BE or CBEA) is jointly developed by Sony, Sony Computer Entertainment, Toshiba, International Commercial Machine (IBM). It is designed based on the POWER architecture of the RISC instruction system and has a high clock frequency, high execution efficiency. Mainly applied to PlayStation 3 and the blade server. The second generation version of the Cell processor improves the double precision floating point calculation performance. The conventional Cell processor, the double precision performance is only one tenth of single precision. And the new CELL processor can make five times the double precision performance.\n\n\n== Development history ==\n\nIn 2000, Sony computer entertainment, Toshiba and IBM formed a processor known as \"STI\" for designing and manufacturing. The STI design center opened in March 2001. Cell uses the Power4 processor's design tool to enhance the design of four years. There are more than 400 engineers with more than 400 companies in Austin and have an important support for 11 IBM Design. During this time, IBM proposed a number of patents related to the Cell architecture, manufacturing process, and soft environment. Early patented version of BroadBand Engine was confirmed to be a wafer package, including \"Processing Elements\", which is a description of this patent, is currently known Power Processing Element (PPE). At present, on the Broadband Engine wafer, each \"processing unit\" includes 8 acceleration processing units, and it is simply referred to as SPE. In March 2007, IBM advanced CELL microprocessor from the 90n meter process of the first generation of products to 65 nanometers, and launched a 65-nanometric CELL microprocessor by 12 inch Fishkill, New York, USA. Production. After the process advances to 65 nm, the wafer area and power consumption of Cell will be further lowered, which is conducive to the development of related applications such as home appliances. In February 2008, IBM announced the Cell processor of the 45-nanometer process that will begin manufacturing. In August 2009, the lightweight version of PlayStation 3-PS3 SLIM used 45 NaM Cell processors. In May 2008, IBM introduced high-performance double-precision floating-point versions of the Cell processor, with 65 nanometers as the main size Powerxcell 8i. In May 2008, a super computer based on an Opteron processor and Powerxcell 8i, an IBM torrential system, became the world's first system that reached a Petaflops, which was the fastest computer in the world, and this record has been maintained By the third quarter of 2009.\nIn 2009, IBM announced at the SC09 high-performance computing conference that abandoned the development of Cell architecture processors, CELL architecture and design concepts will be fused into other processor products of IBM. The company plans to develop a follow-up product of the Powerxcell-8i processor, with a dual PowerPC processor core, and set up 32 SPE units will have been canceled.\n\n\n== Overview ==\nCell contains 9 cores: 1 64-bit PPE control core and 8 exact SPE calculation cores.\nIt has a transistor (DD2 mass production version). The core area is 235 square millimeters, which is manufactured by IBM SOI 90 nano-copper interconnection process. After that, 65 nm technology is used.\nThe first working frequency of the project was 4.06 GHz, the operating voltage was 1.1 volts; thereafter there were 4.6 GHz.\n256 billion floating point calculations per second (256 gflops).\nSupport mesh operation, with flexible parallel, distributed computing structure. August 25, 2005, 4 companies such as IBM, Sony, SCEI and Toshiba officially disclosed \"Cell\", the specification data released by the item, divided into 5 copies, including 1 description Cell Based on decentralized processing The overall architecture defined by multimedia applications, the other 4 copies of the instruction set architecture, low-order combination language, high-order C / C ++ program language expansion specification, and application binary interface (Application Binary) Interface) specification and instruction file. Cell combines the general Power Architecture kernel, moderate performance and streamlined coprocessor, greatly speeds up multimedia and vector processing applications, and many other forms of dedicated calculations.\n\n\n=== Processor architecture ===\nPPE can be used as resource management, and SPE can be used as a data processor. The program on the PPE can break down the task to the SPE, and then transfer data. SPE lacks most of the general characteristics in general processors, which cannot perform common operating system tasks, no support for virtual memory, and cannot directly access the computer's RAM, and uninterrupted support is also very limited. Connecting the SPE, PPE, and main memory controllers, is a bus named Element Interconnect Bus, which is the main channel of data transfer.\n\n\n==== PPE ====\nPower Processor Element: The PPE contains a 64-bit dual execution PowerPC structure RISC kernel and supports the PowerPC's virtual memory subsystem. It has 32KB L1 instructions and a 32 kB of data is quick to get, and 512 KB L2 is shared. The PPE in Cell includes a VMX instruction set (Vector MultiMedia Extensions: AltiveC Technology).\n\n\n==== SPE ====\nSynergistic Processing Elements, referred to as SPE. Each SPE includes:\n\nA vector processor called Synergistic Processing Unit, or SPU\nA private memory area in the SPU, called local storage (size of this area on PS3 is 256K)\nA group of communication channels used to contact the outside world\nA set of 128 registers, each 128 bit wide (each register can usually be used to save 4 32-bit values)\nA memory flow controller (MFC), which is responsible for managing DMA transmission between local storage and main memory of the SPU\n\n\n==== EIB ====\nElement Interconnect Bus (EIB): Each DMA controller acquires instructions and materials per DMA controller through this bus. The DMA controller also delivers the results to a general-purpose bus bar, which can be output to the wafer to transmit the peripheral or PPE to take a memory of the wafer. PPE can realize the information transmitted by the SPE, but SPE does not know any traffic adjacent; this will keep the SPE's simpleness and limit the interrupt or unnecessary impact on which it is executed. If SPE needs to know external information Change, its respective DMA controllers are responsible for getting information.\n\n\n==== Memory and I / O controller ====\nCell BE Built-in 2.5 megabyte memory, through Rambus's XDR and Flexio technology, can exchange 100 Jibby gbytes with external memory per second. The XDR Memory Controller Interface (XIO) is 72-bit yuan wide, and the total memory bandwidth of 25.6 Gb / s can be operated at 3.2 Gbps data rate.\n\n\n=== Powerxcell 8i ===\nIn 2008, IBM announced a revised variant Cell, which is called Powerxcell 8i and starts from IBM's blade servo QS22. Take more than 100 million US dollars is the world's first Linpack to reach a super computer with dual-core AMD Opteron, and Powerxcell 8i processor is mixed into a node design. Take a total of 6563 dual-core AMD Opteron, and 12240 IBM Powerxcell 8i. The Green Super Computer 500 (Green500) list released by the International Super Computer Conference, IBM's Powerxcell 8i exclusive 3 and 5 to 7, this ranking with average floating point calculation capabilities per second per second (MFLOPS / W Baseline. In addition to QS22 and supercompute, Powerxcell is also made into an acceleration processor of the PCI-E intermeshry and in the QPace item as a core processor.\n\n\n== Commercialization ==\n\n\n=== ps3 ===\nSTI applies Cell to high-quality digital audio and video home appliances, players, computer drawings, scientific operations and other fields, which are the most attractive and largest-scale products in the relevant applications with SCE. The first generation of CELL microprocessors will have a PPE microprocessor core, with 8 SPE collaborative processors (retaining 1 SPE as reserve, actually available SPE is 7), composed of 250 million electrical crystals The PS3 uses a version of the time of 3.2GHz.\n\n\n=== spursengine ===\nToshiba launches Cell-based auxiliary processor named SpursEngine. This is different from the true Cell processor, which has only 1 PPE and 4 SPE cores, but additional Hardware codecs of MPEG-2 and H.264. It can be used to accelerate pictures and video playbacks (including MPEG-2 and H.264) and have their own XDR memory. PCI-E X1 or X4 can be employed in terms of interface. Toshiba's flat-screen TV will use a related processor to interpolate the standard clearance to 1080p. And simultaneously make details, improve color, edge sharpness, etc. Ritai has introduced acceleration cards with Spursengine wafers to use as assisting the computer for image editing.\n\n\n=== Household TV ===\nToshiba launches Cell TV, which converts the 2D picture to 3D. Cell T also upgrades digital video, even reinforcing pixels, strengthens low quality streams, and knows the lights of the room to adjust the display quality of the screen. Cell TV still has built-in camera, microphone and software, you can call online video calls. This is the first product developed by Toshiba as the core development, focusing on as an example, used to explain what kind of products can be developed for hardware and software engineers. For example, a business model is established using the networking capabilities of the Cell TV. This TV obviously can become a carrier of a large number of pay services.\n\n\n== See ==\nTake a ride (super computer)\nPlayStation3\n\n\n== Reference material ==\n\n\n== External link ==\n(English) Cell Broadband Engine Resource Center (Page Archive Backup, Save Internet Archive)\n(English) (Japanese) Sony computer entertainment CELL processor exclusive website\n(Japanese) CELL ブ ブ ド ド ド ド · エ エ ジ ジ · マ マ ク ロ プ セ サ サ け に に 机 机 机 机 拡 む む む 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発 発\n(English) CMPWARE Configurable Multiprocessor Development Kit for Cell BE (Page Archive Backup, Save Internet Archive)\n(English) ISSCC 2005: The Cell Microprocessor (page archive backup, existing internet archive)\n(English) The Little Broadband Engine That Could: Reviewing The Newest Little SDK That Installs Native On PS3 (Page Archive Backup, Save Internet Archives)\n(English) Introducing the IBM / SONY / TOSHIBA CELL PROCESSOR? Part i: The Simd Processing Units (Page Archive Backup, Save Internet Archive)\n(English) Introducing the IBM / SONY / TOSHIBA CELL Processor - Part II: The Cell Architecture (Page Archive Backup, Save Internet Archive) "}