{"topic": "Forestry", "english_title": "Forestry", "english": "Forestry is the science and craft of creating, managing, playing, using, conserving and repairing forests, woodlands, and associated resources for human and environmental benefits. Forestry is practiced in plantations and natural stands. The science of forestry has elements that belong to the biological, physical, social, political and managerial sciences.Modern forestry generally embraces a broad range of concerns, in what is known as multiple-use management, including:\n\nThe provision of timber\nFuel wood\nWildlife habitat\nNatural water quality management\nRecreation\nLandscape and community protection\nEmployment\nAesthetically appealing landscapes\nBiodiversity management\nWatershed management\nErosion control\nPreserving forests as \"sinks\" for atmospheric carbon dioxideA practitioner of forestry is known as a forester. An other common term is silviculturalist. Silviculture is narrower than forestry, being concerned only with forest plants, but is often used synonymously with forestry.\nForest ecosystems have come to be seen as the most important component of the biosphere, and forestry has emerged as a vital applied science, craft, and technology.\nAll people depend upon forests and their biodiversity, some more than others. Forestry is an important economic segment in various industrial countries, as forests provide more than 86 million green jobs and support the livelihoods of many more people. For example, in Germany, forests cover nearly a third of the land area, wood is the most important renewable resource, and forestry supports more than a million jobs and about €181 billion of value to the German economy each year.Worldwide, an estimated 880 million people spend part of their time collecting fuelwood or producing charcoal, many of them women. Human populations tend to be low in areas of low-income countries with high forest cover and high forest biodiversity, but poverty rates in these areas tend to be high. Some 252 million people living in forests and savannahs have incomes of less than US$1.25 per day.\n\n\n== History ==\n\n\n=== Background ===\nThe preindustrial age has been dubbed by Werner Sombart and others as the 'wooden age', as timber and firewood were the basic resources for energy, construction and housing. The development of modern forestry is closely connected with the rise of capitalism, economy as a science and varying notions of land use and property.\nRoman Latifundiae, large agricultural estates, were quite successful in maintaining the large supply of wood that was necessary for the Roman Empire. Large deforestations came with respectively after the decline of the Romans. However  already in the 5th century, monks in the then Byzantine Romagna on the Adriatic coast, were able to establish stone pine plantations to provide fuelwood and food. This was the beginning of the massive forest mentioned by Dante Alighieri in his 1308 poem Divine Comedy.Similar sustainable formal forestry practices were developed by the Visigoths in the 7th century when, faced with the ever-increasing shortage of wood, they instituted a code concerned with the preservation of oak and pine forests. The use and management of many forest resources has a long history in China as well, dating back to the Han dynasty and taking place under the landowning gentry. A similar approach was used in Japan. It was also later written about by the Ming dynasty Chinese scholar Xu Guangqi (1562–1633).\nIn Europe, land usage rights in medieval and early modern times allowed different users to access forests and pastures. Plant litter and resin extraction were important, as pitch (resin) was essential for the caulking of ships, falking and hunting rights, firewood and building, timber gathering in wood pastures, and for grazing animals in forests. The notion of \"commons\" (German \"Allmende\") refers to the underlying traditional legal term of common land. The idea of enclosed private property came about during modern times. However, most hunting rights were retained by members of the nobility which preserved the right of the nobility to access and use common land for recreation, like fox hunting.\n\n\n=== Early modern forestry development ===\n\nSystematic management of forests for a sustainable yield of timber began in Portugal in the 13th century when King AfonsoIII planted the Pinhal do Rei (King's Pine Forest) near Leiria to prevent coastal erosion and soil degradation, and as a sustainable source for timber used in naval construction. His successor King Denis of Portugal continued the practice and the forest exists still today.Forest management also flourished in the German states in the 14th century, e.g. in Nuremberg, and in 16th-century Japan. Typically, a forest was divided into specific sections and mapped; the harvest of timber was planned with an eye to regeneration. As timber rafting allowed for connecting large continental forests, as in south western Germany, via Main, Neckar, Danube and Rhine with the coastal cities and states, early modern forestry and remote trading were closely connected. Large firs in the black forest were called „Holländer“, as they were traded to the Dutch ship yards. Large timber rafts on the Rhine were 200 to 400m in length, 40m in width and consisted of several thousand logs. The crew consisted of 400 to 500 men, including shelter, bakeries, ovens and livestock stables. Timber rafting infrastructure allowed for large interconnected networks all over continental Europe and is still of importance in Finland.\nStarting with the 16th century, enhanced world maritime trade, a boom in housing construction in Europe, and the success and further Berggeschrey (rushes) of the mining industry increased timber consumption sharply. The notion of 'Nachhaltigkeit', sustainability in forestry, is closely connected to the work of Hans Carl von Carlowitz (1645–1714), a mining administrator in Saxony. His book Sylvicultura oeconomica, oder haußwirthliche Nachricht und Naturmäßige Anweisung zur wilden Baum-Zucht (1713) was the first comprehensive treatise about sustainable yield forestry. In the UK, and, to an extent, in continental Europe, the enclosure movement and the Clearances favored  strictly enclosed private property. The Agrarian reformers, early economic writers and scientists tried to get rid of the traditional commons. At the time, an alleged tragedy of the commons together with fears of a Holznot, an imminent wood shortage played a watershed role in the controversies about cooperative land use patterns.The practice of establishing tree plantations in the British Isles was promoted by John Evelyn, though it had already acquired some popularity. Louis XIV's minister Jean-Baptiste Colbert's oak Forest of Tronçais, planted for the future use of the French Navy, matured as expected in the mid-19th century: \"Colbert had thought of everything except the steamship,\" Fernand Braudel observed. In parallel, schools of forestry were established beginning in the late 18th century in Hesse, Russia, Austria-Hungary, Sweden, France and elsewhere in Europe.\n\n\n=== Forest conservation and early globalization ===\n\nStarting from the 1750s modern scientific forestry was developed in France and the German speaking countries in the context of natural history scholarship and state administration inspired by physiocracy and cameralism. Its main traits were centralized management by professional foresters, the adherence to sustainble yield concepts with a bias towards fuelwood and timber production, artificial afforestation, and a critical view of pastoral and agricultural uses of forests.During the late 19th and early 20th centuries, forest preservation programs were established in British India, the United States, and Europe. Many foresters were either from continental Europe (like Sir Dietrich Brandis), or educated there (like Gifford Pinchot). Sir Dietrich Brandis is considered the father of tropical forestry, European concepts and practices had to be adapted in tropical and semi-arid climate zones. The development of plantation forestry was one of the (controversial) answers to the specific challenges in the tropical colonies. The enactment and evolution of forest laws and binding regulations occurred in most Western nations in the 20th century in response to growing conservation concerns and the increasing technological capacity of logging companies. Tropical forestry is a separate branch of forestry which deals mainly with equatorial forests that yield woods such as teak and mahogany.\n\n\n=== Mechanization ===\nForestry mechanization was always in close connection to metal working and the development of mechanical tools to cut and transport timber to its destination. Rafting belongs to the earliest means of transport. Steel saws came up in the 15th century. The 19th century widely increased the availability of steel for whipsaws and introduced forest railways and railways in general for transport and as forestry customer. Further human induced changes, however, came since World War II, respectively in line with the \"1950s syndrome\". The first portable chainsaw was invented in 1918 in Canada, but large impact of mechanization in forestry started after World War II. Forestry harvesters are among the most recent developments. Although drones, planes, laser scanning, satellites and robots also play a part in forestry.\n\n\n=== Early journals which are still present ===\nSylwan first published in 1820\nSchweizerische Zeitschrift für Forstwesen first published in 1850.\nErdészeti Lapok first published in 1862. (Hungary, 1862–present)\nThe Indian Forester first published in 1875.\nŠumarski list (Forestry Review, Croatia) was published in 1877 by Croatian Forestry Society.\nMontes (Forestry, Spain) first published in 1877.\nRevista pădurilor (Journal of Forests, Romania, 1881–1882; 1886–present), the oldest extant magazine in Romania\nForestry Quarterly, first published in 1902 by the New York State College of Forestry.\nŠumarstvo (Forestry, Serbia) first published in 1948 by the Ministry of Forestry of Democratic Federal Yugoslavia, and since 1951 by Organ of Society of Forestry Engineers and Technicians of the Republic of Serbia (succeeding the former Šumarski glasnik published from 1907 to 1921)\n\n\n== Forestry in the 21st century ==\n\nToday a strong body of research exists regarding the management of forest ecosystems and the genetic improvement of tree species and varieties. Forestry studies also include the development of better methods for the planting, protecting, thinning, controlled burning, felling, extracting, and processing of timber. One of the applications of modern forestry is reforestation, in which trees are planted and tended in a given area.\nTrees provide numerous environmental, social and economic benefits for people. In many regions, the forest industry is of major ecological, economic, and social importance, with the United States producing more timber than any other country in the world. Third-party certification systems that provide independent verification of sound forest stewardship and sustainable forestry have become commonplace in many areas since the 1990s. These certification systems developed as a response to criticism of some forestry practices, particularly deforestation in less-developed regions along with concerns over resource management in the developed world.\nIn topographically severe forested terrain, proper forestry is important for the prevention or minimization of serious soil erosion or even landslides. In areas with a high potential for landslides, forests can stabilize soils and prevent property damage or loss, human injury, or loss of life.\n\n\n== Foresters ==\n\nForesters work for the timber industry, government agencies, conservation groups, local authorities, urban parks boards, citizens' associations, and private landowners. The forestry profession includes a wide diversity of jobs, with educational requirements ranging from college bachelor's degrees to PhDs for highly specialized work. Industrial foresters plan forest regeneration starting with careful harvesting. Urban foresters manage trees in urban green spaces. Foresters work in tree nurseries growing seedlings for woodland creation or regeneration projects. Foresters improve tree genetics. Forest engineers develop new building systems.\nProfessional foresters measure and model the growth of forests with tools like geographic information systems. Foresters may combat insect infestation, disease, forest and grassland wildfire, but increasingly allow these natural aspects of forest ecosystems to run their course when the likelihood of epidemics or risk of life or property are low. Increasingly, foresters participate in wildlife conservation planning and watershed protection. Foresters have been mainly concerned with timber management, especially reforestation, maintaining forests at prime conditions, and fire control.\n\n\n== Forestry plans ==\nForesters develop and implement forest management plans relying on mapped resource inventories showing an area's topographical features as well as its distribution of trees (by species) and other plant cover. Plans also include landowner objectives, roads, culverts, proximity to human habitation, water features and hydrological conditions, and soils information. Forest management plans typically include recommended silvicultural treatments and a timetable for their implementation. Application of digital maps in Geographic Informations systems (GIS) that extracts and integrates different information about forest terrains, soil type and tree covers, etc. using, e.g. laser scanning, enhances forest management plans in modern systems.\nForest management plans include recommendations to achieve the landowner's objectives and desired future condition for the property subject to ecological, financial, logistical (e.g. access to resources), and other constraints.  On some properties, plans focus on producing quality wood products for processing or sale. Hence, tree species, quantity, and form, all central to the value of harvested products quality and quantity, tend to be important components of silvicultural plans.\nGood management plans include consideration of future conditions of the stand after any recommended harvests treatments, including future treatments (particularly in intermediate stand treatments), and plans for natural or artificial regeneration after final harvests.\nThe objectives of landowners and leaseholders influence plans for harvest and subsequent site treatment. In Britain, plans featuring \"good forestry practice\" must always consider the needs of other stakeholders such as nearby communities or rural residents living within or adjacent to woodland areas. Foresters consider tree felling and environmental legislation when developing plans. Plans instruct the sustainable harvesting and replacement of trees. They indicate whether road building or other forest engineering operations are required.\nAgriculture and forest leaders are also trying to understand how the climate change legislation will affect what they do. The information gathered will provide the data that will determine the role of agriculture and forestry in a new climate change regulatory system.\n\n\n== Forestry as a science ==\nOver the past centuries, forestry was regarded as a separate science. With the rise of ecology and environmental science, there has been a reordering in the applied sciences. In line with this view, forestry is a primary land-use science comparable with agriculture. Under these headings, the fundamentals behind the management of natural forests comes by way of natural ecology. Forests or tree plantations, those whose primary purpose is the extraction of forest products, are planned and managed utilizing a mix of ecological and agroecological principles. In many regions of the world there is considerable conflict between forest practices and other societal priorities such as water quality, watershed preservation, sustainable fishing, conservation, and species preservation.\n\n\n== Genetic diversity in forestry ==\nThe provenance of forest reproductive material used to plant forests has great influence on how the trees develop, hence why it is important to use forest reproductive material of good quality and of high genetic diversity. More generally, all forest management practices, including in natural regeneration systems, may impact the genetic diversity of trees.\nThe term genetic diversity describes the differences in DNA sequence between individuals as distinct from variation caused by environmental influences. The unique genetic composition of an individual (its genotype) will determine its performance (its phenotype) at a particular site.Genetic diversity is needed to maintain the vitality of forests and to provide resilience to pests and diseases. Genetic diversity also ensures that forest trees can survive, adapt and evolve under changing environmental conditions. Furthermore, genetic diversity is the foundation of biological diversity at species and ecosystem levels. Forest genetic resources are therefore important to consider in forest management.Genetic diversity in forests is threatened by forest fires, pests and diseases, habitat fragmentation, poor silvicultural practices and inappropriate use of forest reproductive material.\nAbout 98 million ha of forest were affected by fire in 2015; this was mainly in the tropical domain, where fire burned about 4 percent of the total forest area in that year. More than two-thirds of the total forest area affected was in Africa and South America. Insects, diseases and severe weather events damaged about 40 million ha of forests in 2015, mainly in the temperate and boreal domains.Furthermore, the marginal populations of many tree species are facing new threats due to climate change.Most countries in Europe have recommendations or guidelines for selecting species and provenances that can be used in a given site or zone.\n\n\n== Education ==\n\n\n=== History of forestry education ===\n\nThe first dedicated forestry school was established by Georg Ludwig Hartig at Hungen in the Wetterau, Hesse, in 1787, though forestry had been taught earlier in central Europe, including at the University of Giessen, in Hesse-Darmstadt.\nIn Spain, the first forestry school was the Forest Engineering School of Madrid (Escuela Técnica Superior de Ingenieros de Montes), founded in 1844.\nThe first in North America, the Biltmore Forest School was established near Asheville, North Carolina, by Carl A. Schenck on September 1, 1898, on the grounds of George W. Vanderbilt's Biltmore Estate. Another early school was the New York State College of Forestry, established at Cornell University just a few weeks later, in September 1898. Early 19th century North American foresters went to Germany to study forestry. Some early German foresters also emigrated to North America.\nIn South America the first forestry school was established in Brazil, in Viçosa, Minas Gerais, in 1962, and moved the next year to become a faculty at the Federal University of Paraná, in Curitiba.\n\n\n=== Forestry education today ===\n\nToday, forestry education typically includes training in general biology, ecology, botany, genetics, soil science, climatology, hydrology, economics and forest management. Education in the basics of sociology and political science is often considered an advantage. Professional skills in conflict resolution and communication are also important in training programs.In India, forestry education is imparted in the agricultural universities and in Forest Research Institutes (deemed universities). Four year degree programmes are conducted in these universities at the undergraduate level. Masters and Doctorate degrees are also available in these universities.\nIn the United States, postsecondary forestry education leading to a Bachelor's degree or Master's degree is accredited by the Society of American Foresters.In Canada the Canadian Institute of Forestry awards silver rings to graduates from accredited university BSc programs,  as well as college and technical programs.In many European countries, training in forestry is made in accordance with requirements of the Bologna Process and the European Higher Education Area.\nThe International Union of Forest Research Organizations is the only international organization that coordinates forest science efforts worldwide.\n\n\n=== Continuing education ===\nIn order to keep up with changing demands and environmental factors, forestry education does not stop at graduation. Increasingly, forestry professionals engage in regular training to maintain and improve on their management practices. An increasingly popular tool are marteloscopes; one hectare large, rectangular forest sites where all trees are numbered, mapped and recorded. These sites can be used to do virtual thinnings and test one's wood quality and volume estimations as well as tree microhabitats. This system is mainly suitable to regions with small-scale multi-functional forest management systems.\n\n\n=== Miscellaneous about Forestry research and education ===\nList of forest research institutes\nList of forestry technical schools\nList of forestry universities and colleges\nList of historic journals of forestry\nImperial Forestry Institute (disambiguation)\n\n\n== See also ==\n\n\n== Sources ==\n This article incorporates text from a free content work.  Licensed under CC BY-SA 3.0 License statement/permission on Wikimedia Commons. Text taken from Global Forest Resources Assessment 2020 Key findings,  FAO, FAO. To learn how to add open license text to Wikipedia articles, please see this how-to page. For information on reusing text from Wikipedia, please see the terms of use.\n This article incorporates text from a free content work.  Licensed under CC BY-SA 3.0 IGO License statement/permission on Wikimedia Commons. Text taken from The State of the World’s Forests 2020. Forests, biodiversity and people – In brief,  FAO & UNEP, FAO & UNEP. To learn how to add open license text to Wikipedia articles, please see this how-to page. For information on reusing text from Wikipedia, please see the terms of use.\n\n\n== References ==\n\n\n=== Further reading ===\nEyle, Alexandra. 1992. Charles Lathrop Pack: Timberman, Forest Conservationist, and Pioneer in Forest Education. Syracuse, NY: ESF College Foundation and College of Environmental Science and Forestry. Distributed by Syracuse University Press. Available: Internet Archive.\nHammond, Herbert. 1991. Seeing the Forest Among the Trees. Winlaw/Vancouver: Polestar Press, 1991.\nHart, C. 1994. Practical Forestry for the Agent and Surveyor. Stroud. Sutton Publishing. ISBN 0-86299-962-6\nHibberd, B.G. (Ed). 1991. Forestry Practice. Forestry Commission Handbook 6. London. HMSO. ISBN 0-11-710281-4\nKimmins, Hammish. 1992. Balancing Act: Environmental Issues in Forestry. Vancouver: University of British Columbia Press.\nMaser, Chris. 1994. Sustainable Forestry: Philosophy, Science, and Economics. DelRay Beach: St. Lucie Press.\nMiller, G. Tyler. 1990. Resource Conservation and Management. Belmont: Wadsworth Publishing.\nNyland, Ralph D. 2007. Silviculture: Concepts and Applications. 2nd ed. Prospect Heights: Waveland Press.\nOosthoek, K. Jan/ Richard Hölzl (eds.) 2019. Managing Northern Europe's Forests. Histories from the Age of Improvement to the Age of Ecology. New York/Oxford: Berghahn Publ.\nRadkau, Joachim Wood: A History, ISBN 978-0-7456-4688-6, November 2011, Polity\nStoddard, Charles H. 1978. Essentials of Forestry. New York: Ronald Press.\n[1]. Vira, B. et al. 2015. Forests and Food: Addressing Hunger and Nutrition Across Sustainable Landscapes. Cambridge: Open Book Publishers.\nScott, James C. 1998. Seeing Like a State: Nature and Space. Yale University Press\n\n\n== External links ==\n Media related to Forestry at Wikimedia Commons\n Works related to Forestry at Wikisource\nForestry at Curlie", "chinese_title": "", "chinese": ""}