{"topic": "Publishing", "english_title": "Publishing", "english": "Publishing is the activity of making information, literature, music, software and other content available to the public for sale or for free. Traditionally, the term refers to the distribution of printed works, such as books, newspapers, and magazines. With the advent of digital information systems, the scope has expanded to include electronic publishing such as ebooks, academic journals, micropublishing, websites, blogs, video game publishing, and the like.\nPublishing may produce private, club, commons or public goods and may be conducted as a commercial, public, social or community activity. The commercial publishing industry ranges from large multinational conglomerates such as Bertelsmann, RELX, Pearson and Thomson Reuters to thousands of small independents. It has various divisions such as: trade/retail publishing of fiction and non-fiction, educational publishing (k-12) and academic and scientific publishing. Publishing is also undertaken by governments, civil society and private companies for administrative or compliance requirements, business, research, advocacy or public interest objectives. This can include annual reports, research reports, market research, policy briefings and technical reports. Self-publishing has become very common.\n\"Publisher\" can refer to a publishing company or organization, or to an individual who leads a publishing company, imprint, periodical or newspaper.\n\n\n== Publishing in law ==\nPublication is important as a legal concept:\n\nAs the process of giving formal notice to the world of a significant intention, for example, to marry or enter bankruptcy\nAs the essential precondition of being able to claim defamation; that is, the alleged libel must have been published\nFor copyright purposes, where there is a difference in the protection of published and unpublished works\n\n\n== History ==\nPublishing became possible with the invention of writing, and became more practical upon the introduction of printing. Prior to printing, distributed works were copied manually, by scribes. Due to printing, publishing progressed hand-in-hand with the development of books.\nThe Chinese inventor Bi Sheng made movable type of earthenware circa 1045, but there are no known surviving examples of his work. The Korean civil servant Choe Yun-ui, who lived during the Goryeo Dynasty, invented the first metal moveable type in 1234-1250 AD Around 1450, in what is commonly regarded as an independent invention, Johannes Gutenberg invented movable type in Europe, along with innovations in casting the type based on a matrix and hand mould. This invention gradually made books less expensive to produce and more widely available.\nEarly printed books, single sheets and images which were created before 1501 in Europe are known as incunables or incunabula. \"A man born in 1453, the year of the fall of Constantinople, could look back from his fiftieth year on a lifetime in which about eight million books had been printed, more perhaps than all the scribes of Europe had produced since Constantine founded his city in A.D. 330.\"Eventually, printing enabled other forms of publishing besides books. The history of modern newspaper publishing started in Germany in 1609, with publishing of magazines following in 1663.\nMissionaries brought printing presses to sub-Saharan Africa in the mid-18th century.Historically, publishing has been handled by publishers, although some authors self-published. The establishment of the World Wide Web in 1989 soon propelled the website into a dominant medium of publishing. Wikis and Blogs soon developed, followed by online books, online newspapers, and online magazines.\nSince its start, the World Wide Web has been facilitating the technological convergence of commercial and self-published content, as well as the convergence of publishing and producing into online production through the development of multimedia content.\nA U.S. based study in 2016 that surveyed 34 publishers found that the publishing industry in the US in general is overwhelmingly represented by straight, able bodied, white females. Salon described the situation as \"lack of diversity behind the scenes in book world\". A survey in 2020 by the same group found there has been no statistical significant change in the lack of diversity since the 2016 survey four years earlier. Lack of diversity in the American publishing industry has been an issue for years. Within the industry, there was the least amount of diversity in higher level editorial positions.\n\n\n== The traditional process of publishing ==\nBook publishers buy or commission copy from independent authors; newspaper publishers, by contrast, usually hire staff to produce copy, although they may also employ freelance journalists, called stringers. Magazines may employ either strategy or a mixture.\nTraditional book publishers are selective about what they publish.  They do not accept manuscripts direct from authors.  Authors must first submit a query letter or proposal, either to a literary agent or direct to the publisher. depending on the publisher's submission guidelines. If the publisher does accept unsolicited manuscripts, then the manuscript is placed in the slush pile, which publisher's readers sift through to identify manuscripts worthy of publication. The acquisitions editors review these and if they agree, send them to the editorial staff. Larger companies have more levels of assessment between submission and publication than smaller companies. Unsolicited submissions have a very low rate of acceptance, with some estimates as low as 3 out of every 10,000 being accepted.\n\n\n== Stages of publishing ==\nThe publishing process includes creation, acquisition, copy editing, production, printing (and its electronic equivalents), marketing, and distribution.\nAlthough listed as distinct stages, parts of these occur concurrently. As editing of text progresses, front cover design and initial layout takes place, and sales and marketing of the book begins.\nThe publisher may subcontract various aspects of this process to specialist companies and/or freelancers.\n\n\n=== Binding ===\n\nIn the case of books, binding follows upon the printing process. It involves folding the printed sheets, \"securing them together, affixing boards or sides to it, and covering the whole with leather or other materials\".\n\n\n== Types of publishers ==\n\nThere are four major types of publishers in book publishing:\n\nCommercial publishers are more rigid and selective as to which books they publish. If accepted, authors pay no costs to publish in exchange for selling rights to their work. They receive in-house editing, design, printing, marketing and distribution services, and are paid royalties on sales.\nSelf-publishers: Authors use self-publishing houses to publish their books and retain full rights to their works. Self-publishing houses are more open than traditional publishing houses, allowing emerging and established authors to publish their work. A number of modern or self-publishing houses offer enhanced services (e.g. editing, design) and authors may choose which one to use. Authors shoulder pre-publishing expenses and in return retain all the rights to their works, keep total control, and are paid royalties on sales.\nVanity presses portray themselves as traditional publishers but are, in fact, just a self-publishing service. Unlike genuine self-publishing services, the author is often obliged to use some or all of their additional services, and the press will often take rights to the work as part of their contract.\nHybrid publishers operate with a different revenue model than traditional publishing, while keeping the rest of the practices of publishing the same. There have been attempts to bridge this gap using hybrid models. No one model has been fully proven at this stage.Derided in the 1911 Encyclopædia Britannica as \"a purely commercial affair\" that cared more about profits than about literary quality, publishing is like any business, with a need for the expenses not to exceed the income. Publishing is now a major industry with the largest companies Reed Elsevier and Pearson PLC having global publishing operations.\nSome businesses maximize their profit margins through vertical integration; book publishing is not one of them. Although newspaper and magazine companies still often own printing presses and binderies, book publishers rarely do. Similarly, the trade usually sells the finished products through a distributor who stores and distributes the publisher's wares for a percentage fee or sells on a sale or return basis.\nThe advent of the Internet has provided the electronic way of book distribution without the need of physical printing, physical delivery and storage of books. This, therefore, poses an interesting question that challenges publishers, distributors, and retailers. The question pertains to the role and importance the publishing houses have in the overall publishing process. It is a common practice that the author, the original creator of the work, signs the contract awarding him or her only around 10% of the proceeds of the book.  Such contract leaves 90% of the book proceeds to the publishing houses, distribution companies, marketers, and retailers. One example (rearranged) of the distribution of proceeds from the sale of a book was given as follows:\n45% to the retailer\n10% to the wholesaler\n10.125% to the publisher for printing (this is usually subcontracted out)\n7.15% to the publisher for marketing\n12.7% to the publisher for pre-production\n15% to the author (royalties)There is a common misconception that publishing houses make large profits and that authors are the lowest paid in the publishing chain. However, most publishers make little profit from individual titles, with 75% of books not breaking even. Approximately 80% of the cost of a book is taken up by the expenses of preparing, distributing, and printing (with printing being one of the lowest costs of all).  On successful titles, publishing companies will usually make around 10% profit, with the author(s) receiving 8–15% of the retail price. However, given that authors are usually individuals, are often paid advances irrespective of whether the book turns a profit and do not normally have to split profits with others, it makes them the highest paid individuals in the publishing process.\nWithin the electronic book path, the publishing house's role remains almost identical.  The process of preparing a book for e-book publication is exactly the same as print publication, with only minor variations in the process to account for the different mediums of publishing.  While some costs, such as the discount given to retailers (normally around 45%) are eliminated, additional costs connected to ebooks apply (especially in the conversion process), raising the production costs to a similar level.Print on demand is rapidly becoming an established alternative to traditional publishing (see main article).\nBook clubs are almost entirely direct-to-retail, and niche publishers pursue a mixed strategy to sell through all available outlets — their output is insignificant to the major booksellers, so lost revenue poses no threat to the traditional symbiotic relationships between the four activities of printing, publishing, distribution, and retail.\n\n\n== Industry sub-divisions ==\n\n\n=== Newspaper publishing ===\n\nNewspapers are regularly scheduled publications that present recent news, typically on a type of inexpensive paper called newsprint. Most newspapers are primarily sold to subscribers, through retail newsstands or are distributed as advertising-supported free newspapers. About one-third of publishers in the United States are newspaper publishers.\n\n\n=== Periodical publishing ===\n\nNominally, periodical publishing involves publications that appear in a new edition on a regular schedule. Newspapers and magazines are both periodicals, but within the industry, the periodical publishing is frequently considered a separate branch that includes magazines and even academic journals, but not newspapers.  About one-third of publishers in the United States publish periodicals (not including newspapers). The library and information science communities often refer to periodicals as  serials.\n\n\n=== Book publishing ===\n\nThe global book publishing industry accounts for over $100 billion of annual revenue, or about 15% of the total media industry.For-profit publishers of books that serve the general public are often referred to as \"trade publishers.\" Book publishers represent less than a sixth of the publishers in the United States. Most books are published by a small number of very large book publishers, but thousands of smaller book publishers exist. Many small- and medium-sized book publishers specialize in a specific area. Additionally, thousands of authors have created publishing companies and self-published their own works. Within the book publishing, the publisher of record for a book is the entity in whose name the book's ISBN is registered. The publisher of record may or may not be the actual publisher.\nIn 2013, Penguin (owned by Pearson) and Random House (owned by Bertelsmann) merged, narrowing the industry to a handful of big publishers as it adapted to digital media. The merger created the largest consumer book publisher in the world, with a global market share of more than 25 percent. Approximately 60% of English-language books are produced through the \"Big Five\" publishing houses: Penguin Random House (Bertelsmann), Hachette (Lagardère), HarperCollins (News Corp), Simon & Schuster (Bertelsmann) and Macmillan (Holtzbrinck).Publishers like  Leadstart, Shristi Publisher, Rupa Publications and Jaico Publishing House are the major publishers from India.  (See also: List of English-language book publishing companies.)\nIn November 2020, ViacomCBS agreed to sell Simon & Schuster, the third largest book publisher in the United States, to Penguin Random House in a deal that will create the first megapublisher.\n\n\n=== Directory publishing ===\nDirectory publishing is a specialized genre within the publishing industry. These publishers produce mailing lists, telephone books, and other types of directories. With the advent of the Internet, many of these directories are now online.\n\n\n=== Tie-in publishing ===\n\nTechnically, radio, television, cinemas, VCDs and DVDs, music systems, games, computer hardware and mobile telephony publish information to their audiences. Indeed, the marketing of a major film often includes a novelization, a graphic novel or comic version, the soundtrack album, a game, model, toys and endless promotional publications.\nSome of the major publishers have entire divisions devoted to a single franchise, e.g. Ballantine Del Rey Lucasbooks has the exclusive rights to Star Wars in the United States; Random House UK (Bertelsmann)/Century LucasBooks holds the same rights in the United Kingdom. The game industry self-publishes through BL Publishing/Black Library (Warhammer) and Wizards of the Coast (Dragonlance, Forgotten Realms, etc.). The BBC has its publishing division that does very well with long-running series such as Doctor Who. These multimedia works are cross-marketed aggressively and sales frequently outperform the average stand-alone published work, making them a focus of corporate interest.\n\n\n== Recent developments ==\nAccessible publishing uses the digitization of books to mark up books into XML and then produces multiple formats from this to sell to consumers, often targeting those with difficulty reading. Formats include a variety larger print sizes, specialized print formats for dyslexia, eye tracking problems and macular degeneration, as well as Braille, DAISY, audiobooks and e-books.Green publishing means adapting the publishing process to minimise environmental impact. One example of this is the concept of on-demand printing, using digital or print-on-demand technology. This cuts down the need to ship books since they are manufactured close to the customer on a just-in-time basis.A further development is the growth of on-line publishing where no physical books are produced. The ebook is created by the author and uploaded to a website from where it can be downloaded and read by anyone.\nAn increasing number of authors are using niche marketing online to sell more books by engaging with their readers online.\n\n\n== Standardization ==\nRefer to the ISO divisions of ICS 01.140.40 and 35.240.30 for further information.\n\n\n== Legal issues ==\n\nPublication is the distribution of copies or content to the public.  The Berne Convention requires that this can only be done with the consent of the copyright holder, which is initially always the author.  In the Universal Copyright Convention, \"publication\" is defined in article VI as \"the reproduction in tangible form and the general distribution to the public of copies of a work from which it can be read or otherwise visually perceived.\"\n\n\n== Privishing ==\nPrivishing (private publishing) is a modern term for publishing a book but printing so few copies or with such lack of marketing, advertising or sales support that it effectively does not reach the public. The book, while nominally published, is almost impossible to obtain through normal channels such as bookshops, often cannot be ordered specially, and has a notable lack of support from its publisher, including refusal to reprint the title. A book that is privished may be referred to as \"killed.\" Depending on the motivation, privishing may constitute breach of contract, censorship, or good business practice (e.g., not printing more books than the publisher believes will sell in a reasonable length of time).\n\n\n== See also ==\n\n\n== Notes and references ==\n\n\n=== Footnotes ===\n\n\n== External links ==\n\nInternational Publishers' organisation", "chinese_title": "", "chinese": ""}