{"topic": "Systems", "english_title": "System", "english": "A system is a group of interacting or interrelated elements that act according to a set of rules to form a unified whole. A system, surrounded and influenced by its environment, is described by its boundaries, structure and purpose and expressed in its functioning. Systems are the subjects of study of systems theory.\n\n\n== Etymology ==\nThe term \"system\" comes from the Latin word systēma, in turn from Greek σύστημα systēma: \"whole concept made of several parts or members, system\", literary \"composition\".\n\n\n== History ==\nAccording to Marshall McLuhan,\n\n\"System\" means \"something to look at\". You must have a very high visual gradient to have systematization. But in philosophy, prior to Descartes, there was no \"system\". Plato had no \"system\". Aristotle had no \"system\".\n\nIn the 19th century the French physicist Nicolas Léonard Sadi Carnot, who studied thermodynamics, pioneered the development of the concept of a \"system\" in the natural sciences. In 1824 he studied the system which he called the working substance (typically a body of water vapor) in steam engines, in regards to the system's ability to do work when heat is applied to it. The working substance could be put in contact with either a boiler, a cold reservoir (a stream of cold water), or a piston (on which the working body could do work by pushing on it). In 1850, the German physicist Rudolf Clausius generalized this picture to include the concept of the surroundings and began to use the term \"working body\" when referring to the system.\nThe biologist Ludwig von Bertalanffy became one of the pioneers of the general systems theory. In 1945 he introduced models, principles, and laws that apply to generalized systems or their subclasses, irrespective of their particular kind, the nature of their component elements, and the relation or 'forces' between them.Norbert Wiener and Ross Ashby, who pioneered the use of mathematics to study systems, carried out significant development in the concept of a system.In the 1980s John Henry Holland, Murray Gell-Mann and others coined the term \"complex adaptive system\" at the interdisciplinary Santa Fe Institute.\n\n\n== Concepts ==\nEnvironment and boundaries\nSystems theory views the world as a complex system of interconnected parts. One scopes a system by defining its boundary; this means choosing which entities are inside the system and which are outside—part of the environment. One can make simplified representations (models) of the system in order to understand it and to predict or impact its future behavior. These models may define the structure and behavior of the system.Natural and human-made systems\nThere are natural and human-made (designed) systems. Natural systems may not have an apparent objective but their behavior can be interpreted as purposeful by an observer. Human-made systems are made with variable purposes that are achieved by some action performed by or with the system. The parts of a system must be related; they must be \"designed to work as a coherent entity\" — otherwise they would be two or more distinct systems.\nTheoretical framework\nMost systems are open systems, exchanging matter and energy with its surroundings; like a car, a coffeemaker, or Earth. A closed system exchanges energy, but not matter, with its environment; like a computer or the project Biosphere 2. An isolated system exchanges neither matter nor energy with its environment. A theoretical example of such system is the Universe.Process and transformation process\nAn open system can also be viewed as a bounded transformation process, that is, a black box that is a process or collection of processes that transforms inputs into outputs. Inputs are consumed; outputs are produced. The concept of input and output here is very broad. For example, an output of a passenger ship is the movement of people from departure to destination.System model\nA system comprises multiple views. Man-made systems may have such views as concept, analysis, design, implementation, deployment, structure, behavior, input data, and output data views. A system model is required to describe and represent all these views.Systems architecture\nA systems architecture, using one single integrated model for the description of multiple views, is a kind of system model.\n\n\n=== Subsystem ===\nA subsystem is a set of elements, which is a system itself, and a component of a larger system. The IBM Mainframe Job Entry Subsystem family (JES1, JES2, JES3, and their HASP/ASP predecessors) are examples. The main elements they have in common are the components that handle input, scheduling, spooling and output; they also have the ability to interact with local and remote operators.\nA subsystem description is a system object that contains information defining the characteristics of an operating environment controlled by the system. The Data tests are performed to verify the correctness of the individual subsystem configuration data (e.g. MA Length, Static Speed Profile, …) and they are related to a single subsystem in order to test its Specific Application (SA).\n\n\n== Analysis ==\nThere are many kinds of systems that can be analyzed both quantitatively and qualitatively. For example, in an analysis of urban systems dynamics, A .W. Steiss defined five intersecting systems, including the physical subsystem and behavioral system. For sociological models influenced by systems theory, Kenneth D. Bailey defined systems in terms of conceptual, concrete, and abstract systems, either isolated, closed, or open. Walter F. Buckley defined systems in sociology in terms of mechanical, organic, and process models. Bela H. Banathy cautioned that for any inquiry into a system understanding its kind is crucial, and defined \"natural\" and \"designed\", i. e. artificial, systems.\nIt is important not to confuse these abstract definitions.  For example, natural systems include subatomic systems, living systems, the solar system, galaxies, and the Universe, while artificial systems include man-made physical structures, hybrids of natural and artificial systems, and conceptual knowledge. The human elements of organization and functions are emphasized with their relevant abstract systems and representations. A cardinal consideration in making distinctions among systems is to determine how much freedom the system has to select its purpose, goals, methods, tools, etc. and how free it is to select itself as distributed or concentrated.Artificial systems inherently have a major defect: they must be premised on one or more fundamental assumptions upon which additional knowledge is built. This is in strict alignment to the Gödel's incompleteness theorems. The Artificial system can be defined as a \"consistent formalized system which contains elementary arithmetic\". These fundamental assumptions are not inherently deleterious, but they must by definition be assumed as true, and if they are actually false then the system is not as structurally integral as is assumed (i.e. it is evident that if the initial expession is false, then the Artificial system is not a \"consistent formalized system\"). For example, in geometry this is very evident in the postulation of theorems and extrapolation of proofs from them.\nGeorge J. Klir maintained that no \"classification is complete and perfect for all purposes\", and defined systems as abstract, real, and conceptual physical systems, bounded and unbounded systems, discrete to continuous, pulse to hybrid systems, etc. The interactions between systems and their environments are categorized as relatively closed and open systems. It seems most unlikely that an absolutely closed system can exist or, if it did, that it could be known by man. Important distinctions have also been made between hard systems – technical in nature and amenable to methods such as systems engineering, operations research, and quantitative systems analysis – and soft systems that involve people and organisations, commonly associated with concepts developed by Peter Checkland and Brian Wilson through Soft Systems Methodology (SSM) involving methods such as action research and emphasis of participatory designs. Where hard systems might be identified as more \"scientific\", the distinction between them is often elusive.\n\n\n=== Cultural system ===\nA cultural system may be defined as the interaction of different elements of culture. While a cultural system is quite different from a social system, sometimes both together are referred to as a \"sociocultural system\". A major concern of the social sciences is the problem of order.\n\n\n=== Economic system ===\n\nAn economic system is a mechanism (social institution) which deals with the production, distribution and consumption of goods and services in a particular society. The economic system is composed of people, institutions and their relationships to resources, such as the convention of property. It addresses the problems of economics, like the allocation and scarcity of resources.\nThe international sphere of interacting states is described and analysed in systems terms by several international relations scholars, most notably in the neorealist school. This systems mode of international analysis has however been challenged by other schools of international relations thought, most notably the constructivist school, which argues that an over-large focus on systems and structures can obscure the role of individual agency in social interactions. Systems-based models of international relations also underlies the vision of the international sphere held by the liberal institutionalist school of thought, which places more emphasis on systems generated by rules and interaction governance, particularly economic governance.\n\n\n== Application of the system concept ==\nSystems modeling is generally a basic principle in engineering and in social sciences. The system is the representation of the entities under concern. Hence inclusion to or exclusion from system context is dependent on the intention of the modeler.\nNo model of a system will include all features of the real system of concern, and no model of a system must include all entities belonging to a real system of concern.\n\n\n=== In information and computer science ===\nIn computer science and information science, system is a hardware system, software system, or combination, which has components as its structure and observable inter-process communications as its behavior. Again, an example will illustrate: There are systems of counting, as with Roman numerals, and various systems for filing papers, or catalogues, and various library systems, of which the Dewey Decimal Classification is an example. This still fits with the definition of components which are connected together (in this case to facilitate the flow of information).\nSystem can also refer to a framework, aka platform, be it software or hardware, designed to allow software programs to run. A flaw in a component or system can cause the component itself  or an entire system to fail to perform its required function, e.g., an incorrect statement or data definition \n\n\n=== In engineering and physics ===\nIn engineering and physics, a physical system is the portion of the universe that is being studied (of which a thermodynamic system is one major example). Engineering also has the concept of a system referring to all of the parts and interactions between parts of a complex project. Systems engineering is the branch of engineering that studies how this type of system should be planned, designed, implemented, built, and maintained. Expected result is the behavior predicted by the specification, or another source, of the component or system under specified conditions.\n\n\n=== In social and cognitive sciences and management research ===\nSocial and cognitive sciences recognize systems in human person models and in human societies. They include human brain functions and mental processes as well as normative ethics systems and social/cultural behavioral patterns.\nIn management science, operations research and organizational development (OD), human organizations are viewed as systems (conceptual systems) of interacting components such as subsystems or system aggregates, which are carriers of numerous complex business processes (organizational behaviors) and organizational structures. Organizational development theorist Peter Senge developed the notion of organizations as systems in his book The Fifth Discipline.\nSystems Thinking is a style of thinking/reasoning and problem solving. It starts from the recognition of system properties in a given problem. It can be a leadership competency. Some people can think globally while acting locally. Such people consider the potential consequences of their decisions on other parts of larger systems. This is also a basis of systemic coaching in psychology.\nOrganizational theorists such as Margaret Wheatley have also described the workings of organizational systems in new metaphoric contexts, such as quantum physics, chaos theory, and the self-organization of systems.\n\n\n=== Pure logical systems ===\nThere is also such a thing as a logical system. The most obvious example is the calculus developed simultaneously by Leibniz and Isaac Newton. Another example is George Boole's Boolean operators. Other examples have related specifically to philosophy, biology, or cognitive science. Maslow's hierarchy of needs applies psychology to biology by using pure logic. Numerous psychologists, including Carl Jung and Sigmund Freud have developed systems which logically organize psychological domains, such as personalities, motivations, or intellect and desire. Often these domains consist of general categories following a corollary such as a theorem. Logic has been applied to categories such as taxonomy, ontology, assessment, and hierarchies.\n\n\n=== Applied to strategic thinking ===\nIn 1988, military strategist, John A. Warden III introduced the Five Ring System model in his book, The Air Campaign, contending that any complex system could be broken down into five concentric rings. Each ring—Leadership, Processes, Infrastructure, Population and Action Units—could be used to isolate key elements of any system that needed change. The model was used effectively by Air Force planners in the First Gulf War. In the late 1990s, Warden applied his model to business strategy.2015to2021\n\n\n== See also ==\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n== External links ==\nDefinitions of Systems and Models by Michael Pidwirny, 1999–2007.\nPublications with the title \"System\" (1600–2008) by Roland Müller.\nDefinitionen von \"System\" (1572–2002) by Roland Müller, (most in German).", "chinese_title": "Systems ", "chinese": "Systems (system) is an IT industry's professional fair, held every year in Munich, Germany.  == External link ==  Systems-world.de - SYSTEMS 2005 (German) "}