{"topic": "Psychology", "english_title": "Psychology", "english": "Psychology is the science of mind and behavior. Psychology includes the study of conscious and unconscious phenomena, as well as feelings and thought. It is an academic discipline of immense scope. Psychologists also seek an understanding of the emergent properties of brains, linking the discipline to neuroscience. As a social science, psychologists aim to understand the behavior of individuals and groups.A professional practitioner or researcher involved in the discipline is called a psychologist and can be classified as a social, behavioral, or cognitive scientist. Some psychologists attempt to understand the role of mental functions in individual and social behavior. Others explore the physiological and biological processes that underlie cognitive functions and behaviors.\nPsychologists explore behavior and mental processes, including perception, cognition, attention, emotion, intelligence, subjective experiences, motivation, brain functioning, and personality. Psychologists' interests extend to interpersonal relationships, psychological resilience, family resilience, and other areas within social psychology. Psychologists also consider the unconscious mind. Research psychologists employ empirical methods to infer causal and correlational relationships between psychosocial variables. Some, but not all, clinical and counseling psychologists rely on symbolic interpretation.\nWhile psychological knowledge is often applied to the assessment and treatment of mental health problems, it is also directed towards understanding and solving problems in several spheres of human activity. By many accounts, psychology ultimately aims to benefit society. Many psychologists are involved in some kind of therapeutic role, practicing in clinical, counseling, or school settings. Other psychologists conduct scientific research on a wide range of topics related to mental processes and behavior. Typically the latter group of psychologists work in academic settings (e.g., universities, medical schools, hospitals). Another group of psychologists is employed in industrial and organizational settings. Yet others are involved in work on human development, aging, sports, health, forensics, and the media.\n\n\n== Etymology and definitions ==\nThe word psychology derives from the Greek word psyche, for spirit or soul. The latter part of the word \"psychology\" derives from -λογία -logia, which refers to \"study\" or \"research\". The Latin word psychologia was first used by the Croatian humanist and Latinist Marko Marulić in his book, Psichiologia de ratione animae humanae in the late 15th century or early 16th century. The earliest known reference to the word psychology in English was by Steven Blankaart in 1694 in The Physical Dictionary. The dictionary refers to \"Anatomy, which treats the Body, and Psychology, which treats of the Soul.\"In 1890, William James defined psychology as \"the science of mental life, both of its phenomena and their conditions.\" This definition enjoyed widespread currency for decades. However, this meaning was contested, notably by radical behaviorists such as John B. Watson, who in his 1913 manifesto defined the discipline of psychology as the acquisition of information useful to the control of behavior. Since James defined \"psychology,\" the term more strongly implicates scientific experimentation. Folk psychology refers to the understanding of ordinary people, as contrasted with that of psychology professionals.\n\n\n== History ==\n\nThe ancient civilizations of Egypt, Greece, China, India, and Persia all engaged in the philosophical study of psychology. In Ancient Egypt the Ebers Papyrus mentioned depression and thought disorders. Historians note that Greek philosophers, including Thales, Plato, and Aristotle (especially in his De Anima treatise), addressed the workings of the mind. As early as the 4th century BC, Greek physician Hippocrates theorized that mental disorders had physical rather than supernatural causes.In China, psychological understanding grew from the philosophical works of Laozi and Confucius, and later from the doctrines of Buddhism. This body of knowledge involves insights drawn from introspection and observation, as well as techniques for focused thinking and acting. It frames the universe in term of a division of physical reality and mental reality as well as the interaction between the physical and the mental. Chinese philosophy also emphasized purifying the mind in order to increase virtue and power. An ancient text known as The Yellow Emperor's Classic of Internal Medicine identifies the brain as the nexus of wisdom and sensation, includes theories of personality based on yin–yang balance, and analyzes mental disorder in terms of physiological and social disequilibria. Chinese scholarship that focused on the brain advanced during the Qing Dynasty with the work of Western-educated Fang Yizhi (1611–1671), Liu Zhi (1660–1730), and Wang Qingren (1768–1831). Wang Qingren emphasized the importance of the brain as the center of the nervous system, linked mental disorder with brain diseases, investigated the causes of dreams and insomnia, and advanced a theory of hemispheric lateralization in brain function.Influenced by Hinduism, Indian philosophy explored distinctions in types of awareness. A central idea of the Upanishads and other Vedic texts that formed the foundations of Hinduism was the distinction between a person's transient mundane self and their eternal, unchanging soul. Divergent Hindu doctrines and Buddhism have challenged this hierarchy of selves, but have all emphasized the importance of reaching higher awareness. Yoga encompasses a range of techniques used in pursuit of this goal. Theosophy, a religion established by Russian-American philosopher Helena Blavatsky, drew inspiration from these doctrines during her time in British India.Psychology was of interest to Enlightenment thinkers in Europe. In Germany, Gottfried Wilhelm Leibniz (1646–1716) applied his principles of calculus to the mind, arguing that mental activity took place on an indivisible continuum. He suggested that the difference between conscious and unconscious awareness is only a matter of degree. Christian Wolff identified psychology as its own science, writing Psychologia Empirica in 1732 and Psychologia Rationalis in 1734. Immanuel Kant advanced the idea of anthropology as a discipline, with psychology an important subdivision. Kant, however, explicitly rejected the idea of an experimental psychology, writing that \"the empirical doctrine of the soul can also never approach chemistry even as a systematic art of analysis or experimental doctrine, for in it the manifold of inner observation can be separated only by mere division in thought, and cannot then be held separate and recombined at will (but still less does another thinking subject suffer himself to be experimented upon to suit our purpose), and even observation by itself already changes and displaces the state of the observed object.\" In 1783, Ferdinand Ueberwasser (1752-1812) designated himself Professor of Empirical Psychology and Logic and gave lectures on scientific psychology, though these developments were soon overshadowed by the Napoleonic Wars. At the end of the Napoleonic era, Prussian authorities discontinued the Old University of Münster. Having consulted philosophers Hegel and Herbart, however, in 1825 the Prussian state established psychology as a mandatory discipline in its rapidly expanding and highly influential educational system. However, this discipline did not yet embrace experimentation. In England, early psychology involved phrenology and the response to social problems including alcoholism, violence, and the country's crowded \"lunatic\" asylums.\n\n\n=== Beginning of experimental psychology ===\n\nGustav Fechner began conducting psychophysics research in Leipzig in the 1830s, articulating the principle that human perception of a stimulus varies logarithmically according to its intensity. The principle became known as the Weber–Fechner law. Fechner's 1860 Elements of Psychophysics challenged Kant's stricture against the conducting of quantitative research on the mind. In Heidelberg, Hermann von Helmholtz conducted parallel research on sensory perception, and trained physiologist Wilhelm Wundt. Wundt, in turn, came to Leipzig University, establishing the psychological laboratory that brought experimental psychology to the world. Wundt focused on breaking down mental processes into the most basic components, motivated in part by an analogy to recent advances in chemistry, and its successful investigation of the elements and structure of materials. Paul Flechsig and Emil Kraepelin soon created another influential psychology laboratory at Leipzig, this one focused more on experimental psychiatry.The German psychologist Hermann Ebbinghaus, a researcher at the University of Berlin, was another 19th-century contributor to the field. He pioneered the experimental study of memory and developed quantitative models of learning and forgetting. In the early twentieth century, Wolfgang Kohler, Max Wertheimer, and Kurt Koffka co-founded the school of Gestalt psychology (not to be confused with the Gestalt therapy of Fritz Perls). The approach of Gestalt psychology is based upon the idea that individuals experience things as unified wholes. Rather than reducing thoughts and behavior into smaller component elements, as in structuralism, the Gestaltists maintained that whole of experience is important, and differs from the sum of its parts.\nPsychologists in Germany, Denmark, Austria, England, and the United States soon followed Wundt in setting up laboratories. G. Stanley Hall, an American who studied with Wundt, founded a psychology lab that became internationally influential. The lab was located at Johns Hopkins University. Hall, in turn, trained Yujiro Motora, who brought experimental psychology, emphasizing psychophysics, to the Imperial University of Tokyo. Wundt's assistant, Hugo Münsterberg, taught psychology at Harvard to students such as Narendra Nath Sen Gupta—who, in 1905, founded a psychology department and laboratory at the University of Calcutta. Wundt's students Walter Dill Scott, Lightner Witmer, and James McKeen Cattell worked on developing tests of mental ability. Cattell, who also studied with eugenicist Francis Galton, went on to found the Psychological Corporation. Witmer focused on the mental testing of children; Scott, on employee selection.Another student of Wundt, the Englishman Edward Titchener, created the psychology program at Cornell University and advanced \"structuralist\" psychology. The idea behind structuralism was to analyze and classify different aspects of the mind, primarily through the method of introspection. William James, John Dewey, and Harvey Carr advanced the idea of functionalism, an expansive approach to psychology that underlined the Darwinian idea of a behavior's usefulness to the individual. In 1890, James wrote an influential book, The Principles of Psychology, which expanded on the structuralism. He memorably described \"stream of consciousness.\" James's ideas interested many American students in the emerging discipline. Dewey integrated psychology with societal concerns, most notably by promoting progressive education, inculcating moral values in children, and assimilating immigrants.\n\nA different strain of experimentalism, with a greater connection to physiology, emerged in South America, under the leadership of Horacio G. Piñero at the University of Buenos Aires. In Russia, too, researchers placed greater emphasis on the biological basis for psychology, beginning with Ivan Sechenov's 1873 essay, \"Who Is to Develop Psychology and How?\" Sechenov advanced the idea of brain reflexes and aggressively promoted a deterministic view of human behavior. The Russian-Soviet physiologist Ivan Pavlov discovered in dogs a learning process that was later termed \"classical conditioning\" and applied the process to human beings.\n\n\n=== Consolidation and funding ===\nOne of the earliest psychology societies was La Société de Psychologie Physiologique in France, which lasted from 1885 to 1893. The first meeting of the International Congress of Psychology sponsored by the International Union of Psychological Science took place in Paris, in August 1889, amidst the World's Fair celebrating the centennial of the French Revolution. William James was one of three Americans among the four hundred attendees. The American Psychological Association (APA) was founded soon after, in 1892. The International Congress continued to be held at different locations in Europe and with wide international participation. The Sixth Congress, held in Geneva in 1909, included presentations in Russian, Chinese, and Japanese, as well as Esperanto. After a hiatus for World War I, the Seventh Congress met in Oxford, with substantially greater participation from the war-victorious Anglo-Americans. In 1929, the Congress took place at Yale University in New Haven, Connecticut, attended by hundreds of members of the APA. Tokyo Imperial University led the way in bringing new psychology to the East. New ideas about psychology diffused from Japan into China.American psychology gained status upon the U.S.'s entry into World War I. A standing committee headed by Robert Yerkes administered mental tests (\"Army Alpha\" and \"Army Beta\") to almost 1.8 million soldiers. Subsequently, the Rockefeller family, via the Social Science Research Council, began to provide funding for behavioral research. Rockefeller charities funded the National Committee on Mental Hygiene, which disseminated the concept of mental illness and lobbied for applying ideas from psychology to child rearing. Through the Bureau of Social Hygiene and later funding of Alfred Kinsey, Rockefeller foundations helped establish research on sexuality in the U.S. Under the influence of the Carnegie-funded Eugenics Record Office, the Draper-funded Pioneer Fund, and other institutions, the eugenics movement also influenced American psychology. In the 1910s and 1920s, eugenics became a standard topic in psychology classes. In contrast to the US, in the UK psychology was met with antagonism by the scientific and medical establishments, and up until 1939 there were only six psychology chairs in universities in England.During World War II and the Cold War, the U.S. military and intelligence agencies established themselves as leading funders of psychology by way of the armed forces and in the new Office of Strategic Services intelligence agency. University of Michigan psychologist Dorwin Cartwright reported that university researchers began large-scale propaganda research in 1939–1941. He observed that \"the last few months of the war saw a social psychologist become chiefly responsible for determining the week-by-week-propaganda policy for the United States Government.\" Cartwright also wrote that psychologists had significant roles in managing the domestic economy. The Army rolled out its new General Classification Test to assess the ability of millions of soldiers. The Army also engaged in large-scale psychological research of troop morale and mental health. In the 1950s, the Rockefeller Foundation and Ford Foundation collaborated with the Central Intelligence Agency (CIA) to fund research on psychological warfare. In 1965, public controversy called attention to the Army's Project Camelot—the \"Manhattan Project\" of social science—an effort which enlisted psychologists and anthropologists to analyze the plans and policies of foreign countries for strategic purposes.In Germany after World War I, psychology held institutional power through the military, and subsequently expanded along with the rest of the military under the Third Reich. Under the direction of Hermann Göring's cousin Matthias Göring, the Berlin Psychoanalytic Institute was renamed the Göring Institute. Freudian psychoanalysts were expelled and persecuted under the anti-Jewish policies of the Nazi Party, and all psychologists had to distance themselves from Freud and Adler, founders of psychoanalysis who were also Jewish. The Göring Institute was well-financed throughout the war with a mandate to create a \"New German Psychotherapy.\" This psychotherapy aimed to align suitable Germans with the overall goals of the Reich. As described by one physician, \"Despite the importance of analysis, spiritual guidance and the active cooperation of the patient represent the best way to overcome individual mental problems and to subordinate them to the requirements of the Volk and the Gemeinschaft.\" Psychologists were to provide Seelenführung, leadership of the mind, to integrate people into the new vision of a German community. Harald Schultz-Hencke melded psychology with the Nazi theory of biology and racial origins, criticizing psychoanalysis as a study of the weak and deformed. Johannes Heinrich Schultz, a German psychologist recognized for developing the technique of autogenic training, prominently advocated sterilization and euthanasia of men considered genetically undesirable, and devised techniques for facilitating this process.After the war, new institutions were created although some psychologists, because of their Nazi affiliation, were discredited. Alexander Mitscherlich founded a prominent applied psychoanalysis journal called Psyche. With funding from the Rockefeller Foundation, Mitscherlich established the first clinical psychosomatic medicine division at Heidelberg University. In 1970, psychology was integrated into the required studies of medical students.After the Russian Revolution, the Bolsheviks promoted psychology as a way to engineer the \"New Man\" of socialism. Consequently, university psychology departments trained large numbers of students in psychology. At the completion of training, positions were made available for those students at schools, workplaces, cultural institutions, and in the military. The Russian state emphasized pedology and the study of child development. Lev Vygotsky became a prominent in the field of child development. The Bolsheviks also promoted free love and embraced the doctrine of psychoanalysis as an antidote to sexual repression. Although pedology and intelligence testing fell out of favor in 1936, psychology maintained its privileged position as an instrument of the Soviet Union. Stalinist purges took a heavy toll and instilled a climate of fear in the profession, as elsewhere in Soviet society. Following World War II, Jewish psychologists past and present, including Lev Vygotsky, A.R. Luria, and Aron Zalkind, were denounced; Ivan Pavlov (posthumously) and Stalin himself were celebrated as heroes of Soviet psychology. Soviet academics experienced a degree of liberalization during the Khrushchev Thaw. The topics of cybernetics, linguistics, and genetics became acceptable again. The new field of engineering psychology emerged. The field involved the study of the mental aspects of complex jobs (such as pilot and cosmonaut). Interdisciplinary studies became popular and scholars such as Georgy Shchedrovitsky developed systems theory approaches to human behavior.Twentieth-century Chinese psychology originally modeled itself on U.S. psychology, with translations from American authors like William James, the establishment of university psychology departments and journals, and the establishment of groups including the Chinese Association of Psychological Testing (1930) and the Chinese Psychological Society (1937). Chinese psychologists were encouraged to focus on education and language learning. Chinese psychologists were drawn to the idea that education would enable modernization. John Dewey, who lectured to Chinese audiences between 1919 and 1921, had a significant influence on psychology in China. Chancellor T'sai Yuan-p'ei introduced him at Peking University as a greater thinker than Confucius. Kuo Zing-yang who received a PhD at the University of California, Berkeley, became President of Zhejiang University and popularized behaviorism. After the Chinese Communist Party gained control of the country, the Stalinist Soviet Union became the major influence, with Marxism–Leninism the leading social doctrine and Pavlovian conditioning the approved means of behavior change. Chinese psychologists elaborated on Lenin's model of a \"reflective\" consciousness, envisioning an \"active consciousness\" (pinyin: tzu-chueh neng-tung-li) able to transcend material conditions through hard work and ideological struggle. They developed a concept of \"recognition\" (pinyin: jen-shih) which referred the interface between individual perceptions and the socially accepted worldview; failure to correspond with party doctrine was \"incorrect recognition.\" Psychology education was centralized under the Chinese Academy of Sciences, supervised by the State Council. In 1951, the Academy created a Psychology Research Office, which in 1956 became the Institute of Psychology. Because most leading psychologists were educated in the United States, the first concern of the Academy was re-education of these psychologists in the Soviet doctrines. Child psychology and pedagogy for the purpose of a nationally cohesive education remained a central goal of the discipline.\n\n\n== Disciplinary organization ==\n\n\n=== Institutions ===\n\nIn 1920, Édouard Claparède and Pierre Bovet created a new applied psychology organization called the International Congress of Psychotechnics Applied to Vocational Guidance, later called the International Congress of Psychotechnics and then the International Association of Applied Psychology. The IAAP is considered the oldest international psychology association. Today, at least 65 international groups deal with specialized aspects of psychology. In response to male predominance in the field, female psychologists in the U.S. formed National Council of Women Psychologists in 1941. This organization became the International Council of Women Psychologists after World War II, and the International Council of Psychologists in 1959. Several associations including the Association of Black Psychologists and the Asian American Psychological Association have arisen to promote the inclusion of non-European racial groups in the profession.The International Union of Psychological Science (IUPsyS) is the world federation of national psychological societies. The IUPsyS was founded in 1951 under the auspices of  the United Nations Educational, Cultural and Scientific Organization (UNESCO}. Psychology departments have since proliferated around the world, based primarily on the Euro-American model. Since 1966, the Union has published the International Journal of Psychology. IAAP and IUPsyS agreed in 1976 each to hold a congress every four years, on a staggered basis.IUPsyS recognizes 66 national psychology associations and at least 15 others exist. The American Psychological Association is the oldest and largest. Its membership has increased from 5,000 in 1945 to 100,000 in the present day. The APA includes 54 divisions, which since 1960 have steadily proliferated to include more specialties. Some of these divisions, such as the Society for the Psychological Study of Social Issues and the American Psychology–Law Society, began as autonomous groups.The Interamerican Psychological Society, founded in 1951, aspires to promote psychology across the Western Hemisphere. It holds the Interamerican Congress of Psychology and ha had 1,000 members in year 2000. The European Federation of Professional Psychology Associations, founded in 1981, represents 30 national associations with a total of 100,000 individual members. At least 30 other international organizations represent psychologists in different regions.In some places, governments legally regulate who can provide psychological services or represent themselves as a \"psychologist.\" The APA defines a psychologist as someone with a doctoral degree in psychology.\n\n\n=== Boundaries ===\nEarly practitioners of experimental psychology distinguished themselves from parapsychology, which in the late nineteenth century enjoyed popularity (including the interest of scholars such as William James). Some people considered parapsychology to be part of \"psychology.\" Parapsychology, hypnotism, and psychism were major topics at the early International Congresses. But students of these fields were eventually ostractized, and more or less banished from the Congress in 1900–1905. Parapsychology persisted for a time at Imperial University in Japan, with publications such as Clairvoyance and Thoughtography by Tomokichi Fukurai, but here too it was mostly shunned by 1913.As a discipline, psychology has long sought to fend off accusations that it is a \"soft\" science. Philosopher of science Thomas Kuhn's 1962 critique implied psychology overall was in a pre-paradigm state, lacking agreement on the type of overarching theory found in mature sciences such as chemistry and physics. Because some areas of psychology rely on research methods such as surveys and questionnaires, critics asserted that psychology is not an objective science. Skeptics have suggested that personality, thinking, and emotion cannot be directly measured and are often inferred from subjective self-reports, which may be problematic. Experimental psychologists have devised a variety of ways to indirectly measure these elusive phenomenological entities.Divisions still exist within the field, with some psychologists more oriented towards the unique experiences of individual humans, which cannot be understood only as data points within a larger population. Critics inside and outside the field have argued that mainstream psychology has become increasingly dominated by a \"cult of empiricism,\" which limits the scope of research because investigators restrict themselves to methods derived from the physical sciences. Feminist critiques have argued that claims to scientific objectivity obscure the values and agenda of (historically) mostly male researchers. Jean Grimshaw, for example, argues that mainstream psychological research has advanced a patriarchal agenda through its efforts to control behavior.\n\n\n== Major schools of thought ==\n\n\n=== Biological ===\n\nPsychologists generally consider biology the substrate of thought and feeling, and therefore an important area of study. Behaviorial neuroscience, also known as biological psychology, involves the application of biological principles to the study of physiological and genetic mechanisms underlying behavior in humans and other animals. The allied field of comparative psychology is the scientific study of the behavior and mental processes of non-human animals. A leading question in behavioral neuroscience has been whether and how mental functions are localized in the brain. From Phineas Gage to H.M. and Clive Wearing, individual people with mental deficits traceable to physical brain damage have inspired new discoveries in this area. Modern behavioral neuroscience could be said to originate in the 1870s, when in France Paul Broca traced production of speech to the left frontal gyrus, thereby also demonstrating hemispheric lateralization of brain function. Soon after, Carl Wernicke identified a related area necessary for the understanding of speech.The contemporary field of behavioral neuroscience focuses on the physical basis of behavior. Behaviorial neuroscientists use animal models, often relying on rats, to study the neural, genetic, and cellular mechanisms that underlie behaviors involved in learning, memory, and fear responses. Cognitive neuroscientists, by using neural imaging tools, investigate the neural correlates of psychological processes in humans. Neuropsychologists conduct psychological assessments to determine how an individual's behavior and cognition are related to the brain. The biopsychosocial model  is a cross-disciplinary, holistic model that concerns the ways in which interrelationships of biological, psychological, and socio-environmental factors affect health and behavior. Evolutionary psychology approaches thought and behavior from a modern evolutionary perspective. This perspective suggests that psychological adaptations evolved to solve recurrent problems in human ancestral environments. Evolutionary psychologists attempt to find out how human psychological traits are evolved adaptations, the results of natural selection or sexual selection over the course of human evolution.The history of the biological foundations of psychology includes evidence of racism. The idea of white supremacy and indeed the modern concept of race itself arose during the process of world conquest by Europeans. Carl von Linnaeus's four-fold classification of humans classifies Europeans as intelligent and severe, Americans as contented and free, Asians as ritualistic, and Africans as lazy and capricious. Race was also used to justify the construction of socially specific mental disorders such as drapetomania and dysaesthesia aethiopica—the behavior of uncooperative African slaves. After the creation of experimental psychology, \"ethnical psychology\" emerged as a subdiscipline, based on the assumption that studying primitive races would provide an important link between animal behavior and the psychology of more evolved humans.\n\n\n=== Behavioral ===\n\nA tenet of behavioral research is that a large part of both human and lower-animal behavior is learned. A principle associated with behavioral research is that the mechanisms involved in learning apply to humans and non-human animals. Behavioral researchers have developed a treatment known as behavior modification, which is used to help individuals replace undesirable behaviors with desirable ones.\n\nEarly behavioral researchers studied stimulus–response pairings, now known as classical conditioning. They demonstrated that when a biologically potent stimulus (e.g., food that elicits salivation) is paired with a previously neutral stimulus (e.g., a bell) over several learning trials, the neutral stimulus by itself can come to elicit the response the biologically potent stimulus elicits. Ivan Pavlov—known best for inducing dogs to salivate in the presence of a stimulus previously linked with food—became a leading figure in the Soviet Union and inspired followers to use his methods on humans. In the United States, Edward Lee Thorndike initiated \"connectionist\" studies by trapping animals in \"puzzle boxes\" and rewarding them for escaping. Thorndike wrote in 1911: \"There can be no moral warrant for studying man's nature unless the study will enable us to control his acts.\" From 1910–1913 the American Psychological Association went through a sea change of opinion, away from mentalism and towards \"behavioralism.\" In 1913 John B. Watson coined the term behaviorism for this school of thought. Watson's famous Little Albert experiment in 1920 was at first thought to demonstrate that repeated use of upsetting loud noises could instill phobias (aversions to other stimuli) in an infant human, although such a conclusion was likely an exaggeration. Karl Lashley, a close collaborator with Watson, examined biological manifestations of learning in the brain.Embraced and extended by Clark L. Hull, Edwin Guthrie, and others, behaviorism became a widely used research paradigm. A new method of \"instrumental\" or \"operant\" conditioning added the concepts of reinforcement and punishment to the model of behavior change. Radical behaviorists avoided discussing the inner workings of the mind, especially the unconscious mind, which they considered impossible to assess scientifically. Operant conditioning was first described by Miller and Kanorski and popularized in the U.S. by B.F. Skinner, who emerged as a leading intellectual of the behaviorist movement.Noam Chomsky delivered an influential critique of radical behaviorism on the grounds that it could not adequately explain the complex mental process of language acquisition. Martin Seligman and colleagues discovered that the conditioning of dogs led to outcomes (\"learned helplessness\") that opposed the predictions of behaviorism. Skinner's behaviorism did not die, perhaps in part because it generated successful practical applications. Edward C. Tolman advanced a hybrid \"cognitive behavioral\" model, most notably with his 1948 publication discussing the cognitive maps used by rats to guess at the location of food at the end of a modified maze.The Association for Behavior Analysis International was founded in 1974 and by 2003 had members from 42 countries. The field has been especially influential in Latin America, where it has a regional organization known as ALAMOC: La Asociación Latinoamericana de Análisis y Modificación del Comportamiento. Behaviorism also gained a strong foothold in Japan, where it gave rise to the Japanese Society of Animal Psychology (1933), the Japanese Association of Special Education (1963), the Japanese Society of Biofeedback Research (1973), the Japanese Association for Behavior Therapy (1976), the Japanese Association for Behavior Analysis (1979), and the Japanese Association for Behavioral Science Research (1994). Today the field of behaviorism is also commonly referred to as behavior modification or behavior analysis.\n\n\n=== Cognitive ===\n\nCognitive psychology studies cognition, the mental processes underlying mental activity. Perception, attention, reasoning, thinking, problem solving, memory, learning, language, and emotion are areas of research. Classical cognitive psychology is associated with a school of thought known as cognitivism, whose adherents argue for an information processing model of mental function, informed by functionalism and experimental psychology.\n\nStarting in the 1950s, the experimental techniques developed by Wundt, James, Ebbinghaus, and others re-emerged as experimental psychology became increasingly cognitivist—concerned with information and its processing—and, eventually, constituted a part of the wider cognitive science. Some called this development the cognitive revolution because it rejected the anti-mentalist dogma of behaviorism as well as the strictures of psychoanalysis.Social learning theorists, such as Albert Bandura, argued that the child's environment could make contributions of its own to the behaviors of an observant subject.\n\nTechnological advances also renewed interest in mental states and representations. English neuroscientist Charles Sherrington and Canadian psychologist Donald O. Hebb used experimental methods to link psychological phenomena with the structure and function of the brain. The rise of computer science, cybernetics and artificial intelligence suggested the value of comparatively studying information processing in humans and machines. Research in cognition had proven practical since World War II, when it aided in the understanding of weapons operation.A popular and representative topic in this area is cognitive bias, or irrational thought. Psychologists (and economists) have classified and described a sizeable catalogue of biases which recur frequently in human thought. The availability heuristic, for example, is the tendency to overestimate the importance of something which happens to come readily to mind.Elements of behaviorism and cognitive psychology were synthesized to form cognitive behavioral therapy, a form of psychotherapy modified from techniques developed by American psychologist Albert Ellis and American psychiatrist Aaron T. Beck.\nOn a broader level, cognitive science is an interdisciplinary enterprise of cognitive psychologists, cognitive neuroscientists, researchers in artificial intelligence, linguists, human–computer interaction, computational neuroscience, logicians and social scientists. The discipline of cognitive science covers cognitive psychology as well as philosophy of mind, computer science, and neuroscience. Computer simulations are sometimes used to model phenomena of interest.\n\n\n=== Social ===\n\nSocial psychology is the study of how humans think about each other and how they relate to each other. Social psychologists study such topics as the influence of others on an individual's behavior (e.g. conformity, persuasion), and the formation of beliefs, attitudes, and stereotypes about other people. Social cognition fuses elements of social and cognitive psychology in order to understand how people process, remember, or distort social information. The study of group dynamics reveals information about the nature and potential optimization of leadership, communication, and other phenomena that emerge at least at the microsocial level. In recent years, many social psychologists have become increasingly interested in implicit measures, mediational models, and the interaction of both person and social variables in accounting for behavior. The study of human society is therefore a potentially valuable source of information about the causes of psychiatric disorder. Some sociological concepts applied to psychiatric disorders are the social role, sick role, social class, life event, culture, migration, social, and total institution.\n\n\n=== Psychoanalytic ===\n\nPsychoanalysis comprises a method of investigating the mind and interpreting experience; a systematized set of theories about human behavior; and a form of psychotherapy to treat psychological or emotional distress, especially conflict originating in the unconscious mind. This school of thought originated in the 1890s with Austrian medical doctors including Josef Breuer (physician), Alfred Adler (physician), Otto Rank (psychoanalyst), and most prominently Sigmund Freud (neurologist). Freud's psychoanalytic theory was largely based on interpretive methods, introspection and clinical observations. It became very well known, largely because it tackled subjects such as sexuality, repression, and the unconscious. These subjects were largely taboo at the time, and Freud provided a catalyst for their open discussion in polite society. Clinically, Freud helped to pioneer the method of free association and a therapeutic interest in dream interpretation.Swiss psychiatrist Carl Jung, influenced by Freud, elaborated a theory of the collective unconscious—a primordial force present in all humans, featuring archetypes which exerted a profound influence on the mind. Jung's competing vision formed the basis for analytical psychology, which later led to the archetypal and process-oriented schools. Other well-known psychoanalytic scholars of the mid-20th century include Erik Erikson, Melanie Klein, D.W. Winnicott, Karen Horney, Erich Fromm, John Bowlby, and Sigmund Freud's daughter, Anna Freud. Throughout the 20th century, psychoanalysis evolved into diverse schools of thought which could be called Neo-Freudian. Among these schools are ego psychology, object relations, and interpersonal, Lacanian, and relational psychoanalysis.Psychologists such as Hans Eysenck and philosophers including Karl Popper criticized psychoanalysis. Popper argued that psychoanalysis had been misrepresented as a scientific discipline, whereas Eysenck said that psychoanalytic tenets had been contradicted by experimental data. By the end of 20th century, psychology departments in American universities mostly marginalized Freudian theory, dismissing it as a \"desiccated and dead\" historical artifact. However, researchers in the emerging field of neuro-psychoanalysis today defend some of Freud's ideas on scientific grounds, while scholars of the humanities maintain that Freud was not a \"scientist at all, but ... an interpreter\".\n\n\n=== Existential-humanistic theories ===\n\nHumanistic psychology developed in the 1950s as a movement within academic psychology, in reaction to both behaviorism and psychoanalysis. The humanistic approach sought to glimpse the whole person, not just fragmented parts of the personality or isolated cognitions. Humanism focused on uniquely human issues, such as free will, personal growth, self-actualization, self-identity, death, aloneness, freedom, and meaning. It emphasized subjective meaning, rejection of determinism, and concern for positive growth rather than pathology. Some founders of the humanistic school of thought were American psychologists Abraham Maslow, who formulated a hierarchy of human needs, and Carl Rogers, who created and developed client-centered therapy. Later, positive psychology opened up humanistic themes to scientific modes of exploration.\nThe American Association for Humanistic Psychology, formed in 1963, declared:\n\nHumanistic psychology is primarily an orientation toward the whole of psychology rather than a distinct area or school. It stands for respect for the worth of persons, respect for differences of approach, open-mindedness as to acceptable methods, and interest in exploration of new aspects of human behavior. As a \"third force\" in contemporary psychology, it is concerned with topics having little place in existing theories and systems: e.g., love, creativity, self, growth, organism, basic need-gratification, self-actualization, higher values, being, becoming, spontaneity, play, humor, affection, naturalness, warmth, ego-transcendence, objectivity, autonomy, responsibility, meaning, fair-play, transcendental experience, peak experience, courage, and related concepts.\nIn the 1950s and 1960s, influenced by philosophers Søren Kierkegaard and Martin Heidegger, psychoanalytically trained American psychologist Rollo May pioneered an existential branch of psychology, which included existential psychotherapy: a method based on the belief that inner conflict within a person is due to that individual's confrontation with the givens of existence. Swiss psychoanalyst Ludwig Binswanger and American psychologist George Kelly may also be said to belong to the existential school. Existential psychologists differed from more \"humanistic\" psychologists in their relatively neutral view of human nature and their relatively positive assessment of anxiety. Existential psychologists emphasized the humanistic themes of death, free will, and meaning, suggesting that meaning can be shaped by myths, or narrative patterns, and that it can be encouraged by an acceptance of the free will requisite to an authentic, albeit often anxious, regard for death and other future prospects.\nAustrian existential psychiatrist and Holocaust survivor Viktor Frankl drew evidence of meaning's therapeutic power from reflections garnered from his own internment. He created a variation of existential psychotherapy called logotherapy, a type of existentialist analysis that focuses on a will to meaning (in one's life), as opposed to Adler's Nietzschean doctrine of will to power or Freud's will to pleasure.\n\n\n== Themes ==\n\n\n=== Personality ===\n\nPersonality psychology is concerned with enduring patterns of behavior, thought, and emotion—commonly referred to as personality—in individuals. Theories of personality vary across different psychological schools and orientations. They carry different assumptions about such issues as the role of the unconscious and the importance of childhood experience. According to Freud, personality is based on the dynamic interactions of the id, ego, and super-ego. In order to develop a taxonomy of personality constructs, trait theorists, in contrast, attempt to describe the personality sphere in terms of a discrete number of key traits using the statistical data-reduction method of factor analysis. Although the number of proposed traits has varied widely, an early biologically-based model proposed by Hans Eysenck, the 3rd mostly highly cited psychologist of the 20th Century (after Freud, and Piaget respectively), suggested that at least three major trait constructs are necessary to describe human personality structure: extraversion–introversion, neuroticism-stability, and psychoticism-normality. Raymond Cattell, the 7th most highly cited psychologist of the 20th Century (based on the scientific peer-reviewed journal literature) empirically derived a theory of 16 personality factors at the primary-factor level, and up to 8 broader second-stratum factors (at the Eysenckian level of analysis), rather than the \"Big Five\" dimensions. Dimensional models of personality are receiving increasing support, and a version of dimensional assessment has been included in the DSM-V. However, despite a plethora of research into the various versions of the \"Big Five\" personality dimensions, it appears necessary to move on from static conceptualizations of personality structure to a more dynamic orientation, whereby it is acknowledged that personality constructs are subject to learning and change across the lifespan.An early example of personality assessment was the Woodworth Personal Data Sheet, constructed during World War I. The popular, although psychometrically inadequate Myers–Briggs Type Indicator sought to assess individuals' \"personality types\" according to the personality theories of Carl Jung. Behaviorist resistance to introspection led to the development of the Strong Vocational Interest Blank and Minnesota Multiphasic Personality Inventory (MMPI), in an attempt to ask empirical questions that focused less on the psychodynamics of the respondent. However, the MMPI has been subjected to critical scrutiny, given that it adhered to archaic psychiatric nosology, and since it required individuals to provide subjective, introspective responses to the hundreds of items pertaining to psychopathology.\n\n\n=== Unconscious mind ===\n\nStudy of the unconscious mind, a part of the psyche outside the awareness of the individual which nevertheless influenced thoughts and behavior was a hallmark of early psychology. In one of the first psychology experiments conducted in the United States, C.S. Peirce and Joseph Jastrow found in 1884 that subjects could choose the minutely heavier of two weights even if consciously uncertain of the difference. Freud popularized this concept, with terms like Freudian slip entering popular culture, to mean an uncensored intrusion of unconscious thought into one's speech and action. His 1901 text The Psychopathology of Everyday Life catalogues hundreds of everyday events which Freud explains in terms of unconscious influence. Pierre Janet advanced the idea of a subconscious mind, which could contain autonomous mental elements unavailable to the scrutiny of the subject.Behaviorism notwithstanding, the unconscious mind has maintained its importance in psychology. Cognitive psychologists have used a \"filter\" model of attention, according to which much information processing takes place below the threshold of consciousness, and only certain processes, limited by nature and by simultaneous quantity, make their way through the filter. Copious research has shown that subconscious priming of certain ideas can covertly influence thoughts and behavior. A significant hurdle in this research is proving that a subject's conscious mind has not grasped a certain stimulus, due to the unreliability of self-reporting. For this reason, some psychologists prefer to distinguish between implicit and explicit memory. In another approach, one can also describe a subliminal stimulus as meeting an objective but not a subjective threshold.The automaticity model, which became widespread following exposition by John Bargh and others in the 1980s, describes sophisticated processes for executing goals which can be selected and performed over an extended duration without conscious awareness. Some experimental data suggests that the brain begins to consider taking actions before the mind becomes aware of them. This influence of unconscious forces on people's choices naturally bears on philosophical questions free will. John Bargh, Daniel Wegner, and Ellen Langer are some prominent contemporary psychologists who describe free will as an illusion.\n\n\n=== Motivation ===\n\nPsychologists such as William James initially used the term motivation to refer to intention, in a sense similar to the concept of will in European philosophy. With the steady rise of Darwinian and Freudian thinking, instinct also came to be seen as a primary source of motivation. According to drive theory, the forces of instinct combine into a single source of energy which exerts a constant influence. Psychoanalysis, like biology, regarded these forces as physical demands made by the organism on the nervous system. However, they believed that these forces, especially the sexual instincts, could become entangled and transmuted within the psyche. Classical psychoanalysis conceives of a struggle between the pleasure principle and the reality principle, roughly corresponding to id and ego. Later, in Beyond the Pleasure Principle, Freud introduced the concept of the death drive, a compulsion towards aggression, destruction, and psychic repetition of traumatic events. Meanwhile, behaviorist researchers used simple dichotomous models (pleasure/pain, reward/punishment) and well-established principles such as the idea that a thirsty creature will take pleasure in drinking. Clark Hull formalized the latter idea with his drive reduction model.Hunger, thirst, fear, sexual desire, and thermoregulation all seem to constitute fundamental motivations for animals. Humans also seem to exhibit a more complex set of motivations—though theoretically these could be explained as resulting from primordial instincts—including desires for belonging, self-image, self-consistency, truth, love, and control.Motivation can be modulated or manipulated in many different ways. Researchers have found that eating, for example, depends not only on the organism's fundamental need for homeostasis—an important factor causing the experience of hunger—but also on circadian rhythms, food availability, food palatability, and cost. Abstract motivations are also malleable, as evidenced by such phenomena as goal contagion: the adoption of goals, sometimes unconsciously, based on inferences about the goals of others. Vohs and Baumeister suggest that contrary to the need-desire-fulfilment cycle of animal instincts, human motivations sometimes obey a \"getting begets wanting\" rule: the more you get a reward such as self-esteem, love, drugs, or money, the more you want it. They suggest that this principle can even apply to food, drink, sex, and sleep.\n\n\n=== Development ===\n\nMainly focusing on the development of the human mind through the life span, developmental psychology seeks to understand how people come to perceive, understand, and act within the world and how these processes change as they age. This may focus on cognitive, affective, moral, social, or neural development. Researchers who study children use a number of unique research methods to make observations in natural settings or to engage them in experimental tasks. Such tasks often resemble specially designed games and activities that are both enjoyable for the child and scientifically useful, and researchers have even devised clever methods to study the mental processes of infants. In addition to studying children, developmental psychologists also study aging and processes throughout the life span, especially at other times of rapid change (such as adolescence and old age). Developmental psychologists draw on the full range of psychological theories to inform their research.\n\n\n=== Genes and environment ===\n\nAll researched psychological traits are influenced by both genes and environment, to varying degrees. These two sources of influence are often confounded in observational research of individuals or families. An example is the transmission of depression from a depressed mother to her offspring. Theory may hold that the offspring, by virtue of having a depressed mother in his or her (the offspring's) environment, is at risk for developing depression. However, risk for depression is also influenced to some extent by genes. The mother may both carry genes that contribute to her depression but will also have passed those genes on to her offspring thus increasing the offspring's risk for depression. Genes and environment in this simple transmission model are completely confounded. Experimental and quasi-experimental behavioral genetic research uses genetic methodologies to disentangle this confound and understand the nature and origins of individual differences in behavior. Traditionally this research has been conducted using twin studies and adoption studies, two designs where genetic and environmental influences can be partially un-confounded. More recently, the availability of microarray molecular genetic or genome sequencing technologies allows researchers to measure participant DNA variation directly, and test whether individual genetic variants within genes are associated with psychological traits and psychopathology through methods including genome-wide association studies. One goal of such research is similar to that in positional cloning and its success in Huntington's: once a causal gene is discovered biological research can be conducted to understand how that gene influences the phenotype. One major result of genetic association studies is the general finding that psychological traits and psychopathology, as well as complex medical diseases, are highly polygenic, where a large number (on the order of hundreds to thousands) of genetic variants, each of small effect, contribute to individual differences in the behavioral trait or propensity to the disorder. Active research continues to understand the genetic and environmental bases of behavior and their interaction.\n\n\n== Applications ==\n\nPsychology encompasses many subfields and includes different approaches to the study of mental processes and behavior:\n\n\n=== Mental testing ===\n\nPsychological testing has ancient origins, such as examinations for the Chinese civil service dating back to 2200 BC. Written exams began during the Han dynasty (202 BC – AD 200). By 1370, the Chinese system required a stratified series of tests, involving essay writing and knowledge of diverse topics. The system was ended in 1906. In Europe, mental assessment took a more physiological approach, with theories of physiognomy—judgment of character based on the face—described by Aristotle in 4th century BC Greece. Physiognomy remained current through the Enlightenment, and added the doctrine of phrenology: a study of mind and intelligence based on simple assessment of neuroanatomy.When experimental psychology came to Britain, Francis Galton was a leading practitioner, and, with his procedures for measuring reaction time and sensation, is considered an inventor of modern mental testing (also known as psychometrics). James McKeen Cattell, a student of Wundt and Galton, brought the concept to the United States, and in fact coined the term \"mental test\". In 1901, Cattell's student Clark Wissler published discouraging results, suggesting that mental testing of Columbia and Barnard students failed to predict their academic performance. In response to 1904 orders from the Minister of Public Instruction, French psychologists Alfred Binet and Théodore Simon elaborated a new test of intelligence in 1905–1911, using a range of questions diverse in their nature and difficulty. Binet and Simon introduced the concept of mental age and referred to the lowest scorers on their test as idiots. Henry H. Goddard put the Binet-Simon scale to work and introduced classifications of mental level such as imbecile and feebleminded. In 1916 (after Binet's death), Stanford professor Lewis M. Terman modified the Binet-Simon scale (renamed the Stanford–Binet scale) and introduced the intelligence quotient as a score report. From this test, Terman concluded that mental retardation \"represents the level of intelligence which is very, very common among Spanish-Indians and Mexican families of the Southwest and also among negroes. Their dullness seems to be racial.\"Following the Army Alpha and Army Beta tests for soldiers in World War I, mental testing became popular in the US, where it was soon applied to school children. The federally created National Intelligence Test was administered to 7 million children in the 1920s, and in 1926 the College Entrance Examination Board created the Scholastic Aptitude Test to standardize college admissions. The results of intelligence tests were used to argue for segregated schools and economic functions—i.e. the preferential training of Black Americans for manual labor. These practices were criticized by black intellectuals such a Horace Mann Bond and Allison Davis. Eugenicists used mental testing to justify and organize compulsory sterilization of individuals classified as mentally retarded. In the United States, tens of thousands of men and women were sterilized. Setting a precedent which has never been overturned, the U.S. Supreme Court affirmed the constitutionality of this practice in the 1907 case Buck v. Bell.Today mental testing is a routine phenomenon for people of all ages in Western societies. Modern testing aspires to criteria including standardization of procedure, consistency of results, output of an interpretable score, statistical norms describing population outcomes, and, ideally, effective prediction of behavior and life outcomes outside of testing situations.\n\n\n=== Mental health care ===\nThe provision of psychological health services is generally called clinical psychology in the U.S. The definitions of this term are various and may include school psychology and counseling psychology. Practitioners typically includes people who have graduated from doctoral programs in clinical psychology but may also include others. In Canada, the above groups usually fall within the larger category of professional psychology. In Canada and the US, practitioners get bachelor's degrees and doctorates, then spend one year in an internship and one year in postdoctoral education. In Mexico and most other Latin American and European countries, psychologists do not get bachelor's and doctorate degrees; instead, they take a three-year professional course following high school. Clinical psychology is at present the largest specialization within psychology. It includes the study and application of psychology for the purpose of understanding, preventing, and relieving psychologically based distress, dysfunction or mental illness and to promote subjective well-being and personal development. Central to its practice are psychological assessment and psychotherapy although clinical psychologists may also engage in research, teaching, consultation, forensic testimony, and program development and administration.Credit for the first psychology clinic in the United States typically goes to Lightner Witmer, who established his practice in Philadelphia in 1896. Another modern psychotherapist was Morton Prince. For the most part, in the first part of the twentieth century, most mental health care in the United States was performed by specialized medical doctors called psychiatrists. Psychology entered the field with its refinements of mental testing, which promised to improve diagnosis of mental problems. For their part, some psychiatrists became interested in using psychoanalysis and other forms of psychodynamic psychotherapy to understand and treat the mentally ill. In this type of treatment, a specially trained therapist develops a close relationship with the patient, who discusses wishes, dreams, social relationships, and other aspects of mental life. The therapist seeks to uncover repressed material and to understand why the patient creates defenses against certain thoughts and feelings. An important aspect of the therapeutic relationship is transference, in which deep unconscious feelings in a patient reorient themselves and become manifest in relation to the therapist.Psychiatric psychotherapy blurred the distinction between psychiatry and psychology, and this trend continued with the rise of community mental health facilities and behavioral therapy, a thoroughly non-psychodynamic model which used behaviorist learning theory to change the actions of patients. A key aspect of behavior therapy is empirical evaluation of the treatment's effectiveness. In the 1970s, cognitive-behavior therapy arose, using similar methods and now including the cognitive constructs which had gained popularity in theoretical psychology. A key practice in behavioral and cognitive-behavioral therapy is exposing patients to things they fear, based on the premise that their responses (fear, panic, anxiety) can be deconditioned.Mental health care today involves psychologists and social workers in increasing numbers. In 1977, National Institute of Mental Health director Bertram Brown described this shift as a source of \"intense competition and role confusion\". Graduate programs issuing doctorates in psychology (PhD or PsyD) emerged in the 1950s and underwent rapid increase through the 1980s. This degree is intended to train practitioners who might conduct scientific research.Some clinical psychologists may focus on the clinical management of patients with brain injury—this area is known as clinical neuropsychology. In many countries, clinical psychology is a regulated mental health profession. The emerging field of disaster psychology (see crisis intervention) involves professionals who respond to large-scale traumatic events.The work performed by clinical psychologists tends to be influenced by various therapeutic approaches, all of which involve a formal relationship between professional and client (usually an individual, couple, family, or small group). Typically, these approaches encourage new ways of thinking, feeling, or behaving. Four major theoretical perspectives are psychodynamic, cognitive behavioral, existential–humanistic, and systems or family therapy. There has been a growing movement to integrate the various therapeutic approaches, especially with an increased understanding of issues regarding culture, gender, spirituality, and sexual orientation. With the advent of more robust research findings regarding psychotherapy, there is evidence that most of the major therapies have equal effectiveness, with the key common element being a strong therapeutic alliance. Because of this, more training programs and psychologists are now adopting an eclectic therapeutic orientation.Diagnosis in clinical psychology usually follows the Diagnostic and Statistical Manual of Mental Disorders (DSM), a handbook first published by the American Psychiatric Association in 1952. New editions over time have increased in size and focused more on medical language. The study of mental illnesses is called abnormal psychology.\n\n\n=== Education ===\n\nEducational psychology is the study of how humans learn in educational settings, the effectiveness of educational interventions, the psychology of teaching, and the social psychology of schools as organizations. The work of child psychologists such as Lev Vygotsky, Jean Piaget, and Jerome Bruner has been influential in creating teaching methods and educational practices. Educational psychology is often included in teacher education programs in places such as North America, Australia, and New Zealand.\nSchool psychology combines principles from educational psychology and clinical psychology to understand and treat students with learning disabilities; to foster the intellectual growth of gifted students; to facilitate prosocial behaviors in adolescents; and otherwise to promote safe, supportive, and effective learning environments. School psychologists are trained in educational and behavioral assessment, intervention, prevention, and consultation, and many have extensive training in research.\n\n\n=== Work ===\n\nIndustrialists soon brought the nascent field of psychology to bear on the study of scientific management techniques for improving workplace efficiency. This field was at first called economic psychology or business psychology; later, industrial psychology, employment psychology, or psychotechnology. An important early study examined workers at Western Electric's Hawthorne plant in Cicero, Illinois from 1924–1932. With funding from the Laura Spelman Rockefeller Fund and guidance from Australian psychologist Elton Mayo, Western Electric experimented on thousands of factory workers to assess their responses to illumination, breaks, food, and wages. The researchers came to focus on workers' responses to observation itself, and the term Hawthorne effect is now used to describe the fact that people work harder when they think they're being watched.The name industrial and organizational psychology (I–O) arose in the 1960s and became enshrined as the Society for Industrial and Organizational Psychology, Division 14 of the American Psychological Association, in 1973. The goal is to optimize human potential in the workplace. Personnel psychology, a subfield of I–O psychology, applies the methods and principles of psychology in selecting and evaluating workers. I–O psychology's other subfield, organizational psychology, examines the effects of work environments and management styles on worker motivation, job satisfaction, and productivity. The majority of I–O psychologists work outside of academia, for private and public organizations and as consultants. A psychology consultant working in business today might expect to provide executives with information and ideas about their industry, their target markets, and the organization of their company.\n\n\n=== Military and intelligence ===\nOne role for psychologists in the military is to evaluate and counsel soldiers and other personnel. In the U.S., this function began during World War I, when Robert Yerkes established the School of Military Psychology at Fort Oglethorpe in Georgia, to provide psychological training for military staff military. Today, U.S Army psychology includes psychological screening, clinical psychotherapy, suicide prevention, and treatment for post-traumatic stress, as well as other aspects of health and workplace psychology such as smoking cessation.Psychologists may also work on a diverse set of campaigns known broadly as psychological warfare. Psychological warfare chiefly involves the use of propaganda to influence enemy soldiers and civilians. In the case of so-called black propaganda the propaganda is designed to seem like it originates from a different source. The CIA's MKULTRA program involved more individualized efforts at mind control, involving techniques such as hypnosis, torture, and covert involuntary administration of LSD. The U.S. military used the name Psychological Operations (PSYOP) until 2010, when these were reclassified as Military Information Support Operations (MISO), part of Information Operations (IO). Psychologists are sometimes involved in assisting the interrogation and torture of suspects, though this has sometimes been denied by those involved and sometimes opposed by others.\n\n\n=== Health, well-being, and social change ===\n\nMedical facilities increasingly employ psychologists to perform various roles. A prominent aspect of health psychology is the psychoeducation of patients: instructing them in how to follow a medical regimen. Health psychologists can also educate doctors and conduct research on patient compliance.Psychologists in the field of public health use a wide variety of interventions to influence human behavior. These range from public relations campaigns and outreach to governmental laws and policies. Psychologists study the composite influence of all these different tools in an effort to influence whole populations of people.Black American psychologists Kenneth and Mamie Clark studied the psychological impact of segregation and testified with their findings in the desegregation case Brown v. Board of Education (1954).Positive psychology is the study of factors which contribute to human happiness and well-being, focusing more on people who are currently healthy. In 2010, Clinical Psychological Review published a special issue devoted to positive psychological interventions, such as gratitude journaling and the physical expression of gratitude. Positive psychological interventions have been limited in scope, but their effects are thought to be superior to that of placebos, especially with regard to helping people with body image problems.\n\n\n== Research methods ==\n\nQuantitative psychological research lends itself to the statistical testing of hypotheses. Although the field makes abundant use of randomized and controlled experiments in laboratory settings, such research can only assess a limited range of short-term phenomena. Thus, psychologists also rely on creative statistical methods to glean knowledge from clinical trials and population data. These include the Pearson product–moment correlation coefficient, the analysis of variance, multiple linear regression, logistic regression, structural equation modeling, and hierarchical linear modeling. The measurement and operationalization of important constructs is an essential part of these research designs.\n\n\n=== Controlled experiments ===\n\nA true experiment with random allocation of subjects to conditions allows researchers to make strong inferences about causal relationships. In an experiment, the researcher alters parameters of influence, called independent variables, and measures resulting changes of interest, called dependent variables. Prototypical experimental research is conducted in a laboratory with a carefully controlled environment.\nRepeated-measures experiments are those which take place through intervention on multiple occasions. In research on the effectiveness of psychotherapy, experimenters often compare a given treatment with placebo treatments, or compare different treatments against each other. Treatment type is the independent variable. The dependent variables are outcomes, ideally assessed in several ways by different professionals. Using crossover design, researchers can further increase the strength of their results by testing both of two treatments on two groups of subjects.\nQuasi-experimental design refers especially to situations precluding random assignment to different conditions. Researchers can use common sense to consider how much the nonrandom assignment threatens the study's validity. For example, in research on the best way to affect reading achievement in the first three grades of school, school administrators may not permit educational psychologists to randomly assign children to phonics and whole language classrooms, in which case the psychologists must work with preexisting classroom assignments. Psychologists will compare the achievement of children attending phonics and whole language classes.\nExperimental researchers typically use a statistical hypothesis testing model which involves making predictions before conducting the experiment, then assessing how well the data supports the predictions. (These predictions may originate from a more abstract scientific hypothesis about how the phenomenon under study actually works.) Analysis of variance (ANOVA) statistical techniques are used to distinguish unique results of the experiment from the null hypothesis that variations result from random fluctuations in data. In psychology, the widely used standard ascribes statistical significance to results which have less than 5% probability of being explained by random variation.\n\n\n=== Other forms of statistical inference ===\nStatistical surveys are used in psychology for measuring attitudes and traits, monitoring changes in mood, checking the validity of experimental manipulations, and for other psychological topics. Most commonly, psychologists use paper-and-pencil surveys. However, surveys are also conducted over the phone or through e-mail. Web-based surveys are increasingly used to conveniently reach many subjects.\nNeuropsychological tests, such as the Wechsler scales and Wisconsin Card Sorting Test, are mostly questionnaires or simple tasks used which assess a specific type of mental function in the respondent. These can be used in experiments, as in the case of lesion experiments evaluating the results of damage to a specific part of the brain.Observational studies analyze uncontrolled data in search of correlations; multivariate statistics are typically used to interpret the more complex situation. Cross-sectional observational studies use data from a single point in time, whereas longitudinal studies are used to study trends across the life span. Longitudinal studies track the same people, and therefore detect more individual, rather than cultural, differences. However, they suffer from lack of controls and from confounding factors such as selective attrition (the bias introduced when a certain type of subject disproportionately leaves a study).\nExploratory data analysis refers to a variety of practices which researchers can use to visualize and analyze existing sets of data. In Peirce's three modes of inference, exploratory data analysis corresponds to abduction, or hypothesis formation. Meta-analysis is the technique of integrating the results from multiple studies and interpreting the statistical properties of the pooled dataset.\n\n\n=== Technological assays ===\n\nA classic and popular tool used to relate mental and neural activity is the electroencephalogram (EEG), a technique using amplified electrodes on a person's scalp to measure voltage changes in different parts of the brain. Hans Berger, the first researcher to use EEG on an unopened skull, quickly found that brains exhibit signature \"brain waves\": electric oscillations which correspond to different states of consciousness. Researchers subsequently refined statistical methods for synthesizing the electrode data, and identified unique brain wave patterns such as the delta wave observed during non-REM sleep.Newer functional neuroimaging techniques include functional magnetic resonance imaging and positron emission tomography, both of which track the flow of blood through the brain. These technologies provide more localized information about activity in the brain and create representations of the brain with widespread appeal. They also provide insight which avoids the classic problems of subjective self-reporting. It remains challenging to draw hard conclusions about where in the brain specific thoughts originate—or even how usefully such localization corresponds with reality. However, neuroimaging has delivered unmistakable results showing the existence of correlations between mind and brain. Some of these draw on a systemic neural network model rather than a localized function model.Psychiatric interventions such as transcranial magnetic stimulation and drugs also provide information about brain–mind interactions. Psychopharmacology is the study of drug-induced mental effects.\n\n\n=== Computer simulation ===\n\nComputational modeling is a tool used in mathematical psychology and cognitive psychology to simulate behavior. This method has several advantages. Since modern computers process information quickly, simulations can be run in a short time, allowing for high statistical power. Modeling also allows psychologists to visualize hypotheses about the functional organization of mental events that couldn't be directly observed in a human. Computational neuroscience uses mathematical models to simulate the brain. Another method is symbolic modeling, which represents many mental objects using variables and rules. Other types of modeling include dynamic systems and stochastic modeling.\n\n\n=== Animal studies ===\n\nAnimal experiments aid in investigating many aspects of human psychology, including perception, emotion, learning, memory, and thought, to name a few. In the 1890s, Russian physiologist Ivan Pavlov famously used dogs to demonstrate classical conditioning. Non-human primates, cats, dogs, pigeons, rats, and other rodents are often used in psychological experiments. Ideally, controlled experiments introduce only one independent variable at a time, in order to ascertain its unique effects upon dependent variables. These conditions are approximated best in laboratory settings. In contrast, human environments and genetic backgrounds vary so widely, and depend upon so many factors, that it is difficult to control important variables for human subjects. There are pitfalls in generalizing findings from animal studies to humans through animal models.Comparative psychology refers to the scientific study of the behavior and mental processes of non-human animals, especially as these relate to the phylogenetic history, adaptive significance, and development of behavior. Research in this area explores the behavior of many species, from insects to primates. It is closely related to other disciplines that study animal behavior such as ethology. Research in comparative psychology sometimes appears to shed light on human behavior, but some attempts to connect the two have been quite controversial, for example the Sociobiology of E.O. Wilson. Animal models are often used to study neural processes related to human behavior, e.g. in cognitive neuroscience.\n\n\n=== Qualitative and descriptive research ===\nResearch designed to answer questions about the current state of affairs such as the thoughts, feelings, and behaviors of individuals is known as descriptive research. Descriptive research can be qualitative or quantitative in orientation. Qualitative research is descriptive research that is focused on observing and describing events as they occur, with the goal of capturing all of the richness of everyday behavior and with the hope of discovering and understanding phenomena that might have been missed if only more cursory examinations have been made.\nQualitative psychological research methods include interviews, first-hand observation, and participant observation. Creswell (2003) identifies five main possibilities for qualitative research, including narrative, phenomenology, ethnography, case study, and grounded theory. Qualitative researchers sometimes aim to enrich interpretations or critiques of symbols, subjective experiences, or social structures. Sometimes hermeneutic and critical aims can give rise to quantitative research, as in Erich Fromm's study of Nazi voting or Stanley Milgram's studies of obedience to authority.\n\nJust as Jane Goodall studied chimpanzee social and family life by careful observation of chimpanzee behavior in the field, psychologists conduct naturalistic observation of ongoing human social, professional, and family life. Sometimes the participants are aware they are being observed, and other times the participants do not know they are being observed. Strict ethical guidelines must be followed when covert observation is being carried out.\n\n\n=== Program Evaluation ===\nProgram Evaluation is a systematic method for collecting, analyzing, and using information to answer questions about projects, policies and programs, particularly about their effectiveness and efficiency. In both the public and private sectors, stakeholders often want to know whether the programs they are funding, implementing, voting for, receiving or objecting to are producing the intended effect. While program evaluation first focuses around this definition, important considerations often include how much the program costs per participant, how the program could be improved, whether the program is worthwhile, whether there are better alternatives, if there are unintended outcomes, and whether the program goals are appropriate and useful.\n\n\n== Contemporary issues in methodology and practice ==\n\n\n=== Metascience ===\nThe field of metascience has revealed significant problems with the methodology of psychological research. Psychological research suffers from high bias, low reproducibility, and widespread misuse of statistics. These finding have led to calls for reform from within and from outside the scientific community.\n\n\n==== Confirmation bias ====\nIn 1959, statistician Theodore Sterling examined the results of psychological studies and discovered that 97% of them supported their initial hypotheses, implying a possible publication bias. Similarly, Fanelli (2010) found that 91.5% of psychiatry/psychology studies confirmed the effects they were looking for, and concluded that the odds of this happening (a positive result) was around five times higher than in fields such as space- or geosciences. Fanelli argues that this is because researchers in \"softer\" sciences have fewer constraints to their conscious and unconscious biases.\n\n\n==== Replication ====\n\nA replication crisis in psychology has emerged. Many notable findings in the field have not been replicated. Some researchers were even accused of publishing fraudulent results. Systematic efforts, including efforts by the Reproducibility Project of the Center for Open Science, to assess the extent of the problem found that as many as two-thirds of highly publicized findings in psychology failed to be replicated. Reproducibility has generally been stronger in cognitive psychology (in studies and journals) than social psychology and subfields of differential psychology. Other subfields of psychology have also been implicated in the replication crisis, including clinical psychology, developmental psychology, and a field closely related to psychology,  educational research.Focus on the replication crisis has led to other renewed efforts in the discipline to re-test important findings. In response to concerns about publication bias and p-hacking, 288 psychology and medical journals have adopted result-blind peer review where studies are accepted not on the basis of their findings and after the studies are completed, but before the studies are conducted and upon the basis of the methodological rigor of their experimental designs and the theoretical justifications for their proposed statistical analysis before data collection or analysis is conducted. In addition, large-scale collaborations among researchers working in multiple labs in different countries have taken place. The collaborators regularly make their data openly available for different researchers to assess. Allen et al. estimated that 61 percent of result-blind studies have yielded null results, in contrast to an estimated 5 to 20 percent in traditional research.\n\n\n==== Misuse of statistics ====\n\nSome critics view statistical hypothesis testing as misplaced. Psychologist and statistician Jacob Cohen wrote in 1994 that psychologists routinely confuse statistical significance with practical importance, enthusiastically reporting great certainty in unimportant facts. Some psychologists have responded with an increased use of effect size statistics, rather than sole reliance on p-values.\n\n\n=== WEIRD bias ===\n\nIn 2008, Arnett pointed out that most articles in American Psychological Association journals were about US populations when U.S. citizens are only 5% of the world's population. He complained that psychologists had no basis for assuming psychological processes to be universal and generalizing research findings to the rest of the global population. In 2010, Henrich, Heine, and Norenzayan reported a systemic bias in conducting psychology studies with participants from \"WEIRD\" (western, educated, industrialized, rich and democratic) societies. Although only 1/8 people worldwide live in regions that fall into the WEIRD classification, the researchers claimed that 60–90% of psychology studies are performed on participants from these areas. The article gave examples of results that differ significantly between people from WEIRD and tribal cultures, including the Müller-Lyer illusion. Arnett (2008), Altmaier and Hall (2008), and Morgan-Consoli et al. (2018) saw the Western bias in research and theory as a serious problem considering psychologists are increasingly applying psychological principles developed in WEIRD regions in their research, clinical work, and consultation with populations around the world. In 2018, Rad, Martingano & Ginges showed that nearly a decade after Henrich et al.'s paper, over 80% of the samples used in studies published in the journal, Psychological Science, were from the WEIRD population. Moreover, their analysis showed that several studies did not fully disclose the origin of their samples, and the authors offer a set of recommendations to editors and reviewers to reduce the WEIRD bias.From an anthropological perspective, scholars applied the WEIRD model to European history, arguing that a powerful Christian Church forced a radical change away from incest and cousin marriages that undermined the role of clans and created individualism in Europe by 1500 CE. They argue that a distinctive Western psychology thus emerged that valued agency, autonomy, and kindness towards strangers. Historians were not involved in that study, and have stated that it contains historical fallacies regarding an all-powerful Church at too early a point in time and a rejection of cousin marriage that did not happen.\n\n\n=== Unscientific mental health training ===\nSome observers perceive a gap between scientific theory and its application—in particular, the application of unsupported or unsound clinical practices. Critics say there has been an increase in the number of mental health training programs that do not instill scientific competence. Practices such as \"facilitated communication for infantile autism\"; memory-recovery techniques including body work; and other therapies, such as rebirthing and reparenting, may be dubious or even dangerous, despite their popularity. In 1984, Allen Neuringer made a similar point regarding the experimental analysis of behavior. Psychologists, sometimes divided along the lines of laboratory vs. clinic, continue to debate these issues.\n\n\n== Ethics ==\nEthical standards in the discipline have changed over time. Some famous past studies are today considered unethical and in violation of established codes (the Canadian Code of Conduct for Research Involving Humans, and the Belmont Report).\nThe most important contemporary standards are informed and voluntary consent. After World War II, the Nuremberg Code was established because of Nazi abuses of experimental subjects. Later, most countries (and scientific journals) adopted the Declaration of Helsinki. In the U.S., the National Institutes of Health established the Institutional Review Board in 1966, and in 1974 adopted the National Research Act (HR 7724). All of these measures encouraged researchers to obtain informed consent from human participants in experimental studies. A number of influential studies led to the establishment of this rule; such studies included the MIT and Fernald School radioisotope studies, the Thalidomide tragedy, the Willowbrook hepatitis study, and Stanley Milgram's studies of obedience to authority.\n\n\n=== Humans ===\nUniversity psychology departments have ethics committees dedicated to the rights and well-being of research subjects. Researchers in psychology must gain approval of their research projects before conducting any experiment to protect the interests of human participants and laboratory animals.The ethics code of the American Psychological Association originated in 1951 as \"Ethical Standards of Psychologists\". This code has guided the formation of licensing laws in most American states. It has changed multiple times over the decades since its adoption. In 1989, the APA revised its policies on advertising and referral fees to negotiate the end of an investigation by the Federal Trade Commission. The 1992 incarnation was the first to distinguish between \"aspirational\" ethical standards and \"enforceable\" ones. Members of the public have a five-year window to file ethics complaints about APA members with the APA ethics committee; members of the APA have a three-year window.Some of the ethical issues considered most important are the requirement to practice only within the area of competence, to maintain confidentiality with the patients, and to avoid sexual relations with them. Another important principle is informed consent, the idea that a patient or research subject must understand and freely choose a procedure they are undergoing. Some of the most common complaints against clinical psychologists include sexual misconduct, and involvement in child custody evaluations.\n\n\n=== Other animals ===\nCurrent ethical guidelines state that using non-human animals for scientific purposes is only acceptable when the harm (physical or psychological) done to animals is outweighed by the benefits of the research. Keeping this in mind, psychologists can use certain research techniques on animals that could not be used on humans.\n\nAn experiment by Stanley Milgram raised questions about the ethics of scientific experimentation because of the extreme emotional stress suffered by the participants. It measured the willingness of study participants to obey an authority figure who instructed them to perform acts that conflicted with their personal conscience.\nComparative psychologist Harry Harlow drew moral condemnation for isolation experiments on rhesus macaque monkeys at the University of Wisconsin–Madison in the 1970s. The aim of the research was to produce an animal model of clinical depression. Harlow also devised what he called a \"rape rack\", to which the female isolates were tied in normal monkey mating posture. In 1974, American literary critic Wayne C. Booth wrote that, \"Harry Harlow and his colleagues go on torturing their nonhuman primates decade after decade, invariably proving what we all knew in advance—that social creatures can be destroyed by destroying their social ties.\" He writes that Harlow made no mention of the criticism of the morality of his work.\n\n\n== References ==\n\n\n=== Sources ===\n\n\n== Further reading ==\nBadcock, Christopher R. (2015). \"Nature-Nurture Controversy, History of\". International Encyclopedia of the Social & Behavioral Sciences. pp. 340–344. doi:10.1016/B978-0-08-097086-8.03136-6. ISBN 978-0-08-097087-5.\nCascio, Wayne F. (2015). \"Industrial–Organizational Psychology: Science and Practice\". International Encyclopedia of the Social & Behavioral Sciences. pp. 879–884. doi:10.1016/B978-0-08-097086-8.22007-2. ISBN 978-0-08-097087-5.\nChryssochoou, Xenia (2015). \"Social Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 532–537. doi:10.1016/B978-0-08-097086-8.24095-6. ISBN 978-0-08-097087-5.\nDeakin, Nicholas (2015). \"Philosophy, Psychiatry, and Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 31–36. doi:10.1016/B978-0-08-097086-8.27049-9. ISBN 978-0-08-097087-5.\nDemetriou, Andreas (2015). \"Intelligence in Cultural, Social and Educational Context\". International Encyclopedia of the Social & Behavioral Sciences. pp. 313–322. doi:10.1016/B978-0-08-097086-8.92147-0. ISBN 978-0-08-097087-5.\nGelso, Charles J. (2015). \"Counseling Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 69–72. doi:10.1016/B978-0-08-097086-8.21073-8. ISBN 978-0-08-097087-5.\nHenley, Tracy B. (2015). \"Psychology, History of (Early Period)\". International Encyclopedia of the Social & Behavioral Sciences. pp. 406–411. doi:10.1016/B978-0-08-097086-8.03235-9. ISBN 978-0-08-097087-5.\nKnowland, Victoria C.P.; Purser, Harry; Thomas, Michael S.C. (2015). \"Cross-Sectional Methodologies in Developmental Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 354–360. doi:10.1016/B978-0-08-097086-8.23235-2. ISBN 978-0-08-097087-5.\nLouw, Dap (2015). \"Forensic Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 351–356. doi:10.1016/B978-0-08-097086-8.21074-X. ISBN 978-0-08-097087-5.\nMcWilliams, Spencer A. (2015). \"Psychology, History of (Twentieth Century)\". International Encyclopedia of the Social & Behavioral Sciences. pp. 412–417. doi:10.1016/B978-0-08-097086-8.03046-4. ISBN 978-0-08-097087-5.\nPe-Pua, Rogelia (2015). \"Indigenous Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 788–794. doi:10.1016/B978-0-08-097086-8.24067-1. ISBN 978-0-08-097087-5.\nPeterson, Roger L.; Peterson, Donald R.; Abrams, Jules C.; Stricker, George; Ducheny, Kelly (2015). \"Training in Clinical Psychology in the United States: Practitioner Model\". International Encyclopedia of the Social & Behavioral Sciences. pp. 517–523. doi:10.1016/B978-0-08-097086-8.21086-6. ISBN 978-0-08-097087-5.\nPoortinga, Ype H. (2015). \"Cross-Cultural Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 311–317. doi:10.1016/B978-0-08-097086-8.24011-7. ISBN 978-0-08-097087-5.\nSpinath, Frank M.; Spinath, Birgit; Borkenau, Peter (2015). \"Developmental Behavioral Genetics and Education\". International Encyclopedia of the Social & Behavioral Sciences. pp. 320–325. doi:10.1016/B978-0-08-097086-8.92009-9. ISBN 978-0-08-097087-5.\nSmith, Edward E. (2015). \"Cognitive Psychology: History\". International Encyclopedia of the Social & Behavioral Sciences. pp. 103–109. doi:10.1016/B978-0-08-097086-8.03028-2. ISBN 978-0-08-097087-5.\nStaerklé, Christian (2015). \"Political Psychology\". International Encyclopedia of the Social & Behavioral Sciences. pp. 427–433. doi:10.1016/B978-0-08-097086-8.24079-8. ISBN 978-0-08-097087-5.\nGelder, Mayou & Geddes (2005). Psychiatry. New York: Oxford University Press Inc.\n\n\n== External links ==\nPsychology at Curlie\nAmerican Psychological Association\nAssociation for Psychological Science", "chinese_title": "psychology ", "chinese": "Psychology (English: Psychology) is a scientific phenomenon, awareness and behavior of human and animal. It is both a theoretical discipline, also an application discipline, including two major areas of theoretical psychology and application psychology.\nPsychology research involves awareness, feeling, perception, cognition, emotion, personality, behavioral and interpersonal relationships, affecting the development of other disciplines, such as education, management, communication, sociology, economics, mental school, Statistics, and literature, etc. On the one hand, attempts to use brain operation to explain the basic behavioral and psychological function of individuals. At the same time, psychology also tries to explain the role of individual mental function in social behavior and social power. Psychologists are engaged in basic research to describe, interpret, predict, and control behavior. Applying psychologists also have the fifth objects - improving the quality of human life. These goals constitute the foundation of psychology.\nIn order to study the behavior of human beings, early psychologists will speculate on the environment, physiology (such as: brain damage, causing dopamine, etc.) and some particular factors.\nBut this experimental method has always been discussed and controversial. However, with the advancement of science and technology, people use nuclear magnetic resonance, tomography, and develop more mature questionnaires to study human psychology. Sometimes patients with partial injuries, psychologists also understand why the function of each part of the head is observed by observing the brain activities of these people.\n\n\n== word source ==\nThe word \"psychology\" (psychology) in the Sen language is composed of Greek Stem, \"Soul\" (ψυή) and \"Research\" (όγος), earliest by Croatia's poet Mark Maroliqi.\n\"Psychology\" translational sources, through historical and psychology related research, prove with China Ming Dynasty, Song Agency, and Song Ming Confucian Tudo, Japan.\nIn 1890, William James defined psychology as \"science, including psychological phenomena and psychological state\". This definition has been widely circulated for decades. However, this meaning has been questioned by some of the radical lines, especially John .b. Watson and other efforts. Watson defines psychology as information useful for control behavior in the 1913 declaration. Similarly, since James defined it, this word stronger implies the technology of scientific experiments.\n\n\n== History ==\n\n\n=== Original ===\n\nEarly psychological research is a scope of philosophy, called philosophical psychology. The study of philosophical psychology can be traced back to ancient civilizations such as Egypt, Greece, India and Huaxia. The ancient China believes that people's sexual ideas are borne by certain organs, and their events will reflect in the organs, such as \"the officials of the heart\" (\"Mencius\"), \"people are in the brain\", \"Head of God\" The residence of \"Spring and Autumn Fortune\"). \"God-shaped\", \"shaped\" and other ideas have many elaborates in the \"Yellow Emperor's Internal Classics\". There are many examples involving medical psychology. Plato's philosophy of binary coexistence, some people think that Aristotle's \"The Soul\" is the work of the earliest discovery of psychology. Through long-lasting evolution, slowly produce a wide variety of disciplines, including the psychology of people's understanding.\nPhilosophical psychology is mainly four major issues that explore mental relationships, natural and educational, free will and decisions, and sources of knowledge. Its early theory has a dollar, binaryism, environmental decisions, spiritual decisions, etc. Modern philosophical psychology is three major ideological geography, including rationalism, empirical and romanticism. As the German psychologist Abinhaos said: \"Psychology has a long past, but only has a short history.\"\nIn the medieval Islamics and psychology, clinical psychotrophic treatment and experimental study have begun.\n\n\n=== Scientific psychology ===\n\nAlthough psychology experiments can be traced back to Arab scholars' book \"Optics\" (1021) However, Psychology as an independent discipline began in 1874, that year, German physiologist William Fengter Publishing two books - \"Principles of Physiology Psychology -, in the preamble:\" To establish a new scientific field \"; Fengter is also called\" psychology The father of learning. In 1875, Leipzi University hired Vonte for professor; in 1879, he established the world's first specialized psychological laboratory at Leipzig University, attracting students from all over the world. After more than 10 years, it is in the 1890s, and the university winds of the United States will explore this move, establish a dozens of psychology laboratories, especially in 1892, 20, this year is also the establishment of the American Psychology. It is usually the time for the birth of scientific psychology in 1874. This time is late for many natural sciences from philosophy to form an independent discipline. Fengter is also the first person to call himself as a psychologist. Other early and important psychologists include Ai Binhaos. At the end of the 19th century, the psychoanalysis of Sigmund Freud was built in the beginning of the 20th century.\n\n\n=== Constructor ===\nGerman psychologist William Vind is considered to be a person who introduces experiments into psychology research, known as \"the father of experimental psychology.\" In 1879, he established the first psychology laboratory at Leipzig University. Fengter focused on the elemental decomposition of psychological decomposition, due to the advancement of chemistry, the latter made breakthroughs in analyzing substance elements and structures. Although Fengter himself is not a constructist, his student Edward B · Tienna became the thinker of constructor, opposite the functionalist. Tienna is an important person of American early psychologists.\n\n\n=== Functionism ===\n\nFunctionism is born relative to structuralism, and is affected by American philosophers, scientists, psychologists William James. James believes that psychology should have practical value, and psychologists should find a scientific way beneficial to people. His book \"Psychology Principles\" were published in 1890, including many pavement problems, providing a direction for follow-up scientists. Other major functionists include John Dewey and Harvey Carl.\n\nOther 19th century outstanding characters have German psychologists Herman Abinhaus, he is a pioneer of studying memory experiments, founding a quantitative model of learning and forgotten in Berlin Humbolda University. Soviet Psychologist Ivan Petrovich Bavov, who found \"classical restriction\" when experimenting with dogs and applied its application with humans. Since the 1950s, Fengter, James, Ai Binhaus developed more experimental technical directions to the experimental technical direction of experimental psychologists more trend to study cognition - paying attention information and information processing - the ultimate evolution is cognitive Part of the science. Earlier, this is considered \"revolutionary\" development\n\n\n=== Spiritual analysis ===\n\nAustrian doctor Sigmund Freud began researching spiritual analysis since the 1990s until he died in 1939. Psychoanalysis is a method of research awareness, explaining experience; it is a theoretical system for human behavior; it is a method for psychological, emotional treatment, especially for psychotherapy for subconscious conflicts. Many theories in the spiritual analysis of Freud are based on interpretation, and within and odds and clinical observations. The mental analysis is widely circulated, because its research object involves the subconsciousness of gender, depression, and psychological development. These issues were listed as a social taboo at the time, and Freud provided catalyst, making problems can be discussed in formal socialization. Clinically, Freud is the pioneer of freelance associations, and he is also studying in the treatment of dreams. Freud's influence on the Swiss psychiatric physician Carl Jerge, the latter analysis psychology and depth psychology complementary. In the 20th century, leaf psychologists studied mental analysis, psychology, mental illness treatment, and philosophy. These famous scholars include Aik Ericson, Merlanti Klein, Donald Venec, Carren, Erich From, John Bobby, and Flow Eider's daughter Anna Freud. In the past 20 century, mental analysis derived different branch schools, many of them were divided into new Freud school. Psychoanalysis and its treatment are criticized by many people, such as Hans Eisenke, and philosophers Carl Popper. Popper is a scientific philosopher who believes that mental analysis is wrong as science, and Eisenke said that the principle of mental analysis does not match the experimental data. By the end of the twentieth century, the Psychology College of American Colleges and Universities became more inclined to emphasized, and the theory of Freud was marginalized and claimed to \"dry the old death\" history. At the same time, researchers maintain Freud's scientific positions in the nervegic analysis, and other human literary scientificers are solid Freud, but they are not scientists, but a ... interpreter. \"\n\n\n=== behavioralism ===\n\nIn the past 20th century, the behavioralism dominated the psychology at the time, and its advocacy is: \"Seeking understanding of specific environmental stimuli how to control specific types of behavior.\" It advocates that psychology should analyze the environmental conditions of the first line, that is, before behavior, and for a body to generate a reaction or inhibit the reaction to provide activity places. Therefore, they should refer to behavior as a body understanding, predicting, and control, and thus make corresponding results. Based on strict control and emphasis on experimental and variables, behavioralism has an important impact on later psychology research. Its representative figures are Shi Jinner, but its inherent cognitive process is to save, in the near future, the popular cognitive approach is to pay attention to the internal cognitive process of the previous neglected, representing the characters, there is a Piajie, Miller, Simon, etc.\nToday, the world's main psychological schools have five views, each of which emphasizes the different aspects of behavior and psychological process. It mainly includes neuropsychology, mental analysis, behavioral psychology, humanistic psychology, cognitive psychology.\n\n\n=== Humanism ===\n\nIn the 1950s, under the influence of behavioralism and mental analysis, humanistic psychology was born. Applying phenomenology, interactive subjectivity, first person's perspective, humanism attempt to capture the whole person - rather than personality or cognition. Humanistic psychology focuses on the foundation of human unique issues, such as personal freedom, growth, self-realization, identity, death, loneliness, freedom and significance. The human process is characterized in that it is focused on subjective expensive, refuses fate, and focusing on the enthusiasm of growth rather than pathological factors. Some people's founders, such as American psychologists Abraham Maslow, founded the theory of the needs of the needs; Carl Roshez created a personal center treatment. After that, positive psychology analyzes humanism and further scientific analysis.\n\n\n=== Format Tower - Delicate ===\n\nWolfgang Crust, Marcos Weto, and Côte d'Ivo Kufka jointly founded a complete psychological school. This psychological study is established in the individual experience as a whole. The molecular structure of the corresponding substance is produced in the early 19th century in Germany, Austria. Decomposed psychology did not decompose thinking, behavior into a small element, but insisted on the importance of experience as a whole, and considered that the overall difference was different from partially added.\nContact psychology should be confused with the treatment of Fritz Pols's format tower, the latter only associated with the completed psychology on the appearance.\n\n\n=== Existism ===\n\nIn the 1950s and 1960s, the American original analystist Roculo Mei was in the influence of German philosopher Martin Heideg, Danish philosopher Soren Obe Kerka, Learn the path of learning. This includes psychotherapy.\nThere is different from other people's school, namely human neutral perspectives, and anxiety positive perspectives. There is a humanistic psychology focus on humanistic theme, such as death, freedom will, meaning, and believes that the meaning can be changed, or a way of writing. People usually encourage people to accept freedom, despite anxiety.\nAustrian existential psychiatrist, the massacre survivors Victor Frank learned from concentration camp, summarizing different versions of the presence of presence, focusing on existenceism, different powerful power of Nietzsche in Adler Or Freud's happiness. Swiss Psycho Analysis Lutidi Bins Wange, American Psychologist George Alexander Kelly and Mi (May), Frankl, is also considered to be a scholar.\n\n\n=== Cognitiveism ===\n\nCognitive psychology research psychological activities, including solving problems, perception, memory, learning, etc. As part of cognitive science, this psychological branch is closely related to other disciplines, including neuroscience, philosophy, linguistics.\nNomi Jumsky triggered a psychological \"Cognitive Revolution\" when the \"stimulation\", \"corresponding\" and \"strengthen\" in criticism behavior concept. Jumsky's debate is applied to complex human behavior in a superficial manner, especially in the field of language acquisition. There is a hypothesis that human nun has a \"inner\" language acquisition function, but for behavioralism, this problem is all behaviors, including language, must be obtained by learning and strengthening. Social learning theorists, such as Alport Ban Dula, the child's living environment helps behavior improvement.\n\nAt the same time, technological progress helps people regain psychological activities and expressions, such as cognition, etc. British Neuroscience Charles Scott Sun Lington and Canadian Psychologist Donald Herb application experiments summarize the link between psychological phenomena and human brain structure and function. The rise of computer science and artificial intelligence makes human information processing to mutually comparison with mechanical information processing. Research on cognition is applied to World War II for understanding weapons operation. In the late twentieth century, cognitiveism became a unified fancy style of psychology, and cognitive psychology became popular branches.\nCognitive psychology believes that concealment of psychological activities should be studied in a scientific way, and psychologists have found two concepts: the threshold stimuli and the inheritance memory, the subconsciousness of the corresponding mental analysis or the accidental formation behavior of behavior. Behaviser elements and cognitive psychology are integrated into a foundation for cognitive behavioral therapies. This psychotherapy is created by American psychologists Albert Ellis and psychiatrist Aaron T · Baker. Cognitive Psychology and Other Disciplines, such as mental philosophy, computer science, neuroscience, and a cognitive science that is classified.\n\n\n== Branch ==\n\n\n=== Biology ===\n\nBiological psychology or behavioral neuroscience from bio-angle research behavior and psychological process. There are different professional branches in biological psychology. For example, physiological psychology uses animal models, especially mice, to study nerve, gene, and cellular functions in learning, memory, fear. Cognitive neuroscientists use neur imaging tools to study the relationship between nerve and human psychological activities, neuropsyter use psychological evaluation Scientific research, such as large brain damage, the degree of cognitive deletions and performance forms.\n\n\n=== Clinical ===\n\nThe research and application of clinical psychology includes understanding, prevention, relieving psychological pain and disorders, promoting mental health and personal growth. Although clinical psychologists also participate in research, teaching, consultation, court testification, procedures and management, but the center of the branch is psychological assessment and treatment. Some clinical psychologists will focus on clinical monitoring of patients with brain injury, and this area is called clinical neuropsychology. In many countries, clinical psychology is subject to regular mental health.\nThe efforts of clinical psychologists have been affected by many treatment programs, all programs include professional relationships between professionals and patients (usually personal, couple, family, or small groups). Different therapeutic practices are associated with different theoretical perspectives, using different processes to establish a combination of treatment, explore psychological causes, encourage new methods to think, feel, and action. The four major theoretical views include mental power treatment, cognitive behavioral treatment, presence - humanistic treatment and system / home treatment. At present, there is a trend that some psychologists are working hard to integrate various treatment factions, especially in the absence of cultural, gender, spirit, and sexual orientation, this trend is more significant. Under the rich research results, there is evidence that the effects of the major treatment factions tend to equally, and share the same infrastructure, and can form a powerful psychotherapy combination. Because of this, more psychological training courses have adopted a compromise trend.\n\n\n=== Cognition ===\n\nCognitive Cognition of Psychological Studies. Perception, pay attention, reason, reason, thinking, solving, memory, learning, language, and emotions are in its research field. Classical cognitive psychology and cognitive schools have interrelated, depending on functionalism and experimental psychology, cognitiveism support psychological information processing model.\nAt the more wide-area level, cognitive science is a cross-discipline, including cognitive psychology, cognitive neuroscience, artificial intelligence, linguistics, human-machine interaction, calculation of neuroscience, and human logic and anthropology. Computers are often used to simulate such experimentation. Computer simulation provides tools for studying the functional organization of thinking, and the nervous system has provided a degree of scale.\n\n\n=== Compare ===\n\nComparative psychology refers to the scientific research of non-human animals, especially those related to system development history, adaptation value, and behavioral development. Research on this area discusses many problems, using many different ways, explores the behavior of different species, from insect to primate. Comparative psychology and other disciplines studying animal behavior, such as animal behavior has a close relationship. Comparative psychology research sometimes brought to human behavior research, but sometimes the association is very contradictory, such as the sociology proposed by Edward Wilson. Animal model is often used to study the nerve treatment related to human behavior, such as an animal model in cognitive neuroscience.\n\n\n=== Development ===\n\nDevelop psychology focuses on the development process of human will in life, trying to understand how people consciously, understand, and action in the world, and study how these phenomena changed as age. These research may focus on cognition, emotion, morality, social, and nerve development. Researchers use a range of special ways to explore children's cases to make observations in natural environments, or simply interact with them in their experiments. These experiments are often present in a game or an activity, both fun, and scientific significance; researchers even designed a very dexterous way to study the psychological activities of baby. In addition to studying children's psychology, developing psychologists also study the age of human life, especially in certain time periods (such as teens and elderly). Develop psychologists designed a complete set of psychology theories to support their research.\n\n\n=== Education ===\n\nEducational Psychology is to study the learning, efficiency, teaching psychology and schools in the process of education as a social psychology as an organization. Children's psychologists, such as Livi Vigoski, let the Piam, Jerome Brun, Bernard Luskins, etc. have an important impact on professors and teaching practice. . In many countries, educational psychology is a compulsory course for teachers.\nSchool psychology combines educational psychology and clinical psychology, trying to understand, students who have learning obstacles; cultivate high-end students; promote adolescence progenitors; or promote safety, mutual assistance, and efficient education environments. School psychologists are in many fields, such as educational behavior assessments, interventions, prevention, consultation, etc. have been well received, and some are quite accommodation in the research field.\n\n\n=== Evolution ===\n\nEvolutionary psychology from modern evolutionary perspectives to study psychological characteristics - such as memory, perception, language, etc. It tries to explore what human psychological features are adapted to evolution, that is, as a functional product for natural selection and sexual selection. The evolutionary psychologist believes that in the environment of human ancestors, the evolution of psychological adaptation solves the problem of periodicity. Through the evolution of psychological traits and their adaptability, evolutionary psychology provides the most approximate developmental interpretation in other psychology (that is, the evolutionary psychology is the ultimate problem, or \"why\", not approximate, or Ask \"how\").\n\n\n=== Industrial - organization ===\n\nIndustrial and Organization Psychology (I-O) Applying Psychology Concepts and Methods Optimizing Workplace 's Human Potential. As the branch of I-O, the psychological principle and method of personnel psychology were screened and evaluated to employees. Another Branch of I-O Tissue Psychological Studies Working Environment and Management Style on the Effect of Positive Positiveness, Achievement and Productivity.\n\n\n=== Person ===\n\nPersonality psychology focuses on personal continuity, ideas, emotions - these are called personality. Personality theory is different because of the different schools, and they have different assumptions on the role of latent sings and the importance of the experience. According to Freud, the personality is based on the interaction between this, self and super, this is the so-called spiritual analysis school. In contrast, the characteristic theory tried to use discrete statistics to conduct research, and the species species proposed also had a thousand autumn. Early Hans Eisenk model proposes a personality consisting of three basic characteristics: exquisite and introvert, neurotic, and spiritual. Raymond Carter proposed 16 personality features. Today, the personality dimension model has received more and more attention, such as the DSM-V model. At present, it is currently a social cognitive school. In fact, it is initially called social learning theory. It is an extension from the behavior school: the shape of the personality is the behavior of people and people's interaction, and then the American psychologist Ban Dura The theory of the behavior school is more expanded, joining the intrinsic activity - cognitive ingredients, forming a social cognitive theory.\n\n\n=== Social ===\n\nSocial psychology research the views between humans and how they produce contacts, and social psychologists include the impact of others on individual behavior (for example: in the establishment, attitude, or bigger level of beliefs. Say, not only the interaction between people, and there are also interactions with a group, as the establishment and strengthening of the stereotype, will cause discrimination behavior, is an example of a classic example. Social Cognition will link with the elements of cognitive psychology and sociology, try to understand how people handle, memories, and distort society. Population Dynamics Research reveals the essence of leadership, exchanges and other microscopic levels and its optimization potential. In recent years, many social psychologists have interested in the imaginative attitude, median model, individual and social value interaction. Therefore, research on human society can be found to lead to psychological disorders. Some sociological concepts applied to psychological disorders include social roles, patient characters, class, life events, culture, migration, etc.\n\n\n=== forward psychology ===\n\nIt is derived from Maslow's humanistic psychology to psychology. The experimental scientific technique is used to study the happiness and strength of human beings. Unlike traditional clinical psychology, psychology pays attention to health care. At present, the intervention of psychology has obtained some experimental affirmation. A special issue is published in the \"Clinical Psychological Review\" in 2010, which is reported to use some of the intervention methods of characteristic strength in psychology, such as the three weeks. Good things and physical forms of thanksgiving expressions (such as: hug, etc.) that helps life satisfaction. In addition, the Mindfulness-Based Stress Reduction, MBSR is also proven to be an effective method for treating depression. However, further research is required for the effects of intervention. Positive intervention is still limited, but their effect is considered higher than placebo, especially for physical image lack of people with a better effect.\n\n\n== Research method ==\nPsychological research tends to computers, ie knowledge of knowledge from other areas to help understand, explain psychological phenomena. In addition, psychologists use a large number of three-section of Charles Sanders Pierce: interpretation, induction, tracing. Due to the common use of the interpretation of natural laws, psychologists will also rely on summary logic to explain the problem. For example, evolutionary psychologists try to utilize the survival of admissions to explain psychological traits - such as memory, perception, language, etc., which are naturally selected or sexually selected products.\nPsychologists will launch basic research to further understand a certain field of psychology, or to apply research to solve other issues such as clinical, workplace. Master's clinical professional meeting at the same time and teacher student research methods and evidence-based practices. The Psychology Association will also assist in establishing specifications, such as moral, training, research methods, professional operations, etc. In addition, according to different countries and regions, psychological services or \"psychologists\", they are also often requested to obtain practices.\n\n\n=== Test method ===\n\nThe results of controlling the variable observation of variables in various situations in various situations in the control experiment context. Statistical analysis of the results, the effect of controlling the effects of unrelated variables, and inference: whether the variable has an effect on variables, that is, whether it has a causality between variables and variables (generally finding the correlation of both. Then confirm the causal relationship. Will also find the correlation coefficient of both according to data analysis, and then determine if there is research value.\nExample: Dog in Pavlov experiment (classic condition reflection). Whenever a bell, the dog secretes a lot of saliva. Experiments involve the independent variable, due to variables (dependent) (Dependent Variable). The bell is IV, the saliva of the dog is DV. The independent variable is a variable in the experimenter, and the variable is variable due to the variable. The experimental method is valued. Credibility and repeatability.\nExperiments with human beings have been controlled, such as the consent of the experimental objects, and ensure the principle of voluntary participation. After World War II, in order to avoid the event of similar Nazis abuse experiments, Nuremberg Code was formulated. Soon, many countries (and scientific institutions) received the \"Helsinki Declaration\". In the United States, the Health Center has established an ethical review committee in 1966, issued a national research method (HR 7724) in 1974. All of the above bills advocate the license for researchers to obtain participation before the experiment. A series of influential events lead to the amendments to the bill, such as the NAS Polytechnic College and Fu Nan College, Sandy amine scandal, Wiro Brook Hepatitis Test, and Stanley Mirgram Test experiment, etc.\n\n\n=== Animal study ===\n\nAnimal learning experiments have important auxiliary role in studying human psychology, such as perceptual, emotion, learning, memory, and more. In the 1990s, the Russian psychologist Ivan Petrovic Pavlov utilizes the dog's experiment to showcase the classic conditions reflection. Non-human animals such as primate, cats, dogs, pigeons, rats, and other rodents are often used in psychological experiments, especially for behavioral psychology. In the ideal state, the experimental control group only gives only one independent variable to show its role of the variable. These can get the most approximate results in the laboratory. In contrast, the difference between human living environment and genetic environment is too large, and there are too many variables, so that it is difficult to control important variable data in the population. Of course, it is obvious that the results of animal experiments into humans are obvious. Animal experiment will be subject to relevant constraints, need to comply with the moral principles set by the Psychology.\n\n\n=== Qualitative and quantification research ===\nThe vast majority of psychology follows the standard scientific methods for research. Psychological researchers try to use the latest theories and assumptions to study data and quality and quantity.\nPsychological research methods include interviews, observation methods, etc. Creswell (2003) defines five major qualitative research, including narrative, phenomenological, ethnic, case analysis, and basic theory. Quality researchers sometimes struggle to enrich, or criticize, subjective experience or social structures for symbols. Similar explanations or critical perspectives are applied to \"quantitative research\", such as the Nazi experiment of Erich From or the power of Stanley Mirgram.\nPsychological quantitative research often use statistics to test falseness. Design quantitative research often includes experimental, quasi-experiment, cross-sectional design, case control research and longitudinal study. The measurement and operation definition in the experimental structure is also very important. Statistical methods include Pearson's toss coefficient, variance analysis, linear regression, Logit model, structural equation modeling, hierarchical linear model, etc.\n\n\n=== Qualitative and description research ===\n\nThe study aims to answer individual ideas, feelings, behaviors, known as \"descriptive research\". The orientation of the descriptive study can be quantitative or qualitative. \"Qualitative Research\" is a descriptive study focusing on the observation of the incident, description, is a point of capturing a point of daily behavior and expects to re-discovery or understand in a rough experiment.\n\n\n=== Natural state observation ===\n\nJust like Gutogo's research includes observing the social, family, psychologists, by observing human society, professional, and homes. Sometimes participants will be aware that they are monitored and sometimes the opposite. But in any case, when observing the study is underway, the researchers must ensure that strict moral guidelines cannot be made.\n\n\n=== Investigation questionnaire ===\n\nPsychology, statistical surveys can be used to measure attitudes, traits, monitoring emotions, check the validity of the test, and other related research projects, etc. Psychological statisticors can use traditional paper, telephone, email, or current The popular network, etc., revolve around the theme, conduct a certain proportion of people's investigation, random surveys, key investigations, sampling investigations. Similar surveys are also used in other applications, such as clinical assessments, personnel assessments.\n\n\n=== Research design of developing psychology ===\nMainly divided into three kinds\n\nCross-Sectional Design: Subjects to the subjects of different age layers at a particular period of time in a landscape. Advantages: Save time and effort, more timely research, and can achieve the results of the results of the results of the results, without sample loss.\nDisadvantages: Cohort Effect, that is, the age difference is not completely caused by age changes, and it may also be affected by an external environment, such as different life experiences of different age groups. Longitudinal Design: Tracking the same group in a certain characteristic or behavior at different times. Advantages: It is more likely to avoid the effects of the same generation, that is, it will not be affected by the differences between groups between different ages, and data can be learned from the individual development.\nDisadvantages: Time-cost, the time cost to spend is quite high, and there will be a problem with the problem of being illuminated by the sample, and the results of the resulting research may only apply to a specific era that has grown up with the study. test. Sequenceland: Also known as Cross-Sequential Method, is a method of simultaneously designing horizontal design and portrait design. Advantages: The data is rich in two ways, and the variations caused by the effects of the peers.\nDisadvantages: As longitudinal research, there is a problem that is lost in the sample, and the cost of transverse research is expected to generate practice effects.\n\n\n=== Neurological method ===\n\nNeuropsychological research methods will compare psychological activities, behaviors, and brain structure, and function. These methods include testing (eg, Waxler Minor Meter, Wisconsin Classification Test), functional nerve imagery and transcranial magnetic stimulation.\n\n\n=== Calculation model ===\nCalculation models are often used as tools that are applied and mathematical psychology and cognitive psychology, that is, a computer simulated a particular behavior. This approach has its own unique advantage. Since modern computer processing information is extremely fast, multiple simulation can be run at the same time, and a large number of statistics are generated in the short term. The model can help psychologists observe the assumption values ​​of psychological events, which is not easy to observe in usual activities.\nThere are many different models available in the application. Jointism utilizes neural network to simulate the brain. Another way is the image simulation, using variables and rules to simulate different psychological activities. Other types of models include power systems and random processes.\nArchives Research: It is to collect a large number of existing information based on certain purposes. By analyzing the relationship between certain phenomena and psychology. Archives research method has broad and narrow scores, broad-screwing research methods in addition to traditional References also include audio-visual imaging materials, narrow archive information including newspapers, magazines, meeting records, government documents, personal letters, etc. The use of archives research methods can make up for other research methods, but there is a disadvantage that needs to be subject to availability.\n\n\n== Criticism ==\n\n\n=== Theory ===\nCriticism of research often includes accusing psychology is \"soft\" science. Science philosophers Thomas Kun's 1962 criticism suggesting that psychology is still in the previous form, lacks the support theory like mature chemistry, physics.\nBecause some of the fields of psychology depends on research methods such as questionnaire surveys, critics believe that psychology is not objective enough. Other points of view believe that psychologists have studied the personality, thinking, and emotions that are directly measured. As a result, it is the subjective report of the investigation object. Other critics believe that the statistics are misused. Some research records indicate that psychologists often confuse the statistical relationship between the statistics, and the former often does not matter in practice. Sometimes, the debate occurs inside the psychological community, such as the dispute between laboratory researchers and practical clinicians.\n\n\n=== Practice ===\nSome observers have discovered conflicts in certain theories and practices - for example, some clinical practice has no theoretical support. Critics believe that more and more psychological training courses have no sufficient scientific basis. Some questioners believe that like \"infant autism assistance communication\"; it is used to renew recovery of body shaping exercises; regenerative therapy, etc., although it is very popular, but doubt, and may be harmful to health.\n\n\n=== Moral ===\n\nIn today's moral standard framework, some research experiments are not allowed. These experiments violate the Ethics Code of the American Psychological Association, Canada involves human experimental moral guidelines, as well as Belmon reports. At present, Moral Guidance stipulates that research on non-human animals can only be carried out in the event of benefits greater than harm. Therefore, the research method of psychologists in animal experiments cannot be used in humans.\n\nMir Grglen experiments in Stanley Mirgram makes participants torture, challenge the moral bottom line of scientific experiments. Experimental research participation objects will violate their own willingness to implement regulations.\nIn the 1970s, Harry Harlow took the \"desperate\" experiment in Madison, Madison, Wisconsin, was condemned. Experiments utilize animals to simulate depression. Harow designed a \"ram rack\" that uses interference to mother macaque behavior. In 1974, US literature critics wrote: \"Harry Harlow with his colleagues decomposes non-human primate experiments, proves that we have already known - the social creature is due to social binders The damage was damaged. \"He wrote Haro's ethics to his studies without any comments. College Psychology Institute has a moral committee to ensure the rights and respect of the research object. Psychological researchers must obtain permission before experimenting to protect human participation in objects or experimental animals.\n\n\n=== WEIRD deviation ===\nIn 1959, the statistian Sterling calculated that 97% of psychological experiments supported their initial hypothesis, suggesting the possibility of deviation. Similarly, Janelli, 2010, found 91.5% of mental / psychological studies have been proved that issues (positive results) are 5 times the spatial or earth science. Janer believes that the \"soft\" scientific researchers lack a bondage in their consciousness and subconscious deviation.\nIn 2010, a group of researchers announced the systemic experimental object deviation in psychological research (\"Western region, well-educated, industrialized, rich, democratic\"; \"Western, EDUCATED, INDUSTRIALIZED, RICH AND Democratic\"). Although 1/8 after the global range is a WEIRD category, the experimenter is called 60-90% of the experiments in WeID objects. The report shows that in Muller-Rial, the experimental conclusion of the Weird object and the tribal object is great.\n\n\n== Research field ==\nThe research area contained in psychology is wide, and many different methods are used to psychological processes and behaviors. Psychology is mainly divided into two major areas of theoretical psychology and application psychology, which can be divided into many sectors, such as educational psychology, metamorphology, management psychology.\n\nTheoretical Psychology: Compared to application psychology, including metamorphology, physiological psychology, cognitive psychology, more psychology, development psychology, health psychology, personality psychology, social psychology, etc. .\nEvolutionary Psychology: It is a integrated attempt to all psychology, which provides a simple way to explain the various phenomena and theories observed in each psychology.\nAbnormal Psychology: It is an abnormal behavior study to describe, forecasting, interpretation, and correction modes. Abnormal psychology research is applied to clinical psychology to treat psychological diseases.\nPhysiological psychology: studies based on physiological composition structures, including human brain, etc.\nCognitive psychology: so-called cognition, refers to various psychological activities in the knowledge process, mainly including consciousness, memory, speech, thinking, etc., usually so-called understanding process.\nPositive psychology: Positive psychology focuses on happiness and satisfying humanistic psychology from the 20th century.\nComparative Psychology: It is the basic theory of animal behavioral evolution, and psychological branches of various behavioral characteristics of animals in different evolutionary levels. It is of great significance for philosophical understanding, and the study of psychology can also provide basic scientific knowledge in animal behavior evolution for production practices and biomedical research.\nDevelopment Psychology: Mainly studying human beings from the personality development process of birth to death, Eric Sen divided the personality development into 8 phases, and believes that people in each stage will face obstacles for different personality development, such as handle It will be well developed, such as processing is not good, will form anxiety and various problems.\nPersonality psychology: study behavior, thinking, and emotional models, usually called individual personality.\nQuantitative Psychology: Applying mathematical models and statistical models in psychology research, and statistical methods for analysis, interpretation of behavioral data.\nPsychological statistics: It is the theory and technology of psychological measurement in psychology, mainly related to education, personality and clinical psychology. Mathematical psychology is closely related to experiments and cognition, physiological psychology.\nSocial Psychology: Exploring the scientific research of social and cognitive processes for individual consciousness, affecting others and contacting others how to generate scientific research, based on psychology, sociology related theory. Social science.\nClinical Psychology: It is an abnormal behavior of human beings. The discussion of these acts, assessment, classification, treatment, prevention, and scientific research in the psychology branch disciplines were discussed by clinical observation.\nEducational Psychology: How to study how humans learn, educational interventions in education, teaching psychology, as the social psychology of organizational school. Livivi Vigoski, the research results of children and psychologists such as Children and Jerome Brun have had a significant impact in teaching methods and education practices.\nHealth Psychology: It is the application of psychological theory and research in health, disease and health care. However, clinical psychology focuses on mental health and neurological diseases, health psychology pays attention to health behaviors, including healthy diet, doctors - patient relationships, and patients' understanding of health knowledge.\nIndustrial and Organization Psychology: The main research organizational psychology is also the goal of advancement utilization, management, and to the organization.\nSchool psychology: mainly studies the psychology and law of students in school learning, teacher teaching. This subject has a significant effect when solving learning problems and difficulties.\nCommunity Psychology: Mainly paying attention to individual relationships between individuals and communities, and has effectively enhanced personal security, happiness and quality of life through the study and action of cooperative research and action, and prevention, empowerment, social changes.\nChildren's psychology: mainly pay attention to children's psychology, cognition development and growth, and how to deal with children with psychological obstacles in response to theory.\nSuper Personal Psychology: Specialized in the spiritual research of self-level, across the psychology, and humanity in terms of humanity.\n\n\n== See ==\npsychologist\nPsychology\nPathology\nSocial psychology\nChina Psychology (CPS)\nAmerican Psychology (APA)\n\n\n== Reference ==\n\n\n== Research Book ==\nLi Shaun: \"Study\" (Taipei: Taiwan Commercial Press, 1998).\nLi Shaoun: \"Philosophy]. psychological. Education (Taipei: Taiwan Commercial Press, 1993).\nLi Shaun: \"The Psychology of the United States\" (Taipei: Taiwan Commercial Press, 1991).\nLi Shaun: \"Psychology of Europe\" (Beijing: Business Press, 2007).\nZhang Chunxing: \"Modern Psychology - Science of Modern People 's Research\" (Taipei: Donghua Book Company, 1991).\nZhu Guangqian: \"Art Psychology\" (Beijing: Renmin University Press, 1998).\n\n\n== External link ==\nPsychology research (Traditional Chinese)\nPsychology Encyclopedia (page archive backup, existing internet archives) (English)\nAmerican Psychology File (English)\nMaster of psychology (English)\nChina Psychology (Page Archive Backup, Save Internet Archives) (Simplified Chinese)\nAmerican Psychological Society (page archive backup, existing internet archives) (English)\nTaiwan Psychology Society (Traditional Chinese)\nHong Kong Psychology "}