{"topic": "Earth", "english_title": "Earth", "english": "Earth is the third planet from the Sun and the only astronomical object known to harbor and support life. About 29.2% of Earth's surface is land consisting of continents and islands. The remaining 70.8% is covered with water, mostly by oceans, seas, gulfs, and other salt-water bodies, but also by lakes, rivers, and other freshwater, which together constitute the hydrosphere. Much of Earth's polar regions are covered in ice. Earth's outer layer is divided into several rigid tectonic plates that migrate across the surface over many millions of years, while its interior remains active with a solid iron inner core, a liquid outer core that generates Earth's magnetic field, and a convective mantle that drives plate tectonics.\nEarth's atmosphere consists mostly of nitrogen and oxygen. More solar energy is received by tropical regions than polar regions and is redistributed by atmospheric and ocean circulation. Greenhouse gases also play an important role in regulating the surface temperature. A region's climate is not only determined by latitude, but also by elevation and proximity to moderating oceans, among other factors. Severe weather, such as tropical cyclones, thunderstorms, and heatwaves, occurs in most areas and greatly impacts life.\nEarth's gravity interacts with other objects in space, especially the Moon, which is Earth's only natural satellite. Earth orbits around the Sun in about 365.25 days. Earth's axis of rotation is tilted with respect to its orbital plane, producing seasons on Earth. The gravitational interaction between Earth and the Moon causes tides, stabilizes Earth's orientation on its axis, and gradually slows its rotation. Earth is the densest planet in the Solar System and the largest and most massive of the four rocky planets.\nAccording to radiometric dating estimation and other evidence, Earth formed over 4.5 billion years ago. Within the first billion years of Earth's history, life appeared in the oceans and began to affect Earth's atmosphere and surface, leading to the proliferation of anaerobic and, later, aerobic organisms. Some geological evidence indicates that life may have arisen as early as 4.1 billion years ago. Since then, the combination of Earth's distance from the Sun, physical properties, and geological history have allowed life to evolve and thrive. In the history of life on Earth, biodiversity has gone through long periods of expansion, occasionally punctuated by mass extinctions. Over 99% of all species that ever lived on Earth are extinct. Almost 8 billion humans live on Earth and depend on its biosphere and natural resources for their survival. Humans increasingly impact Earth's surface, hydrology, atmospheric processes, and other life.\n\n\n== Etymology ==\nThe modern English word  Earth developed, via Middle English, from an Old English noun most often spelled eorðe. It has cognates in every Germanic language, and their ancestral root has been reconstructed as *erþō. In its earliest attestation, the word eorðe was already being used to translate the many senses of Latin terra and Greek γῆ gē: the ground, its soil, dry land, the human world, the surface of the world (including the sea), and the globe itself. As with Roman Terra/Tellūs and Greek Gaia, Earth may have been a personified goddess in Germanic paganism: late Norse mythology included Jörð ('Earth'), a giantess often given as the mother of Thor.Historically, earth has been written in lowercase. From early Middle English, its definite sense as \"the globe\" was expressed as the earth. By Early Modern English, many nouns were capitalized, and the earth was also written the Earth, particularly when referenced along with other heavenly bodies. More recently, the name is sometimes simply given as Earth, by analogy with the names of the other planets, though earth and forms with the remain common. House styles now vary: Oxford spelling recognizes the lowercase form as the most common, with the capitalized form an acceptable variant. Another convention capitalizes \"Earth\" when appearing as a name (for example, \"Earth's atmosphere\") but writes it in lowercase when preceded by the (for example, \"the atmosphere of the earth\"). It almost always appears in lowercase in colloquial expressions such as \"what on earth are you doing?\"Occasionally, the name Terra  is used in scientific writing and especially in science fiction to distinguish humanity's inhabited planet from others, while in poetry Tellus  has been used to denote personification of the Earth. Terra is also the name of the planet in some Romance languages (languages that evolved from Latin) like Italian and Portuguese, while in other Romance languages the word gave rise to names with slightly altered spellings (like the Spanish Tierra and the French Terre). The Latinate form Gæa or Gaea (English: ) of the Greek poetic name Gaia (Γαῖα; Ancient Greek: [ɡâi̯.a] or [ɡâj.ja]) is rare, though the alternative spelling Gaia has become common due to the Gaia hypothesis, in which case its pronunciation is  rather than the more classical English .There are a number of adjectives for the planet Earth. From Earth itself comes earthly. From the Latin Terra comes terran , terrestrial , and (via French) terrene , and from the Latin Tellus comes tellurian  and telluric.\n\n\n== Chronology ==\n\n\n=== Formation ===\n\nThe oldest material found in the Solar System is dated to 4.5682+0.0002−0.0004 Ga (billion years) ago. By 4.54±0.04 Ga the primordial Earth had formed. The bodies in the Solar System formed and evolved with the Sun. In theory, a solar nebula partitions a volume out of a molecular cloud by gravitational collapse, which begins to spin and flatten into a circumstellar disk, and then the planets grow out of that disk with the Sun. A nebula contains gas, ice grains, and dust (including primordial nuclides). According to nebular theory, planetesimals formed by accretion, with the primordial Earth being estimated as likely taking anywhere from 70 to 100 million years to form.Estimates of the age of the Moon range from 4.5 Ga to significantly younger. A leading hypothesis is that it was formed by accretion from material loosed from Earth after a Mars-sized object with about 10% of Earth's mass, named Theia, collided with Earth. It hit Earth with a glancing blow and some of its mass merged with Earth. Between approximately 4.1 and 3.8 Ga, numerous asteroid impacts during the Late Heavy Bombardment caused significant changes to the greater surface environment of the Moon and, by inference, to that of Earth.\n\n\n=== Geological history ===\n\nEarth's atmosphere and oceans were formed by volcanic activity and outgassing. Water vapor from these sources condensed into the oceans, augmented by water and ice from asteroids, protoplanets, and comets. Sufficient water to fill the oceans may have been on Earth since it formed. In this model, atmospheric greenhouse gases kept the oceans from freezing when the newly forming Sun had only 70% of its current luminosity. By 3.5 Ga, Earth's magnetic field was established, which helped prevent the atmosphere from being stripped away by the solar wind.As the molten outer layer of Earth cooled it formed the first solid crust, which is thought to have been mafic in composition. The first continental crust, which was more felsic in composition, formed by the partial melting of this mafic crust. The presence of grains of the mineral zircon of Hadean age in Eoarchean sedimentary rocks suggests that at least some felsic crust existed as early as 4.4 Ga, only 140 Ma after Earth's formation. There are two main models of how this initial small volume of continental crust evolved to reach its current abundance: (1) a relatively steady growth up to the present day, which is supported by the radiometric dating of continental crust globally and (2) an initial rapid growth in the volume of continental crust during the Archean, forming the bulk of the continental crust that now exists, which is supported by isotopic evidence from hafnium in zircons and neodymium in sedimentary rocks. The two models and the data that support them can be reconciled by large-scale recycling of the continental crust, particularly during the early stages of Earth's history.New continental crust forms as a result of plate tectonics, a process ultimately driven by the continuous loss of heat from Earth's interior. Over the period of hundreds of millions of years, tectonic forces have caused areas of continental crust to group together to form supercontinents that have subsequently broken apart. At approximately 750 Ma, one of the earliest known supercontinents, Rodinia, began to break apart. The continents later recombined to form Pannotia at 600–540 Ma, then finally Pangaea, which also began to break apart at 180 Ma.The most recent pattern of ice ages began about 40 Ma, and then intensified during the Pleistocene about 3 Ma. High- and middle-latitude regions have since undergone repeated cycles of glaciation and thaw, repeating about every 21,000, 41,000 and 100,000 years. The Last Glacial Period, colloquially called the \"last ice age\", covered large parts of the continents, up to the middle latitudes, in ice and ended about 11,700 years ago.\n\n\n=== Origin of life and evolution ===\n\nChemical reactions led to the first self-replicating molecules about four billion years ago. A half billion years later, the last common ancestor of all current life arose. The evolution of photosynthesis allowed the Sun's energy to be harvested directly by life forms. The resultant molecular oxygen (O2) accumulated in the atmosphere and due to interaction with ultraviolet solar radiation, formed a protective ozone layer (O3) in the upper atmosphere. The incorporation of smaller cells within larger ones resulted in the development of complex cells called eukaryotes. True multicellular organisms formed as cells within colonies became increasingly specialized. Aided by the absorption of harmful ultraviolet radiation by the ozone layer, life colonized Earth's surface. Among the earliest fossil evidence for life is microbial mat fossils found in 3.48 billion-year-old sandstone in Western Australia, biogenic graphite found in 3.7 billion-year-old metasedimentary rocks in Western Greenland, and remains of biotic material found in 4.1 billion-year-old rocks in Western Australia. The earliest direct evidence of life on Earth is contained in 3.45 billion-year-old Australian rocks showing fossils of microorganisms.During the Neoproterozoic, 1000 to 541 Ma, much of Earth might have been covered in ice. This hypothesis has been termed \"Snowball Earth\", and it is of particular interest because it preceded the Cambrian explosion, when multicellular life forms significantly increased in complexity. Following the Cambrian explosion, 535 Ma, there have been at least five major mass extinctions and many minor ones. Apart from the proposed current Holocene extinction event, the most recent was 66 Ma, when an asteroid impact triggered the extinction of the non-avian dinosaurs and other large reptiles, but largely spared small animals such as insects, mammals, lizards and birds. Mammalian life has diversified over the past 66 Mys, and several million years ago an African ape gained the ability to stand upright. This facilitated tool use and encouraged communication that provided the nutrition and stimulation needed for a larger brain, which led to the evolution of humans. The development of agriculture, and then civilization, led to humans having an influence on Earth and the nature and quantity of other life forms that continues to this day.\n\n\n=== Future ===\n\nBecause carbon dioxide (CO2) has a long lifespan in the atmosphere, moderate human CO2 emissions may postpone the next glacial inception by 100,000 years. Earth's expected long-term future is tied to that of the Sun. Over the next 1.1 billion years, solar luminosity will increase by 10%, and over the next 3.5 billion years by 40%. Earth's increasing surface temperature will accelerate the inorganic carbon cycle, reducing CO2 concentration to levels lethally low for plants (10 ppm for C4 photosynthesis) in approximately 100–900 million years. The lack of vegetation will result in the loss of oxygen in the atmosphere, making animal life impossible. Due to the increased luminosity, Earth's mean temperature may reach 100 °C (212 °F) in 1.5 billion years, and all ocean water will evaporate and be lost to space within an estimated 1.6 to 3 billion years. Even if the Sun were stable, a fraction of the water in the modern oceans will descend to the mantle, due to reduced steam venting from mid-ocean ridges.The Sun will evolve to become a red giant in about 5 billion years. Models predict that the Sun will expand to roughly 1 AU (150 million km; 93 million mi), about 250 times its present radius. Earth's fate is less clear. As a red giant, the Sun will lose roughly 30% of its mass, so, without tidal effects, Earth will move to an orbit 1.7 AU (250 million km; 160 million mi) from the Sun when the star reaches its maximum radius.\n\n\n== Physical characteristics ==\n\n\n=== Size and shape ===\n\nThe shape of Earth is nearly spherical. There is a small flattening at the poles and bulging around the equator due to Earth's rotation. Therefore, a better approximation of Earth's shape is an oblate spheroid, whose equatorial diameter is 43 kilometres (27 mi) larger than the pole-to-pole diameter.The point on the surface farthest from Earth's center of mass is the summit of the equatorial Chimborazo volcano in Ecuador (6,384.4 km or 3,967.1 mi). The average diameter of the reference spheroid is 12,742 kilometres (7,918 mi). Local topography deviates from this idealized spheroid, although on a global scale these deviations are small compared to Earth's radius: the maximum deviation of only 0.17% is at the Mariana Trench (10,925 metres or 35,843 feet below local sea level), whereas Mount Everest (8,848 metres or 29,029 feet above local sea level) represents a deviation of 0.14%.In geodesy, the exact shape that Earth's oceans would adopt in the absence of land and perturbations such as tides and winds is called the geoid. More precisely, the geoid is the surface of gravitational equipotential at mean sea level (MSL).Sea surface topography are water deviations from MSL, analogous to land topography.\n\n\n=== Chemical composition ===\n\nEarth's mass is approximately 5.97×1024 kg (5,970 Yg). It is composed mostly of iron (32.1%), oxygen (30.1%), silicon (15.1%), magnesium (13.9%), sulfur (2.9%), nickel (1.8%), calcium (1.5%), and aluminum (1.4%), with the remaining 1.2% consisting of trace amounts of other elements. Due to mass segregation, the core region is estimated to be primarily composed of iron (88.8%), with smaller amounts of nickel (5.8%), sulfur (4.5%), and less than 1% trace elements.The most common rock constituents of the crust are nearly all oxides: chlorine, sulfur, and fluorine are the important exceptions to this and their total amount in any rock is usually much less than 1%. Over 99% of the crust is composed of 11 oxides, principally silica, alumina, iron oxides, lime, magnesia, potash, and soda.\n\n\n=== Internal structure ===\n\nEarth's interior, like that of the other terrestrial planets, is divided into layers by their chemical or physical (rheological) properties. The outer layer is a chemically distinct silicate solid crust, which is underlain by a highly viscous solid mantle. The crust is separated from the mantle by the Mohorovičić discontinuity. The thickness of the crust varies from about 6 kilometres (3.7 mi) under the oceans to 30–50 km (19–31 mi) for the continents. The crust and the cold, rigid, top of the upper mantle are collectively known as the lithosphere, which is divided into independently moving tectonic plates.Beneath the lithosphere is the asthenosphere, a relatively low-viscosity layer on which the lithosphere rides. Important changes in crystal structure within the mantle occur at 410 and 660 km (250 and 410 mi) below the surface, spanning a transition zone that separates the upper and lower mantle. Beneath the mantle, an extremely low viscosity liquid outer core lies above a solid inner core. Earth's inner core may be rotating at a slightly higher angular velocity than the remainder of the planet, advancing by 0.1–0.5° per year, although both somewhat higher and much lower rates have also been proposed. The radius of the inner core is about one-fifth of that of Earth.\nDensity increases with depth, as described in the table on the right.\n\n\n=== Heat ===\n\nThe major heat-producing isotopes within Earth are potassium-40, uranium-238, and thorium-232. At the center, the temperature may be up to 6,000 °C (10,830 °F), and the pressure could reach 360 GPa (52 million psi). Because much of the heat is provided by radioactive decay, scientists postulate that early in Earth's history, before isotopes with short half-lives were depleted, Earth's heat production was much higher. At approximately 3 Gyr, twice the present-day heat would have been produced, increasing the rates of mantle convection and plate tectonics, and allowing the production of uncommon igneous rocks such as komatiites that are rarely formed today.\n\nThe mean heat loss from Earth is 87 mW m−2, for a global heat loss of 4.42×1013 W. A portion of the core's thermal energy is transported toward the crust by mantle plumes, a form of convection consisting of upwellings of higher-temperature rock. These plumes can produce hotspots and flood basalts. More of the heat in Earth is lost through plate tectonics, by mantle upwelling associated with mid-ocean ridges. The final major mode of heat loss is through conduction through the lithosphere, the majority of which occurs under the oceans because the crust there is much thinner than that of the continents.\n\n\n=== Tectonic plates ===\n\nEarth's mechanically rigid outer layer, the lithosphere, is divided into tectonic plates. These plates are rigid segments that move relative to each other at one of three boundaries types: at convergent boundaries, two plates come together; at divergent boundaries, two plates are pulled apart; and at transform boundaries, two plates slide past one another laterally. Along these plate boundaries, earthquakes, volcanic activity, mountain-building, and oceanic trench formation can occur. The tectonic plates ride on top of the asthenosphere, the solid but less-viscous part of the upper mantle that can flow and move along with the plates.As the tectonic plates migrate, oceanic crust is subducted under the leading edges of the plates at convergent boundaries. At the same time, the upwelling of mantle material at divergent boundaries creates mid-ocean ridges. The combination of these processes recycles the oceanic crust back into the mantle. Due to this recycling, most of the ocean floor is less than 100 Ma old. The oldest oceanic crust is located in the Western Pacific and is estimated to be 200 Ma old. By comparison, the oldest dated continental crust is 4,030 Ma, although zircons have been found preserved as clasts within Eoarchean sedimentary rocks that give ages up to 4,400 Ma, indicating that at least some continental crust existed at that time.The seven major plates are the Pacific, North American, Eurasian, African, Antarctic, Indo-Australian, and South American. Other notable plates include the Arabian Plate, the Caribbean Plate, the Nazca Plate off the west coast of South America and the Scotia Plate in the southern Atlantic Ocean. The Australian Plate fused with the Indian Plate between 50 and 55 Ma. The fastest-moving plates are the oceanic plates, with the Cocos Plate advancing at a rate of 75 mm/a (3.0 in/year) and the Pacific Plate moving 52–69 mm/a (2.0–2.7 in/year). At the other extreme, the slowest-moving plate is the South American Plate, progressing at a typical rate of 10.6 mm/a (0.42 in/year).\n\n\n=== Surface ===\n\nThe total surface area of Earth is about 510 million km2 (197 million sq mi). Of this, 70.8%, or 361.13 million km2 (139.43 million sq mi), is below sea level and covered by ocean water. Below the ocean's surface are much of the continental shelf, mountains, volcanoes, oceanic trenches, submarine canyons, oceanic plateaus, abyssal plains, and a globe-spanning mid-ocean ridge system. The remaining 29.2%, or 148.94 million km2 (57.51 million sq mi), not covered by water has terrain that varies greatly from place to place and consists of mountains, deserts, plains, plateaus, and other landforms. The elevation of the land surface varies from the low point of −418 m (−1,371 ft) at the Dead Sea, to a maximum altitude of 8,848 m (29,029 ft) at the top of Mount Everest. The mean height of land above sea level is about 797 m (2,615 ft).The continental crust consists of lower density material such as the igneous rocks granite and andesite. Less common is basalt, a denser volcanic rock that is the primary constituent of the ocean floors. Sedimentary rock is formed from the accumulation of sediment that becomes buried and compacted together. Nearly 75% of the continental surfaces are covered by sedimentary rocks, although they form about 5% of the crust. The third form of rock material found on Earth is metamorphic rock, which is created from the transformation of pre-existing rock types through high pressures, high temperatures, or both. The most abundant silicate minerals on Earth's surface include quartz, feldspars, amphibole, mica, pyroxene and olivine. Common carbonate minerals include calcite (found in limestone) and dolomite.Erosion and tectonics, volcanic eruptions, flooding, weathering, glaciation, the growth of coral reefs, and meteorite impacts are among the processes that constantly reshape Earth's surface over geological time.The pedosphere is the outermost layer of Earth's continental surface and is composed of soil and subject to soil formation processes. The total arable land is 10.9% of the land surface, with 1.3% being permanent cropland. Close to 40% of Earth's land surface is used for agriculture, or an estimated 16.7 million km2 (6.4 million sq mi) of cropland and 33.5 million km2 (12.9 million sq mi) of pastureland.\n\n\n=== Gravitational field ===\n\nThe gravity of Earth is the acceleration that is imparted to objects due to the distribution of mass within Earth. Near Earth's surface, gravitational acceleration is approximately 9.8 m/s2 (32 ft/s2). Local differences in topography, geology, and deeper tectonic structure cause local and broad, regional differences in Earth's gravitational field, known as gravity anomalies.\n\n\n=== Magnetic field ===\n\nThe main part of Earth's magnetic field is generated in the core, the site of a dynamo process that converts the kinetic energy of thermally and compositionally driven convection into electrical and magnetic field energy. The field extends outwards from the core, through the mantle, and up to Earth's surface, where it is, approximately, a dipole. The poles of the dipole are located close to Earth's geographic poles. At the equator of the magnetic field, the magnetic-field strength at the surface is 3.05×10−5 T, with a magnetic dipole moment of 7.79×1022 Am2 at epoch 2000, decreasing nearly 6% per century. The convection movements in the core are chaotic; the magnetic poles drift and periodically change alignment. This causes secular variation of the main field and field reversals at irregular intervals averaging a few times every million years. The most recent reversal occurred approximately 700,000 years ago.\n\n\n==== Magnetosphere ====\n\nThe extent of Earth's magnetic field in space defines the magnetosphere. Ions and electrons of the solar wind are deflected by the magnetosphere; solar wind pressure compresses the dayside of the magnetosphere, to about 10 Earth radii, and extends the nightside magnetosphere into a long tail. Because the velocity of the solar wind is greater than the speed at which waves propagate through the solar wind, a supersonic bow shock precedes the dayside magnetosphere within the solar wind. Charged particles are contained within the magnetosphere; the plasmasphere is defined by low-energy particles that essentially follow magnetic field lines as Earth rotates. The ring current is defined by medium-energy particles that drift relative to the geomagnetic field, but with paths that are still dominated by the magnetic field, and the Van Allen radiation belts are formed by high-energy particles whose motion is essentially random, but contained in the magnetosphere.During magnetic storms and substorms, charged particles can be deflected from the outer magnetosphere and especially the magnetotail, directed along field lines into Earth's ionosphere, where atmospheric atoms can be excited and ionized, causing the aurora.\n\n\n== Orbit and rotation ==\n\n\n=== Rotation ===\n\nEarth's rotation period relative to the Sun—its mean solar day—is 86,400 seconds of mean solar time (86,400.0025 SI seconds). Because Earth's solar day is now slightly longer than it was during the 19th century due to tidal deceleration, each day varies between 0 and 2 ms longer than the mean solar day.Earth's rotation period relative to the fixed stars, called its stellar day by the International Earth Rotation and Reference Systems Service (IERS), is 86,164.0989 seconds of mean solar time (UT1), or 23h 56m 4.0989s. Earth's rotation period relative to the precessing or moving mean March equinox (when the Sun is at 90° on the equator), is 86,164.0905 seconds of mean solar time (UT1) (23h 56m 4.0905s). Thus the sidereal day is shorter than the stellar day by about 8.4 ms.Apart from meteors within the atmosphere and low-orbiting satellites, the main apparent motion of celestial bodies in Earth's sky is to the west at a rate of 15°/h = 15'/min. For bodies near the celestial equator, this is equivalent to an apparent diameter of the Sun or the Moon every two minutes; from Earth's surface, the apparent sizes of the Sun and the Moon are approximately the same.\n\n\n=== Orbit ===\n\nEarth orbits the Sun at an average distance of about 150 million km (93 million mi) every 365.2564 mean solar days, or one sidereal year. This gives an apparent movement of the Sun eastward with respect to the stars at a rate of about 1°/day, which is one apparent Sun or Moon diameter every 12 hours. Due to this motion, on average it takes 24 hours—a solar day—for Earth to complete a full rotation about its axis so that the Sun returns to the meridian. The orbital speed of Earth averages about 29.78 km/s (107,200 km/h; 66,600 mph), which is fast enough to travel a distance equal to Earth's diameter, about 12,742 km (7,918 mi), in seven minutes, and the distance to the Moon, 384,000 km (239,000 mi), in about 3.5 hours.The Moon and Earth orbit a common barycenter every 27.32 days relative to the background stars. When combined with the Earth-Moon system's common orbit around the Sun, the period of the synodic month, from new moon to new moon, is 29.53 days. Viewed from the celestial north pole, the motion of Earth, the Moon, and their axial rotations are all counterclockwise. Viewed from a vantage point above the Sun and Earth's north poles, Earth orbits in a counterclockwise direction about the Sun. The orbital and axial planes are not precisely aligned: Earth's axis is tilted some 23.44 degrees from the perpendicular to the Earth-Sun plane (the ecliptic), and the Earth-Moon plane is tilted up to ±5.1 degrees against the Earth-Sun plane. Without this tilt, there would be an eclipse every two weeks, alternating between lunar eclipses and solar eclipses.The Hill sphere, or the sphere of gravitational influence, of Earth is about 1.5 million km (930,000 mi) in radius. This is the maximum distance at which Earth's gravitational influence is stronger than the more distant Sun and planets. Objects must orbit Earth within this radius, or they can become unbound by the gravitational perturbation of the Sun.Earth, along with the Solar System, is situated in the Milky Way and orbits about 28,000 light-years from its center. It is about 20 light-years above the galactic plane in the Orion Arm.\n\n\n=== Axial tilt and seasons ===\n\nThe axial tilt of Earth is approximately 23.439281° with the axis of its orbit plane, always pointing towards the Celestial Poles. Due to Earth's axial tilt, the amount of sunlight reaching any given point on the surface varies over the course of the year. This causes the seasonal change in climate, with summer in the Northern Hemisphere occurring when the Tropic of Cancer is facing the Sun, and in the Southern Hemisphere when the Tropic of Capricorn faces the Sun. In each instance, winter occurs simultaneously in the opposite hemisphere. During the summer, the day lasts longer, and the Sun climbs higher in the sky. In winter, the climate becomes cooler and the days shorter. Above the Arctic Circle and below the Antarctic Circle there is no daylight at all for part of the year, causing a polar night, and this night extends for several months at the poles themselves. These same latitudes also experience a midnight sun, where the sun remains visible all day.By astronomical convention, the four seasons can be determined by the solstices—the points in the orbit of maximum axial tilt toward or away from the Sun—and the equinoxes, when Earth's rotational axis is aligned with its orbital axis. In the Northern Hemisphere, winter solstice currently occurs around 21 December; summer solstice is near 21 June, spring equinox is around 20 March and autumnal equinox is about 22 or 23 September. In the Southern Hemisphere, the situation is reversed, with the summer and winter solstices exchanged and the spring and autumnal equinox dates swapped.The angle of Earth's axial tilt is relatively stable over long periods of time. Its axial tilt does undergo nutation; a slight, irregular motion with a main period of 18.6 years. The orientation (rather than the angle) of Earth's axis also changes over time, precessing around in a complete circle over each 25,800-year cycle; this precession is the reason for the difference between a sidereal year and a tropical year. Both of these motions are caused by the varying attraction of the Sun and the Moon on Earth's equatorial bulge. The poles also migrate a few meters across Earth's surface. This polar motion has multiple, cyclical components, which collectively are termed quasiperiodic motion. In addition to an annual component to this motion, there is a 14-month cycle called the Chandler wobble. Earth's rotational velocity also varies in a phenomenon known as length-of-day variation.In modern times, Earth's perihelion occurs around 3 January, and its aphelion around 4 July. These dates change over time due to precession and other orbital factors, which follow cyclical patterns known as Milankovitch cycles. The changing Earth-Sun distance causes an increase of about 6.8% in solar energy reaching Earth at perihelion relative to aphelion. Because the Southern Hemisphere is tilted toward the Sun at about the same time that Earth reaches the closest approach to the Sun, the Southern Hemisphere receives slightly more energy from the Sun than does the northern over the course of a year. This effect is much less significant than the total energy change due to the axial tilt, and most of the excess energy is absorbed by the higher proportion of water in the Southern Hemisphere.\n\n\n== Earth-Moon system ==\n\n\n=== Moon ===\n\nThe Moon is a relatively large, terrestrial, planet-like natural satellite, with a diameter about one-quarter of Earth's. It is the largest moon in the Solar System relative to the size of its planet, although Charon is larger relative to the dwarf planet Pluto. The natural satellites of other planets are also referred to as \"moons\", after Earth's. The most widely accepted theory of the Moon's origin, the giant-impact hypothesis, states that it formed from the collision of a Mars-size protoplanet called Theia with the early Earth. This hypothesis explains (among other things) the Moon's relative lack of iron and volatile elements and the fact that its composition is nearly identical to that of Earth's crust.The gravitational attraction between Earth and the Moon causes tides on Earth. The same effect on the Moon has led to its tidal locking: its rotation period is the same as the time it takes to orbit Earth. As a result, it always presents the same face to the planet. As the Moon orbits Earth, different parts of its face are illuminated by the Sun, leading to the lunar phases. Due to their tidal interaction, the Moon recedes from Earth at the rate of approximately 38 mm/a (1.5 in/year). Over millions of years, these tiny modifications—and the lengthening of Earth's day by about 23 µs/yr—add up to significant changes. During the Ediacaran period, for example, (approximately 620 Ma) there were 400±7 days in a year, with each day lasting 21.9±0.4 hours.The Moon may have dramatically affected the development of life by moderating the planet's climate. Paleontological evidence and computer simulations show that Earth's axial tilt is stabilized by tidal interactions with the Moon. Some theorists think that without this stabilization against the torques applied by the Sun and planets to Earth's equatorial bulge, the rotational axis might be chaotically unstable, exhibiting large changes over millions of years, as is the case for Mars, though this is disputed.Viewed from Earth, the Moon is just far enough away to have almost the same apparent-sized disk as the Sun. The angular size (or solid angle) of these two bodies match because, although the Sun's diameter is about 400 times as large as the Moon's, it is also 400 times more distant. This allows total and annular solar eclipses to occur on Earth.\n\n\n=== Asteroids and artificial satellites ===\n\nEarth's co-orbital asteroids population consists of quasi-satellites, objects with a horseshoe orbit and trojans. There are at least five quasi-satellites, including 469219 Kamoʻoalewa. A trojan asteroid companion, 2010 TK7, is librating around the leading Lagrange triangular point, L4, in Earth's orbit around the Sun. The tiny near-Earth asteroid 2006 RH120 makes close approaches to the Earth–Moon system roughly every twenty years. During these approaches, it can orbit Earth for brief periods of time.As of April 2020, there are 2,666 operational, human-made satellites orbiting Earth. There are also inoperative satellites, including Vanguard 1, the oldest satellite currently in orbit, and over 16,000 pieces of tracked space debris. Earth's largest artificial satellite is the International Space Station.\n\n\n== Hydrosphere ==\n\nThe abundance of water on Earth's surface is a unique feature that distinguishes the \"Blue Planet\" from other planets in the Solar System. Earth's hydrosphere consists chiefly of the oceans, but technically includes all water surfaces in the world, including inland seas, lakes, rivers, and underground waters down to a depth of 2,000 m (6,600 ft). The mass of the oceans is approximately 1.35×1018 metric tons or about 1/4400 of Earth's total mass. The oceans cover an area of 361.8 million km2 (139.7 million sq mi) with a mean depth of 3,682 m (12,080 ft), resulting in an estimated volume of 1.332 billion km3 (320 million cu mi). If all of Earth's crustal surface were at the same elevation as a smooth sphere, the depth of the resulting world ocean would be 2.7 to 2.8 km (1.68 to 1.74 mi). About 97.5% of the water is saline; the remaining 2.5% is fresh water. Most fresh water, about 68.7%, is present as ice in ice caps and glaciers.In Earth's coldest regions, snow survives over the summer and changes into ice. This accumulated snow and ice eventually forms into glaciers, bodies of ice that flow under the influence of their own gravity. Alpine glaciers form in mountainous areas, whereas vast ice sheets form over land in polar regions. The flow of glaciers erodes the surface changing it dramatically, with the formation of U-shaped valleys and other landforms. Sea ice in the Arctic covers an area about as big as the United States, although it is quickly retreating as a consequence of climate change.The average salinity of Earth's oceans is about 35 grams of salt per kilogram of seawater (3.5% salt). Most of this salt was released from volcanic activity or extracted from cool igneous rocks. The oceans are also a reservoir of dissolved atmospheric gases, which are essential for the survival of many aquatic life forms. Sea water has an important influence on the world's climate, with the oceans acting as a large heat reservoir. Shifts in the oceanic temperature distribution can cause significant weather shifts, such as the El Niño–Southern Oscillation.\n\n\n== Atmosphere ==\n\nThe atmospheric pressure at Earth's sea level averages 101.325 kPa (14.696 psi), with a scale height of about 8.5 km (5.3 mi). A dry atmosphere is composed of 78.084% nitrogen, 20.946% oxygen, 0.934% argon, and trace amounts of carbon dioxide and other gaseous molecules. Water vapor content varies between 0.01% and 4% but averages about 1%. The height of the troposphere varies with latitude, ranging between 8 km (5 mi) at the poles to 17 km (11 mi) at the equator, with some variation resulting from weather and seasonal factors.Earth's biosphere has significantly altered its atmosphere. Oxygenic photosynthesis evolved 2.7 Gya, forming the primarily nitrogen–oxygen atmosphere of today. This change enabled the proliferation of aerobic organisms and, indirectly, the formation of the ozone layer due to the subsequent conversion of atmospheric O2 into O3. The ozone layer blocks ultraviolet solar radiation, permitting life on land. Other atmospheric functions important to life include transporting water vapor, providing useful gases, causing small meteors to burn up before they strike the surface, and moderating temperature. This last phenomenon is known as the greenhouse effect: trace molecules within the atmosphere serve to capture thermal energy emitted from the ground, thereby raising the average temperature. Water vapor, carbon dioxide, methane, nitrous oxide, and ozone are the primary greenhouse gases in the atmosphere. Without this heat-retention effect, the average surface temperature would be −18 °C (0 °F), in contrast to the current +15 °C (59 °F), and life on Earth probably would not exist in its current form.\n\n\n=== Weather and climate ===\n\nEarth's atmosphere has no definite boundary, gradually becoming thinner and fading into outer space. Three-quarters of the atmosphere's mass is contained within the first 11 km (6.8 mi) of the surface. This lowest layer is called the troposphere. Energy from the Sun heats this layer, and the surface below, causing expansion of the air. This lower-density air then rises and is replaced by cooler, higher-density air. The result is atmospheric circulation that drives the weather and climate through redistribution of thermal energy.\n\nThe primary atmospheric circulation bands consist of the trade winds in the equatorial region below 30° latitude and the westerlies in the mid-latitudes between 30° and 60°. Ocean currents are also important factors in determining climate, particularly the thermohaline circulation that distributes thermal energy from the equatorial oceans to the polar regions.The amount of solar energy reaching the Earth's surface decreases with increasing latitude. At higher latitudes, the sunlight reaches the surface at lower angles, and it must pass through thicker columns of the atmosphere. As a result, the mean annual air temperature at sea level decreases by about 0.4 °C (0.7 °F) per degree of latitude from the equator. Earth's surface can be subdivided into specific latitudinal belts of approximately homogeneous climate. Ranging from the equator to the polar regions, these are the tropical (or equatorial), subtropical, temperate and polar climates.Further factors that affect a location's climates are its proximity to oceans, the oceanic and atmospheric circulation, and topology. Places close to oceans typically have colder summers and warmer winters, due to the fact that oceans can store large amounts of heat. The wind transports the cold or the heat of the ocean to the land. Atmospheric circulation also plays an important role: San Francisco and Washington DC are both coastal cities at about the same latitude. San Francisco's climate is significantly more moderate as the prevailing wind direction is from sea to land. Finally, temperatures decrease with height causing mountainous areas to be colder than low-lying areas.Water vapor generated through surface evaporation is transported by circulatory patterns in the atmosphere. When atmospheric conditions permit an uplift of warm, humid air, this water condenses and falls to the surface as precipitation. Most of the water is then transported to lower elevations by river systems and usually returned to the oceans or deposited into lakes. This water cycle is a vital mechanism for supporting life on land and is a primary factor in the erosion of surface features over geological periods. Precipitation patterns vary widely, ranging from several meters of water per year to less than a millimeter. Atmospheric circulation, topographic features, and temperature differences determine the average precipitation that falls in each region.The commonly used Köppen climate classification system has five broad groups (humid tropics, arid, humid middle latitudes, continental and cold polar), which are further divided into more specific subtypes. The Köppen system rates regions based on observed temperature and precipitation. Surface air temperature can rise to around 55 °C (131 °F) in hot deserts, such as Death Valley, and can fall as low as −89 °C (−128 °F) in Antarctica.\n\n\n=== Upper atmosphere ===\n\nAbove the troposphere, the atmosphere is usually divided into the stratosphere, mesosphere, and thermosphere. Each layer has a different lapse rate, defining the rate of change in temperature with height. Beyond these, the exosphere thins out into the magnetosphere, where the geomagnetic fields interact with the solar wind. Within the stratosphere is the ozone layer, a component that partially shields the surface from ultraviolet light and thus is important for life on Earth. The Kármán line, defined as 100 km (62 mi) above Earth's surface, is a working definition for the boundary between the atmosphere and outer space.Thermal energy causes some of the molecules at the outer edge of the atmosphere to increase their velocity to the point where they can escape from Earth's gravity. This causes a slow but steady loss of the atmosphere into space. Because unfixed hydrogen has a low molecular mass, it can achieve escape velocity more readily, and it leaks into outer space at a greater rate than other gases. The leakage of hydrogen into space contributes to the shifting of Earth's atmosphere and surface from an initially reducing state to its current oxidizing one. Photosynthesis provided a source of free oxygen, but the loss of reducing agents such as hydrogen is thought to have been a necessary precondition for the widespread accumulation of oxygen in the atmosphere. Hence the ability of hydrogen to escape from the atmosphere may have influenced the nature of life that developed on Earth. In the current, oxygen-rich atmosphere most hydrogen is converted into water before it has an opportunity to escape. Instead, most of the hydrogen loss comes from the destruction of methane in the upper atmosphere.\n\n\n== Life on Earth ==\n\nA planet's life forms inhabit ecosystems, whose total forms the biosphere. The biosphere is divided into a number of biomes, inhabited by broadly similar plants and animals. On land, biomes are separated primarily by differences in latitude, height above sea level and humidity. Terrestrial biomes lying within the Arctic or Antarctic Circles, at high altitudes or in extremely arid areas are relatively barren of plant and animal life; species diversity reaches a peak in humid lowlands at equatorial latitudes. Estimates of the number of species on Earth today vary; most species have not been described.  Over 99% of all species that ever lived on Earth are extinct.A planet that can sustain life is termed habitable, even if life did not originate there. The distance of Earth from the Sun, as well as its orbital eccentricity, rate of rotation, axial tilt, geological history, sustaining atmosphere, and magnetic field all contribute to the current climatic conditions at the surface. Earth provides liquid water—an environment where complex organic molecules can assemble and interact, and sufficient energy to sustain metabolism. Plants can take up nutrients from the atmosphere, soils and water. These nutrients are constantly recycled between different species.Extreme weather, such as tropical cyclones (including hurricanes and typhoons), occurs over most of Earth's surface and has a large impact on life in those areas. From 1980 to 2000, these events caused an average of 11,800 human deaths per year. Many places are subject to earthquakes, landslides, tsunamis, volcanic eruptions, tornadoes, blizzards, floods, droughts, wildfires, and other calamities and disasters. Human impact is felt in many areas due to pollution of the air and water, acid rain, loss of vegetation (overgrazing, deforestation, desertification), loss of wildlife, species extinction, soil degradation, soil depletion and erosion. Humans activities release greenhouse gases into the atmosphere which cause global warming. This is driving changes such as the melting of glaciers and ice sheets, a global rise in average sea levels, increased risk of drought and wildfires, and migration of species to colder areas.\n\n\n== Human geography ==\n\nEarth's human population passed seven billion in the early 2010s, and is projected to peak at around ten billion in the second half of the 21st century. Most of the growth is expected to take place in sub-Saharan Africa. Human population density varies widely around the world, but a majority live in Asia. By 2050, 68% of the world's population is expected to be living in urban, rather than rural, areas. The Northern Hemisphere contains 68% of the world's land mass. Partly due to the predominance of land mass, 90% of humans live in the Northern Hemisphere.It is estimated that one-eighth of Earth's surface is suitable for humans to live on—three-quarters of Earth's surface is covered by oceans, leaving one-quarter as land. Half of that land area is desert (14%), high mountains (27%), or other unsuitable terrains. States claim the planet's entire land surface, except for parts of Antarctica and a few other unclaimed areas. Earth has never had a planetwide government, but the United Nations is the leading worldwide intergovernmental organization.The first human to orbit Earth was Yuri Gagarin on 12 April 1961. In total, about 550 people have visited outer space and reached orbit as of November 2018, and, of these, twelve have walked on the Moon. Normally, the only humans in space are those on the International Space Station. The station's crew, made up of six people, is usually replaced every six months. The farthest that humans have traveled from Earth is 400,171 km (248,655 mi), achieved during the Apollo 13 mission in 1970.\n\n\n=== Natural resources and land use ===\n\nEarth has resources that have been exploited by humans. Those termed non-renewable resources, such as fossil fuels, are only replenished over geological timescales. Large deposits of fossil fuels are obtained from Earth's crust, consisting of coal, petroleum, and natural gas. These deposits are used by humans both for energy production and as feedstock for chemical production. Mineral ore bodies have also been formed within the crust through a process of ore genesis, resulting from actions of magmatism, erosion, and plate tectonics. These metals and other elements are extracted by mining, a process which often brings environmental and health damage.Earth's biosphere produces many useful biological products for humans, including food, wood, pharmaceuticals, oxygen, and the recycling of organic waste. The land-based ecosystem depends upon topsoil and fresh water, and the oceanic ecosystem depends on dissolved nutrients washed down from the land. In 2019, 39 million km2 (15 million sq mi) of Earth's land surface consisted of forest and woodlands, 12 million km2 (4.6 million sq mi) was shrub and grassland, 40 million km2 (15 million sq mi) were used for animal feed production and grazing, and 11 million km2 (4.2 million sq mi) were cultivated as croplands. Of the 12–14% of ice-free land that is used for croplands, 2 percentage points were irrigated in 2015. Humans use building materials to construct shelters.\n\n\n=== Humans and climate ===\nHuman activities, such as the burning of fossil fuels, emit greenhouse gases into the atmosphere of the Earth,  altering its climate. It is estimated that global temperatures in the year 2020 were 1.2 °C (2.2 °F) warmer than the preindustrial baseline. This increase in temperature, known as global warming, has contributed to the melting of glaciers, rising sea levels, increased risk of drought and wildfires, and migration of species to colder areas.\n\n\n== Cultural and historical viewpoint ==\n\nHuman cultures have developed many views of the planet. The standard astronomical symbol of Earth consists of a cross circumscribed by a circle, , representing the four corners of the world. Earth is sometimes personified as a deity. In many cultures it is a mother goddess that is also the primary fertility deity. Creation myths in many religions involve the creation of Earth by a supernatural deity or deities. The Gaia hypothesis, developed in the mid-20th century, compared Earth's environments and life as a single self-regulating organism leading to broad stabilization of the conditions of habitability. Images of Earth taken from space, particularly during the Apollo program, have been credited with altering the way that people viewed the planet that they lived on, emphasizing its beauty, uniqueness and apparent fragility.Scientific investigation has resulted in several culturally transformative shifts in people's view of the planet. Initial belief in a flat Earth was gradually displaced in Ancient Greece by the idea of a spherical Earth, which was attributed to both the philosophers Pythagoras and Parmenides. Earth was generally believed to be the center of the universe until the 16th century, when scientists first concluded that it was a moving object, comparable to the other planets in the Solar System.It was only during the 19th century that geologists realized Earth's age was at least many millions of years. Lord Kelvin used thermodynamics to estimate the age of Earth to be between 20 million and 400 million years in 1864, sparking a vigorous debate on the subject; it was only when radioactivity and radioactive dating were discovered in the late 19th and early 20th centuries that a reliable mechanism for determining Earth's age was established, proving the planet to be billions of years old.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nEarth – Profile – Solar System Exploration – NASA\nEarth Observatory – NASA\nEarth – Videos – International Space Station:\nVideo (01:02) – Earth (time-lapse)\nVideo (00:27) – Earth and auroras (time-lapse)\nGoogle Earth 3D, interactive map\nInteractive 3D visualisation of the Sun, Earth and Moon system\nGPlates Portal (University of Sydney)", "chinese_title": "Earth ", "chinese": "Earth is the third planet in the solar system, and the sun 149 597 890.7 km / 1 astronomical unit is the only celestial body in the universe, is also a planet living in human living, a total of 7.6 billion people. The mass is about 5.97 × 1024 kg, about 6,371 kilometers radius, with an average density of 5.5 g / cm3, the highest in the solar planet. The earth performs rotation and public movement at the same time, which produces a change in day and night and the four seasons, and a sun day is rotated once, and a sun is a week. The self-transverse track is called the equatorial surface, and the mutual track surface is called the yellow road, and the angle between the two is called Yellow Direction. There is only one natural satellite in the earth, moon.\nThere are 71% of the earth's surface, which is covered by water, called the ocean or lake or river, and the rest is the continents and islands, surface distribution rivers and lakes. The ice cover and the Arctic of the Antarctic have ice. The body includes a rock ring, a mantle, a molten metal outer core and a solid metal mainland core. It has a geomagnetic field generated by the field. External gas is surrounded, called atmosphere, mainly ingredient nitrogen, oxygen, carbon dioxide, argon.\nThe earth was born in about 4.54 billion years ago, and the ocean began 42 billion years ago, and lives in the ocean 3.5 billion years ago, and then gradually involved in surface and atmosphere, and differentiated into aerobic organisms and anaerobic organisms. Specific evidence produced by early life southern southwestern metastasis in the southwest of Greenland, has a history of bonus graphite, as well as the early biological remains of about 41 billion years ago in the Western Australian continent. Since then, several biological clusters are removed, and the biological species are increasing. According to the scientific community, the 5 billion species that have been existing in the earth have been desirable, according to statistics, today's survive species is approximately 1,200 to 1,4 million, including 1200,000 species that confirm survival. And the remaining 86% have not been officially discovered. In May 2016, some scientists believe that there were probably 1 trillion species on the earth today, including only more than 100,000 people in human beings. In July 2016, there were 355 genes in the existing creatures in the existing creatures. About 766 billion people on the earth, divided into approximately 200 countries and regions, interconnected by diplomacy, tourism, trade, media or war.\n\n\n== Names and resignation ==\nThe English name \"Earth\" of the earth is derived from the ancient English. Its history can be traced back to ancient English (often \"eorðe\"), there are homologous words in the Germanian language, and its original Germanian word is called \"* erþþ\" . Latin called \"Terra\", which is the name of the goddess of the ancient Roman mythology. The Greek is called \"gamma α\" (GAIA), this name is the name of the Greek mythology.\nThe word \"Earth\" earliest appeared in the Western East period of the Ming Dynasty, the first introduced the word is the Italian Missionary Macon (Matteo Ricci, 1552-1610), who used in \"Kunyi Wan Guo Full picture\" The word. In the late Qing Dynasty, Western modern science introduced China, and the ground was gradually accepted by the Chinese, \"Earth\" (also \"land\") was widely used, and the declaration was published in the first month of the publication of \"Earth\".\n\n\n== History ==\n\n\n=== Earth formation ===\n\nAccording to the measurement results of the radioactive date, the solar system is formed at approximately 45.6 ± 0.08 billion years ago, and the native earth is approximately 45.4 ± 2004 billion years ago. In theory, the formation of the sun begins with the gravitation of huge hydrogen molecular clouds in 4.6 billion years, most of the quality is concentrated in the center, forming the sun; the remainder is flattened, and it has formed a planetary disk. Then, the planet, satellite, meter, and other solar system are small. The nebula is advocated, and the microcomparies such as the earth originated from the relics of the gas, ice, dust, and the diameter of one to ten kilometers. According to this theory, the diameter of the substance constituting the native earth is approximately 10-20 wire, and these substances have been governed by 1,000 to 20 million years, and finally formative the native earth. The newly ease of Earth is \"ocean\" consisting of magma, not the water now.\nThe moon is approximately 453 million years ago, and the research on the origin of the moon has not yet concluded that the most popular hypothesis is a big collision. This hypothesis believes that there is a collision that is called Eiya's celestial and earth. This size is similar to Mars. Its quality is 10% of the earth. The collision has triggered a huge explosion. The burst of material flew into space. The lunar is formed by the toner, and some of the quality of Eiya has also melted into the earth. During this time from about 41 billion to 38 billion years, the monthly system entered the post-heavy bombing period, countless asteroids hit the surface of the moon, making a huge change in the surface of the moon, which can be speculated that the Earth at the time also encountered A lot of impact.\nThe earth's surface begins to cool the surface of the earth, forming a hard rock, and the gas released by the volcanic eruption forms a secondary atmosphere. The initial atmosphere may be composed of water vapor, carbon dioxide, nitrogen, and the evaporation of water vapor accelerate the cooling of the surface. After sufficient cooling, the heavy rain has been tens of thousands of years, and the rain is filled with the basin, forming the ocean. When the rainstorm reduces the water vapor content in the air, many carbon dioxide in the atmosphere is also washed away. In addition, the water and ice on the asteroid, the original planet and the comet are also one of the sources of water. Dark sun paradox pointed out that although the early sunlight is only about 7/10, but the greenhouse gas in the atmosphere is enough to avoid liquid water in the ocean. About 35 billion years ago, the Earth's magnetic field appeared, helping to prevent the atmosphere from being peeled off by the sun. The outer layer is cooled and solidified and forms a housing under the action of atmospheric water vapor. There are two models of land formation, one believes that land continues to grow, another more likely model thinks that the earth's history is rapidly generated, and then remains until now. The internal heat is continuously disabled, and the driver plate structure is formed to form a continent, and after hundreds of millions of years, the supermarine experiences three divided parties. About 750 million years ago, one of the earliest super continents - Rodinia has started division, and merged into Panonosa continent in 6 to 450 million years ago, then combined into an ancient continent, and finally about 1.8 billion years ago. Split. At present, the Earth is in the update of the Daxie Bing, and the high latitude area has undergone several rounds of frozen and thawled, and it is cycled every 40 to 10,000. The last continental frozen is about 10,000 years ago.\n\n\n=== Life evolution ===\n\nEarth provides the only environment that is known to maintain life evolution. It is believed that the high-energy chemical reaction of approximately 4 billion years has produced self-replicating molecules, and all the common ancestors of all lives have occurred in 500 million years, and then differentiated bacteria and gobacteria. Early life forms develop photosynthetic ability, can directly utilize solar energy, and release oxygen into the atmosphere. The oxygen accumulated in the atmosphere is subjected to ultraviolet rays emitted by the sun, forming ozone (O3) in the upper atmosphere, and there is an ozone layer. Early life exists in the form of prokaryotic organisms. According to the symbiotics, in the process of life evolution, some small cells are swallowed into large cells, which are coexisting into large cells, which becomes a large cells of the orchestr, thereby forming a relatively complex eukaryotic cell. Thereafter, the cells of each portion of the cell community gradually differentiate different functions, forming a true multi-cell organism. Since the ozone layer absorbs the harmful ultraviolet rays emitted by the sun, the land becomes suitable for life survival, and life begins to prison on land. The earliest fossil evidence left by life has a microbial pad fossil 3.48 billion years ago in sandstone in Western Australia, and the sonatic graphite in the Xiglinlan transparent debris rock, and the Rock in Western Australia 4.1 billion years ago. The former biomass wreck.\nJoseph Can Siwenk was first proposed to speculate that when the ancient New Yuan ancient ancient ice is 750 million years ago, the strong glacier activity made most of the surface of the earth in an ice, it is \"snow Purchase of the earth. The end of the end of Eddika Ji, which appeared in the end of Eddi Caji, and then there was a large outbreak of Han Wu Ji's life, and the varieties of multi-cell biological biological species on the earth were soared (such as clover, shrimp, etc.). After the Breakfast of Han Wu Ji, the earth experienced 5 biological clusters extinction events. Among them, the second stack of 251 million years ago - three stacking extinction events is the largest species extinction in geological history; and the nearest extinguishing incident in the distance is 66 million years ago - The ancient extinction event, the strikes of the asteroids make non-bird dinosaurs and other large reptiles, but some small animals have escaped, such as mammals like 鼩鼱. In the past 66 million years, mammals continued to differentiate. Millions of years ago Africa animals (such as Tuben in the original) learned upright. Thus they can better use tools, communicate with each other, thereby gaining more nutrients and stimulus, the brain is getting more and more developed, and finally evolving into humans. Humans have enjoyed the quality of life that has not been reached by any other species on the Earth with the development of agriculture and civilization, but also affects the earth and natural environment.\n\n\n=== For future prediction ===\n\nAfter 15 to 45 billion years, the glutinous angle of the Earth may have a maximum of 90 degrees. According to estimation, from now on, the complex life development of the Earth's surface is still young, the activities can continue to achieve great, maintaining approximately 5 to 1 billion years, but if the nitrogen in the atmosphere completely disappeared, this time will extend to 2.3 billion years. The Earth is closely connected to the fate of the distant future and the sun. As the core of the sun, the hydrogen continuous nuclear aggregation is generated into helium, the sun is increased slowly, increased by 10% after 11 billion, increased by 40% after 35 billion years. There are many, the speed of the sun release heat will continue to grow. According to the climate model, the earth's surface will eventually be affected by the rising sun radiation, which is originally only changed to the extreme crown in the tropics, and the ocean will vaporize and disappear.\nEarth surface temperature rise increases inorganic carbon circulation, reducing atmospheric carbon dioxide content. About 5 to 900 million years later, the carbon dioxide content in the atmosphere will gradually be low to 10 ppm. If there is no evolutionary process, even C4 plants can not survive. The lack of vegetation will cause the Earth's atmosphere to decrease, and the animals on the earth will extinct within millions of years. Since then, it is expected that there will be more than 100 billion years, and the surface water will disappear, and the average temperature of the Earth will also rise to 70 ° C (158 ° F). Even if the sun remains stable, because the vapor from the ridge in the ocean is reduced, 27% of the seawater will enter the mantle, and the decrease in seawater makes the temperature variations and unfavorable life.\n5 billion years later, the solar evolution became a red superstar, and the Earth's surface was no longer possible to form a complex molecule. The model predicts that the sun will expand to 250 times the current radius, that is, about 1 au (150,000,000 km), and the fate of the earth is still still unclear. When it is a red superstar, the sun will lose 30% of the quality. Therefore, if the impact of the tide is not considered, when the sun is in volume, the earth will move to the distance from the sun 1.7 au (250,000,000 km), get rid of the fate of the outer atmosphere falling into the expansion sun; however, even the solar brightness The peak will be 5,000 times the current, and the remaining organisms on earth are also difficult to escape the destiny of sunshine. A simulation in 2008 showed that the earth's orbit was attenuated due to the drag of the tidal effect, so that it fell into the sun atmospheric layer that has become a red superstar and evaporated.\n\n\n== Physical characteristics ==\n\n\n=== Form ===\n\nThe earth is roughly ellipsoid. The effect of the global rotation makes it slightly flat in the direction of the two poles, and there is slightly near the equator. From the ground, the Earth equator is 43 km (27 miles). Therefore, the earth's surface is the farthest level of the Earth is not the highest altitude of Everest, but is located on the mountains of Ecuadol, Ecuador, Ecuador. The Earth's reference ellipsoid is about 12,742 km (7,918 mile), about (40,000 km) / π, this integer is not coincidence, but because the initial definition of length unit meters is the equatorial and Northern Pole in Paris, Paris, France. One million eloquence of distance.\nSince the local terrain is undulating, the earth is slightly deviated from the ideal ellipsoid, but from the planetary scale, these undulations are small, the maximum deviation is only 0.17%, located 10,911 meters (35,797 feet) below the sea level. Maliana ditch and altitude 8,844 meters (29,016 feet), Mount Everest generated only 0.14% deviation. If the earth is contacted to the slopoline size, the earth is like a small flaw like a large mountain range and the ditch, while other most areas, including the North American plain and deep sea plains, more smooth.\n\n\n=== Chemical composition ===\n\nThe total mass of the Earth is about 5.97 × 1024 kg, ie 5,970 尧克 (YG). The main chemical elements constituting the earth are iron (32.1%), oxygen (30.1%), silicon (15.1%), magnesium (13.9%), sulfur (2.9%), nickel (1.8%), calcium (1.5%), aluminum (1.4%); the remaining 1.2% is other trace elements such as tungsten, gold, mercury, fluorine, boron, helium, and the like. Due to the reason for the quality layer, the quality is concentrated to the center), according to the estimation, the main chemical elements constituting the core nucleation are iron (88.8%), and the other constituent nuclear elements include nickel (5.8%) and sulfur (4.5%. ), As well as a total of less than 1% trace element. The main minerals constituting the mantle include pellets (chemical formula (Mg, Fe, Ca, Na) (Mg, Fe, Al) (Si, Al) 2O6), olivine (chemical formula (Mg, Fe) 2SiO4), and the like.\nAs for the chemical composition of the crust, oxygen is the highest in the crust, accounting for 46%. The oxygenated oxygenated compound in the crust includes water, silica, calcium sulfate, calcium carbonate, alumina, etc., and 10 compounds of the crustal content, and most of the compounds which constitute the crustal common rock are oxygenated. Some rocks are fluorides, sulfides and chlorides, but fluorine, sulfur and chlorine in any local rock formation is usually far from 1%. Saltered rocks covering more than 90% of the rocks in the shallow mesh is mainly composed of silica and silicate. Geochemical Frank Virga Vilk Clarke is based on 1,672 analyzes of various rocks. Inference 99.22% of the rocks are the oxides listed below, there are fewer components.\n\n\n=== Internal construct ===\n\nThe interior of the earth can be divided into several layers according to the chemical properties or physical (rheology) properties. However, the inner and outer cores of the earth have a significant difference, which is the characteristics of other planets. The outer layer of the Earth is a crust with a silicate mineral, and there is a mantle composition of a viscous solid. The boundary between the mantle and the crust is a Moh's discontinuous surface. The thickness of the crust is different from the position. Different, from the 6 km from the seabed to the land 30 to 50 kilometers. The crust and the mantle are colder, and the upper layer is known as a rock ring, and the plate is also formed in this region. The rock ring is below the low viscosity soft flow ring, and the rock ring slides above the soft flow ring. The major changes in the mantle crystal structure appear between the surfaces below 410 to 660 kilometers, which are the transition zone of the upper mantle and the lower mantle. Hereinafter, below the mantle is a core boundary of the mantle and the core, and then it is a very low viscosity of a liquid outer core, and the most inside is the solid intraocular core. The angular velocity of the mainland nuclear rotation may be more fast than the other parts of the earth, and is about 0.1-0.5 each year. The mainland nuclear radius 1, 220 kilometers, about 1/5 of the earth radius.\n\n\n=== Earth heat ===\n\nIn the heat generated in the earth, the residual heat of the suction is 20%, and the radioactive decay heat accounted for 80%. The thermophilic isotope in the Earth mainly has potassium-40, uranium-238, uranium-235 and -232. The temperature is up to 6,000 ° C (10,830 ° F), and the pressure can reach 360 GPA. Because many geothermal heats are from radioactivity, scientists speculate in the early days of the earth, before the half-life is not exhausted, the internal heat of the earth may have more than now, and it may be twice the present three billion years ago. Therefore, the temperature gradient of the Earth's radius will be greater, the rate of mantle convection and the plate structure is also faster, which may generate some rocks like Komaji, and now there is now a rock that is difficult to generate in geological conditions.\n\nThe average heat dissipation of the Earth surface is 87 mW m-2, and the total heat dissipation of the entire earth is 4.42 × 1013 W. The part of the core nucleation is boomed to the crust through high temperature lava, which is called a letter heating column. Therefore, a hot spot and overflowing mouse. The thermal energy of the earth will gradually rise into the middle and bine through the block configuration in the section. Another main way of thermal energy is mainly transmitted by the heat conduction of the rock circle, mainly in the seabed, because the shell in the sea is thinner than the terrestrial.\n\n\n=== Plate configuration ===\n\nRigid rock circles located in the outer layer are divided into several sections. These sectors are rigid, and the relative movement between the sectors occurs in the following three edges: one is the edge of the polymer plate, and the two plates are close to each other; the second is the edge of the separation plate, and the two plates are separated from each other; It is the edge of the transforming plate, which is mounted to each other in this two sectors. On the edge of these sectors, earthquakes, volcanic activities, rolling movements, and forming ditch. These sectors float on the soft flow ring.\nAs the sector drifts, the ocean plate is slid to below the front edge of the edge of the polymeric plate. At the same time, the mantle substance rises from the edge of the separation plate to the crust, producing a medium ridge. These processes have caused the ocean crust to constantly generate from the mantle, and the age of the marine crust is mostly less than 100 million. The oldest marine crust in the past, in the West Pacific area, its age is estimated to have about 200 million. In contrast, the oldest continental crust is approximately 4030 million years old.\nAt present, the main sector of the earth is the Pacific sector, the North American sector, Eurasia sector, African sector, Antarctic sector, India-Australia sector and South America sector. There is also arabic sector, the Caribbean sector, a Nasca plate located outside the West Coast of South America, and a sector such as Scothe Plate located in the South Atlantic. India - Australian sector is formed in the Australian sector and the Indian sector to fused before 50 million to 55 million years ago. In these sectors, the shift rate of the ocean plate is fast, the mainland block movement rate is slow: Cookos plate displacement rate of the ocean plate is 75 mm per year, the Pacific sector is shifted at a rate of 52 to 69 mm per year; and the European section Asia Continental sector, the average is from a rate of 21 mm per year.\n\n\n=== Landmform ===\n\nThe total surface area of ​​the Earth is about 510 million square kilometers, about 70.8% surface area is covered by water, and most of the crustal surfaces (361 million square kilometers) are below the sea level. The surface of the sea floor has a mountainous feature, including a global central ridge system, as well as the seabed volcano, ditch, seabed canyon, seabed plateau and deep sea plains. The remaining 29.2% (1 billion 48.94 million square kilometers, or 57.51 million square miles) are places that are not covered by water, including mountain, basins, plains, plateau and other terrain.\nThe surface of the earth is constructed and erosion, and has experienced long-term remodeling. The sector constructor changes geomorphology, wind, precipitation, thermal cycle, and chemical effects of surface erosion. Glacier effects, coast erosion, formation of coral reefs, and impact of large meteorites have an impact on the development of the landform.\nThe rocks of the Earth surface can be roughly divided into three categories: fire, sedimentary rock and metamorphic rock. Shumei is a rock formed by rising to the surface of magma or lava cooling solidification, also known as magma rock, is the main rock constituting the crust. Firecuro can be divided into two categories according to the causes: First, the invasion of the magma invaded the surface, which can be divided into deep-forming rocks and shallowed rocks according to the formation position, and common granite is an invasion. The second is the spurting rock formed by magma, and also known as volcanic rocks, such as Anshan, basalt. The mainland crust is mainly due to the low density of granite, the Anshan rock composition, and the ocean crust is mainly composed of dense basalt. Sedimentary rock is formed from deposits that are borne, buried and closely bonded together. Nearly 75% of the continental surface is covered by deposited rocks, although they only form about 5% of crusts, metamorite is a rock formed from the original rock through high pressure high temperature environment deterioration, such as marble. The most abundant silicate mineral surface of the Earth has quartz, long stone, angular flash, mica, glow and olivine. Common carbonate minerals have square solutions (found in limestone and dolomite). The soil circle is the outermost layer of the surface of the earth, consisting of soil and is affected by the soil formation process. The total area of ​​cultivated land occupies the total surface area, of which 1.3% is permanent cultivated land. Near 40% of the surface is used in farmland and pastures, including 1.3 × 107 square kilometers of farmland and 3.4 × 107 square kilometers of pastures. The lowest surface is located in the dead sea of ​​West Asia, with an altitude of approximately -420 meters, and the highest level of altitude is located in the Himalayan Mountains of China and Nepalese border, with an altitude of more than 8848 meters. The average sea level above sea level is 840 meters.\nTraditionally, the surface of the earth is divided into seven continents, four oceans and different sea areas. The earth is also divided into two hemispheres in the south hemisphere and the northern hemisphere with a pole, divided into the east hemisphere and western hemisphere, or is divided into water hemispheres in the semi-land distribution.\n\n\n=== Water ring ===\n\nIn the solar system, the surface is that the surface is covered with a large area of ​​the earth, which is different from other planets, and the Earth's alleged \"blue planet\" is then. The water circle on the earth is mainly composed of the ocean, while the land of land, lake, river, and deep underground water that can be deep to 2,000 meters have also account for a certain proportion. The survival of the Pacific Mariana Hugou is a deep abyment of 10,911.4 meters, and it is the deepest ocean.\nThe total mass of the Earth is about 1.35 × 1018 tons, which is equivalent to 1/4400 of the total quality of the earth. The ocean coverage is 3.618 × 108 square kilometers, with an average depth of 3682 meters, with a total volume of approximately 1.332 × 109 cubic kilometers. If all the surfaces on the earth are the same altitude, and it is a smooth spherical surface, the average depth of the Earth will be 2.7 to 2.8 km.\nThe water on the earth is about 97.5% is sea water, 2.5% is freshwater. And 68.7% of fresh water exists in the form of ice caps and glaciers.\nThe average salinity of the Earth's Shanghai Ocean is about 3.5%, that is, about 35 grams of salt per kilogram of salt. Most salts are produced in a volcanic effect and cooled fire. The ocean is also a reservoir that dissolves atmospheric gas, which is indispensable for many aquatic life. The ocean is a large heat storage, and its seawater has had a significant impact on the global climate. Changes in marine temperature distribution may have a big impact on weather changes, such as El Niño - southern oscillation. Affected by factors such as earth planet, the ocean on earth has a relatively stable foreign flow, and the foreign stream is mainly divided into \"warm current\" and \"cold flow\". The warmth is mainly \"warming and humidification\" in the nearby area of ​​the flow. Effect, cold flow.\n\n\n=== Active ring ===\n\nThe average air pressure of the Earth is 101.325 kPa, with a large air standard of about 8.5 km. The atmosphere of the Earth is made of 78% nitrogen, 21% oxygen, mixed trace of water vapor, carbon dioxide, and other gaseous molecules. The height of the flow layer varies from the latitude of the latitude, and the height of the triposphere near the equator is as high as 17 km, while the high level height near the pole is only 8 kilometers, and the height of the stream is also changed with the weather and seasonal factors.\nEarth's biosphere affects the Earth's atmosphere. The photosynthesis began to produce oxygen at 2.7 billion years ago, and finally formed is currently mainly atmospheric with nitrogen and oxygen. This change enables aerobic organisms to reproduce, and then the oxygen in the atmosphere is converted to ozone to form an ozone layer. The ozone layer blocks the ultraviolet rays in solar radiation, and the life on the earth is allowed to continue. For life, the important role of the atmosphere also includes transporting water vapor, providing the gas required for life, allowing the meteor to burn down before the ground, and adjust the temperature. Certain micro gas molecules in the atmosphere can absorb long wave radiation exudated from the surface, thereby raising the average temperature of the earth, which is a greenhouse effect. The greenhouse gas in the atmosphere mainly has water vapor, carbon dioxide, methane and ozone. If the earth does not have a greenhouse effect, the surface average temperature will only be -18 ° C (now + 15 ° C), and life is likely to not exist.\n\n\n==== Weather and climate ====\n\nThe atmosphere of the earth has no clear border. The farther away from the ground, the worse the air, and finally disappeared in outer space. Three quarters of the atmosphere are concentrated in 11 km from the ground watch. The energy from the sun heats the surface and the gas in the abutment of the stream, the air is thermally expanded, and the density is reduced, the surrounding gas is more cold, the gas is high, and the gas circulation is formed. This makes calories and produces a variety of weather phenomena and climatic conditions.\nThe main atmospheric circulation has a mid-latitude western wind strip with a latitude and latitude of 30 ° to 60 ° in the equatorial area of ​​30 ° latitude. The important factors that determine the climate also have octave, especially the heat of the heat from the equatorial waters to the polar region.\nThe water vapor evaporating surface evaporation also transports through the atmosphere. If the atmosphere is suitable, the warm and moist air rises, then the water vapor is condensed, and the precipitation falls back to the ground. Most of the precipitation flows through the river system to low altitude, usually returning to the ocean or gathered in the lake. This water cycle is an important reason for the Earth's energy to maintain life, and the main factor in erosion in the long geological period. The precipitation in various places is large, and there are thousands of millimeters from one year. The average precipitation of a region is determined by the atmospheric circulation, landform characteristics and temperature differences.\nThe solar energy obtained by the earth's surface is decreasing with the latitude. The high latitude region of the solar irradiation is small, and the atmosphere must pass through the sun, so the average temperature is low. Each increase in latitude is 1 degree, and the average temperature at sea level is reduced by about 0.4 ° C (0.7 ° F changes). The earth's surface can be divided into a plurality of latitude belts that are roughly similar, from the equator to the poles, are tropical, subtropical, temperate and polar climate. Different climatic types can be delineated depending on the temperature and excess of the water temperature and precipitation. Commonly used Keen Climate classification method divide the global climate into five categories: Class A Tropical climate, Class B Drought Climate, C-Temperal Climate, C Calm Tape Climate, E-Terminal Climate and Alpine Climate, Each Class is further Divided into several small classes.\nThe latitude is not the only factor of the climate. Since water is more hot than gears, marine climate is often more gentle than continental climate. In fact, the South Hemisphere is closer to the sun in the summer, leading to a large number of radiation accepted by the South Hemisphere. If the water area of ​​the southern hemisphere is larger than the northern hemisphere, the water is absorbed with excess radiation, and the average temperature in the south hemisphere will be 2.3 ° C higher than the northern half. The impact of atmospheric circulation and foreign flow is equally important. In high latitudes, the role of warmth and western wind, the climate in the West Bank of the mainland tends to be more gentle than the climate in the same latitude inland and the mainland. Northern Europe is in the Arctic Circle, but the climate is more appropriate. The low latitude of Canada and the Russian Far East have shown a cold polar climate. In the West Bank in the low latitude area of ​​South America, it is affected by the Cold Current of Peru, there is no heat in summer. In addition, the climate is also related to the height, the higher the sea level, the more cold climate.\nIn 1913, the 56.7 ° C (134.1 ° F) measured by the Furnace Valley in the National Park of California, USA, is the highest temperature measured by the Earth; in 1983, in 1983, it was measured by the Antarctic Swastock Station. -89.2 ° C (-128.6 ° F) For the lowest temperature measured by Earth, the remote sensing satellite has measured a temperature as low as -94.7 ° C (-138.5 ° F) in the eastern Antarctic container. These temperatures are only measured by modern instruments since the 20th century, which may have not fully reflected the range of earth temperatures.\n\n\n==== High-rise atmosphere ====\n\nAbove the absence of the flow layer, the atmosphere relatively high-level atmosphere is usually divided into a flat flow layer, an intermediate layer, a thermal layer, and a scattered layer. Each layer temperature varies depending on the high change. The upper portion of the flat layer is an ozone layer, which can partially absorb ultraviolet rays from the sun shoot to the surface, which is important for life on the earth. This also increases the temperature in the flat-flow layer as height increases. The temperature in the intermediate layer decreases as heights increase. In the hot layer, since the gas atom has strong absorption in solar radiation, the temperature increases sharply with the height. The upper portion of the hot layer is thin, the temperature is ionized, and the gas molecules are ionization, and the plasma is formed, and the ionosphere is formed. The dissipation layer extends extends, more thin, until the magnetic layer, where the ground magnetic field and the solar wind interaction are. The high altitude of the land table 100 km is a card door line, and it is considered that it is the boundaries of the atmosphere and outer space.\nDue to thermal exercise, some molecular speed of the outer edge of the atmosphere can be large enough to get rid of the earth gravity. This will cause the atmospheric gas to slowly disappear into space. Because the amount of free hydrogen molecular weight is small, it is easier to achieve the speed of the universe, and the rate of dissipation to outer space is faster. Among them, in terms of hydrogen gas loss, it is one of the reasons why Earth's atmosphere and surface from early reducing property becomes now. Although photosynthesis also provides some oxygen, it is believed that the reducing agent such as hydrogen disappears is a necessary premise that the atmosphere can widely accumulate oxygen, and therefore also affect the life form of the earth. Although oxygen and hydrogen in the atmosphere can be converted to water, most of its loss is destroyed from methane in high-rise atmosphere.\n\n\n=== Magnetic field ===\n\nThere is a static magnetic field in the interior of the earth and the surrounding space. According to the multi-pole of the static magnetic field, If the earth is approximated as a magnetic dipole, its magnetic moment size is 7.91 × 1015 T m3, and the ground is approximately absent from the ground, but there is a little deviation, the angle of the two is referred to as a geomagnetic offset. On the plane of the plane and the geosetic surface of the vertical distorted magnetic axis, the magnetic equagery intensity is about 3 × 10-5 t, and the magnetic shaft is intersecting the ground magnetic axis, and the magnetic induction intensity is about the ground magnetic equity. Twice the time. Depending on the generator fake, the geomagnetism mainly comes from the motion of the conductive fluid formed by iron and nickel. In the outer core of the core, the hot conductive fluid is turned through the effect of turning toward the force from the center to external convection, and generates a vortex to generate a magnetic field. The magnetic field generated by the vortex will antifest to the flow of the fluid, so that the motion of the fluid is approximately stable. However, since the convection motion itself is unstable, the direction of the ground magnetic axis will be slow, no regular, resulting in geomagnetic reversal. The cycle of geomagnetic reversal is not fixed, and each millions may occur several times. The most recent time has occurred 780,000 years ago, known as the cloth Nice - Songshan reversed.\nThe influence of geomagnetic in space is called the magnetic layer. The solar bonus is deflected by the magnetic layer, so it is unable to attack the Earth. The solar pressure will compress the magnetic layer to the area of ​​the sun to 10 earth radii, and the area away from the sun extends to grow. The solar wind is blown into the magnetic layer in the magnetic layer in supersonic to form an arcuate shock wave. The solar wind speed is therefore slowed, and a portion of the movable can be converted to thermal energy, so that the temperature of the nearby area is increased. Above the ionization layer, the low energy charged particles in the magnetic layer form a plasma layer, and the motion of the motion is dominated. Since the Earth's self-transgent affects the movement of the plasma, the plaqua will be transferred to the Earth. The particles in the magnetic layer in the magnetic layer are rotationally flowing around the shaft to form a cyclic current. The charged particles are oriented along the magnetic field wire, and the gradient of the ground magnetic field is oriented to the curvature, and the electron is drifted electronically, the positive ion drifts, thus forming a cyclic current. Van Allen radiation belt is a radiation area of ​​two layers of donuts, and the inner layer is mainly formed from high energy protons and electrons, and the outer layer also contains hetero-hetero-ion. These high-energy particles are captured by magnetic fields and move along the magnetic field line in a spiral form. When a magnetic storm occurs, the charged particles are deflected from the outer magnetic field along the magnetic field direction and collide with the atmosphere atom, and they excite them with ionization, and the aurora is generated.\n\n\n== Movement of the earth ==\n\n\n=== Cotion ===\n\nThe average cycle of the Earth relative to the sun is called a flat sun day, which is defined as the Pit Sun 86,400 seconds (equal to Si86, 400.0025 seconds). Because the tidal deceleration, now the earth's sun is slightly longer than the 19th century, with a length of 0 to 2 Si ms per day. The International Earth Self-Transfer Service (Iers), with a secondary unit of international units, and measured the length of the average sun day by 1623 to 2005 and 1962 to 2005.\nThe earth is called a stellar day, referred to as a star day, according to IERS measurements, 1 star day is equal to Pingyang (UT1) 86,164.098903691 seconds, i.e., 23H 56M 4.098903691S. Astronomical is often used as a stellar day with a stars in 1982 in 1982, in 1982, 1982, 56M 4.09053083288S. Since the spring points will move because of the difference between the age, this stellar day is about 8.4 milliseconds than the real star day.\nFrom the earth, the air in the air is 15 ° per hour, that is, the angular velocity of 15 'per minute (except for meteor in the low orbit in the atmosphere). Near the equals equator, the movement distance of each two is equivalent to the moon or the sun seen in the surface of the earth (almost the same).\n\n\n=== 公 转 ===\n\nThe average distance of the earth around the sun is about 150 × 106 km (93,000,000 miles), and each 365.2564 is turned a circle every 365.2564, called a constant star year. The publication allows the sun to about 1 ° in the east of the stars, each of which is equal to the sun or the visual diameter of the sun or the moon. Due to this movement, the Earth is about 24 hours, that is, a sun day, in order to turn around the axis, let the sun come again through Zhongtian. The average speed of the Earth is approximately 29.8 km / s (107,000 km / h), and 12,742 km (7,918 mi) can be intravenous within 7 minutes, and it is equivalent to the distance of the earth; about 3.54,000 km (239,000) The moon distance of mi).\nIn modern, the time in the near-day and far-reaching time appears from January 3 and July 4th, respectively. These two dates will change over time due to the impact of the progress and the change of track parameters. This change has periodic characteristics, namely Milanovic cycles. The changes in the earth and the sun are caused by running from far or day to near-day, the amount of solar energy is increased by 6.9%. Because the Southern Hemisphere is always the same time each year, when it is close to the reception, the sun is in the year, the Southern Hemisphere accepted more than the northern hemisphere. However, this effect is much smaller than the influence of axial tilt on total energy changes, and most of the more received energy has been absorbed by a high proportion of seawater in the southern hemisphere.\nRelative to the star background, the moon and the Earth are revolved every 27.32 weave a circle. Since the monthly system went around the sun, the interval between the two times, that is, the cycle of the looked down, the average is 29.53 days. From the Northern Northern Pole, the public around the earth and their rotation are counterclockwise. From the high point of the Earth and the Sun Arctic, the earth is also wrapped around the sun in counterclockwise, but the mutual track surface (ie, Huangdao) and the Earth equator are not coincident - the yellow road and the equatorial surface are 23.439281 ° (about 23 ° 26) The angle of '), the corner is also an angle of the rotating shaft and the mutual axis, referred to as a track inclination, a shaft inclination or yellow caller. The orbital plane (white road) of the moon around the earth is 5.1 ° with the zodiac angle. Without these tilts, there will be a sustained eclipse and an interchange of a month.\nThe Earth's gravity affects the range (Hill ball) radius is approximately 1.5 × 106 km (930,000 miles). This is the maximum distance of the Earth's gravity than the sun and the distant planet. The celestial body must enter this range to surround the earth, otherwise its track becomes unstable due to solar gravity, and it is possible to get rid of the earth.\nThe entire solar system, including the earth, is located in the center of the Milky Way, which is around the center of the Milky Way in the hunter arm of approximately 20 light years above the Galaxy plane. In 1990, the Traveler No. 1 was taken from 6.4 × 109 km (4 × 109 miles) to the Earth's image (dark blue point).\n\n\n=== inclination ===\n\nThe existence of the track inclination allows the earth to circulate around the sun, and the sun direct point is cyclically changed between the South Return line and the northern return line. The cycle is a return year, the time is 365.24219 flat sun days (ie: 365 days 5 hours 48 points 45 seconds). Different latitude regions in different latitudes and changes in the sun height in different latitude regions, which in turn makes the total amount of solar radiation accepted by these regions, resulting in seasonal changes. When the North Pole is closer to the sun, the sun direct point is located in the northern hemisphere. At this time, the northern hemisphere is short, the sun is high, for the summer half year; the southern hemisphere is short, the sun height is small, for the winter Half year; vice versa. In the northern temperature belt in the north of the north, the sun always rises from the southeast direction, falling to the southwest; in the south temperature belt, the sun rises from the northeast direction and falls in the northwest.\nIn the south, the northern hemisphere is in the summer, the higher the latitude, the longer the day, the shorter nights, the shortness of the day, the situation is white, called extreme day. In the vicinity of the pole, the six months of the summer is extremely extreme; the higher the latitude of the winter, the shorter the day, the longer the night, the pole, the whole day, the night is a night, called the extreme night. The pole near the pole is very night.\nIn a return year, the sun direct point is moved between the north and south. Direct point falls in northern return line, and the incident on the South Return is called \"two to\". The direct point will cross the equator twice, called \"second\". In the northern hemisphere, the winter solstice appeared before and after each year, summer supinity appeared around June 21, the spring component usually appeared on March 20, and the autumn is usually appeared on September 22 or September 23. In the southern hemisphere, spring feet, autumn; summer solstice, the date of the winter solstice is just the opposite of the Northern Hemisphere. Since the earth is not an ideal sphere, the yellow road, the white side and the equatorial surface exists, the sun and the moon have the amount of power applied to the Earth, so that the Earth will progress while rotating, the cycle It has been 258,000 years, which leads to the difference in the annuality of the annuality and the year of return, ie \"age\". The inclination angle of the earth has changed almost change over time, but due to the continuous change in the position of the sun and the moon, the Earth's external force is changed, the earth is rotating, the inclination angle will still have slight, no rules, The maximum cycle component is 18.6 years, which is consistent with the moon intersection. The earth is not an ideal rigid body, affected by geological movement, atmospheric movement, etc., the mass distribution of the earth changes, and the rotary pole point will also have a slight drift relative to the surface of the earth, and the position of each year will change several meters. Since 1900, the extremely drifted 20 meters. This drift is called the extreme. The extreme shift is a quasi-cycle movement, and the main cycle component includes a period of one year of motion and a period of 14 months. The former is usually considered to be related to atmospheric movement, and the latter is called Chandler swing. Since the rotation angle velocity of the Earth is larger than the moon and the moon, it is affected by tidal friction, the rotation angle speed of the earth is slowly decreased by time, in other words, the time will gradually grow.\n\n\n== Purchase ===\nIf the planet can sustain life, it can be called appropriate, even if life does not originate there. Earth can provide liquid water, complex organic molecules can assemble and interact in it, and sufficient energy to maintain metabolism. The distance between the Earth to the sun, the mid-rotation, axial inclinement, geological history, suitable atmosphere, and protective magnetic fields, resulting in the current climate conditions of the Earth's surface.\n\n\n=== Biosphere ===\n\nAll organisms living in the ecosystem of the planet are called the planetary biosphere. The biological circle of the earth began evolving from 35 billion years ago, and is divided into multiple bio groups, and the seed species of life in each biological group are basically the same. The biological group on the land mainly uses latitude, altitude and humidity. Anti-frozen, alpine frozen and extreme arid areas are rare, and the biodiversity is low; and the species in the ferrous rainforest are extremely rich, and the biodiversity is high.\n\n\n=== Natural resources and land use ===\n\nThe earth has a variety of natural resources for human mining utilization. Many of them are non-renewable energy such as fossil fuels, and the regeneration speed of these resources is very slow. Most fossil fuels are obtained from the crust, such as coal, oil and gas. Humans mainly use these fossil fuel to obtain raw materials from energy and chemical production. The ore is formed in the mineral process of the crust, and the mineral process is caused by magma, erosion and sector structure.\nEarth biospheres can produce many biological products for humans, including food, wood, medicines, oxygen, etc., and can reuse in many organic waste. On the land ecosystem relies on the soil and freshwater, the marine ecosystem relies on the dissolved nursery of land-flushing. In 1980, the world has 5.53 billion hectares (50.53 million square kilometers) woodland, 6.78 billion hectares (67.88 million square kilometers) grass and pastures, there is a $ 150.1 million hectare (15.01 million square kilometers) used as cultivated land. In 1993, there were 2,481,250 square kilometers (958,020 square miles) in the world. Humans use a variety of building materials in terns to build their own residence.\n\n\n=== Natural and environmental hazard ===\n\nThe large-scale regions of the Earth surface are affected by extreme weather such as tropical cyclones, typhoon, etc., which affect the survival of biology in the affected area. From 1980 to 2000, there were 11,800 people died in natural disasters. Among them, between 1900 and 1999, the famine contributing to drought is a disaster that causes the most death. In addition, the mantle convection is moved by the plate and causes environmental hazards such as earthquakes and volcanic activities. Earth's natural and environmental hazards also include mountain fires, floods, landslides, avalanches, etc., will cause death.\n\nHuman activities have brought environmental problems in many regions: water pollution, air pollution, acid rain, toxic substances, vegetation damage (overgraremia, deforestation and desertification), death, species extinction, soil degradation and Erosion and soil loss.\nAccording to the United Nations information, industrial activity emission carbon dioxide is closely related to global warming. It is predicted that global warming will bring glaciers and ice cover melts to the environment, and the temperature range is more extreme, major weather changes, and sea level rise.\n\n\n== Human geography ==\n\nThe map is about research and practice maps, geography is a discipline studying continent, constructing, residents and other phenomena on earth. Since ancient times, local maps and geography have been serving as part of the side of the Earth. Measurement is a method of measuring the location and distance of the measurement, and a small-scale navigation, certain position, and direction can be performed. Measurement is developed with mapology and geography, providing and properly quantifying some information.\nAs of October 31, 2011, the total population of the earth reached around 7 billion. It is predicted that the world population will reach 9.2 billion in 2050, of which developing countries will have a rapid growth of population. The difference in density in the world is huge, most of the population is in Asia. It is expected that 60% of the world will live in urban in 2020, rather than rural areas.\nIt is estimated that only one-third of the earth is suitable for humans living. Two-quarter of them covered sea water, one quarter is land. Desert (14%), alpine (27%), and other terrain that are not suitable for humans account for one-half of the total land area. The Alt (82 ° 28n) is located in the world's northernmost permanent residence in Canada, Canada; A Mumnson in Antarctica-Special Antarctic Station (90 ° s) It is the most southernmost permanent place of the world, which is almost completely close to the South Pole.\nThe land surface of the earth, except for some parts of the Antarctic, some land along the Danube West Bank and the independence of the sovereignty outside the unrempacious Bilteville between Egypt and the Sudan. The country has. As of 2015 (2015-Missing Required Parameter 1 = Month!), A total of 193 sovereignty countries in the world are United Nations Member States, and there are 2 observers, and 72 local and limited recognition countries. Although there are some national countries to have an attempt of the world, there has never been a sovereign government to rule the entire earth.\nThe United Nations is a global international organization that \"involves disputes between countries involving countries\" is an important platform for international law and international diplomacy. If the consensus of Member States is achieved, the United Nations can arrested some international affairs. On April 12, 1961, Yuri Alekseyevich Gaban became the first person who arrived in Earth orbit. As of July 30, 2010, a total of 487 people have been to space and enter the track to wind, and 12 of them are also involved in Apollo plans and walk in the moon. Under normal circumstances, the International Space Station is the only place in space. Members of the space station are composed of 6 people, and members are generally replaced every six months. Apollo No. 13 is 400,171 kilometers from the Earth from the 13th in 1970, the farthest arrived for humans.\n\n\n== Satellite ==\n\n\n=== Moon ===\n\nThe moon is the natural satellite of the earth, which is often called \"moon\" because ancient times will be called \"moon\". The diameter of the moon is about one quarter of the earth, and the structure is similar to the class planet. The moon is the solar system in the satellite - the planet is larger than the largest satellite. Although the ratio between Pluto and its satellite is larger, Pluto is a short star.\nThe gravitational role between the moon and the earth is the main reason for the phenomenon of the earth tide, while the moon is locked by the tide of the earth, so the rotation cycle of the moon is equal to the public rotation cycle around the earth, so that the moon ball is always in the same side toward the earth. The moon is illuminated by the sun and facing the earth, leading to changes in the moon phase, the dark part and the bright part are separated by the bright and dark boundaries.\n\nDue to the tidal interaction between the moon, the moon will gradually away from the Earth with a distance of approximately 38 mm per year, and the length of the earth's rotation increases by about 23 microseconds per year. Millions of years come over, these tiny changes have accumulated significant changes. For example, in the period of mud ball (about 419 million years ago), 400 days a year, and only 21.8 hours a day.\nThe moon can dramatically affect the development of the earth on the Earth's climate. Evidence and computer simulation of ancient biology showed that the glutinous angle of the earth was stable because the tidal interaction with the moon was stable. Some rodents believe that there is no such stable force against the torque generated by the sun and other planets to the Earth's equator, and the self-rotating axis of the earth will be chaotic; Mars is a ready-made example.\nThe diameter of the sun is about 400 times the moon, but it is also 400 times from the Earth, so the moon and the solar size of the earth are almost the same. This reason exactly causes the angular diameter (or three-dimensional angles) of the two days, so the earth can observe the whole food and daily risotes.\nRegarding the origin of the moon, a big collision is currently the most popular scientific hypothesis, but this assumption still has some problems that cannot be explained. This hypothesis believes that 4.5 billion years ago, a Mars size was hit by an early earth, and the residual fragments formed a moon. This hypothesis explains the moon with respect to the globe lack of iron and volatile elements, as well as the constituent and Earth's crusts almost the same reason.\n\n\n=== Asteroid and artificial satellite ===\n\nThe artificial earth satellite is built by human beings, surrounded by space aircraft running. As of early August 2020, the land in the land of 6,613, including expiration, existing US Sate 1 on the Earth orbit, there are more than 300,000 tens of space garbage, also surround the earth on the track. The world's largest artificial satellite is currently an international space station.\nIn addition to the moon and the artificial satellite, the earth currently has at least 5 commonplace small planets (quasi-satellite), four of which are on the earth track, surrounded by the sun, the sun runs, the sun is running around the sun - Krtny, 2002 AA29, 2016 HO3 and Troy Asteroid 2010 TK7 in the Earth Legrangon Day L4. Pretail Near Little Planet 2006 RH120, approximately every 20 years, close to the ground - monthly system, when it approaches the track.\n\n\n== Culture and historical view ==\n\nThe standard astronomical symbol of the earth is a circular cross \"🜨\" represents the world's four corners.\nThe image of Earth in human culture is different. Some cultures give the earth personality, will be a god. Many cultural plants are the mother gods of the supervisor. Gaia Seifa is born in the mid-20th century. This point of view makes the earth to self-regulate life, so that the earth can guarantee its overall stability and suitable for live. And the creation of the creation of religion has recorded, and the earth is innovative.\nWith the development of science and technology, the earth in human eyes is constantly changing. At first, the ancients of the East and the West believed in the sky. But in the 6th century BC, the circle proposed by Pythagoras replaced this view. The ancients have regarded the earth as the center of the universe, but the subsequent scholars determined that the same as many of the earth and the solar system is the planet rotating around the star. After Christian scholars and clergy propaganda, such as James Ukue uses the Bible pedigree to analyze the Earth age, Westerners have basically believed that the earth is more than a thousand years old. In the 19th century, the geologist found that the age of the earth should exceed a few million years. William Tomson inferred in 1864 with thermodynamics, and the Earth's age should be between 200,000 and 400 million. This conclusion triggered a fierce debate. In the late 19th century to the early 20th century, scientists were measured by radioactive doped year, and the birth time of Earth was several billion years. However, in the 20th century, the Apollo plans to begin, and human beings have observed the earth on the track, and photographs the photos of the earth, and the views of human beings have changed again.\n\n\n== See ==\nTower\nEarth Science\nEarth system science\nThe location of the earth in the universe\n\n\n== Comment ==\n\n\n== Reference material ==\n\n\n== External link ==\nEncyclopedia entry of national geographic channels \"Earth\" (English)\nEffect of climate change on the shape of the earth - NASA\nAmerican Geological Survey\nEarth Observatory - NASAC\nInternational space station related videos:\nFilm (01:02) - Earth (Huaji Photography)\nFilm (00:27) - Earth and Aurora (Shuttle Photography) "}