{"topic": "overpopulation", "english_title": "Overpopulation", "english": "Overpopulation or overabundance occurs when a species' population becomes so excessive that people deem it must be managed. It can result from an increase in births (fertility rate), a decline in the mortality rate, an increase in immigration, or a depletion of resources. When overpopulation occurs the available resources become too limited for the entire population to survive comfortably or at all in long term.\n\n\n== Background ==\nIn ecology, overpopulation is a concept used primarily in wildlife management. Typically, an overpopulation causes the entire population of the species in question to become weaker, as no single individual is able to find enough food or shelter. As such, overpopulation is thus characterised by an increase in the diseases and parasite-load which live upon the species in question, as the entire population is weaker. Other characteristics of overpopulation are lower fecundity, adverse effects on the environment (soil, vegetation or fauna) and lower average body weights. Especially the worldwide increase of deer populations, which usually show irruptive growth, is proving to be of ecological concern. Ironically, where ecologists were preoccupied with conserving or augmenting deer populations only a century ago, the focus has now shifted in the direct opposite, and ecologists are now more concerned with limiting the populations of such animals.Supplemental feeding of charismatic species or interesting game species is a major problem in causing overpopulation, as is too little hunting or trapping of such species. Management solutions are increasing hunting by making it easier or cheaper for (foreign) hunters to hunt, banning supplemental feeding, awarding bounties, forcing landowners to hunt or contract professional hunters, using immunocontraception, promoting the harvest of venison or other wild meats, introducing large predators (rewilding), poisonings or introducing diseases.\nA useful tool in wildlife culling is the use of mobile freezer trailers in which to store carcasses. The harvest of meat from wild animals is a sustainable method of creating a circular economy.Immunocontraception is more ethical for animal rights activists, but it has proved completely impractical.\n\n\n== Well studied species ==\n\n\n=== Deer ===\nIn Scotland the program of having landowners privately cull the overpopulation of red deer in the highlands has proved an abject failure. Scotland's deer are stunted, emaciated, and frequently starve in the Spring. As of 2016 the population is now so high, that 100,000 deer would need to be culled each year only to maintain the current population. A number of landowners have proven unwilling to accede to the law, requiring government intervention anyway. It has been necessary to contract professional hunters in order to satisfy landowner legislation regarding the annual cull. Millions of pounds of taxpayers' cash is spent on the annual cull. As of 2020, 100,000 deer are shot each year. Compounding the problem, some landowners have used supplemental feeding at certain shooting blinds in order to ease sport hunting.Overpopulation can have effects on forage plants, eventually causing a species to thus alter the greater environment. Natural ecosystems are extremely complex. The overpopulation of deer in Britain has been caused by legislation making hunting more difficult, but another reason may be the proliferation of forests, used by different deer species to breed and shelter. Forests and parks have caused Britain to be much more forested than it was in recent history, and may thus perversely be causing biodiversity loss, conversion of heath habitat to grassland, extirpation of grassland and woodland plants due to overgrazing and the changing of the habitat structure. Examples are bluebells and primroses. Deer open up the forest and reduce the amount of brambles, which then has knock-on effects on dormice and certain birds which nest near the ground, such as the capercaillie, dunnock, nightingale, song thrush, willow warbler, marsh tit, willow tit and bullfinch. Populations of the nightingale and the European turtle dove are believed to be primarily impacted by muntjac. Grouse populations suffer due to smashing into the fencing needed to protect against deer. On the other hand redstart and wood warblers may benefit from the more open understory created by the deer.A significant amount of the environmental destruction in Britain is caused by an overabundance of deer. Besides ecological effects, overpopulation of deer causes economic effects due to browsing on crops, expensive fencing needed to combat this and protect new afforestation planting and coppice growth, and increasing numbers of road traffic incidents. Deer are in fact the most lethal animals of Britain, killing approximately 20 people a year from road accidents. In Scotland, the cost of road accidents due to these animals is estimated to be £7million, and such collisions cause injuries to 50 to 100 people a year. High populations cause stripping of the bark of trees, eventually destroying forests. Protecting forests from deer costs on average three times as much as planting the forest in the first place. The NGO Trees for Life spent weeks planting native trees in Scotland, aiming to rebuild the ancient Caledonian Forest. After winter snowdrifts in 2014/2015 flattened the deer fences, more than a decade's growth was lost in a matter of weeks. In 2009 – 2010 the cost of forest protection in Scotland ran to £10.5m.Some animals, such as muntjac, are too small and boring for most hunters to shoot, which poses additional management problems.In the United States the exact same problem is seen with white-tailed deer, where populations have exploded and become invasive species in some areas. In continental Europe roe deer pose a similar problem, although the populations were formerly much less, they have swelled in the 20th century so that although two and a half million are shot each year by hunters in Western Europe alone, as of 1998, the population still appears to be increasing, causing problems for forestry and traffic. In an experiment where roe deer on a Norwegian island was freed from human harvest and predators, the deer showed a doubling of the population each year or two. In the Netherlands and southern England roe deer were extirpated from the entirety of the country except for a few small areas around 1875. In the 1970s the species was still completely absent from Wales, but as of 2013, it has colonized the entire country. As new forests were planted in the Netherlands in the 20th century, the population began to expand rapidly. As of 2016 there are some 110,000 deer in the country.\n\n\n=== Birds ===\nAquaculture operations, recreation angling and populations of endangered fish such as the schelly are impacted by cormorant populations. Open aquaculture ponds provide winter or year-round homes and food for cormorants. Cormorants' effect on the aquaculture industry is significant, with a dense flock capable of consuming an entire harvest. Cormorants are estimated to cost the catfish industry in Mississippi alone between $10 million and $25 million annually. Cormorant culling is commonly achieved by sharp-shooting, nest destruction, roost dispersal and oiling the eggs.Geese numbers have also been called overpopulated. In the Canadian Arctic region, snow geese, Ross's geese, greater white-fronted geese and some populations of Canada geese have been increasing significantly over the past decades. Lesser snow geese populations have increased to over three million, and continue to increase by some 5% per year. Giant Canada geese have grown from near extinction to nuisance levels. Average body sizes have decreased and parasite loads are higher. Before the 1980s, Arctic geese populations had boom and bust cycles (see above) thought to be based on food availability, although there are still some bust years, this no longer seems the case.It is difficult to know what the numbers of geese were before the 20th century, before human impact presumably altered them. There are a few anecdotal claims from that time of two or three million, but these are likely exaggerations, as that would imply a massive die-off or vast amounts harvested, for which there is no evidence. More likely estimates from the period of 1500 to 1900 are a few hundred thousand animals, which implies that with the exception of Ross's geese, modern populations of geese are many millions more than in pre-industrial levels.Humans are blamed as the ultimate cause for the increase, directly and indirectly, due to management legislation limiting hunting introduced specifically in order to protect bird populations, but most importantly due to the increase in agriculture and urban parks, which has had the effect of creating vast amounts of unintentional sanctuaries filled with food. Urban geese flocks have increased enormously. City ordinances generally prohibit discharging firearms, keeping such flocks safe, and there is abundant food. Geese profit from agricultural grain crops, and seem to be shifting their habitat preferences to such farmlands. Ironically, the creation of wildlife refuges may have exacerbated this: as geese overpopulations destroyed the Scirpus salt marsh habitats that they were originally restricted to, this has speeded their conversion to adopt new feeding habitats, while maintaining roosting sites in refuges. The creation of wildlife refuges to protect wetland habitats in the continental United States from the 1930s to 1950s seems to have had the effect of disrupting the migration routes, as geese no longer fly as far south to Texas and Louisiana as they once did. Reduction of goose hunting in the US since the 1970s seems to have further had the effect of protecting populations. In Canada hunting has also decreased dramatically, from 40% harvest rates in the 1960s to 8% in the 1990s. Nonetheless, when kill rates were compared to populations, hunting alone does not seems to be solely responsible for the increase -weather or a not yet completed shift in habitat preference to agricultural land may also be factors. Although hunting may have formerly been the main factor in maintaining stable populations, ecologists no longer consider it a practical management solution, as public interest in the practice has continued to wane, and the population is now so large that the massive culls needed are unrealistic to ask from the public. Climate change in the Arctic would appear to be an obvious cause for the increase, but when subpopulations are correlated with local climatic increases, this does not seem to hold true, and furthermore, breeding regions seem to be shifting southwards anyway, irrespective of climate change.The nutrient subsidy provided by foraging in agricultural land has made the overall landscape use by geese unsustainable. Where such geese congregate local plant communities have been substantially altered; these chronic effects are cumulative, and have been considered a threat to the Arctic ecosystems, due to knock-off effects on native ducks, shorebirds and passerines. Grubbing and overgrazing by geese completely denudes the tundra and marshland, in combination with abiotic processes, this creates large desert expanses of hypersaline, anoxic mud which continue to increase each year -eventually these habitat changes become irreversible remaining in this state for decades. Biodiversity drops to only one or two species which are inedible for geese, such as Senecio congestus, Salicornia borealis and Atriplex hastata. Because grazing occurs in serial stages, with biodiversity decreasing at each stage, floral composition may be used as an indicator of the degree of goose foraging at a site. Other effects are destruction of the vegetation holding dunes in place, the shift from sedge meadows and grassy swards with herbaceous plants to moss fields, which can eventually give way to bare ground called 'peat barrens', and the erosion of this bare peat until glacial gravel and till is bared. In the High Arctic research is less developed: Eriophorum scheuchzeri and E. angustifolium fens appear to be affected, and are being replaced by carpets of moss, whereas meadows covered in Dupontia fisheri appear to be escaping destruction. There does not appear to be the damage found at lower latitudes in the Arctic. There is little proper research in effects on other birds. The yellow rail (Coturnicops noveboracensis) appears to be extirpated from areas of Manitoba due habitat loss caused by the geese, whereas on the other hand the semipalmated plover (Charadrius semipalmatus) appears to be taking advantage of the large areas of dead willows as a breeding ground.In the wintering grounds in continental USA, effects are much less pronounced. Experimentally excluding geese by means of fencing in North Carolina has found heavily affected areas can regenerate after only two years. Bulrush stands (Schoenoplectus americanus) are still an important component of the diet, but there are indications the bulrush is being impacted, with soft mudflats gradually replacing areas where it grows.Damage to agriculture is primarily to seedlings, winter wheat and hay production. Changing the species composition to species less palatable to geese, such as Lotus may alleviate losses in hay operations. Geese also feed on agricultural land without causing economic loss, gleaning seeds from corn, soya or other grains and feeding on wheat, potato and corn stubble. In Québec crop damage insurance for the hay industry began in 1992 and claims increased yearly; actual compensation paid by the government, including administrative costs, amount to some half a million dollars a year.The fact that Arctic regions are remote, there is little public understanding for combatting the problem, and ecologists as yet do not have any effective solutions for combatting the problem anyway. In Canada, the most important hunters of geese are the Cree people around Hudson Bay, members of the Mushkegowuk Harvesters Association, with an average kill rate of up to 60.75 birds per species per hunter in the 1970s. Kill rates have dropped, with hunters taking only half as much in the 1990s. However, total numbers of kills have increased, i.e. there are more hunters, but they are killing less per person. Nonetheless, per household the kills are approximately the same, at 100 birds. This indicates that stimulating an increase in native hunting might be difficult to achieve. The Cree population has increased. Elders say the taste of the birds has gotten worse, and they are thinner, both possibly effects due to the overpopulation. Elders also say that hunting has gotten more difficult, because there are less young and goslings, which are more likely to fall for decoys. Inuit peoples and other peoples to the north do much less hunting of geese, with kill rates of 1 to 24 per species per hunter. Per kilogram, hunters save some $8.14 to $11.40 from buying poultry at stores. Total kill numbers from hunters elsewhere in the USA and southern Canada has been falling steadily. This is blamed on a decline in people interested in hunting, more feeding areas for the birds, and larger flocks with more experienced adult birds which makes decoying difficult. Individual hunters are bagging higher numbers, compensating lower hunter numbers.Management strategies in the USA include increasing the bag limit and the number of open hunting days, goose egg addling, trapping and relocation, and egg and nest destruction, managing habitat to make it less attractive to geese, harassment and direct culling. In Denver, Colorado, during moulting season biologists rounded up 300Canada geese (of 5,000 in the city), ironically on Canada Day, killing them and distributing the meat to needy families (as opposed to sending it to a landfill), to try to curb the number of geese, following such programs in New York, Pennsylvania, Oregon and Maryland. Complaints about the birds were that they had taken over the golf courses, pooped all over the place, devoured native plants and scared citizens. Such culls have proven socially controversial, with intense backlash by some citizens. Park officials had tried dipping eggs in oil, using noise-makers and planting tall plants, but this was not sufficient.In Russia, the problem does not seem to exist, likely due to human harvest and local long-term cooling climate trends in the Russian Far East and Wrangel Island.It is also possible that the population growth is completely natural, and that when the carrying capacity of the environment is reached the population will stop growing. For organisations such as Ducks Unlimited, the resurgence of goose populations in North America can be called one of the greatest success story in wildlife management. By 2003 the US goose harvest was approaching 4 million, three times the numbers 30 years ago.\n\n\n=== Pets ===\n\n\n== Population cycles ==\n\nIn the wild, rampant population growth of prey species often causes growth in the populations of predators. Such predator-prey relationships can form cycles, which are usually mathematically modelled as Lotka–Volterra equations.In natural ecosystems, predator population growth lags just behind the prey populations. After the prey population crashes, the overpopulation of predators causes the entire population to be subjected to mass starvation. The population of the predator drops, as less young are able to survive into adulthood. This could be considered a perfect time for wildlife managers to allow hunters or trappers to harvest as much of these animals as necessary, for example lynx in Canada, although on the other hand this may impact the ability of the predator to rebound when the prey population begins to exponentially increase again. Such mathematical models are also crucial in determining the amount of fish which may be sustainably harvested in fisheries, this is known as the maximum sustainable yield.Predator population growth has the effect of controlling the prey population, and can result in the evolution of prey species in favour of genetic characteristics that render it less vulnerable to predation (and the predator may co-evolve, in response).In the absence of predators, species are bound by the resources they can find in their environment, but this does not necessarily control overpopulation, at least in the short term. An abundant supply of resources can produce a population boom followed by a population crash. Rodents such as lemmings and voles have such population cycles of rapid growth and subsequent decrease. Snowshoe hares populations similarly cycle dramatically, as did those of one of their predators, the lynx. Another example is the cycles among populations of grey wolves and moose in Isle Royale National Park. For some still unexplained reason, such patterns in mammal population dynamics are more prevalent in ecosystems found at more arctic latitudes.Some species such as locusts experience large natural cyclic variations, experienced by farmers as plagues.\n\n\n== Introduced species ==\n\nThe introduction of a foreign species has often caused ecological disturbance, such as when  deer and trout were introduced into Argentina, or when rabbits were introduced to Australia and when predators were introduced in turn to attempt to control the rabbits.When an introduced species is so successful that its population begins to increase exponentially and causes deleterious effects to farmers, fisheries or the natural environment, these introduced species are called invasive species.\n\n\n== Criticism ==\nIn natural ecosystems, populations naturally expand until they reach the carrying capacity of the environment; if the resources on which they depend are exhausted, they naturally collapse. According to the animal rights movement, calling this an 'overpopulation' is more an ethics question than a scientific fact. Animal rights organisations are commonly critics of ecological systems and wildlife management. Animal rights activists and locals earning income from commercial hunts counter that scientists are outsiders who do not know wildlife issues, and that any slaughter of animals is evil.Various case studies indicate that use of cattle as 'natural grazers' in many European nature parks due to absence of hunting, culling or natural predators (such as wolves),may cause an overpopulation because the cattle do not migrate. This has the effect of reducing plant biodiversity, as the cattle consume native plants. Because such cattle populations begin to starve and die in the winter as available forage drops, this has caused animal rights activists to advocate supplemental feeding, which has the effect of exacerbating the ecological effects, causing nitrification and eutrophication due to excess faeces, deforestation as trees are destroyed, and biodiversity loss.Despite the ecological effects of overpopulation, wildlife managers may want such high populations in order to satisfy public enjoyment of seeing wild animals. Others contend that introducing large predators such as lynx and wolves may have similar economic benefits, even if tourists rarely actually catch glimpses of such creatures.\n\n\n== Human overpopulation ==\n\nOverpopulation can result from an increase in births, a decline in mortality rates against the background of high fertility rates. It is possible for very sparsely populated areas to be overpopulated if the area has a meagre or non-existent capability to sustain life (e.g. a desert). Advocates of population moderation cite issues like quality of life and risk of starvation and disease as a basis to argue against continuing high human population growth and for population decline.\n\n\n== References ==\n\n\n== See also ==\nOvershoot (population)", "chinese_title": "", "chinese": ""}