{"topic": "belief", "english_title": "Belief", "english": "A belief is an attitude that something is the case, or that some proposition about the world is true. In epistemology, philosophers use the term \"belief\" to refer to attitudes about the world which can be either true or false. To believe something is to take it to be true; for instance, to believe that snow is white is comparable to accepting the truth of the proposition \"snow is white\". However, holding a belief does not require active introspection. For example, few carefully consider whether or not the sun will rise tomorrow, simply assuming that it will. Moreover, beliefs need not be occurrent (e.g. a person actively thinking \"snow is white\"), but can instead be dispositional (e.g. a person who if asked about the color of snow would assert \"snow is white\").There are various different ways that contemporary philosophers have tried to describe beliefs, including as representations of ways that the world could be (Jerry Fodor), as dispositions to act as if certain things are true (Roderick Chisholm), as interpretive schemes for making sense of someone's actions (Daniel Dennett and Donald Davidson), or as mental states that fill a particular function (Hilary Putnam). Some have also attempted to offer significant revisions to our notion of belief, including eliminativists about belief who argue that there is no phenomenon in the natural world which corresponds to our folk psychological concept of belief (Paul Churchland) and formal epistemologists who aim to replace our bivalent notion of belief (\"either we have a belief or we don't have a belief\") with the more permissive, probabilistic notion of credence (\"there is an entire spectrum of degrees of belief, not a simple dichotomy between belief and non-belief\").Beliefs are the subject of various important philosophical debates. Notable examples include: \"What is the rational way to revise one's beliefs when presented with various sorts of evidence?\"; \"Is the content of our beliefs entirely determined by our mental states, or do the relevant facts have any bearing on our beliefs (e.g. if I believe that I'm holding a glass of water, is the non-mental fact that water is H2O part of the content of that belief)?\"; \"How fine-grained or coarse-grained are our beliefs?\"; and \"Must it be possible for a belief to be expressible in language, or are there non-linguistic beliefs?\".\n\n\n== Conceptions ==\nVarious conceptions of the essential features of beliefs have been proposed but there is no consensus as to which is the right one. Representationalism is the traditionally dominant position. In its most common form, it holds that beliefs are mental attitudes towards representations, which are usually identified with propositions. These attitudes are part of the internal constitution of the mind holding the attitude. This view contrasts with functionalism, which defines beliefs not in terms of the internal constitution of the mind but in terms of the function or the causal role played by beliefs. According to dispositionalism, beliefs are identified with dispositions to behave in certain ways. This view can be seen as a form of functionalism defining beliefs in terms of the behavior they tend to cause. Interpretationism constitutes another conception, which has gained popularity in contemporary philosophy. It holds that the beliefs of an entity are in some sense dependent on or relative to the interpretation of a third party of this entity. Representationalism tends to be associated with a mind-body-dualism. Naturalist considerations against this dualism are one of the motivations for choosing one of the alternative conceptions.\n\n\n=== Representationalism ===\nRepresentationalism characterizes beliefs in terms of mental representations. Representations are usually defined as objects with semantic properties, like having a content, referring to something, being true or false, etc. Beliefs form a special class of mental representations since they do not involve sensory qualities in order to represent something, unlike perceptions or episodic memories. Because of this, it seems natural to construe beliefs as attitudes towards propositions, which also constitute non-sensory representations, i.e. as propositional attitudes. As mental attitudes, beliefs are characterized both by their content and their mode. The content of an attitude is what this attitude is directed at: its object. Propositional attitudes are directed at propositions. Beliefs are usually distinguished from other propositional attitudes, like desires, by their mode or the way how they are directed at propositions. The mode of beliefs has a mind-to-world direction of fit: beliefs try to represent the world as it is, they do not intend to change it, unlike desires. For example, on this outlook, if Rahul believes that it will be sunny today, then he has a mental attitude towards the proposition \"It will be sunny today\" which affirms that this proposition is true. This is different from Sofía's desire that it will be sunny today, despite the fact that both Rahul and Sofía have attitudes toward the same proposition. The mind-to-world direction of fit of beliefs is sometimes expressed by saying that beliefs aim at truth. This aim is also reflected in the tendency to revise one's belief upon receiving new evidence that an old belief is false. So upon hearing the bad weather forecast, Rahul is likely to change his mental attitude but Sofía is not.\nThere are different ways of conceiving how mental representations are realized in the mind. One form is the language of thought hypothesis, which claims that mental representations have a language-like structure, sometimes referred to as mentalese. \nJust like regular language, this involves simple elements that are combined in various ways according to syntactic rules to form more complex elements that act as bearers of meaning. On this conception, holding a belief would involve storing such a complex element in one's mind. Different beliefs are separated from each other in that they correspond to different elements stored in the mind. A more holistic alternative to the language of thought hypothesis is the map-conception, which uses the analogy to maps to elucidate the nature of beliefs. According to this view, the belief-system of a mind should not be conceived as a set of many individual sentences but as a map encoding the information contained in these sentences. For example, the fact that Brussels is halfway between Paris and Amsterdam can be expressed both linguistically as a sentence and in a map through its internal geometrical relations.\n\n\n=== Functionalism ===\nFunctionalism contrasts with representationalism in that it defines beliefs not in terms of the internal constitution of the mind but in terms of the function or the causal role played by them. This view is often combined with the idea that the same belief can be realized in various ways and that it does not matter how it is realized as long as it plays the causal role characteristic to it. As an analogy, a hard drive is defined in a functionalist manner: it performs the function of storing and retrieving digital data. This function can be realized in many different ways: being made of plastic or steel, using magnetic tape or laser. Functionalists hold that something similar is true for beliefs (or mental states in general). Among the roles relevant for beliefs is their relation to perceptions and to actions: perceptions usually cause beliefs and beliefs cause actions. For example, seeing that the traffic light has switched to red is usually associated with the belief that it is red, which in turn causes the driver to bring the car to a halt. Functionalists use such characteristics to define beliefs: whatever is caused by perceptions in a certain way and also causes behavior in a certain way is called a belief. This is not just true for humans but may include animals, hypothetical aliens or even computers. From this perspective, it would make sense to ascribe the belief that the traffic light is red to a self-driving car behaving just like the human driver.\nDispositionalism is sometimes seen as a specific form of functionalism. It defines beliefs only concerning their role as causes of behavior or as dispositions to behave in a certain way.  For example, a belief that there is a pie in the pantry is associated with the disposition to affirm this when asked and to go to the pantry when hungry. While it is uncontroversial that beliefs shape our behavior, the thesis that beliefs can be defined exclusively through their role in producing behavior has been contested. The problem arises because the mechanisms shaping our behavior seem to be too complex to single out the general contribution of one particular belief for any possible situation. For example, one may decide not to affirm that there is a pie in the pantry when asked because one wants to keep it secret. Or one may not eat the pie despite being hungry because one also believes that it is poisoned. Due to this complexity, we are unable to define even a belief as simple as this one in terms of the behavioral dispositions for which it is responsible.\n\n\n=== Interpretationism ===\nAccording to interpretationism, the beliefs of an entity are in some sense dependent on or relative to the interpretation of a third party of this entity. Daniel Dennett is an important defender of such a position. He holds that we ascribe beliefs to entities in order to predict how they will behave. Entities with simple behavioral patterns can be described using physical laws or in terms of their function. Dennett refers to these forms of explanation as the physical stance and the design stance. These stances are contrasted with the intentional stance, which is applied to entities with a more complex behavior by ascribing beliefs and desires to these entities. For example, we can predict that a chess player will move her queen to f7 if we ascribe to her the desire to win the game and the belief that this move will achieve that. The same procedure can also be applied to predicting how a chess computer will behave. The entity has the belief in question if this belief can be used to predict its behavior. Having a belief is relative to an interpretation since there may be different equally good ways of ascribing beliefs to predict behavior. So there may be another interpretation that predicts the move of the queen to f7 that does not involve the belief that this move will win the game. Another version of interpretationism is due to Donald Davidson, who uses the thought experiment of radical interpretation, in which the goal is to make sense of the behavior and language of another person from scratch without any knowledge of this person's language. This process involves ascribing beliefs and desires to the speaker. The speaker really has these beliefs if this project can be successful in principle.Interpretationism can be combined with eliminativism and instrumentalism about beliefs. Eliminativists hold that, strictly speaking, there are no beliefs. Instrumentalists agree with eliminativists but add that belief-ascriptions are useful nonetheless. This usefulness can be explained in terms of interpretationism: belief-ascriptions help us in predicting how entities will behave. It has been argued that interpretationism can also be understood in a more realistic sense: that entities really have the beliefs ascribed to them and that these beliefs participate in the causal network. But for this to be possible, it may be necessary to define interpretivism as a methodology and not as an ontological outlook on beliefs.\n\n\n=== Historical ===\nIn the context of Ancient Greek thought, three related concepts were identified regarding the concept of belief: pistis, doxa, and dogma. Simplified, pistis refers to \"trust\" and \"confidence,\" doxa refers to \"opinion\" and \"acceptance,\" and dogma refers to the positions of a philosopher or of a philosophical school such as Stoicism.\n\n\n== Types ==\nBeliefs can be categorized into various types depending on their ontological status, their degree, their object or their semantic properties.\n\n\n=== Occurrent and dispositional ===\nHaving an occurrent belief that Ayers Rock is in Australia involves entertaining the representation associated with this belief, for example, by actively thinking about it. But the great majority of our beliefs are not active most of the time, they are merely dispositional. They usually become activated or occurrent when needed or relevant in some way and then fall back into their dispositional state afterward. For example, the belief that 57 is greater than 14 was probably dispositional to the reader before reading this sentence, has become occurrent while reading it and may soon become dispositional again as the mind focuses elsewhere. The distinction between occurrent and dispositional beliefs is sometimes identified with the distinction between conscious and unconscious beliefs. But it has been argued that despite overlapping, the two distinctions do not match. The reason for this is that beliefs can shape one's behavior and be involved in one's reasoning even if the subject is not conscious of them. Such beliefs are cases of unconscious occurrent mental states. On this view, being occurrent corresponds to being active, either consciously or unconsciously.A dispositional belief is not the same as a disposition to believe. \nWe have various dispositions to believe given the right perceptions, for example, to believe that it is raining given the perception of rain. Without this perception, there is still a disposition to believe but no actual dispositional belief. On a dispositionalist conception of beliefs, there are no occurrent beliefs since all beliefs are defined in terms of dispositions.\n\n\n=== Full and partial ===\nAn important dispute in formal epistemology concerns the question of whether beliefs should be conceptualized as full beliefs or as partial beliefs. Full beliefs are all-or-nothing attitudes: either one has a belief in a proposition or one does not. This conception is sufficient to understand many belief ascriptions found in everyday language, for example, Pedro's belief that the earth is bigger than the moon. But some cases involving comparisons between beliefs are not easily captured through full beliefs alone, for example, that Pedro's belief that the earth is bigger than the moon is more certain than his belief that the earth is bigger than Venus. Such cases are most naturally analyzed in terms of partial beliefs involving degrees of belief, so-called credences. The higher the degree of a belief, the more certain the believer is that the believed proposition is true. This is usually formalized by numbers between 0 and 1: a degree of 1 represents an absolutely certain belief, a belief of 0 corresponds to an absolutely certain disbelief and all the numbers in between correspond to intermediate degrees of certainty. In the Bayesian approach, these degrees are interpreted as subjective probabilities, e.g. a belief of degree 0.9 that it will rain tomorrow means that the agent thinks that the probability of rain tomorrow is 90 %. Bayesianism uses this relation between beliefs and probability to define the norms of rationality in terms of the laws of probability. This includes both synchronic laws about what one should believe at any moment and diachronic laws about how one should revise one's beliefs upon receiving new evidence.The central question in the dispute between full and partial beliefs is whether these two types are really distinct types or whether one type can be explained in terms of the other type. One answer to this question is called the Lockean thesis. It states that partial beliefs are basic and that full beliefs are to be conceived as partial beliefs above a certain threshold, for example, that every belief above 0.9 is a full belief. Defenders of a primitive notion of full belief, on the other hand, have tried to explain partial beliefs as full beliefs about probabilities. On this view, having a partial belief of degree 0.9 that it will rain tomorrow is the same as having a full belief that the probability of rain tomorrow is 90 %. Another approach circumvents the notion of probability altogether and replaces degrees of belief with degrees of disposition to revise one's full belief. From this perspective, both a belief of degree 0.6 and a belief of degree 0.9 may be seen as full beliefs. The difference between them is that the former belief can easily be changed upon receiving new evidence while the latter is more stable.\n\n\n=== Belief-in and belief-that ===\nTraditionally, philosophers have mainly focused in their inquiries concerning belief on the notion of belief-that. Belief-that can be characterized as a propositional attitude to a claim which is either true or false. Belief-in, on the other hand, is more closely related to notions like trust or faith in that it refers usually to an attitude to persons. Belief-in plays a central role in many religious traditions in which belief in God is one of the central virtues of their followers. The difference between belief-in and belief-that is sometimes blurry since various expressions using the term \"belief in\" seem to be translatable into corresponding expressions using the term \"belief that\" instead. For example, a belief in fairies may be said to be a belief that fairies exist. In this sense, belief-in is often used when the entity is not real, or its existence is in doubt. Typical examples would include: \"he believes in witches and ghosts\" or \"many children believe in Santa Claus\" or \"I believe in a deity\". Not all usages of belief-in concern the existence of something: some are commendatory in that they express a positive attitude towards their object. It has been suggested that these cases can also be accounted for in terms of belief-that. For example, a belief in marriage could be translated as a belief that marriage is good. Belief-in is used in a similar sense when expressing self-confidence or faith in one's self or one's abilities.\nDefenders of a reductive account of belief-in have used this line of thought to argue that belief in God can be analyzed in a similar way, e.g. that it amounts to a belief that God exists with his characteristic attributes, like omniscience and omnipotence. Opponents of this account often concede that belief-in may entail various forms of belief-that but that there are additional aspects to belief-in that are not reducible to belief-that. For example, a belief in an ideal may involve the belief that this ideal is something good, but it additionally involves a positive evaluative attitude toward this ideal that goes beyond a mere propositional attitude. Applied to the belief in God, opponents of the reductive approach may hold that a belief that God exists may be a necessary pre-condition for belief in God, but that it is not sufficient.\n\n\n=== De dicto and de re ===\nThe difference between de dicto and de re beliefs or the corresponding ascriptions concerns the contributions singular terms like names and other referential devices make to the semantic properties of the belief or its ascription. In regular contexts, the truth-value of a sentence does not change upon substitution of co-referring terms. For example, since the names \"Superman\" and \"Clark Kent\" refer to the same person, we can replace one with the other in the sentence \"Superman is strong\" without changing its truth-value. But this issue is more complicated in case of belief ascriptions. For example, Lois believes that Superman is strong but she does not believe that Clark Kent is strong. This difficulty arises due to the fact that she does not know that the two names refer to the same entity. Beliefs or belief ascriptions for which this substitution does not generally work are de dicto, otherwise, they are de re. So in a de re sense, Lois does believe that Clark Kent is strong, while in a de dicto sense she does not. The contexts corresponding to de dicto ascriptions are known as referentially opaque contexts while de re ascriptions are referentially transparent.\n\n\n=== Collective belief ===\nA collective belief is referred to when people speak of what \"we\" believe when this is not simply elliptical for what \"we all\" believe. Sociologist Émile Durkheim wrote of collective beliefs and proposed that they, like all \"social facts\", \"inhered in\" social groups as opposed to individual persons. Jonathan Dancy states that \"Durkheim's discussion of collective belief, though suggestive, is relatively obscure\". Philosopher Margaret Gilbert (1942- ) has offered a related account in terms of the joint commitment of a number of persons as a body to accept a certain belief. According to this account, individuals who together collectively believe something need not personally believe it individually. Gilbert's work on the topic has stimulated a developing literature among philosophers. One question that has arisen is whether and how philosophical accounts of belief in general need to be sensitive to the possibility of collective belief.\n\n\n== Belief contents ==\nAs mental representations, beliefs have contents. The content of a belief is what this belief is about or what it represents. Within philosophy, there are various disputes about how the contents of beliefs are to be understood. Holists and molecularists hold that the content of one particular belief depends on or is determined by other beliefs belonging to the same subject, which is denied by atomists. The question of dependence or determination also plays a central role in the internalism-externalism-debate. Internalism states that the contents of someone's beliefs depend only on what is internal to that person: they are determined entirely by things going on inside this person's head. Externalism, on the other hand, holds that the relations to one's environment also have a role to play in this.\n\n\n=== Atomism, molecularism and holism ===\nThe disagreement between atomism, molecularism and holism concerns the question of how the content of one belief depends on the contents of other beliefs held by the same subject. Atomists deny such dependence relations, molecularists restrict them to only a few closely related beliefs while holists hold that they may obtain between any two beliefs, however unrelated they seem. For example, assume that Mei and Benjamin both affirm that Jupiter is a planet. The most straightforward explanation, given by the atomists, would be that they have the same belief, i.e. that they hold the same content to be true. But now assume that Mei also believes that Pluto is a planet, which is denied by Benjamin. This indicates that they have different concepts of planet, which would mean that they were affirming different contents when they both agreed that Jupiter is a planet. This reasoning leads to molecularism or holism because the content of the Jupiter-belief depends on the Pluto-belief in this example.An important motivation for this position comes from W. V. Quine's confirmational holism, which holds that, because of this interconnectedness, we cannot confirm or disconfirm individual hypotheses, that confirmation happens on the level of the theory as a whole. Another motivation is due to considerations of the nature of learning: it is often not possible to understand one concept, like force in Newtonian physics, without understanding other concepts, like mass or kinetic energy. One problem for holism is that genuine disagreements seem to be impossible or very rare: disputants would usually talk past each other since they never share exactly the same web of beliefs needed to determine the content of the source of the disagreement.\n\n\n=== Internalism and externalism ===\nInternalism and externalism disagree about whether the contents of our beliefs are determined only by what's happening in our head or also by other factors. Internalists deny such a dependence on external factors. They hold that a person and a molecule-by-molecule copy would have exactly the same beliefs. Hilary Putnam objects to this position by way of his twin Earth thought experiment. He imagines a twin Earth in another part of the universe that is exactly like ours, except that their water has a different chemical composition despite behaving just like ours. According to Putnam, the reader's thought that water is wet is about our water while the reader's twin's thought on twin Earth that water is wet is about their water. This is the case despite the fact that the two readers have the same molecular composition. So it seems necessary to include external factors in order to explain the difference. One problem with this position is that this difference in content does not bring any causal difference with it: the two readers act in exactly the same way. This casts doubt on the thesis that there is any genuine difference in need of explanation between the contents of the two beliefs.\n\n\n== Epistemology ==\n\nEpistemology is concerned with delineating the boundary between justified belief and opinion, and involved generally with a theoretical philosophical study of knowledge. The primary problem in epistemology is to understand what is needed to have knowledge. In a notion derived from Plato's dialogue Theaetetus, where the epistemology of Socrates most clearly departs from that of the sophists, who appear to have defined knowledge as \"justified true belief\". The tendency to base knowledge (episteme) on common opinion (doxa) Socrates dismisses, results from failing to distinguish a dispositive belief (doxa) from knowledge (episteme) when the opinion is regarded correct (n.b., orthé not alethia), in terms of right, and juristically so (according to the premises of the dialogue), which was the task of the rhetors to prove. Plato dismisses this possibility of an affirmative relation between opinion and knowledge even when the one who opines grounds his belief on the rule, and is able to add justification (logos: reasonable and necessarily plausible assertions/evidence/guidance) to it.Plato has been credited for the justified true belief theory of knowledge, even though Plato in the Theaetetus elegantly dismisses it, and even posits this argument of Socrates as a cause for his death penalty. The epistemologists, Gettier and Goldman, have questioned the \"justified true belief\" definition.\n\n\n=== Justified true belief ===\nJustified true belief is a definition of knowledge that gained approval during the Enlightenment, \"justified\" standing in contrast to \"revealed\". There have been attempts to trace it back to Plato and his dialogues, more specifically in the Theaetetus, and the Meno.  The concept of justified true belief states that in order to know that a given proposition is true, one must not only believe the relevant true proposition, but also have justification for doing so. In more formal terms, an agent \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n   knows that a proposition \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n   is true if and only if:\n\n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n   is true\n\n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n   believes that \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n   is true, and\n\n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n   is justified in believing that \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n   is trueThis theory of knowledge suffered a significant setback with the discovery of Gettier problems, situations in which the above conditions were seemingly met but where many philosophers deny that anything is known. Robert Nozick suggested a clarification of \"justification\" which he believed eliminates the problem: the justification has to be such that were the justification false, the knowledge would be false. Bernecker and Dretske (2000) argue that \"no epistemologist since Gettier has seriously and successfully defended the traditional view.\" On the other hand, Paul Boghossian argues that the justified true belief account is the \"standard, widely accepted\" definition of knowledge.\n\n\n=== Belief systems ===\nA belief system comprises a set of mutually supportive beliefs. The beliefs of any such system can be religious, philosophical, political, ideological, or a combination of these.\n\n\n==== Glover's view ====\nPhilosopher Jonathan Glover, following Meadows (2008), says that beliefs are always part of a belief system, and that tenanted belief systems are difficult for the tenants to completely revise or reject. He suggests that beliefs have to be considered holistically, and that no belief exists in isolation in the mind of the believer. Each belief always implicates and relates to other beliefs. Glover provides the example of a patient with an illness who returns to a doctor, but the doctor says that the prescribed medicine is not working. At that point, the patient has a great deal of flexibility in choosing what beliefs to keep or reject: the patient could believe that the doctor is incompetent, that the doctor's assistants made a mistake, that the patient's own body is unique in some unexpected way, that Western medicine is ineffective, or even that Western science is entirely unable to discover truths about ailments.This insight has relevance for inquisitors, missionaries, agitprop groups and thought-police. The British philosopher Stephen Law has described some belief systems (including belief in homeopathy, psychic powers, and alien abduction) as \"claptrap\" and says that such belief-systems can \"draw people in and hold them captive so they become willing slaves of claptrap [...] if you get sucked in, it can be extremely difficult to think your way clear again\".\n\n\n== Religion ==\n\nReligious belief refers to attitudes towards mythological, supernatural, or spiritual aspects of a religion. Religious belief is distinct from religious practice and from religious behaviours – with some believers not practicing religion and some practitioners not believing religion. Religious beliefs, deriving from ideas that are exclusive to religion, often relate to the existence, characteristics and worship of a deity or deities, to the idea of divine intervention in the universe and in human life, or to the deontological explanations for the values and practices centered on the teachings of a spiritual leader or community. In contrast to other belief systems, religious beliefs are usually codified.\n\n\n=== Forms ===\nA popular view holds that different religions each have identifiable and exclusive sets of beliefs or creeds, but surveys of religious belief have often found that the official doctrine and descriptions of the beliefs offered by religious authorities do not always agree with the privately held beliefs of those who identify as members of a particular religion. For a broad classification of the kinds of religious belief, see below.\n\n\n==== Fundamentalism ====\n\nFirst self-applied as a term to the conservative doctrine outlined by anti-modernist Protestants in the United States, \"fundamentalism\" in religious terms denotes strict adherence to an interpretation of scriptures that are generally associated with theologically conservative positions or traditional understandings of the text and are distrustful of innovative readings, new revelation, or alternative interpretations. Religious fundamentalism has been identified in the media as being associated with fanatical or zealous political movements around the world that have used a strict adherence to a particular religious doctrine as a means to establish political identity and to enforce societal norms.\n\n\n==== Orthodoxy ====\n\nFirst used in the context of Early Christianity, the term \"orthodoxy\" relates to religious belief that closely follows the edicts, apologies, and hermeneutics of a prevailing religious authority. In the case of Early Christianity, this authority was the communion of bishops, and is often referred to by the term \"Magisterium\". The term orthodox was applied almost as an epithet to a group of Jewish believers who held to pre-Enlightenment understanding of Judaism – now known as Orthodox Judaism. The Eastern Orthodox Church of Christianity and the Catholic Church each consider themselves to be the true heir to Early Christian belief and practice. The antonym of \"orthodox\" is \"heterodox\", and those adhering to orthodoxy often accuse the heterodox of apostasy, schism, or heresy.\n\n\n==== Modernism/reform ====\nThe Renaissance and later the Enlightenment in Europe exhibited varying degrees of religious tolerance and intolerance towards new and old religious ideas. The philosophes took particular exception to many of the more fantastical claims of religions and directly challenged religious authority and the prevailing beliefs associated with the established churches. In response to the liberalizing political and social movements, some religious groups attempted to integrate Enlightenment ideals of rationality, equality, and individual liberty into their belief systems, especially in the nineteenth and twentieth centuries. Reform Judaism and Liberal Christianity offer two examples of such religious associations.\n\n\n=== Attitudes to other religions ===\nAdherents of particular religions deal with the differing doctrines and practices espoused by other religions or by other religious denominations in a variety of ways.\n\n\n==== Exclusivism ====\n\nPeople with exclusivist beliefs typically explain other beliefs either as in error, or as corruptions or counterfeits of the true faith. This approach is a fairly consistent feature among smaller new religious movements that often rely on doctrine that claims a unique revelation by the founders or leaders, and considers it a matter of faith that the \"correct\" religion has a monopoly on truth. All three major Abrahamic monotheistic religions have passages in their holy scriptures that attest to the primacy of the scriptural testimony, and indeed monotheism itself is often vouched as an innovation characterized specifically by its explicit rejection of earlier polytheistic faiths.\nSome exclusivist faiths incorporate a specific element of proselytization. This is a strongly-held belief in the Christian tradition which follows the doctrine of the Great Commission, and is less emphasized by the Islamic faith where the Quranic edict \"There shall be no compulsion in religion\" (2:256) is often quoted as a justification for toleration of alternative beliefs. The Jewish tradition does not actively seek out converts.\nExclusivism correlates with conservative, fundamentalist, and orthodox approaches of many religions, while pluralistic and syncretist approaches either explicitly downplay or reject the exclusivist tendencies within a religion.\n\n\n==== Inclusivism ====\nPeople with inclusivist beliefs recognize some truth in all faith systems, highlighting agreements and minimizing differences. This attitude is sometimes associated with Interfaith dialogue or with the Christian Ecumenical movement, though in principle such attempts at pluralism are not necessarily inclusivist and many actors in such interactions (for example, the Roman Catholic Church) still hold to exclusivist dogma while participating in inter-religious organizations. Explicitly inclusivist religions include many that are associated with the New Age movement, as well as modern reinterpretations of Hinduism and Buddhism. The Baháʼí Faith considers it doctrine that there is truth in all faith-systems.\nPluralism and syncretism are two closely related concepts. People with pluralist beliefs make no distinction between faith systems, viewing each one as valid within a particular culture. People with syncretic views blend the views of a variety of different religions or traditional beliefs into a unique fusion which suits their particular experiences and contexts (see eclecticism). Unitarian Universalism exemplifies a syncretic faith.\n\n\n=== Adherence ===\n\nTypical reasons for adherence to religion include the following:\n\nSome see belief in a deity as necessary for moral behavior.\nSome regard religious practices as serene, beautiful, and conducive to religious experiences, which in turn support religious beliefs.\nOrganized religions promote a sense of community among their followers, and the moral and cultural common ground of these communities makes them attractive to people with similar values. Indeed, while religious beliefs and practices are usually connected, some individuals with substantially secular beliefs still participate in religious practices for cultural reasons.\nEach religion asserts that it is a means by which its adherents may come into closer contact with the Divine, with Truth, and with spiritual power. They all promise to free adherents from spiritual bondage, and to bring them into spiritual freedom. It naturally follows that a religion which can free its adherents from deception, sin, and spiritual death will have significant mental-health benefits. Abraham Maslow's research after World War II showed that Holocaust survivors tended to be those who held strong religious beliefs (not necessarily temple attendance, etc.), suggesting that belief helped people cope in extreme circumstances. Humanistic psychology went on to investigate how religious or spiritual identity may have correlations with longer lifespan and better health. The study found that humans may particularly need religious ideas to serve various emotional needs such as the need to feel loved, the need to belong to homogeneous groups, the need for understandable explanations and the need for a guarantee of ultimate justice. Other factors may involve sense of purpose, sense of identity, or a sense of contact with the divine. See also Man's Search for Meaning, by Viktor Frankl, detailing his experience with the importance of religion in surviving the Holocaust. Critics assert that the very fact that religion was the primary selector for research subjects may have introduced a bias, and that the fact that all subjects were Holocaust survivors may also have had an effect. According to Larson et al. (2000), \"[m]ore longitudinal research with better multidimensional measures will help further clarify the roles of these [religious] factors and whether they are beneficial or harmful.\"Psychologist James Alcock also summarizes a number of apparent benefits which reinforce religious belief. These include prayer appearing to account for successful resolution of problems, \"a bulwark against existential anxiety and fear of annihilation,\" an increased sense of control, companionship with one's deity, a source of self-significance, and group identity.\n\n\n=== Apostasy ===\n\nTypical reasons for rejection of religion include:\n\nSome people regard certain fundamental doctrines of some religions as illogical, contrary to experience, or unsupported by sufficient evidence; such people may reject one or more religions for those reasons. Even some believers may have difficulty accepting particular religious assertions or doctrines. Some people believe the body of evidence available to humans to be insufficient to justify certain religious beliefs. They may thus disagree with religious interpretations of ethics and human purpose, or with various creation myths. This reason has perhaps been aggravated by the protestations and emphases of some fundamentalist Christians.\nSome religions include beliefs that certain groups of people are inferior or sinful and deserve contempt, persecution, or even death, and that non-believers will be punished for their unbelief in an after-life. Adherents to a religion may feel antipathy to unbelievers. Numerous examples exist of people of one religion or sect using religion as an excuse to murder people with different religious beliefs. To mention just a few examples:\nthe slaughter of the Huguenots by French Catholics in the sixteenth century\nHindus and Muslims killing each other when Pakistan separated from India in 1947\nthe persecution and killing of Shiite Muslims by Sunni Muslims in Iraq\nthe murder of Protestants by Catholics and vice versa in Ireland (both of these examples in the late twentieth century)\nthe Israeli–Palestinian conflict that continues as of 2018 – According to some critics of religion, such beliefs can encourage completely unnecessary conflicts and in some cases even wars. Many atheists believe that, because of this, religion is incompatible with world peace, freedom, civil rights, equality, and good government. On the other hand, most religions perceive atheism as a threat and will vigorously and even violently defend themselves against religious sterilization, making the attempt to remove public religious practices a source of strife.\nSome people may be unable to accept the values that a specific religion promotes and will therefore not join that religion. They may also be unable to accept the proposition that those who do not believe will go to hell or be damned, especially if said nonbelievers are close to the person.\nThe maintenance of life and the achievement of self-esteem require of a person the fullest exercise of reason—but morality (people are taught) rests on and requires faith.\n\n\n== Psychology ==\nMainstream psychology and related disciplines have traditionally treated belief as if it were the simplest form of mental representation and therefore one of the building blocks of conscious thought. Philosophers have tended to be more abstract in their analysis, and much of the work examining the viability of the belief concept stems from philosophical analysis.\nThe concept of belief presumes a subject (the believer) and an object of belief (the proposition). So, like other propositional attitudes, belief implies the existence of mental states and intentionality, both of which are hotly debated topics in the philosophy of mind, whose foundations and relation to brain states are still controversial.\nBeliefs are sometimes divided into core beliefs (that are actively thought about) and dispositional beliefs (that may be ascribed to someone who has not thought about the issue). For example, if asked \"do you believe tigers wear pink pajamas?\" a person might answer that they do not, despite the fact they may never have thought about this situation before.This has important implications for understanding the neuropsychology and neuroscience of belief. If the concept of belief is incoherent, then any attempt to find the underlying neural processes that support it will fail.\nPhilosopher Lynne Rudder Baker has outlined four main contemporary approaches to belief in her book Saving Belief:\nOur common-sense understanding of belief is correct – Sometimes called the \"mental sentence theory,\" in this conception, beliefs exist as coherent entities, and the way we talk about them in everyday life is a valid basis for scientific endeavor. Jerry Fodor was one of the principal defenders of this point of view.\nOur common-sense understanding of belief may not be entirely correct, but it is close enough to make some useful predictions – This view argues that we will eventually reject the idea of belief as we know it now, but that there may be a correlation between what we take to be a belief when someone says \"I believe that snow is white\" and how a future theory of psychology will explain this behavior. Philosopher Stephen Stich has argued for this particular understanding of belief.\nOur common-sense understanding of belief is entirely wrong and will be completely superseded by a radically different theory that will have no use for the concept of belief as we know it – Known as eliminativism, this view (most notably proposed by Paul and Patricia Churchland) argues that the concept of belief is like obsolete theories of times past such as the four humours theory of medicine, or the phlogiston theory of combustion. In these cases science has not provided us with a more detailed account of these theories, but completely rejected them as valid scientific concepts to be replaced by entirely different accounts. The Churchland argue that our common-sense concept of belief is similar in that as we discover more about neuroscience and the brain, the inevitable conclusion will be to reject the belief hypothesis in its entirety.\nOur common-sense understanding of belief is entirely wrong; however, treating people, animals, and even computers as if they had beliefs is often a successful strategy – The major proponents of this view, Daniel Dennett and Lynne Rudder Baker, are both eliminativists in that they hold that beliefs are not a scientifically valid concept, but they do not go as far as rejecting the concept of belief as a predictive device. Dennett gives the example of playing a computer at chess. While few people would agree that the computer held beliefs, treating the computer as if it did (e.g. that the computer believes that taking the opposition's queen will give it a considerable advantage) is likely to be a successful and predictive strategy. In this understanding of belief, named by Dennett the intentional stance, belief-based explanations of mind and behaviour are at a different level of explanation and are not reducible to those based on fundamental neuroscience, although both may be explanatory at their own level.Strategic approaches make a distinction between rules, norms and beliefs as follows:\n\nRules. Explicit regulative processes such as policies, laws, inspection routines, or incentives. Rules function as a coercive regulator of behavior and are dependent upon the imposing entity's ability to enforce them.\nNorms. Regulative mechanisms accepted by the social collective. Norms are enforced by normative mechanisms within the organization and are not strictly dependent upon law or regulation.\nBeliefs. The collective perception of fundamental truths governing behavior. The adherence to accepted and shared beliefs by members of a social system will likely persist and be difficult to change over time. Strong beliefs about determinant factors (i.e., security, survival, or honor) are likely to cause a social entity or group to accept rules and norms.\n\n\n=== Belief formation and revision ===\n\nAn extensive amount of scientific research and philosophical discussion exists around the modification of beliefs, which is commonly referred to as belief revision. Generally speaking, the process of belief revision entails the believer weighing the set of truths and/or evidence, and the dominance of a set of truths or evidence on an alternative to a held belief can lead to revision. One process of belief revision is Bayesian updating and is often referenced for its mathematical basis and conceptual simplicity. However, such a process may not be representative for individuals whose beliefs are not easily characterized as probabilistic.\nThere are several techniques for individuals or groups to change the beliefs of others; these methods generally fall under the umbrella of persuasion. Persuasion can take on more specific forms such as consciousness raising when considered in an activist or political context. Belief modification may also occur as a result of the experience of outcomes. Because goals are based, in part on beliefs, the success or failure at a particular goal may contribute to modification of beliefs that supported the original goal.\nWhether or not belief modification actually occurs is dependent not only on the extent of truths or evidence for the alternative belief, but also characteristics outside the specific truths or evidence. This includes, but is not limited to: the source characteristics of the message, such as credibility; social pressures; the anticipated consequences of a modification; or the ability of the individual or group to act on the modification. Therefore, individuals seeking to achieve belief modification in themselves or others need to consider all possible forms of resistance to belief revision.\nGlover maintains that any person can continue to hold any belief if they would really like to (for example, with help from ad hoc hypotheses). One belief can be held fixed, and other beliefs will be altered around it. Glover warns that some beliefs may not be entirely explicitly believed (for example, some people may not realize they have racist belief-systems adopted from their environment as a child). Glover believes that people tend to first realize that beliefs can change, and may be contingent on their upbringing, around age 12 or 15.\n Glover emphasizes that beliefs are difficult to change. He says that one may try to rebuild one's beliefs on more secure foundations (axioms), like building a new house, but warns that this may not be possible. Glover offers the example of René Descartes, saying: \"[Descartes] starts off with the characteristic beliefs of a 17th-century Frenchman; he then junks the lot, he rebuilds the system, and somehow it looks a lot like the beliefs of a 17th-century Frenchman.\" To Glover, belief systems are not like houses but are instead like boats. As Glover puts it: \"Maybe the whole thing needs rebuilding, but inevitably at any point you have to keep enough of it intact to keep floating.\"\n\n\n==== Models of belief formation ====\n\nPsychologists study belief formation and the relationship between beliefs and actions. Three types of models of belief formation and change have been proposed: conditional inference process models, linear models and information processing models.\nConditional inference process models emphasize the role of inference for belief formation. When people are asked to estimate the likelihood that a statement is true, they search their memory for information that has implications for the validity of this statement. Once this information has been identified, they estimate the likelihood that the statement would be true if the information were true, and the likelihood that the statement would be true if the information were false. If their estimates for these two probabilities differ, people average them, weighting each by the likelihood that the information is true and false. Thus, information bears directly on beliefs of another, related statement.Unlike the previous model, linear models take into consideration the possibility of multiple factors influencing belief formation. Using regression procedures, these models predict belief formation on the basis of several different pieces of information, with weights assigned to each piece on the basis of their relative importance.These information processing models address the fact that the responses people have to belief-relevant information is unlikely to be predicted from the objective basis of the information that they can recall at the time their beliefs are reported. Instead, these responses reflect the number and meaning of the thoughts that people have about the message at the time that they encounter it.Some influences on people's belief formation include:\n\nInternalization of beliefs during childhood, which can form and shape our beliefs in different domains. Albert Einstein is often quoted as having said that \"Common sense is the collection of prejudices acquired by age eighteen.\" Political beliefs depend most strongly on the political beliefs most common in the community where we live. Most individuals believe the religion they were taught in childhood.\nCharismatic leaders can form or modify beliefs (even if those beliefs fly in the face of all previous beliefs). Rational individuals need to reconcile their direct reality with any said belief; therefore, if belief is not present or possible, it reflects the fact that contradictions were necessarily overcome using cognitive dissonance.\nAdvertising can form or change beliefs through repetition, shock, and association with images of sex, love, beauty, and other strong positive emotions. Contrary to intuition, a delay, known as the sleeper effect, instead of immediate succession may increase an advertisement's ability to persuade viewer's beliefs if a discounting cue is present.\nPhysical trauma, especially to the head, can radically alter a person's beliefs.However, even educated people, well aware of the process by which beliefs form, still strongly cling to their beliefs, and act on those beliefs even against their own self-interest. In Anna Rowley's book, Leadership Therapy, she states \"You want your beliefs to change. It's proof that you are keeping your eyes open, living fully, and welcoming everything that the world and people around you can teach you.\" This means that peoples' beliefs should evolve as they gain new experiences.\n\n\n=== Prediction ===\nDifferent psychological models have tried to predict people's beliefs and some of them try to estimate the exact probabilities of beliefs. For example, Robert Wyer developed a model of subjective probabilities. When people rate the likelihood of a certain statement (e.g., \"It will rain tomorrow\"), this rating can be seen as a subjective probability value. The subjective probability model posits that these subjective probabilities follow the same rules as objective probabilities. For example, the law of total probability might be applied to predict a subjective probability value. Wyer found that this model produces relatively accurate predictions for probabilities of single events and for changes in these probabilities, but that the probabilities of several beliefs linked by \"and\" or \"or\" do not follow the model as well.\n\n\n=== Delusion ===\nDelusions are defined as fixed false beliefs that are not changed even when confronted with conflicting evidence.  Psychiatrist and historian G.E. Berrios (1940- ) has challenged the view that delusions are genuine beliefs and instead labels them as \"empty speech acts\", where affected persons are motivated to express false or bizarre belief statements due to an underlying psychological disturbance. However, the majority of mental health professionals and researchers treat delusions as if they were genuine beliefs.\n\n\n=== Emotion and beliefs ===\nResearch has indicated that emotion and cognition act in conjunction to produce beliefs, and more specifically emotion plays a vital role in the formation and maintenance of beliefs.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nRobert Audi. \"Dispositional Beliefs and Dispositions to Believe\", Noûs, Vol. 28, No. 4 (Dec., 1994), pp. 419–434. OCLC 481484099\nColeman III, T., Jong, J., & van Mulukom, V. (2018). Introduction to the Special Issue: What are Religious Beliefs?. Contemporary Pragmatism, 15(3), 279–283. doi:10.1163/18758185-01503001\nElisa Järnefelt, Created by Some Being: Theoretical and Empirical Exploration of Adults' Automatic and Reflective Beliefs about the Origin of Natural Phenomena. Diss. University of Helsinki, 2013. ISBN 978-952-10-9416-3.\nJ. Leicester, \"What beliefs are made from\". Sharjah, UAE: Bentham Science Publishers, 2016.\n\n\n== External links ==\n The dictionary definition of belief at Wiktionary\n The dictionary definition of belief system at Wiktionary\nSchwitzgebel, Eric. \"Belief\".  In Zalta, Edward N. (ed.). Stanford Encyclopedia of Philosophy.\n\"The Aim of Belief\". Internet Encyclopedia of Philosophy.", "chinese_title": "", "chinese": ""}