{"topic": "Agronomy", "english_title": "Agronomy", "english": "Agronomy is the science and technology of producing and using plants in agriculture for food, fuel, fiber, recreation, and land restoration. Agronomy has come to encompass work in the areas of plant genetics, plant physiology, meteorology, and soil science. It is the application of a combination of sciences like biology, chemistry, economics, ecology, earth science, and genetics. Professionals in the field of agronomy are called agronomists. \n\n\n== Plant breeding ==\n\nThis area of agronomy involves selective breeding of plants to produce the best crops under various conditions. Plant breeding has increased crop yields and has improved the nutritional value of numerous crops, including corn, soybeans, and wheat. It has also led to the development of new types of plants. For example, a hybrid grain called triticale was produced by crossbreeding rye and wheat. Triticale contains more usable protein than does either rye or wheat. Agronomy has also been instrumental in fruit and vegetable production research. Additionally, in turfgrass science, the use of plant breeding has led to reduction in need for fertilizer and water inputs (requirements) as well as turf-types which show increased resistance to diseases.\n\n\n== Biotechnology ==\n\nAgronomists use biotechnology to extend and expedite the development of desired characteristic.  Biotechnology is often a lab activity requiring field testing of the new crop varieties that are developed.\nIn addition to increasing crop yields agronomic biotechnology is increasingly being applied for novel uses other than food. For example, oilseed is at present used mainly for margarine and other food oils, but it can be modified to produce fatty acids for detergents, substitute fuels and petrochemicals.\n\n\n== Soil science ==\n\nAgronomists study sustainable ways to make soils more productive and profitable throughout the world. They classify soils and analyze them to determine whether they contain nutrients vital to plant growth. Common macronutrients analyzed include compounds of nitrogen, phosphorus, potassium, calcium, magnesium, and sulfur. Soil is also assessed for several micronutrients, like zinc and boron. The percentage of organic matter, Soil pH, and nutrient holding capacity (cation exchange capacity) are tested in a regional laboratory. Agronomists will interpret these lab reports and make recommendations to balance soil nutrients for optimal plant growth.\n\n\n=== Soil conservation ===\nIn addition, agronomists develop methods to preserve the soil and to decrease the effects of erosion by wind and water. For example, a technique called contour plowing may be used to prevent soil erosion and conserve rainfall. Researchers in agronomy also seek ways to use the soil more effectively in solving other problems. Such problems include the disposal of human and animal manure, water pollution, and pesticide build-up in the soil. As well as looking after the soil for future generations to come, such as the burning of paddocks after crop production. Pasture management techniques include no-till farming, planting of soil-binding grasses along contours on steep slopes, and using contour drains of depths up to 1 metre.\n\n\n== Agroecology ==\nAgroecology is the management of agricultural systems with an emphasis on ecological and environmental perspectives. This area is closely associated with work in the areas of sustainable agriculture, organic farming, and alternative food systems and the development of alternative cropping systems.\n\n\n== Theoretical modeling ==\nTheoretical production ecology tries to quantitatively study the growth of crops. The plant is treated as a kind of biological factory, which processes light, carbon dioxide, water, and nutrients into harvestable products. The main parameters considered are temperature, sunlight, standing crop biomass, plant production distribution, and nutrient and water supply.\n\n\n== See also ==\nAgricultural engineering\nAgricultural policy\nAgroecology\nAgrology\nAgrophysics\nCrop farming\nFood systems\nHorticulture\nGreen Revolution\nVegetable farming\n\n\n== References ==\n\n\n== Bibliography ==\nWendy B. Murphy, The Future World of Agriculture, Watts, 1984.\nAntonio Saltini, Storia delle scienze agrarie, 4 vols, Bologna 1984–89, ISBN 88-206-2412-5, ISBN 88-206-2413-3, ISBN 88-206-2414-1, ISBN 88-206-2415-X\n\n\n== External links ==\nThe American Society of Agronomy (ASA)\nCrop Science Society of America (CSSA)\nSoil Science Society of America (SSSA)\nEuropean Society for Agronomy\nThe National Agricultural Library (NAL) – Comprehensive agricultural library.\nInformation System for Agriculture and Food Research", "chinese_title": "", "chinese": ""}