{"topic": "Language", "english_title": "Language", "english": "A language is a structured system of communication used by humans, including speech (spoken language), gestures (sign language) and writing. The most widely-spoken languages have writing systems of glyphs that enable sounds or gestures to be inscribed for later reactivation.\nThe scientific study of language is called linguistics. Critical examinations of languages, such as philosophy of language, the relationships between language and thought, etc, such as how words represent experience, have been debated at least since Gorgias and Plato in ancient Greek civilization. Thinkers such as Rousseau (1712 – 1778) have debated that language originated from emotions, while others like Kant (1724 –1804), have held that languages originated from rational and logical thought. Twentieth century philosophers such as Wittgenstein (1889 – 1951) argued that philosophy is really the study of language itself. Major figures in contemporary linguistics of these times include Ferdinand de Saussure and Noam Chomsky.\nEstimates of the number of human languages in the world vary between 5,000 and 7,000. However, any precise estimate depends on the arbitrary distinction (dichotomy) between languages and dialect. Natural languages are spoken or signed, but any language can be encoded into secondary media using auditory, visual, or tactile stimuli – for example, in writing, whistling, signing, or braille. In other words, human language is modality-independent, but written or signed language is the way to inscribe or encode the natural human speech or gestures. Depending on philosophical perspectives regarding the definition of language and meaning, when used as a general concept, \"language\" may refer to the cognitive ability to learn and use systems of complex communication, or to describe the set of rules that makes up these systems, or the set of utterances that can be produced from those rules. All languages rely on the process of semiosis to relate signs to particular meanings. Oral, manual and tactile languages contain a phonological system that governs how symbols are used to form sequences known as words or morphemes, and a syntactic system that governs how words and morphemes are combined to form phrases and utterances.\nHuman language has the properties of productivity and displacement, and relies on social convention and learning. Its complex structure affords a much wider range of expressions than any known system of animal communication. Language is thought to have originated when early hominins started gradually changing their primate communication systems, acquiring the ability to form a theory of other minds and a shared intentionality. This development is sometimes thought to have coincided with an increase in brain volume, and many linguists see the structures of language as having evolved to serve specific communicative and social functions. Language is processed in many different locations in the human brain, but especially in Broca's and Wernicke's areas. Humans acquire language through social interaction in early childhood, and children generally speak fluently by approximately three years old. The use of language is deeply entrenched in human culture. Therefore, in addition to its strictly communicative uses, language also has many social and cultural uses, such as signifying group identity, social stratification, as well as social grooming and entertainment.\nLanguages evolve and diversify over time, and the history of their evolution can be reconstructed by comparing modern languages to determine which traits their ancestral languages must have had in order for the later developmental stages to occur. A group of languages that descend from a common ancestor is known as a language family; in contrast, a language that has been demonstrated to not have any living or non-living relationship with another language is called a language isolate. There are also many unclassified languages whose relationships have not been established, and spurious languages may have not existed at all. Academic consensus holds that between 50% and 90% of languages spoken at the beginning of the 21st century will probably have become extinct by the year 2100.\n\n\n== Definitions ==\n\nThe English word language derives ultimately from Proto-Indo-European *dn̥ǵʰwéh₂s \"tongue, speech, language\" through Latin lingua, \"language; tongue\", and Old French language. The word is sometimes used to refer to codes, ciphers, and other kinds of artificially constructed communication systems such as formally defined computer languages used for computer programming. Unlike conventional human languages, a formal language in this sense is a system of signs for encoding and decoding information. This article specifically concerns the properties of natural human language as it is studied in the discipline of linguistics.\nAs an object of linguistic study, \"language\" has two primary meanings: an abstract concept, and a specific linguistic system, e.g. \"French\". The Swiss linguist Ferdinand de Saussure, who defined the modern discipline of linguistics, first explicitly formulated the distinction using the French word langage for language as a concept, langue as a specific instance of a language system, and parole for the concrete usage of speech in a particular language.When speaking of language as a general concept, definitions can be used which stress different aspects of the phenomenon. These definitions also entail different approaches and understandings of language, and they also inform different and often incompatible schools of linguistic theory. Debates about the nature and origin of language go back to the ancient world. Greek philosophers such as Gorgias and Plato debated the relation between words, concepts and reality. Gorgias argued that language could represent neither the objective experience nor human experience, and that communication and truth were therefore impossible. Plato maintained that communication is possible because language represents ideas and concepts that exist independently of, and prior to, language.During the Enlightenment and its debates about human origins, it became fashionable to speculate about the origin of language. Thinkers such as Rousseau and Herder argued that language had originated in the instinctive expression of emotions, and that it was originally closer to music and poetry than to the logical expression of rational thought. Rationalist philosophers such as Kant and Descartes held the opposite view. Around the turn of the 20th century, thinkers began to wonder about the role of language in shaping our experiences of the world – asking whether language simply reflects the objective structure of the world, or whether it creates concepts that it in turn impose on our experience of the objective world. This led to the question of whether philosophical problems are really firstly linguistic problems. The resurgence of the view that language plays a significant role in the creation and circulation of concepts, and that the study of philosophy is essentially the study of language, is associated with what has been called the linguistic turn and philosophers such as Wittgenstein in 20th-century philosophy. These debates about language in relation to meaning and reference, cognition and consciousness remain active today.\n\n\n=== Mental faculty, organ or instinct ===\nOne definition sees language primarily as the mental faculty that allows humans to undertake linguistic behaviour: to learn languages and to produce and understand utterances. This definition stresses the universality of language to all humans, and it emphasizes the biological basis for the human capacity for language as a unique development of the human brain. Proponents of the view that the drive to language acquisition is innate in humans argue that this is supported by the fact that all cognitively normal children raised in an environment where language is accessible will acquire language without formal instruction. Languages may even develop spontaneously in environments where people live or grow up together without a common language; for example, creole languages and spontaneously developed sign languages such as Nicaraguan Sign Language. This view, which can be traced back to the philosophers Kant and Descartes, understands language to be largely innate, for example, in Chomsky's theory of Universal Grammar, or American philosopher Jerry Fodor's extreme innatist theory. These kinds of definitions are often applied in studies of language within a cognitive science framework and in neurolinguistics.\n\n\n=== Formal symbolic system ===\nAnother definition sees language as a formal system of signs governed by grammatical rules of combination to communicate meaning. This definition stresses that human languages can be described as closed structural systems consisting of rules that relate particular signs to particular meanings. This structuralist view of language was first introduced by Ferdinand de Saussure, and his structuralism remains foundational for many approaches to language.Some proponents of Saussure's view of language have advocated a formal approach which studies language structure by identifying its basic elements and then by presenting a formal account of the rules according to which the elements combine in order to form words and sentences. The main proponent of such a theory is Noam Chomsky, the originator of the generative theory of grammar, who has defined language as the construction of sentences that can be generated using transformational grammars. Chomsky considers these rules to be an innate feature of the human mind and to constitute the rudiments of what language is. By way of contrast, such transformational grammars are also commonly used in formal logic, in formal linguistics, and in applied computational linguistics. In the philosophy of language, the view of linguistic meaning as residing in the logical relations between propositions and reality was developed by philosophers such as Alfred Tarski, Bertrand Russell, and other formal logicians.\n\n\n=== Tool for communication ===\n\nYet another definition sees language as a system of communication that enables humans to exchange verbal or symbolic utterances. This definition stresses the social functions of language and the fact that humans use it to express themselves and to manipulate objects in their environment. Functional theories of grammar explain grammatical structures by their communicative functions, and understand the grammatical structures of language to be the result of an adaptive process by which grammar was \"tailored\" to serve the communicative needs of its users.This view of language is associated with the study of language in pragmatic, cognitive, and interactive frameworks, as well as in sociolinguistics and linguistic anthropology. Functionalist theories tend to study grammar as dynamic phenomena, as structures that are always in the process of changing as they are employed by their speakers. This view places importance on the study of linguistic typology, or the classification of languages according to structural features, as it can be shown that processes of grammaticalization tend to follow trajectories that are partly dependent on typology. In the philosophy of language, the view of pragmatics as being central to language and meaning is often associated with Wittgenstein's later works and with ordinary language philosophers such as J.L. Austin, Paul Grice, John Searle, and W.O. Quine.\n\n\n=== Distinctive features of human language ===\n\nA number of features, many of which were described by Charles Hockett and called design features set human language apart from communication used by non-human animals.\nCommunication systems used by other animals such as bees or apes are closed systems that consist of a finite, usually very limited, number of possible ideas that can be expressed. In contrast, human language is open-ended and productive, meaning that it allows humans to produce a vast range of utterances from a finite set of elements, and to create new words and sentences. This is possible because human language is based on a dual code, in which a finite number of elements which are meaningless in themselves (e.g. sounds, letters or gestures) can be combined to form an infinite number of larger units of meaning (words and sentences). However, one study has demonstrated that an Australian bird, the chestnut-crowned babbler, is capable of using the same acoustic elements in different arrangements to create two functionally distinct vocalizations. Additionally, pied babblers have demonstrated the ability to generate two functionally distinct vocalisations composed of the same sound type, which can only be distinguished by the number of repeated elements.Several species of animals have proved to be able to acquire forms of communication through social learning: for instance a bonobo named Kanzi learned to express itself using a set of symbolic lexigrams. Similarly, many species of birds and whales learn their songs by imitating other members of their species. However, while some animals may acquire large numbers of words and symbols, none have been able to learn as many different signs as are generally known by an average 4 year old human, nor have any acquired anything resembling the complex grammar of human language.Human languages differ from animal communication systems in that they employ grammatical and semantic categories, such as noun and verb, present and past, which may be used to express exceedingly complex meanings. It is distinguished by the property of recursivity: for example, a noun phrase can contain another noun phrase (as in \"[[the chimpanzee]'s lips]\") or a clause can contain another clause (as in \"[I see [the dog is running]]\"). Human language is the only known natural communication system whose adaptability may be referred to as modality independent. This means that it can be used not only for communication through one channel or medium, but through several. For example, spoken language uses the auditive modality, whereas sign languages and writing use the visual modality, and braille writing uses the tactile modality.Human language is unusual in being able to refer to abstract concepts and to imagined or hypothetical events as well as events that took place in the past or may happen in the future. This ability to refer to events that are not at the same time or place as the speech event is called displacement, and while some animal communication systems can use displacement (such as the communication of bees that can communicate the location of sources of nectar that are out of sight), the degree to which it is used in human language is also considered unique.\n\n\n== Origin ==\n\nTheories about the origin of language differ in regard to their basic assumptions about what language is. Some theories are based on the idea that language is so complex that one cannot imagine it simply appearing from nothing in its final form, but that it must have evolved from earlier pre-linguistic systems among our pre-human ancestors. These theories can be called continuity-based theories. The opposite viewpoint is that language is such a unique human trait that it cannot be compared to anything found among non-humans and that it must therefore have appeared suddenly in the transition from pre-hominids to early man. These theories can be defined as discontinuity-based. Similarly, theories based on the generative view of language pioneered by Noam Chomsky see language mostly as an innate faculty that is largely genetically encoded, whereas functionalist theories see it as a system that is largely cultural, learned through social interaction.Chomsky is one prominent proponent of a discontinuity-based theory of human language origins. He suggests that for scholars interested in the nature of language, \"talk about the evolution of the language capacity is beside the point.\" Chomsky proposes that perhaps \"some random mutation took place [...] and it reorganized the brain, implanting a language organ in an otherwise primate brain.\" Though cautioning against taking this story literally, Chomsky insists that \"it may be closer to reality than many other fairy tales that are told about evolutionary processes, including language.\"\nContinuity-based theories are held by a majority of scholars, but they vary in how they envision this development. Those who see language as being mostly innate, for example psychologist Steven Pinker, hold the precedents to be animal cognition, whereas those who see language as a socially learned tool of communication, such as psychologist Michael Tomasello, see it as having developed from animal communication in primates: either gestural or vocal communication to assist in cooperation. Other continuity-based models see language as having developed from music, a view already espoused by Rousseau, Herder, Humboldt, and Charles Darwin. A prominent proponent of this view is archaeologist Steven Mithen. Stephen Anderson states that the age of spoken languages is estimated at 60,000 to 100,000 years and that: Researchers on the evolutionary origin of language generally find it plausible to suggest that language was invented only once, and that all modern spoken languages are thus in some way related, even if that relation can no longer be recovered ... because of limitations on the methods available for reconstruction.\nBecause language emerged in the early prehistory of man, before the existence of any written records, its early development has left no historical traces, and it is believed that no comparable processes can be observed today. Theories that stress continuity often look at animals to see if, for example, primates display any traits that can be seen as analogous to what pre-human language must have been like. Early human fossils can be inspected for traces of physical adaptation to language use or pre-linguistic forms of symbolic behaviour. Among the signs in human fossils that may suggest linguistic abilities are: the size of the brain relative to body mass, the presence of a larynx capable of advanced sound production and the nature of tools and other manufactured artifacts.It was mostly undisputed that pre-human australopithecines did not have communication systems significantly different from those found in great apes in general. However, a 2017 study on Ardipithecus ramidus challenges this belief. Scholarly opinions vary as to the developments since the appearance of the genus Homo some 2.5 million years ago. Some scholars assume the development of primitive language-like systems (proto-language) as early as Homo habilis (2.3 million years ago) while others place the development of primitive symbolic communication only with Homo erectus (1.8 million years ago) or Homo heidelbergensis (0.6 million years ago), and the development of language proper with Anatomically Modern Homo sapiens with the Upper Paleolithic revolution less than 100,000 years ago.\n\n\n== Study ==\n\nThe study of language, linguistics, has been developing into a science since the first grammatical descriptions of particular languages in India more than 2000 years ago, after the development of the Brahmi script. Modern linguistics is a science that concerns itself with all aspects of language, examining it from all of the theoretical viewpoints described above.\n\n\n=== Subdisciplines ===\nThe academic study of language is conducted within many different disciplinary areas and from different theoretical angles, all of which inform modern approaches to linguistics. For example, descriptive linguistics examines the grammar of single languages, theoretical linguistics develops theories on how best to conceptualize and define the nature of language based on data from the various extant human languages, sociolinguistics studies how languages are used for social purposes informing in turn the study of the social functions of language and grammatical description, neurolinguistics studies how language is processed in the human brain and allows the experimental testing of theories, computational linguistics builds on theoretical and descriptive linguistics to construct computational models of language often aimed at processing natural language or at testing linguistic hypotheses, and historical linguistics relies on grammatical and lexical descriptions of languages to trace their individual histories and reconstruct trees of language families by using the comparative method.\n\n\n=== Early history ===\n\nThe formal study of language is often considered to have started in India with Pāṇini, the 5th century BC grammarian who formulated 3,959 rules of Sanskrit morphology. However, Sumerian scribes already studied the differences between Sumerian and Akkadian grammar around 1900 BC. Subsequent grammatical traditions developed in all of the ancient cultures that adopted writing.In the 17th century AD, the French Port-Royal Grammarians developed the idea that the grammars of all languages were a reflection of the universal basics of thought, and therefore that grammar was universal. In the 18th century, the first use of the comparative method by British philologist and expert on ancient India William Jones sparked the rise of comparative linguistics. The scientific study of language was broadened from Indo-European to language in general by Wilhelm von Humboldt. Early in the 20th century, Ferdinand de Saussure introduced the idea of language as a static system of interconnected units, defined through the oppositions between them.By introducing a distinction between diachronic and synchronic analyses of language, he laid the foundation of the modern discipline of linguistics. Saussure also introduced several basic dimensions of linguistic analysis that are still fundamental in many contemporary linguistic theories, such as the distinctions between syntagm and paradigm, and the Langue-parole distinction, distinguishing language as an abstract system (langue), from language as a concrete manifestation of this system (parole).\n\n\n=== Modern linguistics ===\n\nIn the 1960s, Noam Chomsky formulated the generative theory of language. According to this theory, the most basic form of language is a set of syntactic rules that is universal for all humans and which underlies the grammars of all human languages. This set of rules is called Universal Grammar; for Chomsky, describing it is the primary objective of the discipline of linguistics. Thus, he considered that the grammars of individual languages are only of importance to linguistics insofar as they allow us to deduce the universal underlying rules from which the observable linguistic variability is generated.In opposition to the formal theories of the generative school, functional theories of language propose that since language is fundamentally a tool, its structures are best analyzed and understood by reference to their functions. Formal theories of grammar seek to define the different elements of language and describe the way they relate to each other as systems of formal rules or operations, while functional theories seek to define the functions performed by language and then relate them to the linguistic elements that carry them out. The framework of cognitive linguistics interprets language in terms of the concepts (which are sometimes universal, and sometimes specific to a particular language) which underlie its forms. Cognitive linguistics is primarily concerned with how the mind creates meaning through language.\n\n\n== Physiological and neural architecture of language and speech ==\nSpeaking is the default modality for language in all cultures. The production of spoken language depends on sophisticated capacities for controlling the lips, tongue and other components of the vocal apparatus, the ability to acoustically decode speech sounds, and the neurological apparatus required for acquiring and producing language. The study of the genetic bases for human language is at an early stage: the only gene that has definitely been implicated in language production is FOXP2, which may cause a kind of congenital language disorder if affected by mutations.\n\n\n=== The brain ===\n\n The brain is the coordinating center of all linguistic activity; it controls both the production of linguistic cognition and of meaning and the mechanics of speech production. Nonetheless, our knowledge of the neurological bases for language is quite limited, though it has advanced considerably with the use of modern imaging techniques. The discipline of linguistics dedicated to studying the neurological aspects of language is called neurolinguistics.Early work in neurolinguistics involved the study of language in people with brain lesions, to see how lesions in specific areas affect language and speech. In this way, neuroscientists in the 19th century discovered that two areas in the brain are crucially implicated in language processing. The first area is Wernicke's area, which is in the posterior section of the superior temporal gyrus in the dominant cerebral hemisphere. People with a lesion in this area of the brain develop receptive aphasia, a condition in which there is a major impairment of language comprehension, while speech retains a natural-sounding rhythm and a relatively normal sentence structure. The second area is Broca's area, in the posterior inferior frontal gyrus of the dominant hemisphere. People with a lesion to this area develop expressive aphasia, meaning that they know what they want to say, they just cannot get it out. They are typically able to understand what is being said to them, but unable to speak fluently. Other symptoms that may be present in expressive aphasia include problems with word repetition. The condition affects both spoken and written language. Those with this aphasia also exhibit ungrammatical speech and show inability to use syntactic information to determine the meaning of sentences. Both expressive and receptive aphasia also affect the use of sign language, in analogous ways to how they affect speech, with expressive aphasia causing signers to sign slowly and with incorrect grammar, whereas a signer with receptive aphasia will sign fluently, but make little sense to others and have difficulties comprehending others' signs. This shows that the impairment is specific to the ability to use language, not to the physiology used for speech production.With technological advances in the late 20th century, neurolinguists have also incorporated non-invasive techniques such as functional magnetic resonance imaging (fMRI) and electrophysiology to study language processing in individuals without impairments.\n\n\n=== Anatomy of speech ===\n\nSpoken language relies on human physical ability to produce sound, which is a longitudinal wave propagated through the air at a frequency capable of vibrating the ear drum. This ability depends on the physiology of the human speech organs. These organs consist of the lungs, the voice box (larynx), and the upper vocal tract – the throat, the mouth, and the nose. By controlling the different parts of the speech apparatus, the airstream can be manipulated to produce different speech sounds.The sound of speech can be analyzed into a combination of segmental and suprasegmental elements. The segmental elements are those that follow each other in sequences, which are usually represented by distinct letters in alphabetic scripts, such as the Roman script. In free flowing speech, there are no clear boundaries between one segment and the next, nor usually are there any audible pauses between them. Segments therefore are distinguished by their distinct sounds which are a result of their different articulations, and can be either vowels or consonants. Suprasegmental phenomena encompass such elements as stress, phonation type, voice timbre, and prosody or intonation, all of which may have effects across multiple segments.Consonants and vowel segments combine to form syllables, which in turn combine to form utterances; these can be distinguished phonetically as the space between two inhalations. Acoustically, these different segments are characterized by different formant structures, that are visible in a spectrogram of the recorded sound wave. Formants are the amplitude peaks in the frequency spectrum of a specific sound.Vowels are those sounds that have no audible friction caused by the narrowing or obstruction of some part of the upper vocal tract. They vary in quality according to the degree of lip aperture and the placement of the tongue within the oral cavity. Vowels are called close when the lips are relatively closed, as in the pronunciation of the vowel [i] (English \"ee\"), or open when the lips are relatively open, as in the vowel [a] (English \"ah\"). If the tongue is located towards the back of the mouth, the quality changes, creating vowels such as [u] (English \"oo\"). The quality also changes depending on whether the lips are rounded as opposed to unrounded, creating distinctions such as that between [i] (unrounded front vowel such as English \"ee\") and [y] (rounded front vowel such as German \"ü\").Consonants are those sounds that have audible friction or closure at some point within the upper vocal tract. Consonant sounds vary by place of articulation, i.e. the place in the vocal tract where the airflow is obstructed, commonly at the lips, teeth, alveolar ridge, palate, velum, uvula, or glottis. Each place of articulation produces a different set of consonant sounds, which are further distinguished by manner of articulation, or the kind of friction, whether full closure, in which case the consonant is called occlusive or stop, or different degrees of aperture creating fricatives and approximants. Consonants can also be either voiced or unvoiced, depending on whether the vocal cords are set in vibration by airflow during the production of the sound. Voicing is what separates English [s] in bus (unvoiced sibilant) from [z] in buzz (voiced sibilant).Some speech sounds, both vowels and consonants, involve release of air flow through the nasal cavity, and these are called nasals or nasalized sounds. Other sounds are defined by the way the tongue moves within the mouth such as the l-sounds (called laterals, because the air flows along both sides of the tongue), and the r-sounds (called rhotics).By using these speech organs, humans can produce hundreds of distinct sounds: some appear very often in the world's languages, whereas others are much more common in certain language families, language areas, or even specific to a single language.\n\n\n== Structure ==\nWhen described as a system of symbolic communication, language is traditionally seen as consisting of three parts: signs, meanings, and a code connecting signs with their meanings. The study of the process of semiosis, how signs and meanings are combined, used, and interpreted is called semiotics. Signs can be composed of sounds, gestures, letters, or symbols, depending on whether the language is spoken, signed, or written, and they can be combined into complex signs, such as words and phrases. When used in communication, a sign is encoded and transmitted by a sender through a channel to a receiver who decodes it.\n\nSome of the properties that define human language as opposed to other communication systems are: the arbitrariness of the linguistic sign, meaning that there is no predictable connection between a linguistic sign and its meaning; the duality of the linguistic system, meaning that linguistic structures are built by combining elements into larger structures that can be seen as layered, e.g. how sounds build words and words build phrases; the discreteness of the elements of language, meaning that the elements out of which linguistic signs are constructed are discrete units, e.g. sounds and words, that can be distinguished from each other and rearranged in different patterns; and the productivity of the linguistic system, meaning that the finite number of linguistic elements can be combined into a theoretically infinite number of combinations.The rules by which signs can be combined to form words and phrases are called syntax or grammar. The meaning that is connected to individual signs, morphemes, words, phrases, and texts is called semantics. The division of language into separate but connected systems of sign and meaning goes back to the first linguistic studies of de Saussure and is now used in almost all branches of linguistics.\n\n\n=== Semantics ===\n\nLanguages express meaning by relating a sign form to a meaning, or its content. Sign forms must be something that can be perceived, for example, in sounds, images, or gestures, and then related to a specific meaning by social convention. Because the basic relation of meaning for most linguistic signs is based on social convention, linguistic signs can be considered arbitrary, in the sense that the convention is established socially and historically, rather than by means of a natural relation between a specific sign form and its meaning.Thus, languages must have a vocabulary of signs related to specific meaning. The English sign \"dog\" denotes, for example, a member of the species Canis familiaris. In a language, the array of arbitrary signs connected to specific meanings is called the lexicon, and a single sign connected to a meaning is called a lexeme. Not all meanings in a language are represented by single words. Often, semantic concepts are embedded in the morphology or syntax of the language in the form of grammatical categories.All languages contain the semantic structure of predication: a structure that predicates a property, state, or action. Traditionally, semantics has been understood to be the study of how speakers and interpreters assign truth values to statements, so that meaning is understood to be the process by which a predicate can be said to be true or false about an entity, e.g. \"[x [is y]]\" or \"[x [does y]]\". Recently, this model of semantics has been complemented with more dynamic models of meaning that incorporate shared knowledge about the context in which a sign is interpreted into the production of meaning. Such models of meaning are explored in the field of pragmatics.\n\n\n=== Sounds and symbols ===\n\nDepending on modality, language structure can be based on systems of sounds (speech), gestures (sign languages), or graphic or tactile symbols (writing). The ways in which languages use sounds or signs to construct meaning are studied in phonology.Sounds as part of a linguistic system are called phonemes. Phonemes are abstract units of sound, defined as the smallest units in a language that can serve to distinguish between the meaning of a pair of minimally different words, a so-called minimal pair. In English, for example, the words bat [bæt] and pat [pʰæt] form a minimal pair, in which the distinction between /b/ and /p/ differentiates the two words, which have different meanings. However, each language contrasts sounds in different ways. For example, in a language that does not distinguish between voiced and unvoiced consonants, the sounds [p] and [b] (if they both occur) could be considered a single phoneme, and consequently, the two pronunciations would have the same meaning. Similarly, the English language does not distinguish phonemically between aspirated and non-aspirated pronunciations of consonants, as many other languages like Korean and Hindi do: the unaspirated /p/ in spin [spɪn] and the aspirated /p/ in pin [pʰɪn] are considered to be merely different ways of pronouncing the same phoneme (such variants of a single phoneme are called allophones), whereas in Mandarin Chinese, the same difference in pronunciation distinguishes between the words [pʰá] 'crouch' and [pá] 'eight' (the accent above the á means that the vowel is pronounced with a high tone).All spoken languages have phonemes of at least two different categories, vowels and consonants, that can be combined to form syllables. As well as segments such as consonants and vowels, some languages also use sound in other ways to convey meaning. Many languages, for example, use stress, pitch, duration, and tone to distinguish meaning. Because these phenomena operate outside of the level of single segments, they are called suprasegmental. Some languages have only a few phonemes, for example, Rotokas and Pirahã language with 11 and 10 phonemes respectively, whereas languages like Taa may have as many as 141 phonemes. In sign languages, the equivalent to phonemes (formerly called cheremes) are defined by the basic elements of gestures, such as hand shape, orientation, location, and motion, which correspond to manners of articulation in spoken language.Writing systems represent language using visual symbols, which may or may not correspond to the sounds of spoken language. The Latin alphabet (and those on which it is based or that have been derived from it) was originally based on the representation of single sounds, so that words were constructed from letters that generally denote a single consonant or vowel in the structure of the word. In syllabic scripts, such as the Inuktitut syllabary, each sign represents a whole syllable. In logographic scripts, each sign represents an entire word, and will generally bear no relation to the sound of that word in spoken language.\nBecause all languages have a very large number of words, no purely logographic scripts are known to exist. Written language represents the way spoken sounds and words follow one after another by arranging symbols according to a pattern that follows a certain direction. The direction used in a writing system is entirely arbitrary and established by convention. Some writing systems use the horizontal axis (left to right as the Latin script or right to left as the Arabic script), while others such as traditional Chinese writing use the vertical dimension (from top to bottom). A few writing systems use opposite directions for alternating lines, and others, such as the ancient Maya script, can be written in either direction and rely on graphic cues to show the reader the direction of reading.In order to represent the sounds of the world's languages in writing, linguists have developed the International Phonetic Alphabet, designed to represent all of the discrete sounds that are known to contribute to meaning in human languages.\n\n\n=== Grammar ===\n\nGrammar is the study of how meaningful elements called morphemes within a language can be combined into utterances. Morphemes can either be free or bound. If they are free to be moved around within an utterance, they are usually called words, and if they are bound to other words or morphemes, they are called affixes. The way in which meaningful elements can be combined within a language is governed by rules. The study of the rules for the internal structure of words are called morphology. The rules of the internal structure of phrases and sentences are called syntax.\n\n\n==== Grammatical categories ====\n\nGrammar can be described as a system of categories and a set of rules that determine how categories combine to form different aspects of meaning. Languages differ widely in whether they are encoded through the use of categories or lexical units. However, several categories are so common as to be nearly universal. Such universal categories include the encoding of the grammatical relations of participants and predicates by grammatically distinguishing between their relations to a predicate, the encoding of temporal and spatial relations on predicates, and a system of grammatical person governing reference to and distinction between speakers and addressees and those about whom they are speaking.\n\n\n==== Word classes ====\nLanguages organize their parts of speech into classes according to their functions and positions relative to other parts. All languages, for instance, make a basic distinction between a group of words that prototypically denotes things and concepts and a group of words that prototypically denotes actions and events. The first group, which includes English words such as \"dog\" and \"song\", are usually called nouns. The second, which includes \"think\" and \"sing\", are called verbs. Another common category is the adjective: words that describe properties or qualities of nouns, such as \"red\" or \"big\". Word classes can be \"open\" if new words can continuously be added to the class, or relatively \"closed\" if there is a fixed number of words in a class. In English, the class of pronouns is closed, whereas the class of adjectives is open, since an infinite number of adjectives can be constructed from verbs (e.g. \"saddened\") or nouns (e.g. with the -like suffix, as in \"noun-like\"). In other languages such as Korean, the situation is the opposite, and new pronouns can be constructed, whereas the number of adjectives is fixed.Word classes also carry out differing functions in grammar. Prototypically, verbs are used to construct predicates, while nouns are used as arguments of predicates. In a sentence such as \"Sally runs\", the predicate is \"runs\", because it is the word that predicates a specific state about its argument \"Sally\". Some verbs such as \"curse\" can take two arguments, e.g. \"Sally cursed John\". A predicate that can only take a single argument is called intransitive, while a predicate that can take two arguments is called transitive.Many other word classes exist in different languages, such as conjunctions like \"and\" that serve to join two sentences, articles that introduce a noun, interjections such as \"wow!\", or ideophones like \"splash\" that mimic the sound of some event. Some languages have positionals that describe the spatial position of an event or entity. Many languages have classifiers that identify countable nouns as belonging to a particular type or having a particular shape. For instance, in Japanese, the general noun classifier for humans is nin (人), and it is used for counting humans, whatever they are called:\nsan-nin no gakusei (三人の学生) lit. \"3 human-classifier of student\" — three studentsFor trees, it would be:\n\nsan-bon no ki (三本の木) lit. \"3 classifier-for-long-objects of tree\" — three trees\n\n\n==== Morphology ====\nIn linguistics, the study of the internal structure of complex words and the processes by which words are formed is called morphology. In most languages, it is possible to construct complex words that are built of several morphemes. For instance, the English word \"unexpected\" can be analyzed as being composed of the three morphemes \"un-\", \"expect\" and \"-ed\".Morphemes can be classified according to whether they are independent morphemes, so-called roots, or whether they can only co-occur attached to other morphemes. These bound morphemes or affixes can be classified according to their position in relation to the root: prefixes precede the root, suffixes follow the root, and infixes are inserted in the middle of a root. Affixes serve to modify or elaborate the meaning of the root. Some languages change the meaning of words by changing the phonological structure of a word, for example, the English word \"run\", which in the past tense is \"ran\". This process is called ablaut. Furthermore, morphology distinguishes between the process of inflection, which modifies or elaborates on a word, and the process of derivation, which creates a new word from an existing one. In English, the verb \"sing\" has the inflectional forms \"singing\" and \"sung\", which are both verbs, and the derivational form \"singer\", which is a noun derived from the verb with the agentive suffix \"-er\".Languages differ widely in how much they rely on morphological processes of word formation. In some languages, for example, Chinese, there are no morphological processes, and all grammatical information is encoded syntactically by forming strings of single words. This type of morpho-syntax is often called isolating, or analytic, because there is almost a full correspondence between a single word and a single aspect of meaning. Most languages have words consisting of several morphemes, but they vary in the degree to which morphemes are discrete units. In many languages, notably in most Indo-European languages, single morphemes may have several distinct meanings that cannot be analyzed into smaller segments. For example, in Latin, the word bonus, or \"good\", consists of the root bon-, meaning \"good\", and the suffix -us, which indicates masculine gender, singular number, and nominative case. These languages are called fusional languages, because several meanings may be fused into a single morpheme. The opposite of fusional languages are agglutinative languages which construct words by stringing morphemes together in chains, but with each morpheme as a discrete semantic unit. An example of such a language is Turkish, where for example, the word evlerinizden, or \"from your houses\", consists of the morphemes, ev-ler-iniz-den with the meanings house-plural-your-from. The languages that rely on morphology to the greatest extent are traditionally called polysynthetic languages. They may express the equivalent of an entire English sentence in a single word. For example, in Persian the single word nafahmidamesh means I didn't understand it consisting of morphemes na-fahm-id-am-esh with the meanings, \"negation.understand.past.I.it\". As another example with more complexity, in the Yupik word tuntussuqatarniksatengqiggtuq, which means \"He had not yet said again that he was going to hunt reindeer\", the word consists of the morphemes tuntu-ssur-qatar-ni-ksaite-ngqiggte-uq with the meanings, \"reindeer-hunt-future-say-negation-again-third.person.singular.indicative\", and except for the morpheme tuntu (\"reindeer\") none of the other morphemes can appear in isolation.Many languages use morphology to cross-reference words within a sentence. This is sometimes called agreement. For example, in many Indo-European languages, adjectives must cross-reference the noun they modify in terms of number, case, and gender, so that the Latin adjective bonus, or \"good\", is inflected to agree with a noun that is masculine gender, singular number, and nominative case. In many polysynthetic languages, verbs cross-reference their subjects and objects. In these types of languages, a single verb may include information that would require an entire sentence in English. For example, in the Basque phrase ikusi nauzu, or \"you saw me\", the past tense auxiliary verb n-au-zu (similar to English \"do\") agrees with both the subject (you) expressed by the n- prefix, and with the object (me) expressed by the – zu suffix. The sentence could be directly transliterated as \"see you-did-me\"\n\n\n==== Syntax ====\n\nAnother way in which languages convey meaning is through the order of words within a sentence. The grammatical rules for how to produce new sentences from words that are already known is called syntax. The syntactical rules of a language determine why a sentence in English such as \"I love you\" is meaningful, but \"*love you I\" is not. Syntactical rules determine how word order and sentence structure is constrained, and how those constraints contribute to meaning. For example, in English, the two sentences \"the slaves were cursing the master\" and \"the master was cursing the slaves\" mean different things, because the role of the grammatical subject is encoded by the noun being in front of the verb, and the role of object is encoded by the noun appearing after the verb. Conversely, in Latin, both Dominus servos vituperabat and Servos vituperabat dominus mean \"the master was reprimanding the slaves\", because servos, or \"slaves\", is in the accusative case, showing that they are the grammatical object of the sentence, and dominus, or \"master\", is in the nominative case, showing that he is the subject.Latin uses morphology to express the distinction between subject and object, whereas English uses word order. Another example of how syntactic rules contribute to meaning is the rule of inverse word order in questions, which exists in many languages. This rule explains why when in English, the phrase \"John is talking to Lucy\" is turned into a question, it becomes \"Who is John talking to?\", and not \"John is talking to who?\". The latter example may be used as a way of placing special emphasis on \"who\", thereby slightly altering the meaning of the question. Syntax also includes the rules for how complex sentences are structured by grouping words together in units, called phrases, that can occupy different places in a larger syntactic structure. Sentences can be described as consisting of phrases connected in a tree structure, connecting the phrases to each other at different levels. To the right is a graphic representation of the syntactic analysis of the English sentence \"the cat sat on the mat\". The sentence is analyzed as being constituted by a noun phrase, a verb, and a prepositional phrase; the prepositional phrase is further divided into a preposition and a noun phrase, and the noun phrases consist of an article and a noun.The reason sentences can be seen as being composed of phrases is because each phrase would be moved around as a single element if syntactic operations were carried out. For example, \"the cat\" is one phrase, and \"on the mat\" is another, because they would be treated as single units if a decision was made to emphasize the location by moving forward the prepositional phrase: \"[And] on the mat, the cat sat\". There are many different formalist and functionalist frameworks that propose theories for describing syntactic structures, based on different assumptions about what language is and how it should be described. Each of them would analyze a sentence such as this in a different manner.\n\n\n=== Typology and universals ===\n\nLanguages can be classified in relation to their grammatical types. Languages that belong to different families nonetheless often have features in common, and these shared features tend to correlate. For example, languages can be classified on the basis of their basic word order, the relative order of the verb, and its constituents in a normal indicative sentence. In English, the basic order is SVO (subject–verb–object): \"The snake(S) bit(V) the man(O)\", whereas for example, the corresponding sentence in the Australian language Gamilaraay would be d̪uyugu n̪ama d̪ayn yiːy (snake man bit), SOV. Word order type is relevant as a typological parameter, because basic word order type corresponds with other syntactic parameters, such as the relative order of nouns and adjectives, or of the use of prepositions or postpositions. Such correlations are called implicational universals. For example, most (but not all) languages that are of the SOV type have postpositions rather than prepositions, and have adjectives before nouns.All languages structure sentences into Subject, Verb, and Object, but languages differ in the way they classify the relations between actors and actions. English uses the nominative-accusative word typology: in English transitive clauses, the subjects of both intransitive sentences (\"I run\") and transitive sentences (\"I love you\") are treated in the same way, shown here by the nominative pronoun I. Some languages, called ergative, Gamilaraay among them, distinguish instead between Agents and Patients. In ergative languages, the single participant in an intransitive sentence, such as \"I run\", is treated the same as the patient in a transitive sentence, giving the equivalent of \"me run\". Only in transitive sentences would the equivalent of the pronoun \"I\" be used. In this way the semantic roles can map onto the grammatical relations in different ways, grouping an intransitive subject either with Agents (accusative type) or Patients (ergative type) or even making each of the three roles differently, which is called the tripartite type.The shared features of languages which belong to the same typological class type may have arisen completely independently. Their co-occurrence might be due to universal laws governing the structure of natural languages, \"language universals\", or they might be the result of languages evolving convergent solutions to the recurring communicative problems that humans use language to solve.\n\n\n== Social contexts of use and transmission ==\n\nWhile humans have the ability to learn any language, they only do so if they grow up in an environment in which language exists and is used by others. Language is therefore dependent on communities of speakers in which children learn language from their elders and peers and themselves transmit language to their own children. Languages are used by those who speak them to communicate and to solve a plethora of social tasks. Many aspects of language use can be seen to be adapted specifically to these purposes. Due to the way in which language is transmitted between generations and within communities, language perpetually changes, diversifying into new languages or converging due to language contact. The process is similar to the process of evolution, where the process of descent with modification leads to the formation of a phylogenetic tree.However, languages differ from biological organisms in that they readily incorporate elements from other languages through the process of diffusion, as speakers of different languages come into contact. Humans also frequently speak more than one language, acquiring their first language or languages as children, or learning new languages as they grow up. Because of the increased language contact in the globalizing world, many small languages are becoming endangered as their speakers shift to other languages that afford the possibility to participate in larger and more influential speech communities.\n\n\n=== Usage and meaning ===\n\nWhen studying the way in which words and signs are used, it is often the case that words have different meanings, depending on the social context of use. An important example of this is the process called deixis, which describes the way in which certain words refer to entities through their relation between a specific point in time and space when the word is uttered. Such words are, for example, the word, \"I\" (which designates the person speaking), \"now\" (which designates the moment of speaking), and \"here\" (which designates the position of speaking). Signs also change their meanings over time, as the conventions governing their usage gradually change. The study of how the meaning of linguistic expressions changes depending on context is called pragmatics. Deixis is an important part of the way that we use language to point out entities in the world. Pragmatics is concerned with the ways in which language use is patterned and how these patterns contribute to meaning. For example, in all languages, linguistic expressions can be used not just to transmit information, but to perform actions. Certain actions are made only through language, but nonetheless have tangible effects, e.g. the act of \"naming\", which creates a new name for some entity, or the act of \"pronouncing someone man and wife\", which creates a social contract of marriage. These types of acts are called speech acts, although they can also be carried out through writing or hand signing.The form of linguistic expression often does not correspond to the meaning that it actually has in a social context. For example, if at a dinner table a person asks, \"Can you reach the salt?\", that is, in fact, not a question about the length of the arms of the one being addressed, but a request to pass the salt across the table. This meaning is implied by the context in which it is spoken; these kinds of effects of meaning are called conversational implicatures. These social rules for which ways of using language are considered appropriate in certain situations and how utterances are to be understood in relation to their context vary between communities, and learning them is a large part of acquiring communicative competence in a language.\n\n\n=== Acquisition ===\n\nAll healthy, normally developing human beings learn to use language. Children acquire the language or languages used around them: whichever languages they receive sufficient exposure to during childhood. The development is essentially the same for children acquiring sign or oral languages. This learning process is referred to as first-language acquisition, since unlike many other kinds of learning, it requires no direct teaching or specialized study. In The Descent of Man, naturalist Charles Darwin called this process \"an instinctive tendency to acquire an art\".\n\nFirst language acquisition proceeds in a fairly regular sequence, though there is a wide degree of variation in the timing of particular stages among normally developing infants. Studies published in 2013 have indicated that unborn fetuses are capable of language acquisition to some degree. From birth, newborns respond more readily to human speech than to other sounds. Around one month of age, babies appear to be able to distinguish between different speech sounds. Around six months of age, a child will begin babbling, producing the speech sounds or handshapes of the languages used around them. Words appear around the age of 12 to 18 months; the average vocabulary of an eighteen-month-old child is around 50 words. A child's first utterances are holophrases (literally \"whole-sentences\"), utterances that use just one word to communicate some idea. Several months after a child begins producing words, he or she will produce two-word utterances, and within a few more months will begin to produce telegraphic speech, or short sentences that are less grammatically complex than adult speech, but that do show regular syntactic structure. From roughly the age of three to five years, a child's ability to speak or sign is refined to the point that it resembles adult language.Acquisition of second and additional languages can come at any age, through exposure in daily life or courses. Children learning a second language are more likely to achieve native-like fluency than adults, but in general, it is very rare for someone speaking a second language to pass completely for a native speaker. An important difference between first language acquisition and additional language acquisition is that the process of additional language acquisition is influenced by languages that the learner already knows.\n\n\n=== Culture ===\n\nLanguages, understood as the particular set of speech norms of a particular community, are also a part of the larger culture of the community that speaks them. Languages differ not only in pronunciation, vocabulary, and grammar, but also through having different \"cultures of speaking.\" Humans use language as a way of signalling identity with one cultural group as well as difference from others. Even among speakers of one language, several different ways of using the language exist, and each is used to signal affiliation with particular subgroups within a larger culture. Linguists and anthropologists, particularly sociolinguists, ethnolinguists, and linguistic anthropologists have specialized in studying how ways of speaking vary between speech communities.Linguists use the term \"varieties\" to refer to the different ways of speaking a language. This term includes geographically or socioculturally defined dialects as well as the jargons or styles of subcultures. Linguistic anthropologists and sociologists of language define communicative style as the ways that language is used and understood within a particular culture.Because norms for language use are shared by members of a specific group, communicative style also becomes a way of displaying and constructing group identity. Linguistic differences may become salient markers of divisions between social groups, for example, speaking a language with a particular accent may imply membership of an ethnic minority or social class, one's area of origin, or status as a second language speaker. These kinds of differences are not part of the linguistic system, but are an important part of how people use language as a social tool for constructing groups.However, many languages also have grammatical conventions that signal the social position of the speaker in relation to others through the use of registers that are related to social hierarchies or divisions. In many languages, there are stylistic or even grammatical differences between the ways men and women speak, between age groups, or between social classes, just as some languages employ different words depending on who is listening. For example, in the Australian language Dyirbal, a married man must use a special set of words to refer to everyday items when speaking in the presence of his mother-in-law. Some cultures, for example, have elaborate systems of \"social deixis\", or systems of signalling social distance through linguistic means. In English, social deixis is shown mostly through distinguishing between addressing some people by first name and others by surname, and in titles such as \"Mrs.\", \"boy\", \"Doctor\", or \"Your Honor\", but in other languages, such systems may be highly complex and codified in the entire grammar and vocabulary of the language. For instance, in languages of east Asia such as Thai, Burmese, and Javanese, different words are used according to whether a speaker is addressing someone of higher or lower rank than oneself in a ranking system with animals and children ranking the lowest and gods and members of royalty as the highest.\n\n\n=== Writing, literacy and technology ===\n\nThroughout history a number of different ways of representing language in graphic media have been invented. These are called writing systems.\nThe use of writing has made language even more useful to humans. It makes it possible to store large amounts of information outside of the human body and retrieve it again, and it allows communication across physical distances and timespans that would otherwise be impossible. Many languages conventionally employ different genres, styles, and registers in written and spoken language, and in some communities, writing traditionally takes place in an entirely different language than the one spoken. There is some evidence that the use of writing also has effects on the cognitive development of humans, perhaps because acquiring literacy generally requires explicit and formal education.The invention of the first writing systems is roughly contemporary with the beginning of the Bronze Age in the late 4th millennium BC. The Sumerian archaic cuneiform script and the Egyptian hieroglyphs are generally considered to be the earliest writing systems, both emerging out of their ancestral proto-literate symbol systems from 3400–3200 BC with the earliest coherent texts from about 2600 BC. It is generally agreed that Sumerian writing was an independent invention; however, it is debated whether Egyptian writing was developed completely independently of Sumerian, or was a case of cultural diffusion. A similar debate exists for the Chinese script, which developed around 1200 BC. The pre-Columbian Mesoamerican writing systems (including among others Olmec and Maya scripts) are generally believed to have had independent origins.\n\n\n=== Change ===\n\nAll languages change as speakers adopt or invent new ways of speaking and pass them on to other members of their speech community. Language change happens at all levels from the phonological level to the levels of vocabulary, morphology, syntax, and discourse. Even though language change is often initially evaluated negatively by speakers of the language who often consider changes to be \"decay\" or a sign of slipping norms of language usage, it is natural and inevitable.Changes may affect specific sounds or the entire phonological system. Sound change can consist of the replacement of one speech sound or phonetic feature by another, the complete loss of the affected sound, or even the introduction of a new sound in a place where there had been none. Sound changes can be conditioned in which case a sound is changed only if it occurs in the vicinity of certain other sounds. Sound change is usually assumed to be regular, which means that it is expected to apply mechanically whenever its structural conditions are met, irrespective of any non-phonological factors. On the other hand, sound changes can sometimes be sporadic, affecting only one particular word or a few words, without any seeming regularity. Sometimes a simple change triggers a chain shift in which the entire phonological system is affected. This happened in the Germanic languages when the sound change known as Grimm's law affected all the stop consonants in the system. The original consonant *bʰ became /b/ in the Germanic languages, the previous *b in turn became /p/, and the previous *p became /f/. The same process applied to all stop consonants and explains why Italic languages such as Latin have p in words like pater and pisces, whereas Germanic languages, like English, have father and fish.Another example is the Great Vowel Shift in English, which is the reason that the spelling of English vowels do not correspond well to their current pronunciation. This is because the vowel shift brought the already established orthography out of synchronization with pronunciation. Another source of sound change is the erosion of words as pronunciation gradually becomes increasingly indistinct and shortens words, leaving out syllables or sounds. This kind of change caused Latin mea domina to eventually become the French madame and American English ma'am.Change also happens in the grammar of languages as discourse patterns such as idioms or particular constructions become grammaticalized. This frequently happens when words or morphemes erode and the grammatical system is unconsciously rearranged to compensate for the lost element. For example, in some varieties of Caribbean Spanish the final /s/ has eroded away. Since Standard Spanish uses final /s/ in the morpheme marking the second person subject \"you\" in verbs, the Caribbean varieties now have to express the second person using the pronoun tú. This means that the sentence \"what's your name\" is ¿como te llamas? [ˈkomo te ˈjamas] in Standard Spanish, but [ˈkomo ˈtu te ˈjama] in Caribbean Spanish. The simple sound change has affected both morphology and syntax. Another common cause of grammatical change is the gradual petrification of idioms into new grammatical forms, for example, the way the English \"going to\" construction lost its aspect of movement and in some varieties of English has almost become a full-fledged future tense (e.g. I'm gonna).\nLanguage change may be motivated by \"language internal\" factors, such as changes in pronunciation motivated by certain sounds being difficult to distinguish aurally or to produce, or through patterns of change that cause some rare types of constructions to drift towards more common types. Other causes of language change are social, such as when certain pronunciations become emblematic of membership in certain groups, such as social classes, or with ideologies, and therefore are adopted by those who wish to identify with those groups or ideas. In this way, issues of identity and politics can have profound effects on language structure.\n\n\n=== Contact ===\n\nOne important source of language change is contact and resulting diffusion of linguistic traits between languages. Language contact occurs when speakers of two or more languages or varieties interact on a regular basis. Multilingualism is likely to have been the norm throughout human history and most people in the modern world are multilingual. Before the rise of the concept of the ethno-national state, monolingualism was characteristic mainly of populations inhabiting small islands. But with the ideology that made one people, one state, and one language the most desirable political arrangement, monolingualism started to spread throughout the world. Nonetheless, there are only 250 countries in the world corresponding to some 6000 languages, which means that most countries are multilingual and most languages therefore exist in close contact with other languages.When speakers of different languages interact closely, it is typical for their languages to influence each other. Through sustained language contact over long periods, linguistic traits diffuse between languages, and languages belonging to different families may converge to become more similar. In areas where many languages are in close contact, this may lead to the formation of language areas in which unrelated languages share a number of linguistic features. A number of such language areas have been documented, among them, the Balkan language area, the Mesoamerican language area, and the Ethiopian language area. Also, larger areas such as South Asia, Europe, and Southeast Asia have sometimes been considered language areas, because of widespread diffusion of specific areal features.Language contact may also lead to a variety of other linguistic phenomena, including language convergence, borrowing, and relexification (replacement of much of the native vocabulary with that of another language). In situations of extreme and sustained language contact, it may lead to the formation of new mixed languages that cannot be considered to belong to a single language family. One type of mixed language called pidgins occurs when adult speakers of two different languages interact on a regular basis, but in a situation where neither group learns to speak the language of the other group fluently. In such a case, they will often construct a communication form that has traits of both languages, but which has a simplified grammatical and phonological structure. The language comes to contain mostly the grammatical and phonological categories that exist in both languages. Pidgin languages are defined by not having any native speakers, but only being spoken by people who have another language as their first language. But if a Pidgin language becomes the main language of a speech community, then eventually children will grow up learning the pidgin as their first language. As the generation of child learners grow up, the pidgin will often be seen to change its structure and acquire a greater degree of complexity. This type of language is generally called a creole language. An example of such mixed languages is Tok Pisin, the official language of Papua New-Guinea, which originally arose as a Pidgin based on English and Austronesian languages; others are Kreyòl ayisyen, the French-based creole language spoken in Haiti, and Michif, a mixed language of Canada, based on the Native American language Cree and French.\n\n\n== Linguistic diversity ==\n\nSIL Ethnologue defines a \"living language\" as \"one that has at least one speaker for whom it is their first language\". The exact number of known living languages varies from 6,000 to 7,000, depending on the precision of one's definition of \"language\", and in particular, on how one defines the distinction between languages and dialects. As of 2016, Ethnologue cataloged 7,097 living human languages. The Ethnologue establishes linguistic groups based on studies of mutual intelligibility, and therefore often includes more categories than more conservative classifications. For example, the Danish language that most scholars consider a single language with several dialects is classified as two distinct languages (Danish and Jutish) by the Ethnologue.According to the Ethnologue, 389 languages (nearly 6%) have more than a million speakers. These languages together account for 94% of the world's population, whereas 94% of the world's languages account for the remaining 6% of the global population.\n\n\n=== Languages and dialects ===\n\nThere is no clear distinction between a language and a dialect, notwithstanding a famous aphorism attributed to linguist Max Weinreich that \"a language is a dialect with an army and navy\". For example, national boundaries frequently override linguistic difference in determining whether two linguistic varieties are languages or dialects. Hakka, Cantonese and Mandarin are, for example, often classified as \"dialects\" of Chinese, even though they are more different from each other than Swedish is from Norwegian. Before the Yugoslav civil war, Serbo-Croatian was generally considered a single language with two normative variants, but due to sociopolitical reasons, Croatian and Serbian are now often treated as separate languages and employ different writing systems. In other words, the distinction may hinge on political considerations as much as on cultural differences, distinctive writing systems, or degree of mutual intelligibility.\n\n\n=== Language families of the world ===\n\nThe world's languages can be grouped into language families consisting of languages that can be shown to have common ancestry. Linguists recognize many hundreds of language families, although some of them can possibly be grouped into larger units as more evidence becomes available and in-depth studies are carried out. At present, there are also dozens of language isolates: languages that cannot be shown to be related to any other languages in the world. Among them are Basque, spoken in Europe, Zuni of New Mexico, Purépecha of Mexico, Ainu of Japan, Burushaski of Pakistan, and many others.The language family of the world that has the most speakers is the Indo-European languages, spoken by 46% of the world's population. This family includes major world languages like English, Spanish, French, German, Russian, and Hindustani (Hindi/Urdu). The Indo-European family achieved prevalence first during the Eurasian Migration Period (c. 400–800 AD), and subsequently through the European colonial expansion, which brought the Indo-European languages to a politically and often numerically dominant position in the Americas and much of Africa. The Sino-Tibetan languages are spoken by 20% of the world's population and include many of the languages of East Asia, including Hakka, Mandarin Chinese, Cantonese, and hundreds of smaller languages.Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population. A similar number of people speak the Afroasiatic languages, which include the populous Semitic languages such as Arabic, Hebrew language, and the languages of the Sahara region, such as the Berber languages and Hausa.The Austronesian languages are spoken by 5.5% of the world's population and stretch from Madagascar to maritime Southeast Asia all the way to Oceania. It includes such languages as Malagasy, Māori, Samoan, and many of the indigenous languages of Indonesia and Taiwan. The Austronesian languages are considered to have originated in Taiwan around 3000 BC and spread through the Oceanic region through island-hopping, based on an advanced nautical technology. Other populous language families are the Dravidian languages of South Asia (among them Kannada, Tamil, and Telugu), the Turkic languages of Central Asia (such as Turkish), the Austroasiatic (among them Khmer), and Tai–Kadai languages of Southeast Asia (including Thai).The areas of the world in which there is the greatest linguistic diversity, such as the Americas, Papua New Guinea, West Africa, and South-Asia, contain hundreds of small language families. These areas together account for the majority of the world's languages, though not the majority of speakers. In the Americas, some of the largest language families include the Quechumaran, Arawak, and Tupi-Guarani families of South America, the Uto-Aztecan, Oto-Manguean, and Mayan of Mesoamerica, and the Na-Dene, Iroquoian, and Algonquian language families of North America. In Australia, most indigenous languages belong to the Pama-Nyungan family, whereas New Guinea is home to a large number of small families and isolates, as well as a number of Austronesian languages.\n\n\n=== Language endangerment ===\n\nLanguage endangerment occurs when a language is at risk of falling out of use as its speakers die out or shift to speaking another language. Language loss occurs when the language has no more native speakers, and becomes a dead language. If eventually no one speaks the language at all, it becomes an extinct language. While languages have always gone extinct throughout human history, they have been disappearing at an accelerated rate in the 20th and 21st centuries due to the processes of globalization and neo-colonialism, where the economically powerful languages dominate other languages.The more commonly spoken languages dominate the less commonly spoken languages, so the less commonly spoken languages eventually disappear from populations. Of the between 6,000 and 7,000 languages spoken as of 2010, between 50–90% of those are expected to have become extinct by the year 2100. The top 20 languages, those spoken by more than 50 million speakers each, are spoken by 50% of the world's population, whereas many of the other languages are spoken by small communities, most of them with less than 10,000 speakers.The United Nations Educational, Scientific and Cultural Organization (UNESCO) operates with five levels of language endangerment: \"safe\", \"vulnerable\" (not spoken by children outside the home), \"definitely endangered\" (not spoken by children), \"severely endangered\" (only spoken by the oldest generations), and \"critically endangered\" (spoken by few members of the oldest generation, often semi-speakers). Notwithstanding claims that the world would be better off if most adopted a single common lingua franca, such as English or Esperanto, there is a consensus that the loss of languages harms the cultural diversity of the world. It is a common belief, going back to the biblical narrative of the tower of Babel in the Old Testament, that linguistic diversity causes political conflict, but this is contradicted by the fact that many of the world's major episodes of violence have taken place in situations with low linguistic diversity, such as the Yugoslav and American Civil War, or the genocide of Rwanda, whereas many of the most stable political units have been highly multilingual.Many projects aim to prevent or slow this loss by revitalizing endangered languages and promoting education and literacy in minority languages. Across the world, many countries have enacted specific legislation to protect and stabilize the language of indigenous speech communities. A minority of linguists have argued that language loss is a natural process that should not be counteracted, and that documenting endangered languages for posterity is sufficient.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n=== Commentary notes ===\n\n\n=== Citations ===\n\n\n== Works cited ==\n\n\n== Further reading ==\nCrystal, David (1997). The Cambridge Encyclopedia of Language. Cambridge: Cambridge University Press.\nCysouw, Michael; Good, Jeff (2013). \"Languoid, doculect and glossonym: Formalizing the notion 'language'\". Language Documentation and Conservation. 7: 331–59.\nSwadesh, Morris (1934). \"The phonemic principle\". Language. 10 (2): 117–29. doi:10.2307/409603. JSTOR 409603.\n\n\n== External links ==\n\nWorld Atlas of Language Structures: a large database of structural (phonological, grammatical, lexical) properties of languages\nEthnologue: Languages of the World is a comprehensive catalog of all of the world's known living languages", "chinese_title": "Language ", "chinese": "Language is a class of composite AC systems, mainly including its formation, acquisition, maintenance and application, particularly corresponding human capabilities. A particular example of such systems is a specific example of such systems. In addition to communication communication, language is also a major component of a person's identity, and is also one of the main components of culture.\nLinguistics is a scientific research on language. The debate related to language philosophy is, such as whether vocabulary can express the experience, at least to the ancient Greek Golgia and Plato. Some thinkers represented by Rousseau believe that language is self-emotion, while Kant believes it stems from rationality and logic. The philosopher demonstration of the 20th century, such as Tittan, said that philosophy is essentially a study of language. The famous linguists have Fudi South Dude Sauss, Num Jumsky, etc.\nHuman language is estimated that there are about 5,000 to 7,000 speculations. Due to the difference in language and dialect, it is difficult to have accurate statistics. Natural language often expresses oral or sign language, but any language can be expressed in sound (e.g., whistle), visual (such as sign language) or tactile intensity (such as Braille). This phenomenon is described in symbolics as modality (Modality-Independent). According to the definition of language and meaning in language philosophy, \"language\" can refer to learning and use the cognitive capacity of the complex AC system, and can also describe the set of rules constituting this system, and can also refer to language rules ( A collection of phrases. All languages ​​rely on symbolic processes to connect specific marks and meaning. Speaking, sign language and tactile language have a vision system to combine symbols in a system or a morphology, and there is also a speech system to combine words and morphoons into phrases and discourse.\nHuman language has creative and displaced, completely relying on social customs and learning. The complex structure of the language makes its expressed ranges are wide than any known animal communication system. According to the perspective of institutionalism, the language is the ability to have the ability to form a mental theory, as well as sharing, and then gradually evolved from its original communication system. This period of development is also roughly the same as human brain capacity expansion, and many language believes that language has evolved because of some specific communication and social functions. There are many parts of the human brain to deal with language, but mainly in Bukuka's area and Venke district. Human language acquisition is to study in early social interaction in early childhood, and the child can speak fluent about three years old. The use of language has been deeply rooted in human culture. So in addition to use in communication, there are also many social and cultural uses, such as strengthening the identity of the group and the social class, which is also used to socialize and entertain.\nThe language will evolve and differentiate over time. Its evolutionary history can be configured with modern language: which qualities are determined from modern languages, which are existing in the ancestral, thereby deposited in the follow-up phase of the language. A set of languages ​​with common ancestral language called language. The language of the Indo-European language is the most used today, and its main members have English, Russian and Hindi. The Han Tibetan language includes Chinese dialects, Tibetan, and Phanda. The Yiafang is included in Arabic, Somali and Hebrew. There is Swahili, Zulu and other hundreds of African languages ​​in the Ban Tuo. Malay - Polynesian language group includes Indonesian, Malay, his plus language and hundreds of languages ​​all over the Pacific. Daro Dutong is mainly distributed in southern India, including Tamil and Telugu. The academic community believes that 50% to 90% of the existing deposits will be extinct at 2100 years ago.\n\n\n== Definition ==\n\nThe term \"language\" or French \"Langage\" is derived from the original Indian \"Lingua\", \"Lingua\", \"Lingua\" or Latin, \"Language\" or French \"Langage\". \"Language\" of ancient French. Sometimes \"Language\" also refers to the code, password, or other artificial created AC systems, such as programming languages ​​or in manual languages. In this sense, in the form language and innate human language, it is a marker system for encoding and decoding information. This entry mainly pays attention to the natural language studied by linguistics.\nIn Chinese, one person tells the words, and the two answers the language. \"The Book of Songs, the\" Book of Songs, \"in the time of the words, in time,\" cloud: \"Direct words, it is said that one is self-proclaimed; the answer is difficult to say,\" said Zheng Dali music: \" Words, stunning words. \"As the object of language research,\" Language \"has two initial meanings: an abstract concept, a specific language system, such as French. Swiss Linguist Fudi South De Saussu defines the basic principles of modern linguistics, and he first districts two concepts of words (Langue). The concept of \"Language\" refers to a particular language system instance, and \"speech\" refers to the specific speech application in a particular language. In terms of a general concept, the definition of language can be used to emphasize the various aspects of language phenomena, form various linguistic factions of the opposite, and even mutually exclusive. Key issues in language philosophy, such as the origin and essence of language, and its debate can be traced back to ancient Greece. Philosophers' Golgia and Plato have done a debate on the relationship between the words, concepts and reality. Golgia believes that language can't express objective experience and subjective experience, so language communication and true also can't exist; Plato insists that will and concepts are presented in the language, so language communication is existing. The enlightenment era focuses on human origin, and there are also questions about language origins. Rousseau, Held and other thinkers believe that language comes from emotional instinct expressions, so language compared to logical expression and rational thinking, more closely related to sensible cognition such as music and poetry. In contrast, Kant, Cartesol, etc., and believes that language is derived from rationality and logic. Since the 20th century, thinkers have begun to question the language of the objective world, or create certain concepts to put human subjective experience to the world's understanding, what roles are played here. The problem has become a study of the essence of philosophy. Therefore, in the 20th century philosophical development, the language in the creation of concepts and circulatory works on the concept of reappearing, Ludwig Vitgenstein and other philosophers and language steering are their representatives. Until today, the meaning and association of the language, the debate of cognitive and consciousness is still active.\n\n\n=== Mind, organs or instinct ===\nOne definition is mainly explained to make people in mind (learning, expression and understanding language). This definition focuses on the versatility of human language and emphasizing the biological basis of human language ability is a unique evolution of the human brain. The supporters of \"Human and Branches have the power of language\" have proposed that all children are normal, as long as they can get in the language in the growth environment, they can learn in the case where there is no formal teaching. This factually supports this concept. Languages ​​can even spontaneously generate them in a living environment without using people who are in the same language; for example, Kreth, as well as spontaneous sign language, such as Nicaragua. This point of view that can be pursued to philosopher Kant and Cartes is that the language is born, such as Nomi Muski's universal Chinese law theory, or the extreme innocent theory of American philosopher Jerry Fu many. These definitions are often used in the language of cognitive science and neurological field.\n\n\n=== Symbol form system ===\nAnother definition is constrained by the composite symbol rules to convey the semantic symbol form system. This definition emphasizes that the human language can be described as a closed structural system, which also includes a specific mark and a particular meaning association rule. The structuralist view of this language was originally proposed by Fernandan Dude Sauss, and his structuralism laid the foundation for many linguistics.\nSome supporters of Some Contributions advocate the use of a form method to study the language structure, that is, by identifying the basic elements of the language structure, and formally express these elements into the words, the rules of the sentence. The main supporter of this theory is the proposed Num Jumski, which generates the literary law. He defines the language as a syntax generated by the available conversion syntax, and it is considered that these rules are the inherent characteristics of human thinking and the basic principles of constituent language. Through the control, such a conversion syntax is also widely used to provide the definition of language logic, formal grammar theory linguistics and computational linguistics. In this linguistics, Alfred Taski, Betlan Russell and other mathematics continue to develop, and believe that semantics exist in the logical relationship between propositions and reality.\n\n\n=== Communication tool ===\n\nAnother definition sees the language as a human communication system on an oral or symbol. This definition emphasizes the social function of the language, focusing on mankind to express yourself or control the object in the surrounding environment. Syntax Function Activity Interpretation Language, understanding the syntax structure of language can be symmetric to adapt and meet the communication needs of language users. This language view also involves the language, cognitive linguistics, and interactive frameworks, as well as social linguistics and language people. As a functionalism theory, it tends to use the language as a dynamic phenomenon, always in the language of the structure of the language. Language type studies, especially for language structural features, it is also attracted attention to this view, as language types tend to partially affect the trajectory of the language process. In the language philosophy, as the center of language and meaning, pragmatic views are taken with later Ludwig Vitgenstein and John Austin, Paul Grasse, John Rogers Hiller and Weiwei The work made by Rad Von Oman, and other general linguists.\n\n\n=== Unique position in human language ===\nA human language is unique than animal language used in other forms of AC systems, such as animals other than humans. Other animals, such as the exchange system used by the bee and is a closed system, which is often very limited ideas. In contrast, there is no upper limit and creative, allowing human beings to produce a lot of discourse from finite elements and create new words and sentences. This is because the human language is a limited number of elements in the language. It does not make sense (such as sound, text and gestures), but the meaning of the meaning (including words and sentences) is unlimited, limited elements and infinity The meaning of combination can generate unlimited human languages.\nHowever, studies have pointed out that Australia's chestnut bending mouth can arranging the same sound elements in different ways to produce a different functional pronunciation. In addition, the zebra also reveals the ability to use two of the same type of sound as a similar behavior, which can only rely on the number of times of sound elements. Indeed, some species are indeed possible to achieve some communication form through social learning. For example, an orangutan named Cansan learns to use a set of Jehis language to express their wishes; many birds and whales are also singing with the same class. However, although these animals can master a large number of words and symbols, they can learn that the number of marks is only equivalent to an average 4-year-old human child, and there is no such rule that is the same in human language.\nThe communication system of human language is different from animals, but also in human language, such as nouns and verbs, now and past, etc., used to express extremely complex meaning. The human language also has a unique recursive level property, for example, one noun phrase can contain another noun phrase (such as \"[[orangutan]'s lips]\"), there is another clause that can contain another clause (such as \"[ See [Dog is running] \"). Human language is also the only modal unrelated natural AC system that adapts to it. It can be applied to various media. If the spoken language uses the sense of view, and the sign language uses the visual practice, and the bilin uses the touch mode.\nThe uniqueness of human language is also reflected in the ability to use abstract concepts; with shift, allowing human language to describe some imaginary, things happening in the past or in the future. Some animals AC systems also have shift (for example, bees can pass location information other than their own detection range), but far from the level of humans.\n\n\n== Origin ==\n\nThere is another assumption for language definitions, resulting in different theory of language origin. There is a view that the language is very complicated, it is hard to imagine that there is no midsency and an evolution into the ultimate form, so the language must be evolved from the pre-linguistic systems of human ancestors. The theory based on this view is called a Continuity-based THEORIES. The opposite point of view, the language is a unique characteristic of human beings, and it cannot be compared to anything of non-human beings. Therefore, the language must have suddenly appeared in the pre-Hominids transition from the pre-HominiDS. . Similarly, based on the theory of Jumsky to generate cultural law, most of the language is visualized in the inner endowment of the gene; the functionalism theory will be regarded as related to cultural heights, through social acquisition systems. Language, philosopher Num Josksky is an important supporter of discontinuity in the origin of human language. He explained: \"Maybe some primate is a long time, suddenly, it may be a random mutation after being radiated by some singular universe, it recomvested a large brain of the primate, implanted inside A linguistic organ. \"Although this describes some literature, he still insists\" and the mythical story related to other contexts including the language, this may be closer to the facts. \" Most scholars are more inclined to continuous hypothesis, but they have their own different views on the evolution process. There are some language skills to be largely born, including Stiifen Pink, and they avoid the study of the clear language of the research primate, and simple thinking is the precedent of animal cognition, \"language The instinct is evolved in a usual way. In addition, some scholars are like Michael Tomasllo, they believe that language is an AC tool, which can be developed in social communication methods of cognitive control, and these ways are more based on gestures rather than sound. There are also some consecutive hypothetical ideas that language originates from music and singing, and this view has been supported by Rousseau, Held, Humbold and Darwin, and its most important supporters, archaeologists Steven Misse. Linguist Stephen Anderson pursues oral speaking already existing 60,000 to 100,000 years. He says:\n\nSince the origin of the language is in the early stage of the prehummer's prehistoric era, there is no form of written records, so the development process has not left a direct historical remains, and there is no finding process with it. Despite this, modern newly born sign language (such as Nicaragues) may allow us to see the phases and processes that must appear in language development. Another research method is to observe early human fossils To find the trace of the physiological structure of the physiological structure used in the figure. These traces show that the size of the brain is related to the body, and the appearance of the throat improves the sound, and the ability to use tools and other manufacturing items. In the detection of some DNAs that have been extracted human, whether they can find a gene (such as foxp2) related to language function (such as Foxp2), and can provide us with a lot of information. There is also an archaeological approach to find the archaeological remains left by the symbolic behavior (such as repetition activities), such as use as a human painted pigment, and theoretically demonstrate the logical relationship of symbolic behavior to the language. Language evolution and the anatomical prerequisites needed, theoretically, its time span from human genus (230 to 24 million years ago) from chimpanze (500 to 6 million years ago) to the behavior modernity (Behavioral) The model is completely exactly (about 5 to 150,000 years ago). It is generally identified that there is no significant difference between the exchange of communication between Nanoba and Class Arah, but also has some objections for the research of the ancestor. It has different opinions between the scholars in the development of the human belongs to about 2.5 million years ago. There are some original language systems that think that the people (approximately 2.3 million years ago), others believe that the erectile (1800,000 years ago) or Hydeburg (600,000 years ago) has a primitive symbolic exchange The language begins to develop when there is a homework with a modernity of a modernity before 100,000 years ago.\n\n\n== Research ==\n\nMore than 2000 years ago, with the development of Boromomin, India has the first grammatical description for individual languages, which is considered to be the world's earliest language research. Today, modern linguistics have developed into a science, based on the aforementioned various language theoretical perspectives, all aspects of language and linguistics.\n\n\n=== Branch discipline ===\nLinguistics research can be divided into many different professional branches from different theoretical perspectives and research ideas. For example, describing the syntax of individual languages; theoretical language is based on how to conceptualize and define the theory of language intrinsicity based on existing human language data; social application of social language research language, from social perspective description syntax, explore language Social function; neurological language testing and study human brain nerve for language understanding, output and acquisition; calculating linguistics based on description of linguistics and theoretical linguistics, build language computer models to handle natural language, test linguistic hypothesis; Historical linguistics use vocabulary and grammatical descriptions to trace the history of individual languages, and often use comparison linguistic research methods to reconstruct the language spectrum.\n\n\n=== Early history ===\nIt is generally believed that the official language initially begins in the 5th century in the 5th century in the first 5th century, Your Nini is in 1959 for the State of State. The Summers also studied the difference between Summere and Akad in about 1900 BC. Subsequently, all civilizations with writing systems have produced their own literary tradition. In the 17th century, French universal common syntax proposed that the grammar of any language reflects the general foundation of ideas, so the grammar is also universal. In the 18th century, English language, Gu Yido Jones used a control method to study the language, and created a relatively linguistic, and William von Humboldt widen the scientific research from the language from the Indo-European language to all Language. In the early 20th century, Fudidan De Sauus is one of the most important formal linguists. He compares the language and its various elements, and believes that language is a static system associated with each other, compared Several basic research perspectives in linguistics, such as historical linguistics and common language, language and speech, have laid the basic research principles of modern linguistics.\n\n\n=== Contemporary linguistics ===\nIn the 1960s, Nom Jumski raised the theory of cultural law. The theory believes that the most basic form of language is a set of syntax rules for all human beings. This set of rules is called universal grammar, which is the foundation of all human language syntax. Jumsky believes that the basic task of linguistics is to describe the general grammar, and individual languages ​​are important for linguistics in the ability to derive what the underlying universal rules produce the language can be observed. Unlike the formal grammar theory with the generated school, functionalism believes that since the language is a tool, according to its functionality, it can analyze its structure most thoroughly. Formal grammar seeks different system elements in definition language, describing the relationship between elements, formal grammar law and grammap operation, and functionalism theory seeks to define language functions, and will have its language elements.\nThe theoretical framework of cognitive linguistics from the perspective of the concept of language forms, the main concern, how to make sense.\n\n\n== Language and speech physiology and mental structures ==\nIn all cultural, speaking is the default form of language. The production of spoken language depends on the complex ability of the other components of the lip, tongue, and vocal devices, the ability to acoustically decode speech voice, and the neural devices required to obtain and produce language. Research on the genetic foundation of human language is in the early stage: the only gene associated with language generation is Foxp2, and if the mutation is affected, it may lead to a congenital language barrier.\n\n\n=== Brain ===\n\nThe brain is a coordination center of all language activities: it controls the generation of language cognition and meaning and the mechanism of speech. Despite the modern imaging technology, brain science research has made considerable progress, but our understanding of language neurological foundation is very limited. Neurological language is committed to studying the nervous system related to language. The initial work of neurological language is the language study of patients with brain lesions to understand how the lesions in specific areas affect language and speech. Through these studies, the 19th century neuroscience found two areas in the brain closely related to language processing. One is the Nikk District, located in the back of the temporal bleeding of the treadmoll (usually the opposite side of the hand). In this brain area, there is a sensitive loss of illness, and its language understanding will be severely damaged, but the speech retains the natural rhythm and relatively normal sentence structure. The second area is a fabric area in the border, located in the forefront of a hemisphere. People with lesions in this area will express their illusions, which means they know what they want, but they cannot say it normally. Expressive default patients may also have fluent, clarity, vocabulary findings, words repeated, and it is difficult to form or understand syntax complicated sentences in verbal and written. Those who have such loss of spellings are also difficult to say the words of the grammar and cannot use syntax information to determine the meaning of the sentence. Expressive and acceptance of incidents also affect the use of the sign language, similar to it affects the language, and patients with exposure to illness can only slowly play the incorrect syntax, and patients with receiving default can fluently use the sign language. But their sign language is difficult to understand, they are also difficult to understand the sign language of others. This indicates that brain damage is damaged by the use of language specific capabilities, not the physiological ability of voice. In the late 20th century, with the advancement of technology, neurologians also use non-invasive techniques such as functional magnetic resonance imaging (FMRI) and electrophysiology to study language treatment without damaged individuals.\n\n\n=== speech analysis and voice ===\n\nThe oral language relies on the human body to generate sound, that is, the ability to generate the longitudinal wave propagating in the air in the vibrating membrane, which depends on the physiology of the human language organ. These organs include lung throat and upper channels (throat, mouth and nose). By controlling different pronunciation portions, the airflow can be manipulated to produce different speech. Voice can be divided into sound segment components and supersonic components. The sound segment is arranged before and after order, usually represented by different letters, such as Roman letters. In the free and smooth speech, there is no clear boundary between a sound segment and the next tone, and there is usually no obvious suspension between words, so the difference between the sound segment is different tuning methods when pronunciation. For example, the difference between vowels and consonants. The supersonic segmentation includes elements such as light reading, sound type, tone, sound rhyme or tone, all of which may affect multiple sound segments. The consonial and vowel sound portions form an syllable, and the syllable is combined to form a discourse; these phones can be distinguished from the gap between the two suction phases. In acoustics, these different tone segments are characterized by different resonance peak structures, which can be seen in the time spectrum (see the right figure). The resonance peak is the amplitude peak in the spectrum of a particular sound. The meticone refers to the tone that the airflow is not hindered by the oral cavity without tuning. Their tone values ​​differ depending on the degree of opening and the position of the tongue in the oral cavity. When the lip is relatively closed, the vowel is closed, such as the metaphystest, the rhyme \"of Chinese\" according to the \"according to the\" Compliance \", and the vowel issued when the lip is open is open vowel, such as Yuan Zone [A] (Chinese \"ah\"). If the tongue is behind, the sound value will become [u] (Chinese \"\" rhyme) and other meticulum. The tone value will also change with the shape of the lip, for example [i] (not late lip-tone), the rounded lip is changed to [Y] (rounded lip tone, such as German \"u\" or Cantonese \"in\"). The consonant refers to a gas stream in a tuning (some parts of the upper channel narrowing or blocked), which is a sound that occurs or closed. The consonant sound value varies depending on the position of the tuning site, that is, the position of the gas stream is variable, which is usually in the lips, teeth, tooth sump, hard palate, soft jaw, hanging or spoke. Each tuning position generates a set of different consonants, depending on the modulation method or blocking type, one is a completely blocked closed sound or succulent, and the other is a non-completely blocked scroll or a nearet. According to the vocal sound of the vocal, the consonant can also be durable, such as [S] in English, [s] is the purpet (咝 咝) and buzz [z] is a turbidity (turbid ggvy). Some phonemes, including vowels and consonants, can utilize nasal tuning, which are called nasal sounds or nasal tone. Other sounds depend on the relative position of the tongue to the airflow, such as [L] (referred to as the edge, because the air flows along both sides of the tongue) and [ɹ] (referred to as the gums.). By calling the vocal organs and tuning portions, humans can produce hundreds of different sounds: Some sounds are very common in various languages ​​in the world, and some rare phones are only in certain languages, language, some language areas, and even single Language.\n\n\n== Structure ==\nThe language is generally regarded as a symbolic communication system consisting of three parts: the symbol, meaning, and the symbol of the two. Symbolics is responsible for studying symbolic processes, symbols and meaning how combines, and the use and interpretation of the mark. The marker can be composed of sound, gestures, letters or symbols, depending on whether language is to say, to do a sign language or write, and they can be combined into complex marks, such as words and phrases. When used for communication, the marker is encoded by the sender and transmits it to the recipient through the channel, and the latter decodes it.\n\nSome definitions distinguish between human language and other AC systems: language marks have no inevitable contact between language marks and its meaning; language system has binary, so language has a layered nested structure, such as The sound composition is word, and the word forms a phrase; language language elements have discrete, so the feature of building language marks is discrete units, such as sound and words can be distinguished from each other, and rearrange them in different modes; language systems have energy products. Therefore, limited language elements can theoretically combine unlimited combination. The rules combined into words and phrases are referred to as syntax or syntax, and the meaning associated with independent marks, phonemes, words, phrases, and text is called semantics. The Language Studies have been divided into language into independent but interconnected marks and meaning systems, and now this view is almost adopted by all linguistics.\n\n\n=== Semantic ===\n\nPeople are expressed by linking a marker to a meaning. These language markers must be able to perceive people, such as sounds, images or gestures, which are contacted according to people's habits. Since their most basic meaning comes from the agreement in people's exchange. The agreement of language symbols is based in society and history, rather than a specific symbol, has a relationship between its significance. In this view, language symbols can be considered as definition.\nTherefore, the language must have vocabulary associated with a particular meaning. For example, English words \"DOG\" represents Canis Familiaris under gray wolf. In a language, a collection of any set of symbols associated with meaning is called the vocabulary, the single symbol associated with meaning is called the word. The language is not all meaning in words, in many cases, the meaning is embedded in the form of a language in the form of a language (syntax) in the form of a grammatical category. All languages ​​contain predicate semantic structures for expression properties, status, or behaviors. Semaning is generally regarded as a study on how the speaker is assigned to statements, which is intentionally regarded as a process of judging the predicate about a real estimate. For example, \"[x [Y]\" or \"[x [Y]\". Recently, this semantic model has been added for more dynamic models. These models combine some shared knowledge, which describes how the symbol is explained in language during meaning generation. This significance model has been explored in the field of language.\n\n\n=== Voice and symbol ===\n\nAccording to the form, the language structure can be based on sound (language), gesture (sign language), graphics or haptic symbol (text) system. Vocal sects have studied the language of language using sound and symbol expression. Studying how to pronounce and perceive the sound is called voice. In the spoken language, the meaning is generated as part of the sound as a system, and some sounds help express significance, while others are not. In any given language, only many different sounds of a limited number of objects can be sent by the human pronunciation to construct meaning. Sound as part of the language system is called a phoneme. The speakement is an abstract unit of sound, defined as a minimum of language that can distinguish between a word (so-called minimum pair of stereo), which can distinguish between a language. In English, a word Bat [bæt] and PAT [Pʰʰt] form a minimum of three-dimensional, in this / b / and / p / distinguish between these two words. However, each language has different ways of distinguishing sounds. For example, in a language that does not distinguish between the dyness and the voiced sound, the voice [P] and [B] (if they all exist) can be considered a phoneme, so these two pronunciations have the same point. Similarly, English does not distinguish between consonants and non-air pronunciation, but many other languages ​​are distinguishable (such as Korean and Hindi): do not send aerobics / P / and words PIN in words spin [spɪn] The gas sound / P / is considered to be only the different pronunciation methods of the same phoneme (this change in a single phoneme is called the same line \", and in the official language, the same pronunciation difference difference word\" \"[Pʰá] And \"eight\" [pá] (á Variable symbols represent high pitch). All verbal languages ​​have at least two types of phones: vowels and consonants, which can be combined with constituent syllables. While having a phoneme such as consonants and vowels, some languages ​​also use the other forms of sound to convey significance. Many languages ​​use, for example, lightweight sound, high hypersonal, vowel length, and tone. Since these speech phenomena operate, they are called ultravailability components. Some languages ​​have only a few phonemes, such as Rotorca and Pira Hans, with only 11 and 10 tones, while others like a macro, may have 141 such phones. In the sign language, the alternative (called sign language) is defined as the basic element of the gesture, such as the shape, direction, position, and motion of the hand corresponding to the species. Writing system uses a visual symbol representative language, which may or may not correspond to the voice of the language. Latin letters (and derived from it) are initially based on a single sound, so words are typically composed of letters representing a structure representing an consonant or vowel. In symbiotic text, if each symbol represents a symbol. In the morbid text, each symbol represents the entire word. And generally do not contact this word in the spoken pronunciation.\nSince all languages ​​have a lot of vocabulary, there is no texture of pure content. The written language represents the sound in the spoken language, and the text is followed by the scheduled display symbol mode to follow a specific direction. The writing order used by the writing system is completely arbitrary but has certain practices. Some writing systems use the horizontal direction (like Latin words from left to right or like Arabic words, there are some vertical directions, such as ancient Chinese (from top to bottom). Some writing systems use the way in reverse writing, or others, such as the ancient Maya text, can be written in any direction and rely on the direction of the reading to read the reading. In order to express the sound of the world language in writing, the voicemaker creates an international audio symbol to express all discrete sound in the human language to help understand the meaning of human language.\n\n\n=== Syntax ===\n\nThe grammar is a research on the most basic elements of the language that can form a speech in the language. The morpheme can be used freely and can be connected together. When it is freely used in the discourse, generally referred to as words, and other words or morphology, referred to as stem or gar. The combination of morphemes is constrained in a combination of languages. The rules of the inner structure of the word internal structure are referred to as the rules of the phrase, phrase or internal structure of the sentence are called syntax.\n\n\n==== Grammatical category ====\n\nThe grammatical category is a classification of semantic content and corresponding grammar forms embodied in sentence components. The elements in the same grammatical areas (semantic content-grammar forms) are mutually pertide, and only one element can be expressed as the grammatical category. For the position and the morphological changes (morphological changes) of the sentence composition, various words (nouns, verbs, etc.) can be separated from sex, number, grammatical relationship between the modules, the syntax relationship between the yuan and the predicate, reflecting the subject matter, predicate and other grammar. The difference in functionality, the difference involves a variety of grammatical categories to the same as the grammar formation. The grammatical category coverage of different languages ​​is nor, some are very common, almost all languages ​​are common, such as hair.\n\n\n==== word class ====\nThe language is based on their grammatical functions and classifications of different words or known words. All languages ​​are distinguished from the words, concepts, representing the words or events, such as \"dog\" and \"song\" are nouns, and \"run\" and \"sing\" are verbs. There is also a term word is adjective, which describes the nature or quality of nature or quality, such as English \"Red\" or \"BIG\". If the new word can continue to join a certain word, then this word is open, and it is closed. In English, the pronouns are closed, while the adjective is open, some adjectives can be switched from the verbs (such as \"saddened\") or nouns (such as \"-like\" suffixed in the form of \"noun + like\") . In some languages, such as in Korean, the pronouns can be converted, but the number of adjectives is fixed. Words can also reflect different grammatical functions. Typical as verb as predicates, and nouns are predicate, namely, subjects and objects. For example, sentence \"Sally Runs\", verb \"Runs\" as a predicate because it describes its specific state of the element \"Sally\". The number of yuan is called the price, and the different verbs can have different prices, holding one or more pairs. One price verb can only have a pair, and it is generally only the subject. This verb is generally called unusual vocabulary; the verb of divalent or more can have two or more pairs, the subject outside the subject For the object, this verb is generally referred to as and informative words. Therefore, the price is often called the property. There are other variations in different languages, such as two sentences, articles (pre-word) lead to nominal and generic name words, and exclamation, motion, etc. There are quantifiers in many languages, used to define the number of nouns, describe the names. Such as Japanese use quantifiers \"people\" come:\nThree people / / に に ん がく San-nin no gakusei? The literally is \"three students\", \"three students\" and the trees:\n\nSan の 木 / さ ぼ ぼ ぼ き き San-bon no ki?, Literally, \"three long object trees\", \"three trees\"\n\n\n==== word method ====\nThe language of morphology and its processes in linguistics, the study of lexics, called the word law or morphology. In most languages, the synthetic words are composed of several morphemes. For example, the word \"unExpected\" can analyze the three morpons of Un-, Expect and -ed. The morpheme can be divided into roots and antiques, and the roots can be independent as the morpheme, and the affix must be attached to other morpons. Affixing is divided into prefix, prefixed, and suffix according to its relative positions of the roots. The garnish will change, explain the semantics of the ternary, and the method of adding a garbrose to create a synthetic word is called derived, such as the verb \"Sing\" plus -Rhange to \"Singer\". In contrast, flexural changes (morphological changes) change the word syntax function by changing the morphology of the morpheme, and then changing the meaning, but does not create new words. Some languages ​​change the word meaning by changing the flexographic structure of the word rhyme structure. For example, English words \"Sing\" becomes \"Sang\" and the past word \"sung\". Different language dependent morphological changes are different, so the relationship based on morphology and grammar produces a formal classification. Isolated language is the language of Morpheme-Per-Word Ratio, and does not perform morphological changes, but in order to express a grammatism relationship, such as Chinese. Isolated is also an analyte, because most of the time words and the semantics are also one or one (but not Chinese is not derived), such as Chinese \"not easy to break\" is not, easy, broken, damaged four free mymeatons, no Synthetic words are composed of UN- (not free mymens), BREAK, BREAK, ABLE (not free tone) like English \"unbreakable\". Most of the syndromes including English are allowed to contain multiple morphemes, but depending on the degree of morphedu, the morpheme word ratio is high, and can also be divided into pseudo, adhesive, and multi-syndrome. The pencil is rich in flexible changes, and its morpheme can have multiple semantic or grammatical functions and can not decompose, but the combination of morphemes will be restricted. Most languages ​​in the world, especially the language of the Indo-European system, are induced. Such as Latin \"Bonus\", including the root BON- (Good) and suffix -us (positive main body). Although the adhesive speech has a flexible change, it is mainly adhered to alter the grammatical function in the root, and the syntax function of the gar is single, such as Turkish \"evlerinizden\" through the morin column EV-LER-INIZ-DEN. House - Multiple - The second person is said to be \"from) means\" from your home \". Traditionally, the so-called multi-syndrome is the most dependent on morphology, and the integration is also the highest, and a sentence is usually expressed in one word. Such as Persian \"فهفهفهییشش\" Nafāmidamesh (I didn't understand), is composed of morbid columns NA-FAHM-ID-AM-ESH (negative - understand - the first person - third party), the complete containment The Subjects and objects of FAHM-. Another example is the word \"Tuntussuqatarniksatengqiggtuq\" by the mori-ni-ksaite-ngqiggte-ni-ksaite-ngqiggte-uq (Reindeer - hunting - the future - Negate - Repeating - Third person singular statement) He hasn't said that he is going to catch the reindeer. \" In this example, in addition to Tuntu (reindeer), all of the other temperaments are not free, and they cannot independently exist. In many languages, the morphology of the words in its sentence will be consistent with each other in some grammar. For example, in many languages ​​of the Indo-European language, the shape of adjectives must be consistent with their modified nouns, so the form of Latin \"Bonus\" is in the form of a positive main body. The result of each other. In many multi-synthetic syndrome, the morphology of the phrase is consistent with the subject and the object of the object. Such as Basker phrase \"Ikusi Nauzu\" ikusi n-au-zu (see the second person - Action - the first person) means \"you saw me\", \"Nauzu\" in the past, the helping probe -Au- (do) At the same time, it is consistent with the prefix N- (you) and suffix-zu (I).\n\n\n==== sentence method ====\n\nAnother way to pass the sense of language is that the word is constituted by a certain sequence, and the sequence sequence here is called syntax. The syntact rules determine the constraint form of the word sequence and sentence structure, and these restrictions acts on significance. For example, in English, English sentences like \"I love you\" (I love you) are to talk, and \"* love you i\" (love you, I) said that it will not. Another example is the \"The Slaves Were Cursing The Master\" and \"The Master Was Cursing The Slaves\" (the master is speaking slave) refers to different things, because the syntax is sensitive to the sequence, the noun in front of the verb The role of the subject, and the noun behind the verb is an object. In contrast, in the Latin, Dominus Servos Vituperabat and Servos Vituperabat Dominus means that \"the owner is cursing slave\", because \"servos\" is the form of Bedge, indicating that they are the subject of the sentence, and \"Dominus\" (Master) is the main body, indicating that he is the subject, so the sequence is changed to express the same meaning. It can be seen that Latin uses lexic (morphology) to distinguish subjects and objects, while English uses sequence this sentence.\nAnother example of the syntactic rules is another example of a number of doubts of words in many languages. This rule explains why English sentence \"John Is Talking to Lucy\" (John Talking to? \"(John Is Talking to Lucy) is changed to the question sentence.\" WHO? \". The latter may emphasize \"who\", so that the meaning of the question has changed slightly. The rules of the phrase are also part of the syntax, the words can be connected to different locations in the mean syntax structure by constituting the phrase, while the phrase is connected to each other at different levels, and finally connects to a sentence in a tree structure. Such as the right picture, in the syntactic analysis, the English sentence \"The cat sat on the mat\" is divided into noun phrase \"the cat\", the verb \"SIT\" and the term phrase \"on the mat\", The phrase phrase \"The cat\" is composed of the crown and nouns, the term phrase \"on the mat\" consists of a preposition and noun phrase. This phrase is moved as a single element when performing a syntax operation. When you want to emphasize \"on the mat\", you can use it as a whole, get \"[and] on the mat, the cat sat\" (on the mat \" The cat is sitting), so it should be considered a unit. Based on the different hypothetical assumptions and descriptions, there are now various theories to make different forms and functional frameworks to analyze sentences, describe language structure.\n\n\n=== Typeology and universality ===\n\nLanguage can be classified according to its grammatical characteristics, although some languages ​​are submitted to different branches, but they still have many common features, and these common features are often associated. For example, the language can be classified in accordance with its basic quotes, ie statement of the status of the status and other positional relationships between other sentence components. For example, the basic sequence and Chinese in English are active guests (SVO) such as \"The Snake (s) bit (v) The Man (O)\" (snake bite), while in Australian Aboriginal Language Kamiraro In Irs, the basic sequence is the main mobile phone dynamics (SOV), such as \"D̪uyugu n̪ama d̪ayn yiːy\" (snake bite). Because the basic sequence type corresponds to other series of syntax types, such as the relative order of the noun and adjectives, the pre-word or post-reference, etc., the sense of grade type is also considered a type element. Such interrelation is called the universality of language, such as most (but not all) the language of the main BC dynamographic (SOV), and presence the appearance of the words before the appearance. Although all language sentences are composed of subjects, predicates, and objects, but different language processing grammar and semantic roles are different, that is, the formation of the relationship is different, so the above-in-law formation is also different. English belongs to the main Bedge language, whether it is not a mapping word (such as \"i run\" I run) or a mapping word sentence (such as \"I love you\" I love you), its subject (the agent Agent, no time The core zoning Subject is also the top name I, the equivalent of the same form. For Diberal language, such as Kamira Royi, the subject (application) of the matrix sentence is equivalent to The object of the matrix (the object, ie Object) is different, and the subject of treating and passing the words. As such, the semantic role can be rendered in different grid relationships such as \"Labor-Bing\" or \"Grid-Pass\" in the main Bage language, even like a three-point language, and The subject and object, and the subjects of failing to pass the words are expressed in three different grids, respectively. Even if the language type is classified by two languages, the common feature is also possible to independently. These features have appeared, which may be due to the universality of the general language structure, that is, the universality of the language, and may be the result of the gradual convergence of humans in the process of constantly resolving communication issues.\n\n\n== Social background for language usage and spread ==\n\nLanguage is existed in the language. Although human beings have the ability to learn any language, they will do this in human, especially children, especially children, only in the growth environment or companions use the language. Language is also used in social communication to address a large number of tasks, so many aspects of language can be considered as adjustments to these purposes. Language The way to pass between intergeneration or speech commutations can lead to constant variations, constantly differentiate new languages, or integrated with each other through language contacts. This process is similar to evolution, and the change in generations will eventually form a tree speech spectrum. However, the difference between the language and the organism is that the language is easily integrated into other languages ​​in the process of diffusion because of the speaker of other languages. Humans often use multiple languages, in addition to the first language obtained by childhood, they also learn new languages ​​during growth. In today's globalization, the language has increased, resulting in many small languages ​​that are gradually endangered, and their users tempted the use of more influence, which can face a larger-wide speech community.\n\n\n=== Quantum ===\n\n\"Significance and symbols are close to each other\", semantic research is based on this assumption, but does not study the formation of social practices and its influence language. Instead, there is usually in the study of words and symbols, words will have different meanings in different social contexts. For example, direct object (DEIXIS), this kind of word description speaker is talking between the specific time and space between the speaker, such as \"I\" (showing the speaker), \"now\" (indicating the moment) and \"\" Here \"(indicating the location of the speech). With the changes in social customs, its marks will gradually change its meaning. Significance of language expressions in terms of literacy how to change, and DeiXis is an important means of using language refers to an entity. Language is concerned about how language is modeled and how these modes are meaningful. For example, language expressions in all languages ​​can be used to deliver information, and can also be used to act. Some behaviors can have actual effects only, such as creating a new name for an entity through \"Naming\", or using the \"someone and his wife\" to create a social contract. Such behavior is called speech behavior. Of course, they can also be implemented by writing or speaking. The form of language expression is often not corresponding to its practical significance in a particular social background. For example, if a person asks: \"Can you get salt?\", He is not really a long enough to take salt enough, but want people to help him. This significance is hints by the context used; the impact of these significance is called the meaning of session. Social rules for these languages ​​are only suitable in certain specific circumstances, and different speech communies are different for understanding their social background, the understanding of language is different. Learning these content is also a very large ring in communication skills acquisition.\n\n\n=== Language acquisition ===\n\nAny normal health people will learn and use language. Children will learn their language that is fully contacted in a single or multi-door. Whether it is speech or spoken, children are basically the same for their learning. This learning process is called the first language acquisition, which is different from many other types of learning, no direct or professional teaching. In the \"Original\" of Human, the museum Charles Darwin said that this process is \"a kind of instinctivity of art\".\n\nAlthough there is a big difference in the specific acquisition phase in the normal development of infants, the development of the first language acquisition is still quite regular. From birth, newborns are easier to respond to human speech compared to other sounds. When about a month, the baby seems to distinguish between different speech. When about six months old, the child will begin to jealous, go to the voice of them, or make the hand around it. Babies in 12 to 18 months, the infants will start using words, and the average vocabulary of about 18 months is about 50 words. Children will start using a single word, that is, only one word to express their own ideas. There will be double-word language in this month, and then the telegraph or some short sentences will begin in a few months, and these short sentences are simpler than the syntax of the adult language, but regularity can be seen from their syntax structure. However, it is indeed a regular syntax structure. From three to five years old, the ability of children talk or doing sign language will develop to the extent of adults, and their language acquisition process is basically completed. The 2013 studies have shown that unborn fetuses have been able to get a language to some extent. By contacting daily life or courses, people can learn the second or even more languages ​​in any age. Children learning the second language is more likely to reach the native language than adults, but in general, the second language user is difficult to obtain the mother-speaking user. An important difference between the first language acquisition and additional language acquisition is that the process of additional language acquisition will be affected by the learner known language.\n\n\n=== Language and culture ===\n\nThe language can be understood as a particular language specification within a particular speech, and is also part of the big culture of the community. The language is not only different in pronunciation, vocabulary and grammar, and its \"language culture\" is also five flowers. Human use language to identify a cultural group, distinguish other groups. Even the user of the same language will also use several different ways, each of which represents a particular sub-group affiliated with a big culture. Languageists and anthropologists, especially social linguists, human linguists and language human classes, special research, speaking, the variation between the speech community. Linguists use \"Language Variants\" to refer to different ways of a language, which contains dialects and language domains in geographic or social and cultural senses, as well as primary cultural. Language Classics and Language Sociologists define the communication protocol as the way of using and understanding languages ​​in a particular culture. Since the language usage specification is shared by a member of a particular group, the communication language has also become a way of displaying and building a group identity. Language differences may become a significant mark of division between social groups, for example, a language with a particular accent can represent a person's minority or a few social class identity, his ancestral, or he as a second language user. These differences are not part of the language system, but how people use languages ​​as an important social tool for building a group. However, many languages ​​will also mark social levels or social opposes in some grammar practices, and highlight the absolute or relatively relative social status of the speaker. In many languages, between men and women, the difference between age, between the age, between the social classes, the difference in both the syntax, just like some languages, using different words based on the listeners. For example, in Dilbar in Australia, the married man must use a special word to mention daily necessities in front of his mother-in-law. Another example, some cultures have exquisite \"social direct language\" systems, or express social distances through language means. In English, social direct language is mainly distinguished by distinguishing between surname and other surnames, and \"lady\", \"doctors\" or \"you\". But in other languages, this system may be very complicated, and override into the entire grammar of the language and the vocabulary. For example, in East Asian language, such as Thai, Burmese and Java, the speaker uses different words according to the relative position of him and the auditor in the level system, with the lowest level of animals and children, the highest level of God and royal members. .\n\n\n=== Text writing ===\n\nAmong the historical long rivers, humans invenously invented many ways to represent the language, which is called a writing system.\nWriting Language is more useful to humans. It can store a lot of information outside the human body and repeat the retrieval, allowing long-distance communication, which is originally not possible to do this only by speech and sign. Many languages ​​have different genre, language, distinctive written languages ​​and spoken language, and even in part of the language community, written words and spoken language are largely separate, such as Cantonese. There is evidence that the application of writing will also have an impact on human cognitive development, which may be because of the usual and regular education that you usually require correct and regular education. The writing system has begun to invent the first leaf of the bronze era of the bronze era in the late BC. Summer's ancient wedge text and Egyptian pictographs are often considered the earliest writing system, they all take off the original text symbol system that appears around 3400-3200 BC, and the earliest consisted text is around 2600 BC. appear. It is generally believed that the Sumeren's text is independent, and for the Egyptian text is completely independent of Sumeir, it is quite controversial. There are similar arguments for Chinese characters developed around 6000 BC. It is widely believed that the Central Columbus' written system (including Olmek and Mayan text) have independent origins.\n\n\n=== Language changes ===\n\nAll languages ​​have changed as the speaker uses or invented new speaking methods, and these changes will spread in the case of speech. Language changes are all-round, and the language will change in terms of voice, vocabulary, morphology, grammar or even parallelism. Although language changes are initially treated with these changes, this is considered to be a language subsidy or language norm, but this change is natural and inevitable. Language changes may affect specific voice or entire voice system. Voice changes include replacement of speech or speech features, which will cause the original voice loss, and even completely become new voice. Voice will also vary depending on the speech before and after it. Voice changes usually have regularity, so that voice will become systematically changed regardless of whether or not they satisfy structural conditions, any non-speech factors can be ignored. However, the system changes are not absolute, and the speech changes often affect only one or several words. Sometimes individual changes will trigger a chain sound movement of the voice system. If all of the Germanian groups have happen to chain sound movement, the start * bʰ becomes / b /, resulting in the original * B change to / p /, Then lead to the original * p be changed to / f /. This process is called Green Law. This can also explain the word Paater and Pisces in the Italian language Pater and Pisces corresponding to the beginning of the beginning of the Father and Fish. Another famous example of chain sound movement is the main reason for English in English. This is the main reason why modern English is writing and pronunciation.\nAnother reason for speech changes is the vowel condensation, that is, due to pronunciation blur, the two independent words are detached, gradually shorten the two syllables of the two syllables or even two speech. For example, Latin Mea Domina has become Madame in French and Ma'am in American English. The language will also change in the grammatical level, which often occurs when the word or morphemes fall off, and the grammatical system has no consciously reorganization to compensate. For example, Standard Spanish uses the flexible change-S to mark the second person of the verb, but a part of the Caribbean Spanish is falling off, causing them that they can only pronounce the word Tú to express the second person. Hiwang Como TE LLAMAS? [KOMO TE JAMAS] (\"What is your name?\") This sentence has become a Caribbean. Como tú telica? [komo tu te jama]. Therefore, subtle speech changes will also affect morphology and syntax. Another common reason for grammar changes is that some specific discourse modes are syntax, such as the formation of an apparent language. For example, English Going To has lost its meaning of its body and exercise, and has become a sign in the future, and this change in some English dialects is very complete (such as I'm Gonna).\nLanguage variations may be pushed by their internal factors, such as specific speech, can cause speech changes in the case where it is difficult to identify or pronunciation, or change some rare language structures. Another factor in language changes is social, such as when certain pronunciation represents a specific group, social class or ideology group, people who want to enter these groups will imitate, using those pronunciation, objectively happening Voice changes. Therefore, identity builds and political issues will also have a profound impact on language structure.\n\n\n=== Language contact ===\n\nLanguage contact is also an important reason for the propagation between language characteristics. Language contact occurs when the user of the two languages ​​or language variants is constantly interacted. Multi-language may have always been a normal human history, most people in the modern world can say a multi-door language. Before the concept of nation-state, mono language is generally only the characteristics of island residents. However, nationalism ideology makes a country, a language of a language is widely accepted, and the monochrome is popular. Despite this, there are approximately 6,000 languages ​​in about 250 countries in the world, indicating that there are still many languages ​​in most countries, so most languages ​​are still closely contacted with other languages. When users of different languages ​​are closely interacting, their language often affects each other. After the long language has been exposed, a language feature diffuses in different languages, making the language of different locations controversy. This may generate a language alliance in the region where many languages ​​are closely contacted, and the language of mutual discordment begins to share a lot of language characteristics. There is a recorded language alliance including the Balkan area, Central American language and Ethiopian area. In addition, some larger areas such as specific geographical features, some larger areas such as South Asia, Europe and Southeast Asia are sometimes considered a language alliance. Language contacts can also lead to other language phenomena, such as language fusion, vocabulary borrowing and even vocabulary reset (local words are gradually replaced by legion of advantageous language). Under extreme and continuous language contact, it may result in some new mixed languages, which are difficult to be classified into a single language helper. For example, Piqin language, such a mixed language is formed in adult users in different languages. Regular contact, usually they don't speak each other's language, but they can build a simplified grammar and voice system through Piqin language, but at the same time have two ways of communication. Piqin also there will be no native language users, and the user who defines the priests of Piqi uses another language as the first language. However, if a kind of Piqin is a primary language of a speech community, then Piqin language will become the mother tongue in this speech community and become more complicated in structure as these children grow up. These languages ​​are also known as Kreth, such as Papuki, which is the official language of Papua New Guinea, starting from English and South Island; and Haiti Kreth, and Canada's Mickey Worried, etc.\n\n\n== Language diversity ==\n\nThe \"National Language\" website defines the \"Live Language\" (the language still use) as \"a language that has at least one mother tanguo.\" The exact number of \"live language\" is currently 6,000-7,000 species, which can be attributed to the \"How to define language\" and \"how to distinguish language and dialect\". As of 2016, \"Ethnical\" recorded 7,097 living human languages. \"Ethical\" is based on language-based mutual understandability research. Therefore, it is more conservative, such as Dan, is generally seen as a single language than the general conservative classification. There are two dialects, and \"\" Ethnic Language is a separate language of Danish and Daidulan. The \"national language\" website also shows that 389 languages ​​(about 6% of total) reached more than 1 million. The total number of users in these languages ​​accounts for 94% of the world's total population, while the remaining 94% of the language only accounts for 6% of the world's population. The right table is \"national language\" estimates the number of languages ​​and its number of users in the world's number of users (2009 data).\n\n\n=== Language and dialect ===\n\nLinguist Max Wein Lai Xi has a very famous discussion, \"said language is a diamond and Navy (A Language IS A DIALECT WITH AN ARMY AND NAVY.), Despite this, there is no obvious language between language and dialect The boundaries, and political borders often affect the language variants as a language or dialect. For example, guest speech, Cantonese and official words are often seen as Chinese dialects, although their difference is more different from Norwegian and its derivative language Swedish differences. Before Yugoslavian civil war, Serbia-Croatian is considered two dialects in the same language, but now Croatian and Serbian use Latin letters and Cyrilli alphabets, as well as different languages. In other words, the difference between language depends not only in cultural differences, text systems, mutual understandability, but also on political considerations.\n\n\n=== World Language ===\n\nThe language in the world can be based on the relative relationship between the common ancestors> Language> Language> Singles> Language> Dialect levels into different languages ​​classification, actually classification levels may be more complicated. The language system that has been identified is hundreds of organizers, but with more evidence in depth in the future, some associates may be classified in larger categories. At the same time, there are currently dozens of languages ​​are listed as isolated languages, and they are unable to find their associations between other languages, such as Basque, Spain, New Mexico, New Mexican, Tarascan, Japan. Arenu and Pakistan's Brugshasi, and so on. There are also some whisperson not listed.\n\nThe User-Indu-European language is mostly 46% of the global population, including primary languages ​​such as English, Spanish, Russian, Indussan (Hindi and Urdu). They first spread throughout the Eurasia (AD 400-2800), and later, as European colonial expansion has made political and large-scale dominant positions in Africa and Americas. The Han Tibetan language is 20% of the global population. It is mainly distributed in East Asia, including Chinese officials, Hakka diars, Cantonese, and other hundreds of smaller languages. There are more language bits in Africa, where the most widely distributed is Niger-Congu, including Swahili, Monkey, and Joben, accounting for 6.9% of the world's population. The scale of Africa is slightly less in Africa, but there are a large number of users, including Arabic, Hebrew, etc., as well as the Hahara Desert, Halars and Berl. The use of the South Island language accounts for 5.5% of the global population, covering the vast range from Madagascar to Southeast Asia and even Oceania. The South Island is included in Malagas language, Malei, Samoa and Indonesia and Taiwan's Aboriginal language. South Island language originated in Taiwan 3,000 in the first 3000 BC, and then spread along many island chains to Oceania after using advanced navigation technology. Other major language bits include the Darro Dragon Department of South Asia (including Kanada, Tamil and Telouu, Central Asian Turki) and South Asia, such as Turkish, Southeast Asia. Language (such as high cotton) and 语 语 (such as Thai). Some local languages ​​are very rich, such as the Americas, Papua New Guinea, West Africa, and South Asia, etc., there will be hundreds of small languages. Although the number does not account for excellent, the language of these places accounts for most of the total world language. There are mainly South America's Kuchmala language, Alavak and Tutin - Guarani, Central America, the Aztex, Outo-Man Gong, Ma Ya, and North America Na-German, Yuluki Department, and Albanian language such as Algona. In Australia, most of the Aboriginal languages ​​belong to Pami-Yonggui Ties. In addition to South Island, New Guinea has a large number of small locations and language islands.\n\n\n=== Endangered language ===\n\nThis language is in an endangered state when most of the user dies or turns to another language. If there is no longer someone as a native language, then it will become a dead language; go down, if there is no one in this language, then it will extinct. Language extinction has been repeatedly happened in human history, but the new colonialism and globalization since the 20th century have exacerbated this trend, and the economic powerful language is still in other languages, and the language of the number of people is on the verge of crisis. It is still unclear how many languages ​​have a total of many languages ​​in the world, depending on many factors. Generally speaking as of 2010, there are 6,000 to 7,000 languages ​​in the world, 50% to 90% of them will extinct before 2100. 50% of the world's population use the top 20 languages, each language exceeds 50 million, while many other languages ​​are only used in small range, most of whom's users are less than 10,000. UNESCO divides the territility of the language into five levels: \"Fragile\" (children are only used in home), \"dangerous\" (no children), \"major hazard\" (main users), \"extremely dangerous\" (extremely dangerous \" The main user is only for the elderly and does not use the first language) and \"extinction\". Although there is always a common language that is unified to be English or Chinese language, it is considered that the disappearance of language will harm the world culture diversity. And the narrative of the Old Testament of the Bible is generally believed that language diversity will lead to political conflicts, but also think that this is contrary to many major violence in the world, such as Nort-North War and Yugoslavian civil war. Or Rwanda's race extinction, regional language diversity of these events is relatively low; and many stable political units are highly multilingual. Many projects are committed to revitalizing the elderly language and promoting educational and literacy of minority languages ​​to prevent or slow down this loss. There are also languages ​​that may have special legislation and stabilize the Aboriginal Speech Community. A small number of linguists believe that language loss is used as a natural process, and it should not be offset, and the end-oriented endangered language is full.\n\n\n== See ==\n\n\n== Comment ==\n\n\n== Reference ==\n\n\n=== Quote ===\n\n\n=== Source ===\n\n\n== External link ==\nWorld Atlas of Language Structures (Page Archive Backup, Internet Archives), (Voice, Syntax, Vocabulary) Structure Properties Large Database\nEthnologue: Languages ​​Of The World (Page Archive Backup, Save Internet Archive), Global Known Language Total\nDistribution of Languages ​​on The Internet (2002) (Page Archive Backup, Save Internet Archives)\nThe Impact of Language In A Globaliad World - Goethe-Institut (Page Archive Backup, Save Internet Archives)\nTop Languages ​​In The World Internet Usage Population and Penetration Report (Nov 2007) (Page Archive Backup, Save Internet Archives)\nWiki of Languages ​​and Construction Languages "}