{"topic": "commons", "english_title": "Commons", "english": "The commons is the cultural and natural resources accessible to all members of a society, including natural materials such as air, water, and a habitable earth. These resources are held in common, not owned privately. Commons can also be understood as natural resources that groups of people (communities, user groups) manage for individual and collective benefit. Characteristically, this involves a variety of informal norms and values (social practice) employed for a governance mechanism.\nCommons can be also defined as a social practice of governing a resource not by state or market but by a community of users that self-governs the resource through institutions that it creates .\n\n\n== Definition and modern use ==\nThe Digital Library of the Commons defines \"commons\" as \"a general term for shared resources in which each stakeholder has an equal interest\".The term \"commons\" derives from the traditional English legal term for common land, which are also known as \"commons\", and was popularised in the modern sense as a shared resource term by the ecologist Garrett Hardin in an influential 1968 article called The Tragedy of the Commons. As Frank van Laerhoven and Elinor Ostrom have stated; \"Prior to the publication of Hardin's article on the tragedy of the commons (1968), titles containing the words 'the commons', 'common pool resources', or 'common property' were very rare in the academic literature.\"Some texts make a distinction in usage between common ownership of the commons and collective ownership among a group of colleagues, such as in a producers' cooperative. The precision of this distinction is not always maintained.\nThe use of \"commons\" for natural resources has its roots in European intellectual history, where it referred to shared agricultural fields, grazing lands and forests that were, over a period of several hundred years, enclosed, claimed as private property for private use. In European political texts, the common wealth was the totality of the material riches of the world, such as the air, the water, the soil and the seed, all nature's bounty regarded as the inheritance of humanity as a whole, to be shared together. In this context, one may go back further, to the Roman legal category res communis, applied to things common to all to be used and enjoyed by everyone, as opposed to res publica, applied to public property managed by the government.\n\n\n== Type ==\n\n\n=== Environmental resource ===\nThe examples below illustrate types of environmental commons.\n\n\n==== European land use ====\n\nOriginally in medieval England the common was an integral part of the manor, and was thus legally part of the estate in land owned by the lord of the manor, but over which certain classes of manorial tenants and others held certain rights. By extension, the term \"commons\" has come to be applied to other resources which a community has rights or access to. The older texts use the word \"common\" to denote any such right, but more modern usage is to refer to particular rights of common, and to reserve the name \"common\" for the land over which the rights are exercised. A person who has a right in, or over, common land jointly with another or others is called a commoner.In middle Europe, commons (relatively small-scale agriculture in, especially, southern Germany, Austria, and the alpine countries) were kept, in some parts, till the present. Some studies have compared the German and English dealings with the commons between late medieval times and the agrarian reforms of the 18th and 19th centuries. The UK was quite radical in doing away with and enclosing former commons, while southwestern Germany (and the alpine countries as e.g. Switzerland) had the most advanced commons structures, and were more inclined to keep them. The Lower Rhine region took an intermediate position. However, the UK and the former dominions have till today a large amount of Crown land which often is used for community or conservation purposes.\n\n\n==== Mongolian grasslands ====\nBased on a research project by the Environmental and Cultural Conservation in Inner Asia (ECCIA) from 1992 to 1995, satellite images were used to compare the amount of land degradation due to livestock grazing in the regions of Mongolia, Russia, and China. In Mongolia, where shepherds were permitted to move collectively between seasonal grazing pastures, degradation remained relatively low at approximately 9%. Comparatively, Russia and China, which mandated state-owned pastures involving immobile settlements and in some cases privatization by household, had much higher degradation, at around 75% and 33% respectively. A collaborative effort on the part of Mongolians proved much more efficient in preserving grazing land.\n\n\n==== Lobster fishery of Maine ====\nWidespread success of the Maine lobster industry is often attributed to the willingness of Maine's lobstermen to uphold and support lobster conservation rules. These rules include harbor territories not recognized by the state, informal trap limits, and laws imposed by the state of Maine (which are largely influenced by lobbying from lobster industry itself). Essentially, the lobstermen collaborate without much government intervention to sustain their common-pool resource.\n\n\n==== Community forests in Nepal ====\nIn the late 1980s, Nepal chose to decentralize government control over forests. Community forest programs work by giving local areas a financial stake in nearby woodlands, and thereby increasing the incentive to protect them from overuse. Local institutions regulate harvesting and selling of timber and land, and must use any profit towards community development and preservation of the forests. In twenty years, locals have noticed a visible increase in the number of trees. Community forestry may also contribute to community development in rural areas – for instance school construction, irrigation and drinking water channel construction, and road construction. Community forestry has proven conducive to democratic practices at grass roots level. Nearly all Nepalese forest user groups generate income from the community forests, although the amount can vary widely among groups. Such income is generated from external sources involving the sales of timber from thinned pine plantations such as in the community forest user groups of Sindhu Palchok and Rachma, and internally in Nepal's mid-hills' broad leaf forests from membership fees, penalties and fines on rule-breakers, in addition to the sales of forest products.\n\n\n==== Irrigation systems of New Mexico ====\n\nAcequia is a method of collective responsibility and management for irrigation systems in desert areas. In New Mexico, a community-run organization known as Acequia Associations supervises water in terms of diversion, distribution, utilization, and recycling, in order to reinforce agricultural traditions and preserve water as a common resource for future generations. The Congreso de las Acequias has since 1990s, is a statewide federation that represents several hundred acequia systems in New Mexico.\n\n\n=== Cultural and intellectual commons ===\nToday, the commons are also understood within a cultural sphere. These commons include literature, music, arts, design, film, video, television, radio, information, software and sites of heritage. Wikipedia is an example of the production and maintenance of common goods by a contributor community in the form of encyclopedic knowledge that can be freely accessed by anyone without a central authority.Tragedy of the commons in the Wiki-Commons is avoided by community control by individual authors within the Wikipedia community.The information commons may help protect users of commons. Companies that pollute the environment release information about what they are doing. The Corporate Toxics Information Project and information like the Toxic 100, a list of the top 100 polluters, helps people know what these corporations are doing to the environment.\n\n\n=== Digital commons ===\n\nMayo Fuster Morell proposed a definition of digital commons as \"information and knowledge resources that are collectively created and owned or shared between or among a community and that tend to be non-exclusive, that is, be (generally freely) available to third parties. Thus, they are oriented to favor use and reuse, rather than to exchange as a commodity. Additionally, the community of people building them can intervene in the governing of their interaction processes and of their shared resources.\"Examples of digital commons are Wikipedia, free software and open-source hardware projects.\nInterestingly, the digital commons can be regarded as a powerful alternative for social change. Evidently, the COVID-19 outbreak has followed other major disasters in the world, yet nothing has really changed in our behaviour, and so far, the political response worldwide has concentrated on “identifying the villain and the hero who will first invent the life-saving vaccine. However, in a time of crisis, it is becoming obvious that the problem is not external but rather embedded and systemic” What this crisis has taught us most of all, is that during uncertain times, what we really lack is the sense of community and social integration.  Amongst many other governance issues, Pazaitis et al. (2020) argue that the reluctance of governments to act proactively in order to avoid economic costs leading to major social problems, are all aligned  with the “growth paradigm” “that prioritises the growth of GDP over human and ecological well-being” – as we have seen many political leaders choosing the economy over health.\nThe notion of the Commons encompasses “the forms of collective action, of coming together, that are not based on a logic of perpetual expansion, but of mutual and collective self-limitation”. Commons systems revolve around self-organisation since past times, and prove that an appropriate interaction between the social and physical technologies, can deliver for tangible needs. As argued in the literature, this field remains a promising one, as there are still plenty lessons to be learned in this respect, both from the “traditional” theory of commons (Ostrom, 1990), as well as from the emerging commons of geographically dispersed communities connected through the Internet.\n\n\n=== Urban commons ===\nUrban commons present the opportunity for the citizens to gain power upon the management of the urban resources and reframe city-life costs based on their use value and maintenance costs, rather than the market-driven value. \n\nUrban commons situates citizens as key players rather than public authorities, private markets and technologies. David Harvey (2012) defines the distinction between public spaces and urban commons. He highlights that the former is not to be equated automatically with urban commons. Public spaces and goods in the city make a commons when part of the citizens take political action. Syntagma Square in Athens, Tahrir Square in Cairo, Maidan Nezalezhnosti in Kyiv, and the Plaza de Catalunya in Barcelona were public spaces that transformed to an urban commons as people protested there to support their political statements. Streets are public spaces that have often become an urban commons by social action and revolutionary protests. Urban commons are operating in the cities in a complementary way with the state and the market. Some examples are community gardening, urban farms on the rooftops and cultural spaces. More recently participatory studies of commons and infrastructures under the conditions of the financial crisis have emerged.\n\n\n=== Knowledge commons ===\n\nIn 2007, Elinor Ostrom along with her colleague Charlotte Hess, did succeed in extending the commons debate to knowledge, approaching knowledge as a complex ecosystem that operates as a common – a shared resource that is subject to social dilemmas and political debates. The focus here was on the ready availability of digital forms of knowledge and associated possibilities to store, access and share it as a common. The connection between knowledge and commons may be made through identifying typical problems associated with natural resource commons, such as congestion, overharvesting, pollution and inequities, which also apply to knowledge. Then, effective alternatives (community-based, non-private, non-state), in line with those of natural commons (involving social rules, appropriate property rights and management structures), solutions are proposed. Thus, the commons metaphor is applied to social practice around knowledge. It is in this context that the present work proceeds, discussing the creation of depositories of knowledge through the organised, voluntary contributions of scholars (the research community, itself a social common), the problems that such knowledge commons might face (such as free-riding or disappearing assets), and the protection of knowledge commons from enclosure and commodification (in the form of intellectual property legislation, patenting, licensing and overpricing). At this point, it is important to note the nature of knowledge and its complex and multi-layered qualities of non-rivalry and non-excludability. Unlike natural commons – which are both rival and excludable (only one person can use any one item or portion at a time and in so doing they use it up, it is consumed) and characterised by scarcity (they can be replenished but there are limits to this, such that consumption/destruction may overtake production/creation) – knowledge commons are characterised by abundance (they are non-rival and non-excludable and thus, in principle, not scarce, so not impelling competition and compelling governance). This abundance of knowledge commons has been celebrated through alternative models of knowledge production, such as Commons-based peer production (CBPP), and embodied in the free software movement. The CBPP model showed the power of networked, open collaboration and non-material incentives to produce better quality products (mainly software).\n\n\n== Commoning as a process ==\nSome scholars have coined the term commoning, which by its nature as a verb serves to emphasize the understanding of the commons as a process and a practice rather than as a static entity. Some authors distinguish between the resources shared (the common-pool resources), the community who governs it, and commoning, that is, the process of coming together to manage such resources. Commoning thus adds another dimension to the commons, acknowledging the social practices entailed in the process of establishing and governing a commons. These practices entail, for the community of commoners, the creation of a new way of living and acting together, thus involving a collective psychological shift: it also entails a process of subjectivization, where the commoners produce themselves as common subjects.The discussion of commoning as a process rather than as a fixed entity also serves to bring new elements to the discussion of the commons. Its focus on social relations endues such processes with an emancipatory potential. Importantly, even if some commons are temporary or fail according to a conventional understanding of the term, their contribution to the members of the community and the social practices and psychological shifts that have arisen are still influential, having contributed to creating new subjectivities and sensibilities. Therefore, in this understanding, commoning can be temporary and this does not entail a problem or a failure. Commoning is a learning process, and the so-called failure of some commons might result in the creation of new ones.\n\n\n== Economic theories ==\n\n\n=== Tragedy of the commons ===\n\nA commons failure theory, now called tragedy of the commons, originated in the 18th century. In 1833 William Forster Lloyd introduced the concept by a hypothetical example of herders overusing a shared parcel of land on which they are each entitled to let their cows graze, to the detriment of all users of the common land. The same concept has been called the \"tragedy of the fishers\", when over-fishing could cause stocks to plummet. Forster’s pamphlet was little known, and it wasn’t until 1968, with the publication by the ecologist Garrett Hardin of the article “The Tragedy of the Commons”, that the term gained relevance. Hardin introduced this tragedy as a social dilemma, and aimed at exposing the inevitability of failure that he saw in the commons.\nHowever, his argument has been widely criticized, since he is accused of having mistaken the commons, that is, resources held and managed in common by a community, with open access, that is, resources that are open to everyone but where it is difficult to restrict access or to establish rules. In the case of the commons, the community manages and sets the rules of access and use of the resource held in common: the fact of having a commons, then, does not mean that anyone is free to use the resource as they like. Studies by Ostrom and others have shown that managing a resource as a commons often has positive outcomes and avoids the so-called tragedy of the commons, a fact that Hardin overlooked.\nIt has been said the dissolution of the traditional land commons played a watershed role in landscape development and cooperative land use patterns and property rights. However, as in the British Isles, such changes took place over several centuries as a result of land enclosure.\nEconomist Peter Barnes has proposed a 'sky trust' to fix this tragedic problem in worldwide generic commons. He claims that the sky belongs to all the people, and companies do not have a right to over pollute. It is a type of cap and dividend program. Ultimately the goal would be to make polluting excessively more expensive than cleaning what is being put into the atmosphere.\n\n\n=== Successful commons ===\nWhile the original work on the tragedy of the commons concept suggested that all commons were doomed to failure, they remain important in the modern world. Work by later economists has found many examples of successful commons, and Elinor Ostrom won the Nobel prize for analysing situations where they operate successfully. For example, Ostrom found that grazing commons in the Swiss Alps have been run successfully for many hundreds of years by the farmers there.Allied to this is the \"comedy of the commons\" concept, where users of the commons are able to develop mechanisms to police their use to maintain, and possibly improve, the state of the commons. This term was coined in an essay by legal scholar, Carol M. Rose, in 1986.Other related concepts are the inverse commons, cornucopia of the commons, and triumph of the commons. It is argued that some types of commons, such as open-source software, work better in the cornucopia of the commons; proponents say that, in those cases, \"the grass grows taller when it is grazed on\".\n\n\n=== Notable theorists ===\n\n\n== Feminist perspectives ==\nSilvia Federici articulates a feminist perspective of the commons in her essay \"Feminism and the Politics of the Commons\". Since the language around the commons has been largely appropriated by the World Bank as it sought to re-brand itself \"the environmental guardian of the planet\", she argues that it is important to adopt a commons discourse that actively resists this re-branding. Secondly, articulations of the commons, although historically present and multiple have struggled to come together as a unified front. For the latter to happen she argues that a \"commoning\" or \"commons\" movement that is effectively able to resist capitalist forms of organizing labour and our livelihoods must look to women to take the lead in organizing the collectivization of our daily lives and the means of production.\n\n\n=== Women and the struggle for the Commons ===\nWomen have traditionally been at the forefront of struggles for commoning \"as primary subjects of reproductive work\". This proximity and dependence on communal natural resources has made women the most vulnerable by their privatization, and made them their most staunch defendants. Examples include: subsistence agriculture, credit associations such as tontine (money commons) and collectivizing reproductive labor. In \"Caliban and the Witch\", Federici interprets the ascent of capitalism as a reactionary move to subvert the rising tide of communalism and to retain the basic social contract.\n\n\n=== \"Feminist Reconstructions\" of the Commons ===\nThe process of commoning the material means of reproduction of human life is most promising in the struggle to \"disentangle our livelihoods not only from the world market but also from the war machine and prison system.\" One of the main aims of the process of commoning is to create \"common subjects\" that are responsible to their communities. The notion of community is not understood as a \"gated community\", but as \"a quality of relations, a principle of cooperation and responsibility to each other and the earth, the forests, the seas, the animals. In communalizing housework, one of the supporting pillars of human activity, it is imperative that this sphere is \"not negated but revolutionized.\" Communalizing housework also serves to de-naturalize it as women's labour, which has been an important part of the feminist struggle.\n\n\n=== Feminist Commons Movement ===\n\n\n==== Abortion and Birth Control ====\nAs reproductive rights over unwanted pregnancies have been denied in many countries for many years, several resistance groups using diverse commoning strategies in order to provide women safe and affordable abortion. Care, knowledge, pills have been made commons against abortion restriction. In New York, U.S., the group Haven Coalition volunteer provide pre and post abortion care for people who have to travel for abortion which is considered illegal in their places of origins, and with New York Abortion Access Fund, they are able to provide them with medical and financial assistance. Underground networks outside male-dominant medical service establishments are where women's networks oversee the abortion and assist each other physically or emotionally by sharing the knowledge of herbalism or home abortion. These underground groups operate under codenames like Jane Collective in Chicago or Renata in Arizona. Some groups like Women on Waves from Netherlands use international waters to conduct abortion. Also, in Italy, Obiezione Respinta movement collaboratively map spaces related to birth control such as pharmacies, consultors, hospitals, etc., through which users share their knowledge and experience of the place and provide access to information that is difficult to obtain.\n\n\n== Historical land commons movements ==\nThe Diggers\nKett's Rebellion\n\n\n== Contemporary commons movements ==\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nAzzellini, Dario (2018). \"Labour as a Commons: The Example of Worker-Recuperated Companies\". Critical Sociology. 44 (4–5): 763–776. doi:10.1177/0896920516661856. S2CID 152137747.\nBasu, S.; Jongerden, J.; Ruivenkamp, G. (2017). \"Development of the drought tolerant variety Sahbhagi Dhan: exploring the concepts commons and community building\". International Journal of the Commons. 11 (1): 144–170. doi:10.18352/ijc.673.\nBasu, S (2016). Knowledge production, Agriculture and Commons: The case of Generation Challenge Programme. (PhD Thesis). Netherlands: Wageningen University. Retrieved from [1].\nBasu, S (2014). An alternative imagination to study commons: beyond state and beyond scientific establishment. Paper presented at the 2nd International Conference on Knowledge Commons for Sustainable Agricultural Innovations. Maringá, Brazil: Maringá State University.\nBollier, David. \"The Commons\". Public Sphere Project. Schuler. Retrieved 26 October 2015.\nBollier, David. (2014). \"The Commons as a Template for Transformation.\" Great Transition Initiative.\nBollier, David and Helfrich, Silke (2012). \"The Wealth of the Commons. A world beyond market & state. The Commons Strategy Group.\nBowers, Chet. (2006). Revitalizing the Commons: Cultural and Educational Sites of Resistance and Affirmation. Lexington Books.\nBowers, Chet. (2012). The Way Forward: Educational Reforms that Focus on the Cultural Commons and the Linguistic Roots of the Ecological Crisis. Eco-Justice Press.\nBresnihan, P. et Byrne, M. (2015). Escape into the city: Everyday practices of communing and the production of urban space in Dublin. Antipode 47(1), pp. 36–54.\nDalakoglou, Dimitris \"Infrastructural gap: Commons, State and Anthropology\". City 20(6).\nDellenbaugh, et al. (2015). Urban Commons: Moving beyond State and Market. Birkhäuser.\nEynaud, Philippe; Juan, Maïté; Mourey, Damien (2018). \"Participatory Art as a Social Practice of Commoning to Reinvent the Right to the City\". Voluntas: International Journal of Voluntary and Nonprofit Organizations. 29 (4): 621–636. doi:10.1007/s11266-018-0006-y. S2CID 149467423.\nFourier, Charles. (1996). The Theory of the Four Movements (Cambridge University Press)\nGregg, Pauline. (2001). Free-Born John: A Biography of John Lilburne (Phoenix Press)\nHarvey, Neil. (1998). The Chiapas Rebellion: The Struggle for Land and Democracy (Duke University Press)\nHill, Christopher. (1984). The World Turned Upside Down: Radical Ideas During the English Revolution (Penguin)\nHill, Christopher. (2006). Winstanley ‘The Law of Freedom’ and other Writings (Cambridge University Press)\nHyde, Lewis. (2010). Common as Air: Revolution, Art and Ownership (Farrar, Straus and Giroux)\nKennedy, Kennedy. (2008). Diggers, Levellers, and Agrarian Capitalism: Radical Political Thought in 17th Century England (Lexington Books)\nKostakis, Vasilis and Bauwens, Michel. (2014). Network Society and Future Scenarios for a Collaborative Economy. (Basingstoke, UK: Palgrave Macmillan). (wiki)\nLeaming, Hugo P. (1995). Hidden Americans: Maroons of Virginia and the Carolinas (Routledge)\nLinebaugh, Peter, and Marcus Rediker. (2000). The Many-Headed Hydra:  Sailors, Slaves, Commoners, and the Hidden History of the Revolutionary Atlantic (Boston: Beacon Press)\nLinebaugh, Peter. (2008). The Magna Carta Manifesto: Liberties and Commons for All (University of California Press)\nLummis, Douglas. (1997). Radical Democracy (Cornell University Press)\nMitchel, John Hanson. (1998). Trespassing: An Inquiry into the Private Ownership of Land (Perseus Books)\nNeeson, J. M. (1996). Commoners: Common Right, Enclosure and Social Change in England, 1700–1820 (Cambridge University Press)\nNegri, Antonio, and Michael Hardt. (2009). Commonwealth. Harvard University Press. ISBN 0674060288\nNewfont, Kathyn. (2012). Blue Ridge Commons: Environmental Activism and Forest History in Western North Carolina (The University of Georgia Press)\nPatel, Raj. (2010). The Value of Nothing (Portobello Books)\nPrice, Richard, ed. (1979). Maroon Societies: Rebel Slave Communities in the Americas (The Johns Hopkins University Press)\nProudhon, Pierre-Joseph. (1994). What is Property? (Cambridge University Press)\nRexroth, Kenneth. (1974). Communalism: From Its Origins to the Twentieth Century (Seabury Press)\nRowe, Jonathan. (2013). Our Common Wealth: The Hidden Economy That Makes Everything Else Work (Berrett-Koehler)\nShantz, Jeff. (2013). Commonist Tendencies: Mutual Aid Beyond Communism. (Punctum)\nSimon, Martin. (2014). Your Money or Your Life: time for both. Social Commons. (Freedom Favours)\n\n\n== External links ==\nIASC - The International Association for the Study of the Commons - an international association dedicated to the international and interdisciplinary study of commons and commons issues\nFoundation for common land – A gathering of those across Great Britain and beyond with a stake in pastoral commons and their future\nInternational Journal of the Commons – an interdisciplinary peer-reviewed open-access journal dedicated to furthering the understanding of institutions for use and management of resources that are (or could be) enjoyed collectively.\nInfrastructuring the Commons – Aalto University Special Interest Group SIG in the Commons (peer-production, co-production, co-governance, co-creation) and Public(s)services. The SIG addresses the relevance of the Commons as a framework to expand the understanding of emerging considerations for the design, provision and maintenance of public services and urban space. Helsinki, Finland.\nOn the Commons – dedicated to exploring ideas and action about the commons—which encompasses natural assets such as oceans and clean air as well as cultural endowments like the Internet, scientific research and the arts.\nThe Peer to Peer Foundation and the Economics and the Commons Conference.\nThe Commons Strategies Group.\nThe Commons Transition Primer.\nP2P Lab", "chinese_title": "", "chinese": ""}