{"topic": "India", "english_title": "India", "english": "India (Hindi: Bhārat), officially the Republic of India (Hindi: Bhārat Gaṇarājya), is a country in South Asia. It is the second-most populous country, the seventh-largest country by land area, and the most populous democracy in the world.  Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar and Indonesia.\nModern humans arrived on the Indian subcontinent from Africa no later than 55,000 years ago.\nTheir long occupation, initially in varying forms of isolation as hunter-gatherers, has made the region highly diverse, second only to Africa in human genetic diversity. Settled life emerged on the subcontinent in the western margins of the Indus river basin 9,000 years ago, evolving gradually into the Indus Valley Civilisation of the third millennium BCE.\nBy 1200 BCE, an archaic form of Sanskrit, an Indo-European language, had diffused into India from the northwest, unfolding as the language of the Rigveda, and recording the dawning of Hinduism in India.\nThe Dravidian languages of India were supplanted in the northern and western regions.\nBy 400 BCE, stratification and exclusion by caste had emerged within Hinduism,\nand Buddhism and Jainism had arisen, proclaiming social orders unlinked to heredity.\nEarly political consolidations gave rise to the loose-knit Maurya and Gupta Empires based in the Ganges Basin.\nTheir collective era was suffused with wide-ranging creativity, but also marked by the declining status of women, and the incorporation of untouchability into an organised system of belief. In South India, the Middle kingdoms exported Dravidian-languages scripts and religious cultures to the kingdoms of Southeast Asia.In the early medieval era, Christianity, Islam, Judaism, and Zoroastrianism put down roots on India's southern and western coasts.\nMuslim armies from Central Asia intermittently overran India's northern plains,\neventually establishing the Delhi Sultanate, and drawing northern India into the cosmopolitan networks of medieval Islam.\nIn the 15th century, the Vijayanagara Empire created a long-lasting composite Hindu culture in south India.\nIn the Punjab, Sikhism emerged, rejecting institutionalised religion.\nThe Mughal Empire, in 1526, ushered in two centuries of relative peace,\nleaving a legacy of luminous architecture.\nGradually expanding rule of the British East India Company followed, turning India into a colonial economy, but also consolidating its sovereignty. British Crown rule began in 1858. The rights promised to Indians were granted slowly, but technological changes were introduced, and ideas of education, modernity and the public life took root.\nA pioneering and influential nationalist movement emerged, which was noted for nonviolent resistance and became the major factor in ending British rule. In 1947 the British Indian Empire was partitioned into two independent dominions, a Hindu-majority Dominion of India and a Muslim-majority Dominion of Pakistan, amid large-scale loss of life and an unprecedented migration.India has been a federal republic since 1950, governed in a democratic parliamentary system. It is a pluralistic, multilingual and multi-ethnic society. India's population grew from 361 million in 1951 to 1.211 billion in 2011.\nDuring the same time, its nominal per capita income increased from US$64 annually to US$1,498, and its literacy rate from 16.6% to 74%. From being a comparatively destitute country in 1951,\nIndia has become a fast-growing major economy and a hub for information technology services, with an expanding middle class. It has a space programme which includes several planned or completed extraterrestrial missions. Indian movies, music, and spiritual teachings play an increasing role in global culture.\nIndia has substantially reduced its rate of poverty, though at the cost of increasing economic inequality.\nIndia is a nuclear-weapon state, which ranks high in military expenditure. It has disputes over Kashmir with its neighbours, Pakistan and China, unresolved since the mid-20th century.\nAmong the socio-economic challenges India faces are gender inequality, child malnutrition,\nand rising levels of air pollution.\nIndia's land is megadiverse, with four biodiversity hotspots. Its forest cover comprises 21.7% of its area. India's wildlife, which has traditionally been viewed with tolerance in India's culture, is supported among these forests, and elsewhere, in protected habitats.\n\n\n== Etymology ==\n\nAccording to the Oxford English Dictionary (third edition 2009), the name \"India\" is derived from the Classical Latin India, a reference to South Asia and an uncertain region to its east; and in turn derived successively from: Hellenistic Greek India ( Ἰνδία); ancient Greek Indos ( Ἰνδός); Old Persian Hindush, an eastern province of the Achaemenid empire; and ultimately its cognate, the Sanskrit Sindhu, or \"river,\" specifically the Indus river and, by implication, its well-settled southern basin. The ancient Greeks referred to the Indians as Indoi (Ἰνδοί), which translates as \"The people of the Indus\".The term Bharat (Bhārat; pronounced [ˈbʱaːɾət] (listen)), mentioned in both Indian epic poetry and the Constitution of India, is used in its variations by many Indian languages. A modern rendering of the historical name Bharatavarsha, which applied originally to a region of the Gangetic Valley, Bharat gained increased currency from the mid-19th century as a native name for India.Hindustan ([ɦɪndʊˈstaːn] (listen)) is a Middle Persian name for India, introduced during the Mughal Empire and used widely since. Its meaning has varied, referring to a region encompassing present-day northern India and Pakistan or to India in its near entirety.\n\n\n== History ==\n\n\n=== Ancient India ===\n\nBy 55,000 years ago, the first modern humans, or Homo sapiens, had arrived on the Indian subcontinent from Africa, where they had earlier evolved.\nThe earliest known modern human remains in South Asia date to about 30,000 years ago. After 6500 BCE, evidence for domestication of food crops and animals, construction of permanent structures, and storage of agricultural surplus appeared in Mehrgarh and other sites in what is now Balochistan, Pakistan. These gradually developed into the Indus Valley Civilisation, the first urban culture in South Asia, which flourished during 2500–1900 BCE in what is now Pakistan and western India. Centred around cities such as Mohenjo-daro, Harappa, Dholavira, and Kalibangan, and relying on varied forms of subsistence, the civilisation engaged robustly in crafts production and wide-ranging trade.During the period 2000–500 BCE, many regions of the subcontinent transitioned from the Chalcolithic cultures to the Iron Age ones. The Vedas, the oldest scriptures associated with Hinduism, were composed during this period, and historians have analysed these to posit a Vedic culture in the Punjab region and the upper Gangetic Plain. Most historians also consider this period to have encompassed several waves of Indo-Aryan migration into the subcontinent from the north-west. The caste system, which created a hierarchy of priests, warriors, and free peasants, but which excluded indigenous peoples by labelling their occupations impure, arose during this period. On the Deccan Plateau, archaeological evidence from this period suggests the existence of a chiefdom stage of political organisation. In South India, a progression to sedentary life is indicated by the large number of megalithic monuments dating from this period, as well as by nearby traces of agriculture, irrigation tanks, and craft traditions.\n\nIn the late Vedic period, around the 6th century BCE, the small states and chiefdoms of the Ganges Plain and the north-western regions had consolidated into 16 major oligarchies and monarchies that were known as the mahajanapadas. The emerging urbanisation gave rise to non-Vedic religious movements, two of which became independent religions. Jainism came into prominence during the life of its exemplar, Mahavira. Buddhism, based on the teachings of Gautama Buddha, attracted followers from all social classes excepting the middle class; chronicling the life of the Buddha was central to the beginnings of recorded history in India. In an age of increasing urban wealth, both religions held up renunciation as an ideal, and both established long-lasting monastic traditions. Politically, by the 3rd century BCE, the kingdom of Magadha had annexed or reduced other states to emerge as the Mauryan Empire. The empire was once thought to have controlled most of the subcontinent except the far south, but its core regions are now thought to have been separated by large autonomous areas. The Mauryan kings are known as much for their empire-building and determined management of public life as for Ashoka's renunciation of militarism and far-flung advocacy of the Buddhist dhamma.The Sangam literature of the Tamil language reveals that, between 200 BCE and 200 CE, the southern peninsula was ruled by the Cheras, the Cholas, and the Pandyas, dynasties that traded extensively with the Roman Empire and with West and South-East Asia. In North India, Hinduism asserted patriarchal control within the family, leading to increased subordination of women. By the 4th and 5th centuries, the Gupta Empire had created a complex system of administration and taxation in the greater Ganges Plain; this system became a model for later Indian kingdoms. Under the Guptas, a renewed Hinduism based on devotion, rather than the management of ritual, began to assert itself. This renewal was reflected in a flowering of sculpture and architecture, which found patrons among an urban elite. Classical Sanskrit literature flowered as well, and Indian science, astronomy, medicine, and mathematics made significant advances.\n\n\n=== Medieval India ===\n\nThe Indian early medieval age, from 600 to 1200 CE, is defined by regional kingdoms and cultural diversity. When Harsha of Kannauj, who ruled much of the Indo-Gangetic Plain from 606 to 647 CE, attempted to expand southwards, he was defeated by the Chalukya ruler of the Deccan. When his successor attempted to expand eastwards, he was defeated by the Pala king of Bengal. When the Chalukyas attempted to expand southwards, they were defeated by the Pallavas from farther south, who in turn were opposed by the Pandyas and the Cholas from still farther south. No ruler of this period was able to create an empire and consistently control lands much beyond their core region. During this time, pastoral peoples, whose land had been cleared to make way for the growing agricultural economy, were accommodated within caste society, as were new non-traditional ruling classes. The caste system consequently began to show regional differences.In the 6th and 7th centuries, the first devotional hymns were created in the Tamil language. They were imitated all over India and led to both the resurgence of Hinduism and the development of all modern languages of the subcontinent. Indian royalty, big and small, and the temples they patronised drew citizens in great numbers to the capital cities, which became economic hubs as well. Temple towns of various sizes began to appear everywhere as India underwent another urbanisation. By the 8th and 9th centuries, the effects were felt in South-East Asia, as South Indian culture and political systems were exported to lands that became part of modern-day Myanmar, Thailand, Laos, Cambodia, Vietnam, Philippines, Malaysia, and Java. Indian merchants, scholars, and sometimes armies were involved in this transmission; South-East Asians took the initiative as well, with many sojourning in Indian seminaries and translating Buddhist and Hindu texts into their languages.\n\nAfter the 10th century, Muslim Central Asian nomadic clans, using swift-horse cavalry and raising vast armies united by ethnicity and religion, repeatedly overran South Asia's north-western plains, leading eventually to the establishment of the Islamic Delhi Sultanate in 1206. The sultanate was to control much of North India and to make many forays into South India. Although at first disruptive for the Indian elites, the sultanate largely left its vast non-Muslim subject population to its own laws and customs. By repeatedly repulsing Mongol raiders in the 13th century, the sultanate saved India from the devastation visited on West and Central Asia, setting the scene for centuries of migration of fleeing soldiers, learned men, mystics, traders, artists, and artisans from that region into the subcontinent, thereby creating a syncretic Indo-Islamic culture in the north. The sultanate's raiding and weakening of the regional kingdoms of South India paved the way for the indigenous Vijayanagara Empire. Embracing a strong Shaivite tradition and building upon the military technology of the sultanate, the empire came to control much of peninsular India, and was to influence South Indian society for long afterwards.\n\n\n=== Early modern India ===\n\nIn the early 16th century, northern India, then under mainly Muslim rulers, fell again to the superior mobility and firepower of a new generation of Central Asian warriors. The resulting Mughal Empire did not stamp out the local societies it came to rule. Instead, it balanced and pacified them through new administrative practices and diverse and inclusive ruling elites, leading to more systematic, centralised, and uniform rule. Eschewing tribal bonds and Islamic identity, especially under Akbar, the Mughals united their far-flung realms through loyalty, expressed through a Persianised culture, to an emperor who had near-divine status. The Mughal state's economic policies, deriving most revenues from agriculture and mandating that taxes be paid in the well-regulated silver currency, caused peasants and artisans to enter larger markets. The relative peace maintained by the empire during much of the 17th century was a factor in India's economic expansion, resulting in greater patronage of painting, literary forms, textiles, and architecture. Newly coherent social groups in northern and western India, such as the Marathas, the Rajputs, and the Sikhs, gained military and governing ambitions during Mughal rule, which, through collaboration or adversity, gave them both recognition and military experience. Expanding commerce during Mughal rule gave rise to new Indian commercial and political elites along the coasts of southern and eastern India. As the empire disintegrated, many among these elites were able to seek and control their own affairs.\n\nBy the early 18th century, with the lines between commercial and political dominance being increasingly blurred, a number of European trading companies, including the English East India Company, had established coastal outposts. The East India Company's control of the seas, greater resources, and more advanced military training and technology led it to increasingly assert its military strength and caused it to become attractive to a portion of the Indian elite; these factors were crucial in allowing the company to gain control over the Bengal region by 1765 and sideline the other European companies. Its further access to the riches of Bengal and the subsequent increased strength and size of its army enabled it to annexe or subdue most of India by the 1820s. India was then no longer exporting manufactured goods as it long had, but was instead supplying the British Empire with raw materials. Many historians consider this to be the onset of India's colonial period. By this time, with its economic power severely curtailed by the British parliament and having effectively been made an arm of British administration, the company began more consciously to enter non-economic arenas like education, social reform, and culture.\n\n\n=== Modern India ===\n\nHistorians consider India's modern age to have begun sometime between 1848 and 1885. The appointment in 1848 of Lord Dalhousie as Governor General of the East India Company set the stage for changes essential to a modern state. These included the consolidation and demarcation of sovereignty, the surveillance of the population, and the education of citizens. Technological changes—among them, railways, canals, and the telegraph—were introduced not long after their introduction in Europe. However, disaffection with the company also grew during this time and set off the Indian Rebellion of 1857. Fed by diverse resentments and perceptions, including invasive British-style social reforms, harsh land taxes, and summary treatment of some rich landowners and princes, the rebellion rocked many regions of northern and central India and shook the foundations of Company rule. Although the rebellion was suppressed by 1858, it led to the dissolution of the East India Company and the direct administration of India by the British government. Proclaiming a unitary state and a gradual but limited British-style parliamentary system, the new rulers also protected princes and landed gentry as a feudal safeguard against future unrest. In the decades following, public life gradually emerged all over India, leading eventually to the founding of the Indian National Congress in 1885.The rush of technology and the commercialisation of agriculture in the second half of the 19th century was marked by economic setbacks and many small farmers became dependent on the whims of far-away markets. There was an increase in the number of large-scale famines, and, despite the risks of infrastructure development borne by Indian taxpayers, little industrial employment was generated for Indians. There were also salutary effects: commercial cropping, especially in the newly canalled Punjab, led to increased food production for internal consumption. The railway network provided critical famine relief, notably reduced the cost of moving goods, and helped nascent Indian-owned industry.\n\nAfter World War I, in which approximately one million Indians served, a new period began. It was marked by British reforms but also repressive legislation, by more strident Indian calls for self-rule, and by the beginnings of a nonviolent movement of non-co-operation, of which Mohandas Karamchand Gandhi would become the leader and enduring symbol. During the 1930s, slow legislative reform was enacted by the British; the Indian National Congress won victories in the resulting elections. The next decade was beset with crises: Indian participation in World War II, the Congress's final push for non-co-operation, and an upsurge of Muslim nationalism. All were capped by the advent of independence in 1947, but tempered by the partition of India into two states: India and Pakistan.Vital to India's self-image as an independent nation was its constitution, completed in 1950, which put in place a secular and democratic republic. It has remained a democracy with civil liberties, an active Supreme Court, and a largely independent press. Economic liberalisation, which began in the 1990s, has created a large urban middle class, transformed India into one of the world's fastest-growing economies, and increased its geopolitical clout. Indian movies, music, and spiritual teachings play an increasing role in global culture. Yet, India is also shaped by seemingly unyielding poverty, both rural and urban; by religious and caste-related violence; by Maoist-inspired Naxalite insurgencies; and by separatism in Jammu and Kashmir and in Northeast India. It has unresolved territorial disputes with China and with Pakistan. India's sustained democratic freedoms are unique among the world's newer nations; however, in spite of its recent economic successes, freedom from want for its disadvantaged population remains a goal yet to be achieved.\n\n\n== Geography ==\n\nIndia accounts for the bulk of the Indian subcontinent, lying atop the Indian tectonic plate, a part of the Indo-Australian Plate. India's defining geological processes began 75 million years ago when the Indian Plate, then part of the southern supercontinent Gondwana, began a north-eastward drift caused by seafloor spreading to its south-west, and later, south and south-east. Simultaneously, the vast Tethyan oceanic crust, to its northeast, began to subduct under the Eurasian Plate. These dual processes, driven by convection in the Earth's mantle, both created the Indian Ocean and caused the Indian continental crust eventually to under-thrust Eurasia and to uplift the Himalayas. Immediately south of the emerging Himalayas, plate movement created a vast trough that rapidly filled with river-borne sediment and now constitutes the Indo-Gangetic Plain. Cut off from the plain by the ancient Aravalli Range lies the Thar Desert.The original Indian Plate survives as peninsular India, the oldest and geologically most stable part of India. It extends as far north as the Satpura and Vindhya ranges in central India. These parallel chains run from the Arabian Sea coast in Gujarat in the west to the coal-rich Chota Nagpur Plateau in Jharkhand in the east. To the south, the remaining peninsular landmass, the Deccan Plateau, is flanked on the west and east by coastal ranges known as the Western and Eastern Ghats; the plateau contains the country's oldest rock formations, some over one billion years old. Constituted in such fashion, India lies to the north of the equator between 6° 44′ and 35° 30′ north latitude and 68° 7′ and 97° 25′ east longitude.India's coastline measures 7,517 kilometres (4,700 mi) in length; of this distance, 5,423 kilometres (3,400 mi) belong to peninsular India and 2,094 kilometres (1,300 mi) to the Andaman, Nicobar, and Lakshadweep island chains. According to the Indian naval hydrographic charts, the mainland coastline consists of the following: 43% sandy beaches; 11% rocky shores, including cliffs; and 46% mudflats or marshy shores.\nMajor Himalayan-origin rivers that substantially flow through India include the Ganges and the Brahmaputra, both of which drain into the Bay of Bengal. Important tributaries of the Ganges include the Yamuna and the Kosi; the latter's extremely low gradient, caused by long-term silt deposition, leads to severe floods and course changes. Major peninsular rivers, whose steeper gradients prevent their waters from flooding, include the Godavari, the Mahanadi, the Kaveri, and the Krishna, which also drain into the Bay of Bengal; and the Narmada and the Tapti, which drain into the Arabian Sea. Coastal features include the marshy Rann of Kutch of western India and the alluvial Sundarbans delta of eastern India; the latter is shared with Bangladesh. India has two archipelagos: the Lakshadweep, coral atolls off India's south-western coast; and the Andaman and Nicobar Islands, a volcanic chain in the Andaman Sea.The Indian climate is strongly influenced by the Himalayas and the Thar Desert, both of which drive the economically and culturally pivotal summer and winter monsoons. The Himalayas prevent cold Central Asian katabatic winds from blowing in, keeping the bulk of the Indian subcontinent warmer than most locations at similar latitudes. The Thar Desert plays a crucial role in attracting the moisture-laden south-west summer monsoon winds that, between June and October, provide the majority of India's rainfall. Four major climatic groupings predominate in India: tropical wet, tropical dry, subtropical humid, and montane.\n\n\n== Biodiversity ==\n\nIndia is a megadiverse country, a term employed for 17 countries which display high biological diversity and contain many species exclusively indigenous, or endemic, to them. India is a habitat for 8.6% of all mammal species, 13.7% of bird species, 7.9% of reptile species, 6% of amphibian species, 12.2% of fish species, and 6.0% of all flowering plant species. Fully a third of Indian plant species are endemic. India also contains four of the world's 34 biodiversity hotspots, or regions that display significant habitat loss in the presence of high endemism.India's forest cover is 99,278 km2 (38,331 sq mi), which is 21.67% of the country's total land area. It can be subdivided further into broad categories of canopy density, or the proportion of the area of a forest covered by its tree canopy. Very dense forest, whose canopy density is greater than 70%, occupies 3.02% of India's land area. It predominates in the tropical moist forest of the Andaman Islands, the Western Ghats, and Northeast India. Moderately dense forest, whose canopy density is between 40% and 70%, occupies 9.39% of India's land area. It predominates in the temperate coniferous forest of the Himalayas, the moist deciduous sal forest of eastern India, and the dry deciduous teak forest of central and southern India.  Open forest, whose canopy density is between 10% and 40%, occupies 9.26% of India's land area, and predominates in the babul-dominated thorn forest of the central Deccan Plateau and the western Gangetic plain.Among the Indian subcontinent's notable indigenous trees are the astringent Azadirachta indica, or neem, which is widely used in rural Indian herbal medicine, and the luxuriant Ficus religiosa, or peepul, which is displayed on the ancient seals of Mohenjo-daro, and under which the Buddha is recorded in the Pali canon to have sought enlightenment.\n\nMany Indian species have descended from those of Gondwana, the southern supercontinent from which India separated more than 100 million years ago.  India's subsequent collision with Eurasia set off a mass exchange of species. However, volcanism and climatic changes later caused the extinction of many endemic Indian forms. Still later, mammals entered India from Asia through two zoogeographical passes flanking the Himalayas. This had the effect of lowering endemism among India's mammals, which stands at 12.6%, contrasting with 45.8% among reptiles and 55.8% among amphibians. Notable endemics are the vulnerable hooded leaf monkey and the threatened Beddom's toad of the Western Ghats.\n\nIndia contains 172 IUCN-designated threatened animal species, or 2.9% of endangered forms.  These include the endangered Bengal tiger and the Ganges river dolphin. Critically endangered species include: the gharial, a crocodilian; the great Indian bustard; and the Indian white-rumped vulture, which has become nearly extinct by having ingested the carrion of diclofenac-treated cattle. The pervasive and ecologically devastating human encroachment of recent decades has critically endangered Indian wildlife. In response, the system of national parks and protected areas, first established in 1935, was expanded substantially. In 1972, India enacted the Wildlife Protection Act and Project Tiger to safeguard crucial wilderness; the Forest Conservation Act was enacted in 1980 and amendments added in 1988. India hosts more than five hundred wildlife sanctuaries and thirteen biosphere reserves, four of which are part of the World Network of Biosphere Reserves; twenty-five wetlands are registered under the Ramsar Convention.\n\n\n== Politics and government ==\n\n\n=== Politics ===\n\nIndia is the world's most populous democracy. A parliamentary republic with a multi-party system, it has eight recognised national parties, including the Indian National Congress and the Bharatiya Janata Party (BJP), and more than 40 regional parties. The Congress is considered centre-left in Indian political culture, and the BJP right-wing. For most of the period between 1950—when India first became a republic—and the late 1980s, the Congress held a majority in the parliament. Since then, however, it has increasingly shared the political stage with the BJP, as well as with powerful regional parties which have often forced the creation of multi-party coalition governments at the centre.In the Republic of India's first three general elections, in 1951, 1957, and 1962, the Jawaharlal Nehru-led Congress won easy victories. On Nehru's death in 1964, Lal Bahadur Shastri briefly became prime minister; he was succeeded, after his own unexpected death in 1966, by Nehru's daughter Indira Gandhi, who went on to lead the Congress to election victories in 1967 and 1971. Following public discontent with the state of emergency she declared in 1975, the Congress was voted out of power in 1977; the then-new Janata Party, which had opposed the emergency, was voted in. Its government lasted just over two years. Voted back into power in 1980, the Congress saw a change in leadership in 1984, when Indira Gandhi was assassinated; she was succeeded by her son Rajiv Gandhi, who won an easy victory in the general elections later that year. The Congress was voted out again in 1989 when a National Front coalition, led by the newly formed Janata Dal in alliance with the Left Front, won the elections; that government too proved relatively short-lived, lasting just under two years. Elections were held again in 1991; no party won an absolute majority. The Congress, as the largest single party, was able to form a minority government led by P. V. Narasimha Rao.\n\nA two-year period of political turmoil followed the general election of 1996. Several short-lived alliances shared power at the centre. The BJP formed a government briefly in 1996; it was followed by two comparatively long-lasting United Front coalitions, which depended on external support. In 1998, the BJP was able to form a successful coalition, the National Democratic Alliance (NDA). Led by Atal Bihari Vajpayee, the NDA became the first non-Congress, coalition government to complete a five-year term. Again in the 2004 Indian general elections, no party won an absolute majority, but the Congress emerged as the largest single party, forming another successful coalition: the United Progressive Alliance (UPA). It had the support of left-leaning parties and MPs who opposed the BJP. The UPA returned to power in the 2009 general election with increased numbers, and it no longer required external support from India's communist parties. That year, Manmohan Singh became the first prime minister since Jawaharlal Nehru in 1957 and 1962 to be re-elected to a consecutive five-year term. In the 2014 general election, the BJP became the first political party since 1984 to win a majority and govern without the support of other parties. The incumbent prime minister is Narendra Modi, a former chief minister of Gujarat. On 20 July 2017, Ram Nath Kovind was elected India's 14th president and took the oath of office on 25 July 2017.\n\n\n=== Government ===\n\nIndia is a federation with a parliamentary system governed under the Constitution of India—the country's supreme legal document. It is a constitutional republic and representative democracy, in which \"majority rule is tempered by minority rights protected by law\". Federalism in India defines the power distribution between the union and the states. The Constitution of India, which came into effect on 26 January 1950, originally stated India to be a \"sovereign, democratic republic;\" this characterisation was amended in 1971 to \"a sovereign, socialist, secular, democratic republic\". India's form of government, traditionally described as \"quasi-federal\" with a strong centre and weak states, has grown increasingly federal since the late 1990s as a result of political, economic, and social changes.\nThe Government of India comprises three branches:\nExecutive: The President of India is the ceremonial head of state, who is elected indirectly for a five-year term by an electoral college comprising members of national and state legislatures. The Prime Minister of India is the head of government and exercises most executive power. Appointed by the president, the prime minister is by convention supported by the party or political alliance having a majority of seats in the lower house of parliament. The executive of the Indian government consists of the president, the vice president, and the Union Council of Ministers—with the cabinet being its executive committee—headed by the prime minister. Any minister holding a portfolio must be a member of one of the houses of parliament. In the Indian parliamentary system, the executive is subordinate to the legislature; the prime minister and their council are directly responsible to the lower house of the parliament. Civil servants act as permanent executives and all decisions of the executive are implemented by them.\nLegislature: The legislature of India is the bicameral parliament. Operating under a Westminster-style parliamentary system, it comprises an upper house called the Rajya Sabha (Council of States) and a lower house called the Lok Sabha (House of the People). The Rajya Sabha is a permanent body of 245 members who serve staggered six-year terms. Most are elected indirectly by the state and union territorial legislatures in numbers proportional to their state's share of the national population. All but two of the Lok Sabha's 545 members are elected directly by popular vote; they represent single-member constituencies for five-year terms. Two seats of parliament, reserved for Anglo-Indian in the article 331, have been scrapped.\nJudiciary: India has a three-tier unitary independent judiciary comprising the supreme court, headed by the Chief Justice of India, 25 high courts, and a large number of trial courts. The supreme court has original jurisdiction over cases involving fundamental rights and over disputes between states and the centre and has appellate jurisdiction over the high courts. It has the power to both strike down union or state laws which contravene the constitution, and invalidate any government action it deems unconstitutional.\n\n\n=== Administrative divisions ===\n\nIndia is a federal union comprising 28 states and 8 union territories (listed below as 1–28 and A–H, respectively). All states, as well as the union territories of Jammu and Kashmir,  Puducherry and the National Capital Territory of Delhi, have elected legislatures and governments following the Westminster system of governance. The remaining five union territories are directly ruled by the central government through appointed administrators. In 1956, under the States Reorganisation Act, states were reorganised on a linguistic basis. There are over a quarter of a million local government bodies at city, town, block, district and village levels.\n\n\n== Foreign, economic and strategic relations ==\n\nIn the 1950s, India strongly supported decolonisation in Africa and Asia and played a leading role in the Non-Aligned Movement. After initially cordial relations with neighbouring China, India went to war with China in 1962, and was widely thought to have been humiliated. India has had tense relations with neighbouring Pakistan; the two nations have gone to war four times: in 1947, 1965, 1971, and 1999. Three of these wars were fought over the disputed territory of Kashmir, while the fourth, the 1971 war, followed from India's support for the independence of Bangladesh. In the late 1980s, the Indian military twice intervened abroad at the invitation of the host country: a peace-keeping operation in Sri Lanka between 1987 and 1990; and an armed intervention to prevent a 1988 coup d'état attempt in the Maldives. After the 1965 war with Pakistan, India began to pursue close military and economic ties with the Soviet Union; by the late 1960s, the Soviet Union was its largest arms supplier.Aside from ongoing its special relationship with Russia, India has wide-ranging defence relations with Israel and France. In recent years, it has played key roles in the South Asian Association for Regional Cooperation and the World Trade Organization. The nation has provided 100,000 military and police personnel to serve in 35 UN peacekeeping operations across four continents. It participates in the East Asia Summit, the G8+5, and other multilateral forums. India has close economic ties with countries in South America, Asia, and Africa; it pursues a \"Look East\" policy that seeks to strengthen partnerships with the ASEAN nations, Japan, and South Korea that revolve around many issues, but especially those involving economic investment and regional security.\n\nChina's nuclear test of 1964, as well as its repeated threats to intervene in support of Pakistan in the 1965 war, convinced India to develop nuclear weapons. India conducted its first nuclear weapons test in 1974 and carried out additional underground testing in 1998. Despite criticism and military sanctions, India has signed neither the Comprehensive Nuclear-Test-Ban Treaty nor the Nuclear Non-Proliferation Treaty, considering both to be flawed and discriminatory. India maintains a \"no first use\" nuclear policy and is developing a nuclear triad capability as a part of its \"Minimum Credible Deterrence\" doctrine. It is developing a ballistic missile defence shield and, a fifth-generation fighter jet. Other indigenous military projects involve the design and implementation of Vikrant-class aircraft carriers and Arihant-class nuclear submarines.Since the end of the Cold War, India has increased its economic, strategic, and military co-operation with the United States and the European Union. In 2008, a civilian nuclear agreement was signed between India and the United States. Although India possessed nuclear weapons at the time and was not a party to the Nuclear Non-Proliferation Treaty, it received waivers from the International Atomic Energy Agency and the Nuclear Suppliers Group, ending earlier restrictions on India's nuclear technology and commerce. As a consequence, India became the sixth de facto nuclear weapons state. India subsequently signed co-operation agreements involving civilian nuclear energy with Russia, France, the United Kingdom, and Canada.\n\nThe President of India is the supreme commander of the nation's armed forces; with 1.395 million active troops, they compose the world's second-largest military. It comprises the Indian Army, the Indian Navy, the Indian Air Force, and the Indian Coast Guard. The official Indian defence budget for 2011 was US$36.03 billion, or 1.83% of GDP. For the fiscal year spanning 2012–2013, US$40.44 billion was budgeted. According to a 2008 Stockholm International Peace Research Institute (SIPRI) report, India's annual military expenditure in terms of purchasing power stood at US$72.7 billion. In 2011, the annual defence budget increased by 11.6%, although this does not include funds that reach the military through other branches of government. As of 2012, India is the world's largest arms importer; between 2007 and 2011, it accounted for 10% of funds spent on international arms purchases. Much of the military expenditure was focused on defence against Pakistan and countering growing Chinese influence in the Indian Ocean. In May 2017, the Indian Space Research Organisation launched the South Asia Satellite, a gift from India to its neighbouring SAARC countries. In October 2018, India signed a US$5.43 billion (over ₹400 billion) agreement with Russia to procure four S-400 Triumf surface-to-air missile defence systems, Russia's most advanced long-range missile defence system.\n\n\n== Economy ==\n\nAccording to the International Monetary Fund (IMF), the Indian economy in 2019 was nominally worth $2.9 trillion; it is the fifth-largest economy by market exchange rates, and is around $11 trillion, the third-largest by purchasing power parity (PPP). With its average annual GDP growth rate of 5.8% over the past two decades, and reaching 6.1% during 2011–2012, India is one of the world's fastest-growing economies. However, the country ranks 139th in the world in nominal GDP per capita and 118th in GDP per capita at PPP. Until 1991, all Indian governments followed protectionist policies that were influenced by socialist economics. Widespread state intervention and regulation largely walled the economy off from the outside world. An acute balance of payments crisis in 1991 forced the nation to liberalise its economy; since then it has moved slowly towards a free-market system by emphasising both foreign trade and direct investment inflows. India has been a member of WTO since 1 January 1995.The 513.7-million-worker Indian labour force is the world's second-largest, as of 2016. The service sector makes up 55.6% of GDP, the industrial sector 26.3% and the agricultural sector 18.1%. India's foreign exchange remittances of US$70 billion in 2014, the largest in the world, were contributed to its economy by 25 million Indians working in foreign countries. Major agricultural products include: rice, wheat, oilseed, cotton, jute, tea, sugarcane, and potatoes. Major industries include: textiles, telecommunications, chemicals, pharmaceuticals, biotechnology, food processing, steel, transport equipment, cement, mining, petroleum, machinery, and software. In 2006, the share of external trade in India's GDP stood at 24%, up from 6% in 1985. In 2008, India's share of world trade was 1.68%; In 2011, India was the world's tenth-largest importer and the nineteenth-largest exporter. Major exports include: petroleum products, textile goods, jewellery, software, engineering goods, chemicals, and manufactured leather goods. Major imports include: crude oil, machinery, gems, fertiliser, and chemicals. Between 2001 and 2011, the contribution of petrochemical and engineering goods to total exports grew from 14% to 42%. India was the world's second largest textile exporter after China in the 2013 calendar year.Averaging an economic growth rate of 7.5% for several years prior to 2007, India has more than doubled its hourly wage rates during the first decade of the 21st century. Some 431 million Indians have left poverty since 1985; India's middle classes are projected to number around 580 million by 2030. Though ranking 51st in global competitiveness, as of 2010, India ranks 17th in financial market sophistication, 24th in the banking sector, 44th in business sophistication, and 39th in innovation, ahead of several advanced economies. With seven of the world's top 15 information technology outsourcing companies based in India, as of 2009, the country is viewed as the second-most favourable outsourcing destination after the United States. India's consumer market, the world's eleventh-largest, is expected to become fifth-largest by 2030. Increasing access to electricity and clean cooking have been the priorities for energy in India: the country's coal is a major cause of greenhouse gas emissions by India but the country's renewable energy is competing strongly.Driven by growth, India's nominal GDP per capita increased steadily from US$329 in 1991, when economic liberalisation began, to US$1,265 in 2010, to an estimated US$1,723 in 2016. It is expected to grow to US$2,191 by 2021. However, it has remained lower than those of other Asian developing countries such as Indonesia, Malaysia, Philippines, Sri Lanka, and Thailand, and is expected to remain so in the near future. \n\nAccording to a 2011 PricewaterhouseCoopers (PwC) report, India's GDP at purchasing power parity could overtake that of the United States by 2045. During the next four decades, Indian GDP is expected to grow at an annualised average of 8%, making it potentially the world's fastest-growing major economy until 2050. The report highlights key growth factors: a young and rapidly growing working-age population; growth in the manufacturing sector because of rising education and engineering skill levels; and sustained growth of the consumer market driven by a rapidly growing middle-class. The World Bank cautions that, for India to achieve its economic potential, it must continue to focus on public sector reform, transport infrastructure, agricultural and rural development, removal of labour regulations, education, energy security, and public health and nutrition.According to the Worldwide Cost of Living Report 2017 released by the Economist Intelligence Unit (EIU) which was created by comparing more than 400 individual prices across 160 products and services, four of the cheapest cities were in India: Bangalore (3rd), Mumbai (5th), Chennai (5th) and New Delhi (8th).\n\n\n=== Industries ===\n\nIndia's telecommunication industry is the second-largest in the world with over 1.2 billion subscribers. It contributes 6.5% to India's GDP.  After the third quarter of 2017, India surpassed the US to become the second largest smartphone market in the world after China.The Indian automotive industry, the world's second-fastest growing, increased domestic sales by 26% during 2009–2010, and exports by 36% during 2008–2009. India's capacity to generate electrical power is 300 gigawatts, of which 42 gigawatts is renewable. At the end of 2011, the Indian IT industry employed 2.8 million professionals, generated revenues close to US$100 billion equalling 7.5% of Indian GDP, and contributed 26% of India's merchandise exports.The pharmaceutical industry in India is among the significant emerging markets for the global pharmaceutical industry. The Indian pharmaceutical market is expected to reach $48.5 billion by 2020. India's R & D spending constitutes 60% of the biopharmaceutical industry. India is among the top 12 biotech destinations in the world. The Indian biotech industry grew by 15.1% in 2012–2013, increasing its revenues from ₹204.4 billion (Indian rupees) to ₹235.24 billion (US$3.94 billion at June 2013 exchange rates).\n\n\n=== Socio-economic challenges ===\n\nDespite economic growth during recent decades, India continues to face socio-economic challenges. In 2006, India contained the largest number of people living below the World Bank's international poverty line of US$1.25 per day. The proportion decreased from 60% in 1981 to 42% in 2005. Under the World Bank's later revised poverty line, it was 21% in 2011. 30.7% of India's children under the age of five are underweight. According to a Food and Agriculture Organization report in 2015, 15% of the population is undernourished. The Mid-Day Meal Scheme attempts to lower these rates.According to a 2016 Walk Free Foundation report there were an estimated 18.3 million people in India, or 1.4% of the population, living in the forms of modern slavery, such as bonded labour, child labour, human trafficking, and forced begging, among others. According to the 2011 census, there were 10.1 million child labourers in the country, a decline of 2.6 million from 12.6 million in 2001.Since 1991, economic inequality between India's states has consistently grown: the per-capita net state domestic product of the richest states in 2007 was 3.2 times that of the poorest. Corruption in India is perceived to have decreased. According to the Corruption Perceptions Index, India ranked 78th out of 180 countries in 2018 with a score of 41 out of 100, an improvement from 85th in 2014.\n\n\n== Demographics, languages, and religion ==\n\nWith 1,210,193,422 residents reported in the 2011 provisional census report, India is the world's second-most populous country. Its population grew by 17.64% from 2001 to 2011, compared to 21.54% growth in the previous decade (1991–2001). The human sex ratio, according to the 2011 census, is 940 females per 1,000 males. The median age was 27.6 as of 2016. The first post-colonial census, conducted in 1951, counted 361 million people. Medical advances made in the last 50 years as well as increased agricultural productivity brought about by the \"Green Revolution\" have caused India's population to grow rapidly.The average life expectancy in India is at 68 years—69.6 years for women, 67.3 years for men. There are around 50 physicians per 100,000 Indians. Migration from rural to urban areas has been an important dynamic in India's recent history. The number of people living in urban areas grew by 31.2% between 1991 and 2001. Yet, in 2001, over 70% still lived in rural areas. The level of urbanisation increased further from 27.81% in the 2001 Census to 31.16% in the 2011 Census. The slowing down of the overall population growth rate was due to the sharp decline in the growth rate in rural areas since 1991. According to the 2011 census, there are 53 million-plus urban agglomerations in India; among them Mumbai, Delhi, Kolkata, Chennai, Bangalore, Hyderabad and Ahmedabad, in decreasing order by population. The literacy rate in 2011 was 74.04%: 65.46% among females and 82.14% among males. The rural-urban literacy gap, which was 21.2 percentage points in 2001, dropped to 16.1 percentage points in 2011. The improvement in the rural literacy rate is twice that of  urban areas. Kerala is the most literate state with 93.91% literacy; while Bihar the least with 63.82%.\n\nIndia is home to two major language families: Indo-Aryan (spoken by about 74% of the population) and Dravidian (spoken by 24% of the population). Other languages spoken in India come from the Austroasiatic and Sino-Tibetan language families. India has no national language. Hindi, with the largest number of speakers, is the official language of the government. English is used extensively in business and administration and has the status of a \"subsidiary official language\"; it is important in education, especially as a medium of higher education. Each state and union territory has one or more official languages, and the constitution recognises in particular 22 \"scheduled languages\".\nThe 2011 census reported the religion in India with the largest number of followers was Hinduism (79.80% of the population), followed by Islam (14.23%); the remaining were Christianity (2.30%), Sikhism (1.72%), Buddhism (0.70%), Jainism (0.36%) and others (0.9%). India has the third-largest Muslim population—the largest for a non-Muslim majority country.\n\n\n== Culture ==\n\nIndian cultural history spans more than 4,500 years. During the Vedic period (c. 1700 BCE – c. 500 BCE), the foundations of Hindu philosophy, mythology, theology and literature were laid, and many beliefs and practices which still exist today, such as dhárma, kárma, yóga, and mokṣa, were established. India is notable for its religious diversity, with Hinduism, Buddhism, Sikhism, Islam, Christianity, and Jainism among the nation's major religions. The predominant religion, Hinduism, has been shaped by various historical schools of thought, including those of the Upanishads, the Yoga Sutras, the Bhakti movement, and by Buddhist philosophy.\n\n\n=== Visual art ===\n\nSouth Asia has an ancient tradition of art, which has exchanged influences with the parts of Eurasia.   Seals from the third millennium BCE Indus Valley Civilization of Pakistan and northern India have been found, usually carved with animals, but a few with human figures. The \"Pashupati\" seal, excavated in Mohenjo-daro, Pakistan, in 1928–29, is the best known.  After this there is a long period with virtually nothing surviving. Almost all surviving ancient Indian art thereafter is in various forms of religious sculpture in durable materials, or coins. There was probably originally far more in wood, which is lost. In north India Mauryan art is the first imperial movement. In the first millennium CE, Buddhist art spread with Indian religions to Central, East and South-East Asia, the last also greatly influenced by Hindu art.  Over the following centuries a distinctly Indian style of sculpting the human figure developed, with less interest in articulating precise anatomy than ancient Greek sculpture but showing smoothly-flowing forms expressing prana (\"breath\" or life-force).  This is often complicated by the need to give figures multiple arms or heads, or represent different genders on the left and right of figures, as with the Ardhanarishvara form of Shiva and Parvati.Most of the earliest large sculpture is Buddhist, either excavated from Buddhist stupas such as Sanchi, Sarnath and Amaravati, or is rock-cut reliefs at sites such as Ajanta, Karla and Ellora.  Hindu and Jain sites appear rather later.  In spite of this complex mixture of religious traditions, generally, the prevailing artistic style at any time and place has been shared by the major religious groups, and sculptors probably usually served all communities. Gupta art, at its peak c. 300 CE – c. 500 CE, is often regarded as a classical period whose influence lingered for many centuries after; it saw a new dominance of Hindu sculpture, as at the Elephanta Caves.  Across the north, this became rather stiff and formulaic after c. 800 CE, though rich with finely carved detail in the surrounds of statues.  But in the South, under the Pallava and Chola dynasties, sculpture in both stone and bronze had a sustained period of great achievement; the large bronzes with Shiva as Nataraja have become an iconic symbol of India.Ancient painting has only survived at a few sites, of which the crowded scenes of court life in the Ajanta Caves are by far the most important, but it was evidently highly developed, and is mentioned as a courtly accomplishment in Gupta times.  Painted manuscripts of religious texts survive from Eastern India about the 10th century onwards, most of the earliest being Buddhist and later Jain. No doubt the style of these was used in larger paintings. The Persian-derived Deccan painting, starting just before the Mughal miniature, between them give the first large body of secular painting, with an emphasis on portraits, and the recording of princely pleasures and wars. The style spread to Hindu courts, especially among the Rajputs, and developed a variety of styles, with the smaller courts often the most innovative, with figures such as Nihâl Chand and Nainsukh.  As a market developed among European residents, it was supplied by Company painting by Indian artists with considerable Western influence. In the 19th century, cheap Kalighat paintings of gods and everyday life, done on paper, were urban folk art from Calcutta, which later saw the  Bengal School of Art, reflecting the art colleges founded by the British, the first movement in modern Indian painting.\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n=== Architecture and literature ===\n\nMuch of Indian architecture, including the Taj Mahal, other works of Mughal architecture, and South Indian architecture, blends ancient local traditions with imported styles. Vernacular architecture is also regional in its flavours. Vastu shastra, literally \"science of construction\" or \"architecture\" and ascribed to Mamuni Mayan, explores how the laws of nature affect human dwellings; it employs precise geometry and directional alignments to reflect perceived cosmic constructs. As applied in Hindu temple architecture, it is influenced by the Shilpa Shastras, a series of foundational texts whose basic mythological form is the Vastu-Purusha mandala, a square that embodied the \"absolute\". The Taj Mahal, built in Agra between 1631 and 1648 by orders of Emperor Shah Jahan in memory of his wife, has been described in the UNESCO World Heritage List as \"the jewel of Muslim art in India and one of the universally admired masterpieces of the world's heritage\". Indo-Saracenic Revival architecture, developed by the British in the late 19th century, drew on Indo-Islamic architecture.The earliest literature in India, composed between 1500 BCE and 1200 CE, was in the Sanskrit language. Major works of Sanskrit literature include the Rigveda (c. 1500 BCE – c. 1200 BCE), the epics: Mahābhārata ( c. 400 BCE – c. 400 CE) and the Ramayana ( c. 300 BCE and later);  Abhijñānaśākuntalam (The Recognition of Śakuntalā, and other dramas of Kālidāsa ( c. 5th century CE) and Mahākāvya poetry.  In Tamil literature, the Sangam literature ( c. 600 BCE – c. 300 BCE) consisting of 2,381 poems, composed by 473 poets, is the earliest work. From the 14th to the 18th centuries, India's literary traditions went through a period of drastic change because of the emergence of devotional poets like Kabīr, Tulsīdās, and Guru Nānak. This period was characterised by a varied and wide spectrum of thought and expression; as a consequence, medieval Indian literary works differed significantly from classical traditions. In the 19th century, Indian writers took a new interest in social questions and psychological descriptions. In the 20th century, Indian literature was influenced by the works of the Bengali poet, author and philosopher Rabindranath Tagore, who was a recipient of the Nobel Prize in Literature.\n\n\n=== Performing arts and media ===\n\nIndian music ranges over various traditions and regional styles. Classical music encompasses two genres and their various folk offshoots: the northern Hindustani and southern Carnatic schools. Regionalised popular forms include filmi and folk music; the syncretic tradition of the bauls is a well-known form of the latter. Indian dance also features diverse folk and classical forms. Among the better-known folk dances are: the bhangra of Punjab, the bihu of Assam, the Jhumair and chhau of Jharkhand, Odisha and West Bengal, garba and dandiya of Gujarat, ghoomar of Rajasthan, and the lavani of Maharashtra. Eight dance forms, many with narrative forms and mythological elements, have been accorded classical dance status by India's National Academy of Music, Dance, and Drama. These are: bharatanatyam of the state of Tamil Nadu, kathak of Uttar Pradesh, kathakali and mohiniyattam of Kerala, kuchipudi of Andhra Pradesh, manipuri of Manipur, odissi of Odisha, and the sattriya of Assam.Theatre in India melds music, dance, and improvised or written dialogue. Often based on Hindu mythology, but also borrowing from medieval romances or social and political events, Indian theatre includes: the bhavai of Gujarat, the jatra of West Bengal, the nautanki and ramlila of North India, tamasha of Maharashtra, burrakatha of Andhra Pradesh, terukkuttu of Tamil Nadu, and the yakshagana of Karnataka. India has a theatre training institute the National School of Drama (NSD) that is situated at New Delhi It is an autonomous organisation under the Ministry of Culture, Government of India.\nThe Indian film industry produces the world's most-watched cinema. Established regional cinematic traditions exist in the Assamese, Bengali, Bhojpuri, Hindi, Kannada, Malayalam, Punjabi, Gujarati, Marathi, Odia, Tamil, and Telugu languages.  The Hindi language film industry (Bollywood) is the largest sector representing 43% of box office revenue, followed by the South Indian Telugu and Tamil film industries which represent 36% combined.Television broadcasting began in India in 1959 as a state-run medium of communication and expanded slowly for more than two decades. The state monopoly on television broadcast ended in the 1990s. Since then, satellite channels have increasingly shaped the popular culture of Indian society. Today, television is the most penetrative media in India; industry estimates indicate that as of 2012 there are over 554 million TV consumers, 462 million with satellite or cable connections compared to other forms of mass media such as the press (350 million), radio (156 million) or internet (37 million).\n\n\n=== Society ===\n\nTraditional Indian society is sometimes defined by social hierarchy. The Indian caste system embodies much of the social stratification and many of the social restrictions found in the Indian subcontinent. Social classes are defined by thousands of endogamous hereditary groups, often termed as jātis, or \"castes\". India declared untouchability to be illegal in 1947 and has since enacted other anti-discriminatory laws and social welfare initiatives.\nFamily values are important in the Indian tradition, and multi-generational patriarchal joint families have been the norm in India, though nuclear families are becoming common in urban areas. An overwhelming majority of Indians, with their consent, have their marriages arranged by their parents or other family elders. Marriage is thought to be for life, and the divorce rate is extremely low, with less than one in a thousand marriages ending in divorce. Child marriages are common, especially in rural areas; many women wed before reaching 18, which is their legal marriageable age. Female infanticide in India, and lately female foeticide, have created skewed gender ratios; the number of missing women in the country quadrupled from 15 million to 63 million in the 50-year period ending in 2014, faster than the population growth during the same period, and constituting 20 percent of India's female electorate. Accord to an Indian government study, an additional 21 million girls are unwanted and do not receive adequate care.  Despite a government ban on sex-selective foeticide, the practice remains commonplace in India, the result of a preference for boys in a patriarchal society. The payment of dowry, although illegal, remains widespread across class lines. Deaths resulting from dowry, mostly from bride burning, are on the rise, despite stringent anti-dowry laws.Many Indian festivals are religious in origin. The best known include: Diwali, Ganesh Chaturthi, Thai Pongal, Holi, Durga Puja, Eid ul-Fitr, Bakr-Id, Christmas, and Vaisakhi.\n\n\n=== Education ===\n\nIn the 2011 census, about 73% of the population was literate, with 81% for men and 65% for women. This compares to 1981 when the respective rates were 41%, 53% and 29%. In 1951 the rates were 18%, 27% and 9%.  In 1921 the rates 7%, 12% and 2%.  In 1891 they were 5%, 9% and 1%,  According to Latika Chaudhary, in 1911 there were under three primary schools for every ten villages. Statistically, more caste and religious diversity reduced private spending. Primary schools taught literacy, so local diversity limited its growth.Education system of India is the world's second largest higher education System. India had over 900 universities, 40,000 colleges and 1.5 million schools. In India's higher education system, a significant number of seats are reserved under affirmative action policies for the historically disadvantaged. In recent decades India's improved education system is often cited as one of the main contributors to its economic development.\n\n\n=== Clothing ===\n\nThe most widely worn traditional dress in India, for both women and men, from ancient times until the advent of modern times, was draped. For women it eventually took the form of a sari, a single long piece of cloth, famously six yards long, and of width spanning the lower body. The sari is tied around the waist and knotted at one end, wrapped around the lower body, and then over the shoulder. In its more modern form, it has been used to cover the head, and sometimes the face, as a veil. It has been combined with an underskirt, or Indian petticoat, and tucked in the waist band for more secure fastening, It is also commonly worn with an Indian blouse, or choli, which serves as the primary upper-body garment, the sari's end—passing over the shoulder—serving to obscure the upper body's contours and to cover the midriff.For men, a similar but shorter length of cloth, the dhoti, has served as a lower-body garment. It too is tied around the waist and wrapped. In south India, it is usually wrapped around the lower body, the upper end tucked in the waistband, the lower left free. In addition, in northern India, it is also wrapped once around each leg before being brought up through the legs to be tucked in at the back. Other forms of traditional apparel that involve no stitching or tailoring are the chaddar (a shawl worn by both sexes to cover the upper body during colder weather, or a large veil worn by women for framing the head, or covering it) and the pagri (a turban or a scarf worn around the head as a part of a tradition, or to keep off the sun or the cold).\n\nUntil the beginning of the first millennium CE, the ordinary dress of people in India was entirely unstitched. The arrival of the Kushans from Central Asia, c. 48 CE, popularised cut and sewn garments in the style of Central Asian favoured by the elite in northern India. However, it was not until Muslim rule was established, first with the Delhi sultanate and then the Mughal Empire, that the range of stitched clothes in India grew and their use became significantly more widespread. Among the various garments gradually establishing themselves in northern India during medieval and early-modern times and now commonly worn are: the shalwars and pyjamas both forms of trousers, as well as the tunics kurta and kameez. In southern India, however, the traditional draped garments were to see much longer continuous use.Shalwars are atypically wide at the waist but narrow to a cuffed bottom. They are held up by a drawstring or elastic belt, which causes them to become pleated around the waist. The pants can be wide and baggy, or they can be cut quite narrow, on the bias, in which case they are called churidars. The kameez is a long shirt or tunic. The side seams are left open below the waist-line,), which gives the wearer greater freedom of movement. The kameez is usually cut straight and flat; older kameez use traditional cuts; modern kameez are more likely to have European-inspired set-in sleeves. The kameez may have a European-style collar, a Mandarin-collar, or it may be collarless; in the latter case, its design as a women's garment is similar to a kurta. At first worn by Muslim women, the use of shalwar kameez gradually spread, making them a regional style, especially in the Punjab region.A kurta, which traces its roots to Central Asian nomadic tunics, has evolved stylistically in India as a garment for everyday wear as well as for formal occasions. It is traditionally made of cotton or silk; it is worn plain or with embroidered decoration, such as chikan; and it can be loose or tight in the torso, typically falling either just above or somewhere below the wearer's knees. The sleeves of a traditional kurta fall to the wrist without narrowing, the ends hemmed but not cuffed; the kurta can be worn by both men and women; it is traditionally collarless, though standing collars are increasingly popular; and it can be worn over ordinary pyjamas, loose shalwars, churidars, or less traditionally over jeans.In the last 50 years, fashions have changed a great deal in India. Increasingly, in urban settings in northern India, the sari is no longer the apparel of everyday wear, transformed instead into one for formal occasions. The traditional shalwar kameez is rarely worn by younger women, who favour churidars or jeans. The kurtas worn by young men usually fall to the shins and are seldom plain. In white-collar office settings, ubiquitous air conditioning allows men to wear sports jackets year-round. For weddings and formal occasions, men in the middle- and upper classes often wear bandgala, or short Nehru jackets, with pants, with the groom and his groomsmen sporting sherwanis and churidars. The dhoti, the once universal garment of Hindu India, the wearing of which in the homespun and handwoven form of khadi allowed Gandhi to bring Indian nationalism to the millions,\nis seldom seen in the cities, reduced now, with brocaded border, to the liturgical vestments of Hindu priests.\n\n\n=== Cuisine ===\n\nIndian cuisine consists of a wide variety of regional and traditional cuisines. Given the range of diversity in soil type, climate, culture, ethnic groups, and occupations, these cuisines vary substantially from each other, using locally available spices, herbs, vegetables, and fruit. Indian foodways have been influenced by religion, in particular Hindu cultural choices and traditions. They have been also shaped by Islamic rule, particularly that of the Mughals, by the arrival of the Portuguese on India's southwestern shores, and by British rule. These three influences are reflected, respectively, in the dishes of pilaf and biryani; the vindaloo; and the tiffin and the Railway mutton curry. Earlier, the Columbian exchange had brought the potato, the tomato, maize, peanuts, cashew nuts, pineapples, guavas, and most notably, chilli peppers, to India. Each became staples of use. In turn, the spice trade between India and Europe was a catalyst for Europe's Age of Discovery.The cereals grown in India, their choice, times, and regions of planting, correspond strongly to the timing of India's monsoons, and the variation across regions in their associated rainfall. In general, the broad division of cereal zones in India, as determined by their dependence on rain, was firmly in place before the arrival of artificial irrigation. Rice, which requires a lot of water, has been grown traditionally in regions of high rainfall in the northeast and the western coast, wheat in regions of moderate rainfall, like India's northern plains, and millet in regions of low rainfall, such as on the Deccan Plateau and in Rajasthan.The foundation of a typical Indian meal is a cereal cooked in plain fashion, and complemented with flavourful savoury dishes. The latter includes lentils, pulses and vegetables spiced commonly with ginger and garlic, but also more discerningly with a combination of spices that may include coriander, cumin, turmeric, cinnamon, cardamon and others as informed by culinary conventions. In an actual meal, this mental representation takes the form of a platter, or thali, with a central place for the cooked cereal, peripheral ones, often in small bowls, for the flavourful accompaniments, and the simultaneous, rather than piecemeal, ingestion of the two in each act of eating, whether by actual mixing—for example of rice and lentils—or in the folding of one—such as bread—around the other, such as cooked vegetables.\n\nA notable feature of Indian food is the existence of a number of distinctive vegetarian cuisines, each a feature of the geographical and cultural histories of its adherents. The appearance of ahimsa, or the avoidance of violence toward all forms of life in many religious orders early in Indian history, especially Upanishadic Hinduism, Buddhism and Jainism, is thought to have been a notable factor in the prevalence of vegetarianism among a segment of India's Hindu population, especially in southern India, Gujarat, and the Hindi-speaking belt of north-central India, as well as among Jains. Among these groups, strong discomfort is felt at thoughts of eating meat, and contributes to the low proportional consumption of meat to overall diet in India. Unlike China, which has increased its per capita meat consumption substantially in its years of increased economic growth, in India the strong dietary traditions have contributed to dairy, rather than meat, becoming the preferred form of animal protein consumption accompanying higher economic growth.In the last millennium, the most significant import of cooking techniques into India occurred during the Mughal Empire. The cultivation of rice had spread much earlier from India to Central and West Asia; however, it was during Mughal rule that dishes, such as the pilaf, developed in the interim during the Abbasid caliphate, and cooking techniques such as the marinating of meat in yogurt, spread into northern India from regions to its northwest. To the simple yogurt marinade of Persia, onions, garlic, almonds, and spices began to be added in India. Rice grown to the southwest of the Mughal capital, Agra, which had become famous in the Islamic world for its fine grain, was partially cooked and layered alternately with the sauteed meat, the pot sealed tightly, and slow cooked according to another Persian cooking technique, to produce what has today become the Indian biryani, a feature of festive dining in many parts of India.\nIn food served in restaurants in urban north India, and internationally, the diversity of Indian food has been partially concealed by the dominance of Punjabi cuisine. This was caused in large part by an entrepreneurial response among people from the Punjab region who had been displaced by the 1947 partition of India, and had arrived in India as refugees. The identification of Indian cuisine with the tandoori chicken—cooked in the tandoor oven, which had traditionally been used for baking bread in the rural Punjab and the Delhi region, especially among Muslims, but which is originally from Central Asia—dates to this period.\n\n\n=== Sports and recreation ===\n\nCricket is the most popular sport in India. Major domestic competitions include the Indian Premier League, which is the most-watched cricket league in the world and ranks sixth among all sports leagues.Several traditional indigenous sports remain fairly popular, such as kabaddi, kho kho, pehlwani and gilli-danda. Some of the earliest forms of Asian martial arts, such as Kalarippayattu, musti yuddha, silambam, and marma adi, originated in India. Chess, commonly held to have originated in India as chaturaṅga, is regaining widespread popularity with the rise in the number of Indian grandmasters. Pachisi, from which parcheesi derives, was played on a giant marble court by Akbar.The improved results garnered by the Indian Davis Cup team and other Indian tennis players in the early 2010s have made tennis increasingly popular in the country. India has a comparatively strong presence in shooting sports, and has won several medals at the Olympics, the World Shooting Championships, and the Commonwealth Games. Other sports in which Indians have succeeded internationally include badminton (Saina Nehwal and P V Sindhu are two of the top-ranked female badminton players in the world), boxing, and wrestling. Football is popular in West Bengal, Goa, Tamil Nadu, Kerala, and the north-eastern states.\n\nIndia has hosted or co-hosted several international sporting events: the 1951 and 1982 Asian Games; the 1987, 1996, and 2011 Cricket World Cup tournaments; the 2003 Afro-Asian Games; the 2006 ICC Champions Trophy; the 2010 Hockey World Cup; the 2010 Commonwealth Games; and the 2017 FIFA U-17 World Cup. Major international sporting events held annually in India include the Chennai Open, the Mumbai Marathon, the Delhi Half Marathon, and the Indian Masters. The first Formula 1 Indian Grand Prix featured in late 2011 but has been discontinued from the F1 season calendar since 2014. India has traditionally been the dominant country at the South Asian Games. An example of this dominance is the basketball competition where the Indian team won three out of four tournaments to date.\n\n\n== See also ==\n\nOutline of India\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==\nOverview\n\nEtymology\n\nHistory\n\nGeography\n\nBiodiversity\n\nPolitics\n\nForeign relations and military\n\nEconomy\n\nDemographics\n\nArt\n\nBlurton, T. Richard, Hindu Art, 1994, British Museum Press, ISBN 0 7141 1442 1\nCraven, Roy C., Indian Art: A Concise History, 1987, Thames & Hudson (Praeger in USA), ISBN 0500201463\nHarle, J.C., The Art and Architecture of the Indian Subcontinent, 2nd edn. 1994, Yale University Press Pelican History of Art, ISBN 0300062176\nMichell, George (2000), Hindu Art and Architecture, 2000, Thames & Hudson, ISBN 0500203377\nRowland, Benjamin, The Art and Architecture of India: Buddhist, Hindu, Jain, 1967 (3rd edn.), Pelican History of Art, Penguin, ISBN 0140561021Culture\n\n\n== Further reading ==\nMessner, W. (2009), Working with India. The Softer Aspects of a Successful Collaboration with the Indian IT & BPO Industry, Springer, ISBN 978-3-540-89077-5, archived from the original on 20 August 2017, retrieved 6 May 2013\nMessner, W. (2012), Engaging with India. How to Manage the Softer Aspects of a Global Collaboration, Createspace, ISBN 978-1-4662-4490-0\n\n\n== External links ==\n\nGovernment\n\nOfficial website of Government of India\nGovernment of India Web DirectoryGeneral information\n\nIndia. The World Factbook. Central Intelligence Agency.\nIndia at Curlie\nIndia from UCB Libraries GovPubs\nIndia from the BBC News\nIndian State district block village website\n Wikimedia Atlas of India\n Geographic data related to India at OpenStreetMap\nKey Development Forecasts for India from International Futures", "chinese_title": "India ", "chinese": "Republic of India (Hindi: भारत गणराज्य, Bhārat Gaṇarājya; English: Republic of India), is known to India (Hindi: भारत; English: India), is a country located in the mainland of South Asia, the area of ​​the world, It is the second largest country in Asia and the actual control territory is 3.16 million square kilometers. India has a large population. As of November 2020, India has 1.36 billion people in India, the second year of the world, according to the gross domestic product, India is now the world's fifth largest economy.\nIndia is not a single national and cultural country, the national and racial, the Indian Strong people account for approximately half of the total population of India, and each ethnic group has its own language, only 22 of the official language recognized by the Constitution. Among them, in which the polishs and English are set to the Federal official language of the Republic of India, and the court ruled that India did not have Mandarin; English as a common language is very popular in India, especially in the South India, but is limited by education The general public is universal in English. India is also a country with more religious and multi-faith, known as \"Religious Museum\", Buddhism and Hinduism in the world's main religions are from ancient India, and most of the Indians believe in Hinduism; Islam is also 100 million as India's second largest religion 8 million believers, spread to the Indian secondary continent with the expansion of the Arab Imperial Empire, and most of the Dynasty, the rulers of Most of India in Northern India were believed in Islam, and the Mughal Dynasty was almost conquered throughout the continent. India is also a member of many formal and informal multilateral international organizations, including United Nations, World Trade Organization, British Federation, Golden Bricks, Four Countries, South Asia Regional Cooperation Alliances and Non-Aligned Movements.\nSome industries based on cultivation of agriculture, city hand industry, service industry, and its support industry have been relatively progress. In addition to the richness of the national culture and the northern terrain, India's tourism industry is very popular. Due to the time difference, a large number of people who can speak English is also invested in the outsourcing industry (ie, foreign companies transfer customer consultation, telephone answers, etc. \"Transfer to India) . On the other hand, the cultural output of Bollywood movies in English circles and the global influence is not over the world's mainstream. At the same time, India is still a lot of patented expired drugs, providing reliable medical care at a low price. In recent years, the Indian government has also vigorously investing in higher education in this country to facilitate the scientific and internationally laminated, such as autonomous space research, South Asia Peninsula Ecological Research, etc. India's most important trading partners are the United States, the EU, Japan, China and the United Arab Emirates.\n\n\n== National name release ==\nHistorically, China has changed several copies of India. Translation of the Western Han is alone, and the Eastern Han is called \"Tianzhu\". In the Tang Dynasty, Xuanzhu believes in the \"Datang Western Regions\", \"said the Tang Zhuzheng, the objection dispute, the old cloud body, or Tianzhu, today from the positive, Yun Yun India\", so it is officially replaced by India. The translation of \"Tianzhu\", \"Virus\", \"India\" originated from the Sino Sindhu, the Indian River, which is ههدو (Hindu), Greek to δ δ (INDU), Turtle.\nIndians claim to be Borneo. India has had a lot of national names, and the origins of the same name are also true. According to Jain Legend, the eldest son of the ancestral Schodothvo called \"Pope\", he is a highest-high king, so his country is named by Poles' void \"Borneo\". According to the \"Go to the World\", the famous King Du Shifa's son called \"Pope\", good at martial arts, during the success of the King, defeated many of the Yalean Xiao Kingdom. \"Soon\" has recorded his martial arts. Due to Pressee, its latter has been considered \"Borneo\", the country is very long. So this country is named in Borneo. There is still another record in \"Go to the World\", such as \"south of the sea and the south of the Himalayas, there is a country, named 'Borneo Warle Shi', the name of its name is due to Pres Reasons for the descendants live. \" As a result, Indian residents are also called \"Palendi\" (meaning, namely Borneo). Also some scholars believe that Pleidi is a local indigenous local indigenous in India, and its civilized remains have found in Halapa and Moisto Daro. However, this statement has a controversy, and some people think that the Pald is a descendant of the king of the Porono.\n\n\n== History ==\n \nIndia exists over the old stone age and Neolithic era. The Indian civilization of the ancient India in the Indian river is one of the earliest ancient civilizations in the world. The Latest 2500 BC has a civilization created by ancient Indians in the Indian river basin. Since the first place where the site is located in Pakistan This civilization is also known as the Indian river civilization or Halapa civilization. Ancient Indians have established a strict social grade system, but the civilization suddenly declined at around 2000 in BC, and the Indian river basin has disintegrated, and its cultural carrier language and text are also dead, no one can understand. The reasons why the ancient Indian civilization decline is now in the archaeological circles. Modern genetic studies show that Indians have a small genetic difference, probably in ancient times, have a significant reduction in the population in ancient times. Some experts believe that the main cause of floods in the Indian river basin or dry. Arrived 1500 BC, from the northwest of India invaded India River Basin and the Henghe River Basin in the northwest of India. In the following centuries, Yalean will gradually settle and engage in agricultural activities. The foreign language brought by the Airyan has replaced the local language and combined with locals in culture and created a classic Vedic culture. This civilization has been in a few centuries with respect to the Indian River civilization in the Indian river basin, and the soil, which is generally called the Ganges Civilization. After the Airyan invaded, in order to distinguish the local indigenous and Yalean, the case system slowly started in India.\n\nIn the middle of the 3rd century BC, the Peacock Dynasty King Aya King was unified in the entire Indian peninsula outside the Mysore region of South India. But after the death of Ayu, the Peacock Dynasty trembled to decline. Since then, India has entered a long time. Among them, the precious frost empire and the Dai Dynasty have been short-lived in Northern India, and various religions have initiated this period, including Buddhism and Hinduism; this period is also a golden period of India, art and cultural.\nIn the 8th century, the Arab Empire has begun to invadiate India, introducing Islamic culture, but the Harborston's Polo Dynasty has been short-lived throughout the North India in 770-1850. In the 12th century, the Islamic Turkic Strokes from Afghanistan were built in the Gur dynasty in the Gur dynasty, which captured the Indian river plain and the Ganges Plain, and advanced to Nar. Madada, afterwards, Delhi Sultan, in the 13th century, Delhi Sudan, starting Hindu history records. Deli Sudan started to decline after experiencing the top peak of the Turku Kok, and weakly controlled the southern part of India. In addition, the invasion of Muner has caused the decline, and India has gradually entered the age of the Legal.\nAt the end of the 15th century, the European businessmen sold in the sea gradually realized the importance of India and actively opened the colony. After the Delhi Sultan, the descendants of Timer from Central Asia were also attracted the last dynasty of the Indian Deli Sudan in 1526, and established a Mughal Empire, experience Hu Ma Yun, Akba, Jia. Hanjir, Sha Jia Khan, to Oran, the era of the peak, almost unified the entire Indian peninsula. However, the rule of the Moham Empire is also rapidly declined by religious conflicts. At the same time, Western colonists such as Portugal, the Netherlands, the United Kingdom and France have stepped on the mainland in India, and fiercely fight for India. conflict. In 1757, the Mohar Empire and the British Indian company have burst into Prabi's battles, and India gradually became the colonial of the United Kingdom for defeat. In 1849, the UK East India successfully mastered the rule of Rule of India, only the small number of region was ruled by Portugal and France. In 1857, India broke out the famous Indian national uprising, anti-cruel British colonists, but it was quickly suppressed. However, India has also been transferred by the UK East India, which is directly dominated by the UK, established the Indian government, and ended the Mughal Empire in the name.\n\nThe Direct Rule of the United Kingdom (known as Bud India) is divided into 13 provinces, including Myanmar. In addition, approolby of 700 Dawang ruled by Indian king's strict supervision, this Tukang accounted for 2/5 of the entire Indian area (some provinces also have a dodentus). In short, although India is a huge colonial empire that is dominated by the United Kingdom, India is actually divided into two parts: British India and the Duke India, causing the phenomenon of the country in the country. In 1877, the UK's Victoria Queen crowned the Emperor of the Indian Empire. In 1911, the capital of the Indian Empire was also represented by Karria to Delhi. In the World War, the Indian army played an extremely important role in the British army.\n\nWith the slowness of the modernization of India, a part of India's superior cultural people aware of the huge shame from British rule, and nationalism gradually began to popularize. Some Indian intellectuals have established the Indian National Convention (Party Party) in 1885. The party was reorganized in 1920, which has received leadership by independent Mohadas Gandhi, and launched a series of non-cooperative sports for India independence. However, the British colonists use the contradiction between Hindu and Muslims, making the contradiction between Muslims and Hindus in India and increasingly harmful. After that, the full-Indian Muslim Union (Mu Zer) representing Muslim benefits, Muhammad Ali Gener became the party leader, and the two major sects of India gradually lost the possibility of unity.\nAfter the Second World War, the British strength declined, due to the rise of nationalist national thoughts and the extensive development of Indian people's uncooperative movement, 许 印 印 印 独But at this time, Muslims in India have begun to plan to build a separate Muslim country - Pakistan, British and Gandhi are unable to change the reality of the Indian society has split, but they have to agree to India's split into India and Pakistan. In 1947, the UK proposed Montbarton program. On August 15, the same year, India realized independence after being separated from Pakistan, but still stayed in the British Federation. On January 26, 1950, India announced its establishment of the Republic of India, but still Federal member state. This Asian continent was finally divided into Hindu-based \"Secret\" India and smaller Islam, Pakistan.\nAfter independence, Javalhar Nihrru's retrievity is tended to socialism, and the Soviet Union has developed the five-year plan for economic development, and the foreign exchange pursues non-aligned policies, independent of Su, and the United States. Outside.\nThe independent Indian government has passed the return, reorganized and redeveloped the redemption policy to the Dawn Wang Gong, and finally eliminates the Dikin State of India. At the same time, in the first year, the first year and Pakistan were burst from the Kashmir dispute, and the territory of Kashmir was about 2/3. In early June 1949, India sent troops to Siki and appointed Indians Lar as the Prime Minister of Sikkin. In August 1949, India and Bhutan signed a \"Permanent Peace and Friendship Treaty\", stipulating the \"guidance\" of India to the external relationship between Bhutan. In December 1950, the \"India and Siki Peace Treaty\", stipulates that Sikki is \"protected\" in India. The CEO of Siktin, India exercised the prime minister, and sent a political commissioner to Sikki's national defense, diplomatic and economic control. After tin gold in 1975, he was officially annexed by India. In 1959, India received Dalai Lama Dandan Guan Guan, China and India began to pay evil. In 1961, the war with Portuguese broke out. In 1962, due to the establishment of a military post in the sovereign dispute area of ​​the Sino-Indian Border, I broke out China-Indian border war, and the expansion trend was frustrated. In 1965 and 1971, the large-scale war with Pakistan has built a large-scale war. Among them, in 1971, India, India, a great victim, and \"Dong Pakistan\" is separated from Pakistan, announced its establishment of Bangladesh. In 1974, India conducted the first nuclear test, and the 1998 nuclear test promoted Pakistan to carry out their own nuclear tests in the same year.\nSince then, India's political economy is slowly developed. In addition, the domestic sects of conflict is still, the long-term economic intervention of the country has caused serious lag, which has continued until the 1990s. In 1991, Prime Minister, India, began market economic reforms and achieved initial results, and the Indian economy slowly entered the fast lane. However, the bottlenecks of compulsory education and higher education, India's industrial workers and industrial development are slow, and powerful trade unions and strict labor laws have also limited foreign investment.\nIndia has been dispatched with Pakistan on the issue of Kashmir, but the establishment of bilateral talks and mutual trust measures since 2002 is weakening in this area. At present, India's economic achievement is eye-catching, but it also faces a number of challenges, such as severe population, environmental deterioration, a large number of poor people and ethnic and religious conflicts in India. India's economy has expanded significantly over the past decade.\n\n\n== Politics ==\n\nIndia is a Federal Republic, up to 714 million voters, more than 1,000 political parties involved in Congress, including 7 national big party (political parties), 40 regions, and 980 small party, known as the world's largest democratic election . (2009) The President India is the head of state and armed forces. The president is limited, and the Prime Minister has the right to realize the power. However, if the country is threatened by war, aggression, the president has the right to announce the urgent state; if the government is paralyzed, the president can behave in the actual government; when the parliamentary elections are deadlocked, the president can designate the party to set up the Pavilion. A bill. The presidential and vice president is five years, and an indirect election is indirectly elected by an ad hoc electoral institution. The Indian vice president does not automatically pick up with the president when the president cannot exercise power.\nThe administrative power is mainly controlled by the ministerial meeting headed by the Prime Minister (ie India's cabinet). Most of the Party nominates the prime ministers of the president and appoints the prime minister. Then nominate other cabinet members to the president.\nThe Indian Congress implemented two hospital systems, including the Journey to the Federal Institute and the Office of the Office of the Office. The Ministerial Conference is responsible for the people's hospital.\nThe Federal Members were terminated for 6 years, and one-thirds were renamed every 2 years, and 233 members were produced by local elections, and the remaining 12 were appointed by the president.\nThere are 545 seats in the People's Garden, five years of ten years, of which 543 people choose, and the remaining 2 are appointed by the president.\nIndia has a perfect statement of the Constitution of the Parliament Democracy, which is a sign of Indian democratic politics. After many revisions, this constitution of 395, more than 1,000 specific terms, known as \"the longest constitution in the world\". India's constitutional declaration India is a sovereign, democratic, socialist Republic to ensure the justice, equality and freedom of its citizens, and strive to promote communication between each other.\nIndia and China, Pakistan has territorial disputes, India claims that Tibet South is Indian territory, and actually controls the area, that is, Arunachal; in addition, India claims that China's controlled Akzin region is territory. Today's territory in India is controversial.\n\n\n== Administrative division ==\n\nIndia law is divided into 28 states (प्रांत, states), 8 federal land (केन्द्र शासित प्रदेश, Union Territories, including New Delhi, National Capital, Ladakh, Jammu and Kashmir) There is controversy in the district.\n\n\n=== Bang ===\n\n\n=== Federal genus ===\nA. Andaman - Nica Islands\nB. Changdadar (Punjab and Harriana)\nC. Dardra - Nagalhaveli and Dhaman\nD. Jam and Kashmir (have a territorial dispute against Pakistan)\nE. Radak (have a territorial dispute against the People's Republic of China)\nF. Rocksha Islands\nG. New Delhi (capital)\nH. Local treatment\n\n\n=== China-Indian border dispute area ===\n\nEast Section: The actual control of India has been jurisdiction, an area of ​​Arunachal, established in 1987, with an area of ​​83743km2, of which the disputed area is approximately 60,000 square kilometers; China is called the Nanka.\nMiddle section: In addition to other regions of the um-hot, the actual control of India, 2100km2.\nWest Section: China actually controls the 33500km2 in Akzin area. Most of the Karakun corridor and most parts of Bargas are also controlled by China.\n\n\n=== Major city ===\n\n\n== Geody ==\n\nIndia is located in the northern hemisphere in the north latitude of 6 degrees to 35 degrees 30 points, and the east is 68 degrees 7 minutes to 97 degrees 25. India is the seventh largest country in the world, with a total area of ​​3.17 million square kilometers. India from north to south 3,214 kilometers, from east to west of 2,993 kilometers, Indian peninsula is also the main body of South Asia.\n\n\n=== Terrain ===\nIndia geography is diverse: from the Snow Mountains to the desert, from the plains to the rainforest, from the hills to the plateau, the scenery should have. India includes most of the Indian secondary continent in Indian sectors, as well as the part of the Indian-Australian sector. India has more than 7,000 kilometers of coastlines, most of which are in the Peninsula in the southern part of Asia, extending into the Indian Ocean.\nFertile Ganges Plains covers most of the northern, central and eastern parts of India. And Deco Plateau accounts for most of the southern India. The western India is a Tar Desert, which is a mixed desert of rocks and dust. India's eastern and Northeast border covered Himalayas. Due to the territorial dispute against Pakistan, the highest point of India has controversy. According to India, its highest point (in a controversial Kashmir region) is Joeori Peak, 8611 meters above sea level. India's no controversy is the dry city Zhang Jiafeng, sea level 8598 meters.\nIndia is located in the mainland of the Indian, mainly consisting of three geographic districts: the mountains in the northern Himalayas (which have 8,598 meters above the highest peaks of India. Southern German Plateau.\n\n\n=== Oceland location ===\nThe northwest of India is bordered by Pakistan and Afghanistan. The north is bordered by China, Bhutan and Nepal, and the eastern part of Myanmar is bordered, and the east of the West Bengal, India is Bangladesh. The southern India is Island, Sri Lanka, Maldives, etc.\nSouthwestern India is bordered with Arabia, and the eastern and southeast are bordered in Bangladesh.\n\n\n=== River ===\nA plurality of rivers originate from or flowing through India, such as the Ganges, Bramaptra River, Ammuna River, the Krishna River. A small section of the Indian river is also located in India. The south of India is a tropical monsoon climate, and the north is a temperate climate. The burst floods, severe thunderstorms, seismic, etc., which are caused by dry and monsoon climate, and earthquakes are main natural disasters in India.\n\n\n=== Natural resources ===\nIndia has the world's fourth larger coal. Other major natural resources are also iron mines, manganese, mica, ferrite soil, titanium ore, chromite, natural gas, oil, diamond, limestone, and cultivated land.\n\n\n=== Climate ===\nIndia is full of hot, most of which belong to the tropical monsoon climate, and the Tar desert in the western India is a tropical desert climate. There is a more obvious monsoon during the summer, and there is no obvious monsoon in winter. The Indian climate is divided into rainy season (January-October) and the dry season (3-50) and the cool season (11-February), and the Himalayas is affected by the Himalayas, which affects India by cold flow or cold high pressure.\n\n\n== Economy ==\n\n \n\nIndia is one of the fastest growing countries in the world, and economic growth is attractive. 2017 International Monetary Fund Assessment India's domestic production is 2.611 trillion, is the world's sixth largest economy, and the Britain is different from the French; 2017 World Bank assessing the production of 2.59 trillion, India, India. The same evaluation is the world's sixth largest economy. If it is measured by purchasing power, India has gross domestic production of 9.459 trillion dollars in 2017, which is transcending Japan to become the third rankings, second only to the United States, China. In the past 20 years, the Indian growth rate is 5.8% and 6.1% from 2011 to 2012. Social Wealth is extremely imbalanced in India, and 10% of the people in the country controls 33% of the country. Due to the large population of India, the average national product is very low. In 2011, the average gross domestic product of India (purchasing power) was $ 3,694, the 129th in the world; the US dollar exchange rate is $ 1,389, which is 140th of the world. Before 1991, he was influenced by the socialist plan, and the economic policy implemented trade protectionism. The Indian government overexpanded labor and financial market and supervised business activities. Due to the 1991 Indian economic crisis, plus the Soviet Union, the new national party government started India Implementing economic liberalization reform, with foreign trade and direct investment, gradually transforming into free market, India's economic scale has gains faster growth, from January 1, 1995, is one of the World Trade Organization Member States .\nIndia has 51,37 million labor people, ranking 2nd world, 50% of them engaged in agriculture or agricultural related industries, 28% engaged in services and related industries; 18% of industries. From the proportion of GDP, agriculture accounted for 18.1% of GDP, services and industries accounted for 55.6% and 26.3% respectively. India's overseas labor is approximately two million people, and the foreign exchange transactions earned in 2014 have reached US $ 70 billion, which is the world's largest foreign exchange transaction amount. . The main crops include rice, barley, rapeseed, cotton, jute, tea, sucrose and potatoes. The main industries include software, cars, cement, chemical, consumer electronics, food processing, machinery, mining, petroleum, pharmaceutical, steel, transportation equipment and textiles. In 2006, foreign trade accounted for 24% of India's gross domestic product, only 6% in 1985. India accounts for 1.68% of the world's trade volume in 2008. In 2011, India was the world's top 10 of the top 10 of the world and the 19th exporters; India's main exports were petroleum products, textiles, jewelry, software, engineering equipment, chemical products and leather; imported products were crude oil, machinery, gems , Fertilizer and chemical products. During 2001 to 2011, petrochemical products and engineering equipment accounted for 14% to 42%.\nIndia implements socialism while implementing democratic politics, the government has strictly controlled private economic activities, foreign trade and foreign capital. However, in 1991, through economic reform, relaxation of foreign trade and foreign investment, gradually opened the domestic market. The privateization of state-owned enterprises and the opening of private and foreign investment are open to private and foreign investment. As regard to relevant political debates. The economic growth rate of India during the opening is 7.5%, and the salary of the past decade is doubled. Since 1985, 431 million Indians have been separated from poverty. According to the global competitive report, India's competitiveness ranks 51st in the world, including in the financial market (17th), bank departments (24th), innovation (39th) and business (44th), etc. good. Among the world's largest 15 information technology outsourcing companies, 7 are in India, while companies are only in the United States for outsourcing countries. India is the 11th consumer market, and 2030 will become the 5th consumer market. India's fastest growing countries, in 2010 to 2011, increased 227 million users; the growth rate of automotive industries ranked 26% in the world, 2009 - 2010 growth, 36% of the car exports. Indian generated capacity is 250 GW (109 watts), of which 8% are renewable energy.\nAlthough India's economic growth in the past few decades has continued to face social and economic challenges in the past few decades. India's country-defined annual income of the World Bank is less than $ 1.25, the most populous population below the poor line, but the proportion of poor population has been reduced by 60% from 1985 to 42% in 2005. Half of children's weight is too light, 46% of them have a malnutrition, and the government launches nutrient lunch to improve the nutritional status of Indian children. Since 1991, the gap between the rich and the poor in India has continued to expand, and the most affluent state has a net value of 3.2 times the poorer in 2007. India's corruption has increased significantly, and the report is estimated to have about $ 46.2 billion in illegal funds after independence. In 1991, the per capita GDP was only 329 dollars in 1991. After the freedom of economic liberalization, India has reached US $ 1265 in 2010, which is expected to reach 2110 dollars in 2016, but still developed in other Asian countries such as Indonesia, Iran. , Malaysia, the Philippines, Sri Lanka, Thailand is low, and the future in the future is difficult to exceed the aforementioned countries.\nIndia's foreign exchange is sufficient, the exchange rate is stable, and the future official will also fully dispense the foreign exchange control, and the market determines the currency value. Indian manufacturing exports have begun to decline, and the electric supply of electricity in many regions in the country is still insufficient. India has a lot of people who are proficient in English, and is currently the world's most important information service country, computer software exporters and the motherland of many software engineers in the 21st century. India has become a dominant, finance, research, technical services, etc. of software exports, will also become a global exporter. 2014 Randstad Group announced that \"Asia's most unhappy employees\" survey showed that the fastest employee ranked first Name is India.\n\n\n=== Research report ===\nAccording to the 2011 Principal Forepane Services, India's purchasing power, the total national product, can win the United States in 2045. In the next forty years, the total production of India has expected an average annual increase of 8% per year, so India has the potential to become the fastest growing economy in the world. The report emphasizes that major growth factors are: young and rapidly growing labor population dividends; because the growth of development education and engineering technology makes industrial growth strong; rapidly growing middle class drives sustained consumption market. The World Bank reminds India to reach its economic potential, and must continue to focus on public reform, transportation infrastructure, agriculture and rural development, relieve labor regulations, education and energy security, and national health insurance and diet nutrition. In the 2017 World Residential Consumption Report published by Economist Information Agency, 400 individual prices of 160 products and services were compared, and the four cities in consumer prices were in India: the third place Bangalore, side Five Mumbai and Qing Na, the eighth new Delhi. According to \"Today, Russian\" TV website reported on February 18, India's newspaper Tallas invited this report: \"India is the world's fifth-largest economy, 2019 GDP reached 2.94 trillion US dollars, more than the UK And France, jumped to the fifth. \"In contrast, the British economy is 2.83 trillion, France is $ 2.71 trillion. According to this report, the Indian GDP has a total of US $ 10.51 trillion, more than Japan and Germany. Due to the large population of India, its per capita GDP is $ 2170. The actual GDP growth rate of the country is expected to decline in the third consecutive year, from 7.5% to 5%. \"World Population Review\" pointed out that Indian economic liberalization begins in the early 1990s, including relaxation of industrial control, reducing control of foreign trade and investment, and promoting national enterprises. The report said: \"These measures help India speed up economic growth.\" The report also said that India's service industry is the fastest growing in the world, and the scale accounts for 60% of the national economy. From the number of people account for 28% of the total number of employees in the country.\n\n\n=== Industrial development ===\nIndia's communication industry has grown up two hundred or seventh million users in 2010 to 2011. It is the fastest growing country in the world; in the third quarter of 2017, India has exceeded the United States to become the world's second wisdom. The mobile phone market is second only to China.\nThe growth rate of Indian automotive industries is a country with the second fast growth rate. It has grown by 26% in domestic automobile sales in 2009 to 2010. It has grown 36% from 2008 to 2009. Indian power generation reaches 300GWH, of which 42GWH uses regenerative energy power generation. At the end of 2011, the Indian IT industry hired two hundred and eighty-thousand experts, with an output value of up to 100 billion dollars, accounting for 7.5% of the Indian national product value, contributing 26% of the export amount of Indian goods.\nIndian pharmaceutical industries are also important emerging markets in the global pharmaceutical industry. The Indian pharmaceutical industry is expected to reach 48.5 billion US dollars in 2020. R & D investment in the Indian Biological Therapy Industry accounts for 60% of total investment. India is a country in the top twelve investment biotechnology industries in the world. The Indian Biotechnology Industry has grown by 15.1% between 2012 to 2013, growing from 2,044 billion rubles to 2,35.24 billion rubles (in accordance with June 2013 exchange rate 1 to 60 rubles, total value of about $ 394 million)\n\n\n=== Transportation ===\n\nIndian transportation includes railways, roads, waterways, aviation, etc. Although the Indian transportation system has improved in recent years, the overall is still relatively backward. In 2014, the Indian railway mileage was 68,525 kilometers, the world's fifth; there were more than 7,000 stations, using more than 12,000 vehicles, the annual transport of 10 billion passengers, the cargo volume exceeded 1 billion tons. However, there are existing iron routes that have problems in the years, slow, safe and poor, and cannot meet demand. Because there is no perfect management system, train shifts are often erroneous in India. On September 23, 2015, the Ministry of Railways, the Ministry of Railways, announced the feasibility study of three high-speed rail lines. At the end of 2015, the media reported that Japan will build the new trunk high-speed rail of Mumbai to Yamada.\nIndian road levels can be divided into three categories: one is highway and national roads; the second is the main road of Bonne Road and local; third is other roads and village roads. According to estimates in 2009, India's national road mileage was 330 million kilometers, ranked third in the world. 12 owners in India It is necessary to port and 184 medium and small ports, and the shipping capacity is 18th in the world. The inland river channel is 14,500 kilometers, of which 5200 kilometers of rivers and 485 kilometers can be mechanized. There are 14 airlines with regular flights in India, and 65 air transport companies specializing in non-regular flights. At present, India private private airlines occupies more than 80% of the market share in China, including Indigo, is the largest airline in India, Jet Airways ranked second. The only state-owned airline in India is Air India. According to the data released by the Indian Civil Aviation Authority, India has reached 810.92 million in 2015. In 2016, it has become the world's third largest domestic aviation market only in the United States and China.\nWith the development of Indian urbanization, traffic congestion has gradually appeared. The Indian government adopts methods such as repairing the intersection and broadening roads, but with the increase in the number of motor vehicles increasingly serious. The Indian government focuses on \"National Urban Transport Policy\" and \"National City Update Plan\" to develop rail transit (subway system), and quickly bus. The tuk is a three-wheeled motorcycle, which is often used as a taxi in India. Only about 10% of Indian families have motorcycles.\n\n\n== Population ==\n\nOn March 31, 2011, the Indian Census Committee censused the population of India. The results show that India's population reached 1,210,193,422 people. It is the world's second largest country in China, from 2001 to 2011 The population growth rate was 1.76%, which was low than 2.13% of the previous decade (1991-2001). Gender ratio 0.94 female / male, the median mediation at the time of the census in 2001 was 24.9 years. As of 2019, the number of people in India was 1368, 737, 513, which was increased by 1.08% per year. The medical progress and green revolution in the past 50 years have enabled agricultural productivity to promote rapid growth, but India still faces several public health related challenges. According to the statistics of the World Health Organization, India died of drinking contaminated water and breathing contaminated air every year, with approximately 50 physicians. Between 1991 and 2001, the urban population has grown 31.2%, however, more than 70% of residents in the country are living in a country. According to the 2001 Census Statistics, India has a total of 27 million cities, including Mumbai, Delhi, and Karli and Kaerne population. The population is mainly distributed in the Ganges Plains. In 2001, the census showed that 72.22% of people lived in more than 550,000 villages, and the rest live in more than 2,000 towns and cities.\n\nIndia's literacy rate is 74.04% (male: 82.14%; female: 65.6%), literacy rate is the highest in Karara, the minimum of Harrobang; sex ratio is 1.064 male / female, expected life 68.59 years old, population growth The rate is 1.606%, the birth rate is 22.69 / 1,000. India has a lot of slums in the rich and poor, and there are many slums in urban diseases: dengue fever, malaria, Japanese encephalitis, hepatitis A, hepatitis T is high.\n\n\n=== National ===\n\nIndia's major ethnic groups include 72% of India - Airyan and 25% Darro. India also has a group of non-settled ethnic groups, such as the famous Groari Yalrohar, with the mid-to-mid-aged Rabari; also has to collect and hunt the resident, or engage in salt merchants, a fortune, spell Teacher, Ashokovaurus treatment engineer, juggler, stone grinder, tattoo master and other industries. The humanologist has identified about 500 non-setstable stray groups in India, and the number may be as high as 80 million.\nIn April 2014, the Supreme Court of India made a historical ruling that recognized the third gender of men and women. India currently has about 2 million transient people.\nIndia often happens to women's rape and violent incidents, most of the northern region of poverty, such as the most intensive Northern Bang of India, is very low; at the same time, the society has a strict species of surname, regarding gender, religion, etc. Prejudice is deeply rooted, resulting in women who originate from low-breeds such as the people.\n\n\n=== Valid name ===\n\nAn important feature in the Indian social structure is that there is still a hometown name system. Indians divide others into four seed names according to Vedas: Brahmen, Bag Demale, Beli, State Luo, and all kinds of surnames cannot be married, identity, professional heroes, and inaccessible people - 旃旃Luo. The surname system has been previously, and in the earliest religious classic \"pear\" (the earliest at the earliest of the Veda), the first name (monk), Brake Emid Lee (aristocrats and warriors), 4 levels (slaves), 4 grades (slaves). In the future, it evolved into three major gradings, which was generally consisting of the original Brahmen, brake Demale and Leshi; the low-class surname of the original Dartain, the third level is some \"旃旃罗\" without a single identity (民) \", the lowest social status, that is, the so-called inaccessible, the number is nearly 100 million, accounting for 1/14 of the total population of the country. Between the surname, due to social politics, economic status, often causses conflict. Currently in the city and more developed regions, there is still a big impact among the surnames, but there is still a big impact in the countryside.\n\n\n=== Language ===\n\nIndia - Yali Anguo and Dalo Language Department is the main language of India, accounting for 74% and 24% of the total population, and other languages ​​are Tibetan Burns, South Asian, India.\nAt present, India's first official language is a Hindi, about 30% of the population, the most language of the population of India; English has terminated its only official language (or with Hindi) in 1965, but It still retains its status of \"second additional official language\", which is also a national general language, mainly in political and commercial exchange, and English is also important in education, especially medium and higher education.\nThere are other 21 local predetermined official languages, including Malayalam, Tamil, Telouu, Kanada, Kongkani, Mala, Urdu language. Gujarat, Oriya, Puncha, Assam, Kashmir, Stri, Nepal, Sanskrit, Manipur, etc., there are more than 1,600 languages.\nAccording to the 2001 Census in India, the number of people used in major languages ​​is as follows:\n\n\n=== Religion ===\n\nIndia is also a very strong country with a very strong color. It is the birthplace of many religions, almost all of the religions in the world in India, known as the \"Religious Museum\".\nThere are about 80.5% of the people in India, and other major religious groups are Islamic (15%), Sikh (1.9%), Jain (0.4%), and the income of early Syrian Christianity In modern times, Christianity (2.3%) was also presented by British colonial rule. Buddhism originated from India, and now in India, Buddhism is relatively small, accounting for 0.8% of the total population, but Buddhism's spread has a considerable impact on countries around India.\nAfter the Fourteen Daren Lama exiled, many Buddhists went to the Pilgrimage every year.\n\n\n== Culture ==\n\n\n=== Communication media ===\n\nThe main news organizations and news agencies in India have: Press Problem, Indian News Agency, India, India Joint News Agency (Second, Communications Agency).\nMost of the Indian newspaper is all private and consortium, and there is no newspaper. In newspapers and periodicals, the largest three daily reports are \"India Times\", \"Maraialam Entertainment\" and \"Gujarat News\". The main Indian newspapers have \"India\", etc .; the main English newspapers have \"India\", \"India Express\", etc.\nThe main TV station in India has state-owned full-printed TV station and private New Deli TV. The radio station mainly has a state-owned full-printed radio station.\nT-Series is a famous Music Video Tape and Movie Company in India. From March 28, 2019, youTube subscribers continued to lead Pewdiepie until April 1, 2019 was successfully retransited by Pewdiepie again, so T-Series is also fast. The cover page replaced on the same day, the number of subscriptions in both parties still do not divide Xuan. [7] Today, T-Series has completely exceeded Pediepie, becoming the number of Youtube subscriptions.\nIn addition, T-Series has its own multi-channel network, with 27 online playback platforms, as of November 2018, all of its platform total subscribers exceeds 100 million, and the total number of views exceeded 61.5 billion.\n\n\n=== Movie ===\n\nIndia is an important movie outland area. India's film production is the crown of the world. It produces 1,000 movies per year, which is 4 times that of Hollywood, mainly paying a large domestic demand. India is also the country in which the world's movie audience is the world, and the audience of the cinema has a lot of 14 million people.\nIndian movies are also very popular in countries with a large number of Indian immigrants.\nIndia is a multilingual country. Although English is still one of the official languages, the ethnic groups of different languages ​​have a very ever-demanding demand for native language, which has created the development of the film industry, especially the development of the Indian film industry in Mumbai, which is most mature, known as Bao Lai Dock (taken from Bombay with Hollywood Hollywood). So the film production and box office fumes in the Hindi are the largest. Many famous movie workers in other parts of India will come to Bollywood to find opportunities. The movies in different regions will imitate each other, so the same set of movies may have different languages.\nSince India is a nation like music and dance, you can often see songs and dance elements in Indian movies, so songs and love films have become the most distinctive movie type in India, such as \"true love forever\" and 2002 in 2000. \" Carmine tears \"(devdas), etc. are the most outstanding representatives. In recent years, India has not only constantly learning and imitating American movies, such as the modern action film \"Shu Tian Shen\" series has received a good box office; and there is a great vision on the type, such as the 2007 sports theme inspirational film \"Crease India\" ! \", In 2009, criticized educational thinking and model and focused on friendship\" three stupid Bollywood \", etc., all bring to the audience with a strong impression and infection.\nThe famous male movie star has sand, Ruok, Almir, and Amitab Bashak, female movie star has Eisei Via Lei, Madui , Carnier, Ri Ni Muki, Poetry, Aya Pan, etc.\nThe Indian Movie Audience Award is the most authoritative and influential film award in India. The magazine \"Indian Film Audience\" is held, and the vast audience participates in voting, starting in 1953, and selection once a year.\n\n\n=== Sport ===\n\nIn India, some of the traditional sports such as Kabadi, Indian wrestling are still very popular. However, India did not hold a world-class sports event such as the Olympic Games, the World Cup.\nIndia's results in large international comprehensive sports meetings\nSummer Olympics: 9 gold 6 silver 11 copper 26 medals (Asia 7th, the top 50)\nAsian Games: 126 gold 168 silver 245 copper 539 medals (Asia 5)\nWorld Games: 1 copper 1 medal (Asia 17, the world's 70th)\nSummer University Student Sports Game: 3 gold 1 silver 3 copper 7 medals (Asia 12th, the world 60)\nAsia Indoor Games: 22 Gold 21 Silver 43 Copper 86 Medals (Asia No. 8)\nSummer Youth Olympics: 6 silver 2 copper 8 medals (Asia 11th, World No. 58)\nWorld Wulong Games: Careless\nAsian Wushu: 3 gold 7 silver 23 copper 33 medals (Asia 10)\nAsian Beach Games: 8 Gold 4 Copper 12 Medals (Asia No. 5)\nAsian Youth Games: 5 Gold 3 Silver 3 Copper 11 Medals (Asia No. 7)\n\n\n== Education ==\n\nIndia implements 12 years of consistent primary and secondary education. Higher education has been 8 years, including 3 years of bachelor's courses, 2 years of subcomprofits and 3 years of doctoral courses. There are also non-formal education such as various types of vocational and technical education, adult education.\nThere are 254 comprehensive universities in the country, famous of the Indian Institute of Technology, University of Deli, Nihru University, Kolkata University.\n\n\n== Diplomacy ==\n\n \nDuring the Cold War, India passed a new foreign policy, and not alliance with any major country. However, India develops close relationship with the Soviet Union and has been widely military support. The end of the Cold War has greatly affected India's foreign policy. India's current implementation of the Dongwang policy is to strengthen diplomacy and economic and trade relations with the United States, China, EU, Japan, Israel, Latin America and Southeast Asian countries. India also has a close relationship with the African Union, the Federation, and the Arab world. India is still close military links with Russia. During the War of China, China was influenced by Korean War and China Social Survival, India has also been supported by the United States and Britain. After 1976, the relationship between the two countries was gradually improved after restoring the ambassador of mutual.\nIndia actively participates in the United Nations peacekeeping tasks. At present, India is the third largest troops in the United Nations, and is working hard to become a permanent member of the UN Security Council.\nIn order to promote the development of the sightseeing industry, in February 2014, the Indian Congress Affairs and Program announced that the new list of land visa increased to 180 countries and regions, including China. In October 2003, India joined the Southeast Asian Friendship Cooperation Treaty, and the ASEAN relations were significantly deepened.\n\n\n== Military ==\n\nIndian Armed Forces (Tiancheng: भारतीय सशस्त्र सेनाएं, transfer: Saśastra Sēnēṃēṃ) In the Military Organization of the Indian Republic, including the Indian Army, India Navy, Indian Air Force, and various other Indian coastal defense teams, India Supported service organizations such as troops and nuclear strategic commands. India maintains the fourth largest armed forces in the world, and it is estimated that there are 1,325,000 general troops. The Indian armed forces are rapidly expanding and modern, in the future, there will be military space programs in the future, and is currently actively developing missile defense systems and powerful nuclear military capabilities.\n\n\n=== Army ===\nThe number of Indian army has maintained in millions in the early 21st century, and is the largest number of people in the world. It belongs to volunteers, India has never used recruitment. The initial goal is to protect the border of the country, but recently provide security protection, especially for armed terrorists attacking Kashmir and Northeast, separating molecules.\n\n\n=== Navy ===\nThe Indian Navy has 55,000 people, including 5,000 Navy Aircraftiers and 2000 Marcos (MARCOS), the Fifth University of the World. The Indian Navy currently has more than 155 ships, including Villat's aircraft carrier, is now retired. At present, India's active aircraft carrier is a Victoria aircraft carrier (INS Vikramadit). YA, translated into \"Super King Aviation Mother Marily\", a built.\nThe Indian Navy has deployed a ballistic missile submarine in the Indian Ocean from August 2016 to protect the national waters' strategic security, mainly defensing the threat of Pakistan and the Chinese Navy. At present, there are five ballistic missiles in India.\n\n\n=== Air Force ===\nIt was formally established on October 8, 1932, the Indian Empire and Royal Progress, which were an auxiliary Air Force, officially entered the battlefield operation during World War II. Since Independence, the Indian Air Force has conducted four wars in Pakistan and China. The Indian Air Force has also actively participated in the United Nations peacekeeping tasks.\n\n\n== See ==\nChina - India Relations\nIndia - British relations\nIndia - US relations\nChina Print\nIndian communication\nNon-aligned sports\nBRIC countries\n\n\n== Comment ==\n\n\n== Reference ==\n\n\n=== Quote ===\n\n\n=== Source ===\nSummation\neconomic\n\npopulation\n\n\n== External link ==\n(English) Indian government official website (page archive backup, existing internet archives)\n(English) Prime Minister Office Official Website\n(English) Indian president official website (page archive backup, existing internet archive)\n(English) Indian parliament official website (page archive backup, existing internet archive)\n(Simplified Chinese) India Administrative Division - Administrative Region Planning Website\n(English) \"World Overview\" on INDIA entries\n(English) Open Directory Program and India Related Content\nIndian maps of Wiki media\n Ground information on India on OpenStreetMap\nGoogle Maps Template: Navboxes\nTemplate: Authority Control "}