{"topic": "Mythology", "english_title": "Myth", "english": "Myth is a folklore genre consisting of narratives that play a fundamental role in a society, such as foundational tales or origin myths. The main characters in myths are usually not humans like gods, demigods, and supernatural figures. However, others also include humans, animals, or combinations in their classificiation of myth. Stories of everyday human beings, although often of leaders of some type, are usually contained in legends, as opposed to myths. Myths are sometimes distinguished from legends in that myths deal with gods, usually have no historical basis, and deal with a remote past in which the world was much more different than the present.Myths are often endorsed by rulers and priests or priestesses and are closely linked to religion or spirituality. Many societies group their myths, legends, and history together, considering myths and legends to be true accounts of their remote past. In particular, creation myths take place in a primordial age when the world had not achieved its later form. Other myths explain how a society's customs, institutions, and taboos were established and sanctified. There is a complex relationship between recital of myths and the enactment of rituals.\nThe term mythology may either refer to the study of myths in general, or a body of myths regarding a particular subject. The study of myth began in ancient history. Rival classes of the Greek myths by Euhemerus, Plato, and Sallustius were developed by the Neoplatonists and later revived by Renaissance mythographers. Today, the study of myth continues in a wide variety of academic fields, including folklore studies, philology, psychology, and anthropology. Moreover, the academic comparisons of bodies of myth are known as comparative mythology.\nSince the term myth is widely used to imply that a story is not objectively true, the identification of a narrative as a myth can be highly political: many adherents of religions view their religion's stories as true and therefore object to the stories being characterised as myths while seeing the stories of other religions as being myth. Labelling all religious narratives as myths can be thought of as treating different traditions with parity.\n\n\n== Definitions ==\n\n\n=== Myth ===\nDefinitions of myth vary to some extent among scholars, though Finnish folklorist Lauri Honko offers a widely-cited definition:\nMyth, a story of the gods, a religious account of the beginning of the world, the creation, fundamental events, the exemplary deeds of the gods as a result of which the world, nature and culture were created together with all parts thereof and given their order, which still obtains. A myth expresses and confirms society's religious values and norms, it provides a pattern of behavior to be imitated, testifies to the efficacy of ritual with its practical ends and establishes the sanctity of cult.\nScholars in other fields use the term myth in varied ways. In a broad sense, the word can refer to any traditional story, popular misconception or imaginary entity.However, while myth and other folklore genres may overlap, myth is often thought to differ from genres such as legend and folktale in that neither are considered to be sacred narratives. Some kinds of folktales, such as fairy stories, are not considered true by anyone, and may be seen as distinct from myths for this reason. Main characters in myths are usually gods, demigods or supernatural humans, while legends generally feature humans as their main characters. However, many exceptions or combinations exist, as in the Iliad, Odyssey and Aeneid. Moreover, as stories spread between cultures or as faiths change, myths can come to be considered folktales, their divine characters recast as either as humans or demihumans such as giants, elves and faeries. Conversely, historical and literary material may acquire mythological qualities over time. For example, the Matter of Britain (the legendary history of Great Britain, especially those focused on King Arthur and the knights of the Round Table) and the Matter of France, seem distantly to originate in historical events of the 5th and 8th-centuries respectively, and became mythologised over the following centuries.\nIn colloquial use, the word myth can also be used of a collectively held belief that has no basis in fact, or any false story. This usage, which is often pejorative, arose from labelling the religious myths and beliefs of other cultures as incorrect, but it has spread to cover non-religious beliefs as well.However, as commonly used by folklorists and academics in other relevant fields, such as anthropology, the term myth has no implication whether the narrative may be understood as true or otherwise. Among biblical scholars of both the Old and New Testament, the word \"myth\" has a technical meaning, in that it usually refers to \"describe the actions of the other‐worldly in terms of this world\" such as the Creation and the Fall.\n\n\n=== Mythology ===\n\nIn present use, mythology usually refers to the collected myths of a group of people, but may also mean the study of such myths. For example, Greek mythology, Roman mythology, and Hittite mythology all describe the body of myths retold among those cultures.\n\n\n=== Mythography ===\nThe compilation or description of myths is sometimes known as mythography, a term which can also be used of a scholarly anthology of myths (or, confusingly, of the study of myths generally).Key mythographers in the Classical tradition include:\nOvid (43 BCE–17/18 CE), whose tellings of myths have been profoundly influential;\nFabius Planciades Fulgentius, a Latin writer of the late-5th to early-6th centuries, whose Mythologies (Latin: Mitologiarum libri III) gathered and gave moralistic interpretations of a wide range of myths;\nthe anonymous medieval Vatican Mythographers, who developed anthologies of Classical myths that remained influential to the end of the Middle Ages; and\nRenaissance scholar Natalis Comes, whose ten-book Mythologiae became a standard source for classical mythology in later Renaissance Europe.Other prominent mythographies include the thirteenth-century Prose Edda attributed to the Icelander Snorri Sturluson, which is the main surviving survey of Norse Mythology from the Middle Ages.\nJeffrey G. Snodgrass (professor of anthropology at the Colorado State University) has termed India's Bhats as mythographers.\n\n\n=== Mythos ===\n\nBecause myth is sometimes used in a pejorative sense, some scholars have opted to use the term mythos instead. However, mythos now more commonly refers to its Aristotelian sense as a \"plot point\" or to a body of interconnected myths or stories, especially those belonging to a particular religious or cultural tradition. It is sometimes used specifically for modern, fictional mythologies, such as the world building of H. P. Lovecraft.\n\n\n=== Mythopoeia ===\n\nMythopoeia (mytho- + -poeia, 'I make myth') was termed by J. R. R. Tolkien, amongst others, to refer to the \"conscious generation\" of mythology. It was notoriously also suggested, separately, by Nazi ideologist Alfred Rosenberg.\n\n\n== Etymology ==\n\nThe word myth comes from Ancient Greek μῦθος (mȳthos), meaning 'speech, narrative, fiction, myth, plot'. In Anglicised form, this Greek word began to be used in English (and was likewise adapted into other European languages) in the early 19th century, in a much narrower sense, as a scholarly term for \"[a] traditional story, especially one concerning the early history of a people or explaining a natural or social phenomenon, and typically involving supernatural beings or events.\"In turn, Ancient Greek μυθολογία (mythología, 'story,' 'lore,' 'legends,' or 'the telling of stories') combines the word mȳthos with the suffix -λογία (-logia, 'study') in order to mean 'romance, fiction, story-telling.' Accordingly, Plato used mythología as a general term for 'fiction' or 'story-telling' of any kind.\nThe Greek term mythología was then borrowed into Late Latin, occurring in the title of Latin author Fulgentius' 5th-century Mythologiæ to denote what we now call classical mythology—i.e., Greco-Roman etiological stories involving their gods. Fulgentius' Mythologiæ explicitly treated its subject matter as allegories requiring interpretation and not as true events.The Latin term was then adopted in Middle French as mythologie. Whether from French or Latin usage, English adopted the word mythology in the 15th century, initially meaning 'the exposition of a myth or myths,' 'the interpretation of fables,' or 'a book of such expositions'. The word is first attested in John Lydgate's Troy Book (c. 1425).From Lydgate until the 17th or 18th century, mythology was used to mean a moral, fable, allegory or a parable, or collection of traditional stories, understood to be false. It came eventually to be applied to similar bodies of traditional stories among other polytheistic cultures around the world.Thus the word mythology entered the English language before the word myth. Johnson's Dictionary, for example, has an entry for mythology, but not for myth. Indeed, the Greek loanword mythos (pl. mythoi) and Latinate mythus (pl. mythi) both appeared in English before the first example of myth in 1830.\n\n\n=== Meanings in Ancient Greece ===\nThe term μῦθος (mȳthos) appears in the works of Homer and other poets of Homer's era, in which the term had several meanings: 'conversation,' 'narrative,' 'speech,' 'story,' 'tale,' and 'word.'Similar to the related term λόγος (logos), mythos expresses whatever can be delivered in the form of words. These can be contrasted with Greek ἔργον (ergon, 'action,' 'deed,' or 'work'). However, the term mythos lacks an explicit distinction between true or false narratives.In the context of Ancient Greek theatre, mythos referred to the myth, narrative, plot, and the story of a play. According to David Wiles, the Greek term mythos in this era covered an entire spectrum of different meanings, from undeniable falsehoods to stories with religious and symbolic significance.According to philosopher Aristotle (384–322 BCE), the spirit of a theatrical play was its mythos. The term mythos was also used for the source material of Greek tragedy. The tragedians of the era could draw inspiration from Greek mythology, a body of \"traditional storylines\" which concerned gods and heroes. David Wiles observes that modern conceptions about Greek tragedy can be misleading. It is commonly thought that the ancient audience members were already familiar with the mythos behind a play, and could predict the outcome of the play. However, the Greek dramatists were not expected to faithfully reproduce traditional myths when adapting them for the stage. They were instead recreating the myths and producing new versions. Storytellers like Euripides (c. 480–406 BCE) relied on suspense to excite their audiences. In one of his works, Merope attempts to kill her son's murderer with an axe, unaware that the man in question is actually her son. According to an ancient description of audience reactions to this work, the audience members were genuinely unsure of whether she would commit filicide or she will be stopped in time. They rose to their feet in terror and caused an uproar.David Wiles points that the traditional mythos of Ancient Greece, was primarily a part of its oral tradition. The Greeks of this era were a literate culture but produced no sacred texts. There were no definitive or authoritative versions of myths recorded in texts and preserved forever in an unchanging form. Instead multiple variants of myths were in circulation. These variants were adapted into songs, dances, poetry, and visual art. Performers of myths could freely reshape their source material for a new work, adapting it to the needs of a new audience or in response to a new situation.Children in Ancient Greece were familiar with traditional myths from an early age. According to the philosopher Plato (c. 428–347 BCE), mothers and nursemaids narrated myths and stories to the children in their charge: David Wiles describes them as a repository of mythological lore.Bruce Lincoln has called attention to the apparent meaning of the terms mythos and logos in the works of Hesiod. In Theogony, Hesiod attributes to the Muses the ability to both proclaim truths and narrate plausible falsehoods (i.e., falsehoods which seem like real things). The verb used for narrating the falsehoods in the text is legein, which is etymologically associated with logos. There are two variants in the manuscript tradition for the verb used to proclaim truths. One variant uses gerusasthai, the other mythesasthai. The latter is a form of the verb mytheomai ('to speak,' 'to tell'), which is etymologically associated with mythos. In the Works and Days, Hesiod describes his dispute with his brother Perses. He also announces to his readers his intention to tell true things to his brother. The verb he uses for telling the truth is mythesaimen, another form of mytheomai.Lincoln draws the conclusion that Hesiod associated the \"speech of mythos\" (as Lincoln calls it) with telling the truth. While he associated the \"speech of logos\" with telling lies, and hiding one's true thoughts (dissimulation). This conclusion is strengthened by the use of the plural term logoi (the plural form of logos) elsewhere in Hesiod's works. Three times the term is associated with the term seductive and three times with the term falsehoods. In his genealogy of the gods, Hesiod lists logoi among the children of Eris, the goddess personifying strife. Eris' children are ominous figures, which personify various physical and verbal forms of conflict.\n\n\n== Interpreting myths ==\n\n\n=== Comparative mythology ===\n\nComparative mythology is a systematic comparison of myths from different cultures. It seeks to discover underlying themes that are common to the myths of multiple cultures. In some cases, comparative mythologists use the similarities between separate mythologies to argue that those mythologies have a common source. This source may inspire myths or provide a common \"protomythology\" that diverged into the mythologies of each culture.\n\n\n=== Functionalism ===\nA number of commentators have argued that myths function to form and shape society and social behaviour. Eliade argued that one of the foremost functions of myth is to establish models for behavior and that myths may provide a religious experience. By telling or reenacting myths, members of traditional societies detach themselves from the present, returning to the mythical age, thereby coming closer to the divine.Honko asserted that, in some cases, a society reenacts a myth in an attempt to reproduce the conditions of the mythical age. For example, it might reenact the healing performed by a god at the beginning of time in order to heal someone in the present. Similarly, Barthes argued that modern culture explores religious experience. Since it is not the job of science to define human morality, a religious experience is an attempt to connect with a perceived moral past, which is in contrast with the technological present.Pattanaik defines mythology as \"the subjective truth of people communicated through stories, symbols and rituals.\" He says, \"Facts are everybody's truth. Fiction is nobody's truth. Myths are somebody's truth.\"\n\n\n=== Euhemerism ===\n\nOne theory claims that myths are distorted accounts of historical events. According to this theory, storytellers repeatedly elaborate upon historical accounts until the figures in those accounts gain the status of gods. For example, the myth of the wind-god Aeolus may have evolved from a historical account of a king who taught his people to use sails and interpret the winds. Herodotus (fifth-century BCE) and Prodicus made claims of this kind. This theory is named euhemerism after mythologist Euhemerus (c. 320 BCE), who suggested that Greek gods developed from legends about human beings.\n\n\n=== Allegory ===\nSome theories propose that myths began as allegories for natural phenomena: Apollo represents the sun, Poseidon represents water, and so on. According to another theory, myths began as allegories for philosophical or spiritual concepts: Athena represents wise judgment, Aphrodite desire, and so on. Müller supported an allegorical theory of myth. He believed myths began as allegorical descriptions of nature and gradually came to be interpreted literally. For example, a poetic description of the sea as \"raging\" was eventually taken literally and the sea was then thought of as a raging god.\n\n\n=== Personification ===\n\nSome thinkers claimed that myths result from the personification of objects and forces. According to these thinkers, the ancients worshiped natural phenomena, such as fire and air, gradually deifying them. For example, according to this theory, ancients tended to view things as gods, not as mere objects. Thus, they described natural events as acts of personal gods, giving rise to myths.\n\n\n=== Myth-ritual theory ===\n\nAccording to the myth-ritual theory, myth is tied to ritual. In its most extreme form, this theory claims myths arose to explain rituals. This claim was first put forward by Smith, who argued that people begin performing rituals for reasons not related to myth. Forgetting the original reason for a ritual, they account for it by inventing a myth and claiming the ritual commemorates the events described in that myth. Frazer argued that humans started out with a belief in magical rituals; later, they began to lose faith in magic and invented myths about gods, reinterpreting their rituals as religious rituals intended to appease the gods.\n\n\n== History of the academic discipline ==\nHistorically, important approaches to the study of mythology have included those of Vico, Schelling, Schiller, Jung, Freud, Lévy-Bruhl, Lévi-Strauss, Frye, the Soviet school, and the Myth and Ritual School.\n\n\n=== Ancient Greece ===\n\nThe critical interpretation of myth began with the Presocratics. Euhemerus was one of the most important pre-modern mythologists. He interpreted myths as accounts of actual historical events, though distorted over many retellings. \nSallustius divided myths into five categories:\ntheological;\nphysical (or concerning natural law);\nanimistic (or concerning soul);\nmaterial; and\nmixed, which concerns myths that show the interaction between two or more of the previous categories and are particularly used in initiations.Plato famously condemned poetic myth when discussing education in the Republic. His critique was primarily on the grounds that the uneducated might take the stories of gods and heroes literally. Nevertheless, he constantly referred to myths throughout his writings. As Platonism developed in the phases commonly called Middle Platonism and neoplatonism, writers such as Plutarch, Porphyry, Proclus, Olympiodorus, and Damascius wrote explicitly about the symbolic interpretation of traditional and Orphic myths.Mythological themes were consciously employed in literature, beginning with Homer. The resulting work may expressly refer to a mythological background without itself becoming part of a body of myths (Cupid and Psyche). Medieval romance in particular plays with this process of turning myth into literature. Euhemerism, as stated earlier, refers to the rationalization of myths, putting themes formerly imbued with mythological qualities into pragmatic contexts. An example of this would be following a cultural or religious paradigm shift (notably the re-interpretation of pagan mythology following Christianization).\n\n\n=== European Renaissance ===\n\nInterest in polytheistic mythology revived during the Renaissance, with early works of mythography appearing in the sixteenth century, among them the Theologia Mythologica (1532).\n\n\n=== Nineteenth century ===\nThe first modern, Western scholarly theories of myth appeared during the second half of the 19th century—at the same time as the word myth was adopted as a scholarly term in European languages. They were driven partly by a new interest in Europe's ancient past and vernacular culture, associated with Romantic Nationalism and epitomised by the research of Jacob Grimm (1785–1863). This movement drew European scholars' attention not only to Classical myths, but also material now associated with Norse mythology, Finnish mythology, and so forth. Western theories were also partly driven by Europeans' efforts to comprehend and control the cultures, stories and religions they were encountering through colonialism. These encounters included both extremely old texts such as the Sanskrit Rigveda and the Sumerian Epic of Gilgamesh, and current oral narratives such as mythologies of the indigenous peoples of the Americas or stories told in traditional African religions.The intellectual context for nineteenth-century scholars was profoundly shaped by emerging ideas about evolution. These ideas included the recognition that many Eurasian languages—and therefore, conceivably, stories—were all descended from a lost common ancestor (the Indo-European language) which could rationally be reconstructed through the comparison of its descendant languages. They also included the idea that cultures might evolve in ways comparable to species. In general, 19th-century theories framed myth as a failed or obsolete mode of thought, often by interpreting myth as the primitive counterpart of modern science within a unilineal framework that imagined that human cultures are travelling, at different speeds, along a linear path of cultural development.\n\n\n==== Nature mythology ====\nOne of the dominant mythological theories of the latter 19th century was nature mythology, the foremost exponents of which included Max Müller and Edward Burnett Tylor. This theory posited that \"primitive man\" was primarily concerned with the natural world. It tended to interpret myths that seemed distasteful to European Victorians—such as tales about sex, incest, or cannibalism—as being metaphors for natural phenomena like agricultural fertility. Unable to conceive impersonal natural laws, early humans tried to explain natural phenomena by attributing souls to inanimate objects, thus giving rise to animism. \nAccording to Tylor, human thought evolved through stages, starting with mythological ideas and gradually progressing to scientific ideas. Müller also saw myth as originating from language, even calling myth a \"disease of language.\" He speculated that myths arose due to the lack of abstract nouns and neuter gender in ancient languages. Anthropomorphic figures of speech, necessary in such languages, were eventually taken literally, leading to the idea that natural phenomena were in actuality conscious beings or gods. Not all scholars, not even all 19th-century scholars, accepted this view, however: Lucien Lévy-Bruhl claimed that \"the primitive mentality is a condition of the human mind and not a stage in its historical development.\" Recent scholarship, noting the fundamental lack of evidence for \"nature mythology\" interpretations among people who actually circulated myths, has likewise abandoned the key ideas of \"nature mythology.\"\n\n\n==== Myth and ritual ====\nJames George Frazer saw myths as a misinterpretation of magical rituals, which were themselves based on a mistaken idea of natural law. this idea was central to the \"myth and ritual\" school of thought. According to Frazer, humans begin with an unfounded belief in impersonal magical laws. When they realize applications of these laws do not work, they give up their belief in natural law in favor of a belief in personal gods controlling nature, thus giving rise to religious myths. Meanwhile, humans continue practicing formerly magical rituals through force of habit, reinterpreting them as reenactments of mythical events. Finally, humans come to realize nature follows natural laws, and they discover their true nature through science. Here again, science makes myth obsolete as humans progress \"from magic through religion to science.\" Segal asserted that by pitting mythical thought against modern scientific thought, such theories imply modern humans must abandon myth.\n\n\n=== Twentieth century ===\n\nThe earlier 20th century saw major work developing psychoanalytical approaches to interpreting myth, led by Sigmund Freud, who, drawing inspiration from Classical myth, began developing the concept of the Oedipus complex in his 1899 The Interpretation of Dreams. Jung likewise tried to understand the psychology behind world myths. Jung asserted that all humans share certain innate unconscious psychological forces, which he called archetypes. He believed similarities between the myths of different cultures reveals the existence of these universal archetypes.The mid-20th century saw the influential development of a structuralist theory of mythology, led by Lévi-Strauss. Strauss argued that myths reflect patterns in the mind and interpreted those patterns more as fixed mental structures, specifically pairs of opposites (good/evil, compassionate/callous), rather than unconscious feelings or urges. Meanwhile, Bronislaw Malinowski developed analyses of myths focusing on their social functions in the real world. He is associated with the idea that myths such as origin stories might provide a \"mythic charter\"—a legitimisation—for cultural norms and social institutions. Thus, following the Structuralist Era (c. 1960s–1980s), the predominant anthropological and sociological approaches to myth increasingly treated myth as a form of narrative that can be studied, interpreted, and analyzed like ideology, history, and culture. In other words, myth is a form of understanding and telling stories that are connected to power, political structures, and political and economic interests. \nThese approaches contrast with approaches, such as those of Joseph Campbell and Eliade, which hold that myth has some type of essential connection to ultimate sacred meanings that transcend cultural specifics. In particular, myth was studied in relation to history from diverse social sciences. Most of these studies share the assumption that history and myth are not distinct in the sense that history is factual, real, accurate, and truth, while myth is the opposite.\nIn the 1950s, Barthes published a series of essays examining modern myths and the process of their creation in his book Mythologies, which stood as an early work in the emerging post-structuralist approach to mythology, which recognised myths' existence in the modern world and in popular culture.The 20th century saw rapid secularisation in Western culture. This made Western scholars more willing to analyse narratives in the Abrahamic religions as myths; theologians such as Rudolf Bultmann argued that a modern Christianity needed to demythologize; and other religious scholars embraced the idea that the mythical status of Abrahamic narratives was a legitimate feature of their importance. This, in his appendix to Myths, Dreams and Mysteries, and in The Myth of the Eternal Return, Eliade attributed modern humans’ anxieties to their rejection of myths and the sense of the sacred.The Christian theologian Conrad Hyers wrote:\n[M]yth today has come to have negative connotations which are the complete opposite of its meaning in a religious context... In a religious context, however, myths are storied vehicles of supreme truth, the most basic and important truths of all. By them, people regulate and interpret their lives and find worth and purpose in their existence. Myths put one in touch with sacred realities, the fundamental sources of being, power, and truth. They are seen not only as being the opposite of error but also as being clearly distinguishable from stories told for entertainment and from the workaday, domestic, practical language of a people. They provide answers to the mysteries of being and becoming, mysteries which, as mysteries, are hidden, yet mysteries which are revealed through story and ritual. Myths deal not only with truth but with ultimate truth.\n\n\n=== Twenty-first century ===\nBoth in 19th-century research, which tended to see existing records of stories and folklore as imperfect fragments of partially lost myths, and in 20th-century structuralist work, which sought to identify underlying patterns and structures in often diverse versions of a given myth, there had been a tendency to synthesise sources to attempt to reconstruct what scholars supposed to be more perfect or underlying forms of myths. From the late 20th century, however, researchers influenced by postmodernism tended instead to argue that each account of a given myth has its own cultural significance and meaning, and argued that rather than representing degradation from a once more perfect form, myths are inherently plastic and variable. There is, consequently, no such thing as the 'original version' or 'original form' of a myth. One prominent example of this movement was A. K. Ramanujan's essay \"Three Hundred Ramayanas\".Correspondingly, scholars challenged the precedence that had once been given to texts as a medium for mythology, arguing that other media, such as the visual arts or even landscape and place-naming, could be as or more important.\n\n\n== Modern mythology ==\n\nScholars in the field of cultural studies research how myth has worked itself into modern discourses. Mythological discourse can reach greater audiences than ever before via digital media. Various mythic elements appear in television, cinema and video games.Although myth was traditionally transmitted through the oral tradition on a small scale, the film industry has enabled filmmakers to transmit myths to large audiences via film. In Jungian psychology myths are the expression of a culture or society’s goals, fears, ambitions and dreams.The basis of modern visual storytelling is rooted in the mythological tradition. Many contemporary films rely on ancient myths to construct narratives. The Walt Disney Company is well-known among cultural study scholars for \"reinventing\" traditional childhood myths. While many films are not as obvious as Disney fairy tales, the plots of many films are based on the rough structure of myths. Mythological archetypes, such as the cautionary tale regarding the abuse of technology, battles between gods and creation stories, are often the subject of major film productions. These films are often created under the guise of cyberpunk action films, fantasy, dramas and apocalyptic tales.21st-century films such as Clash of the Titans, Immortals and Thor continue the trend of mining traditional mythology to frame modern plots. Authors use mythology as a basis for their books, such as Rick Riordan, whose Percy Jackson and the Olympians series is situated in a modern-day world where the Greek deities are manifest.\n\n\n== See also ==\n\nList of mythologies\nList of mythological objects\nList of mythology books and sources\nMagic and mythology\nMythopoeia, artificially constructed mythology, mainly for the purpose of storytelling\n\n\n== Notes ==\n\n\n== References ==\nAnderson, Albert A. (2004), \"Mythos, Logos, and Telos: How to Regain the Love of Wisdom\",  in Anderson, Albert A.; Hicks, Steven V.; Witkowski, Lech (eds.), Mythos and Logos: How to Regain the Love of Wisdom, Rodopi, ISBN 978-90-420-1020-8\nApollodorus (1976). \"Introduction\". Gods and Heroes of the Greeks: The Library of Apollodorus. Translated by Simpson, Michael. Amherst: University of Massachusetts Press. ISBN 978-0-87023-206-0.\nArmstrong, Karen (2010). A Short History of Myth (Myths series). Knopf Canada. ISBN 978-0-307-36729-7.\nBarthes, Roland (1972). Mythologies. Hill and Wang. ISBN 978-0-8090-7193-7.\nBascom, William Russell (1965). The Forms of Folklore: Prose Narratives. University of California.\nBowker, John (2005). \"Euhemerism\". The Concise Oxford Dictionary of World Religions. Oxford University Press. ISBN 978-0-19-861053-3.\nBulfinch, Thomas (2004). Bulfinch's Mythology. Kessinger Publishing. ISBN 978-1-4191-1109-9.\nCorner, John (1999). Critical Ideas in Television Studies. Clarendon Press. ISBN 978-0-19-874221-0.\nDoniger, Wendy (2004). Hindu Myths: A Sourcebook Translated from the Sanskrit. Penguin Books Limited. ISBN 978-0-14-190375-0.\nDoty, William G. (2004). Myth: A Handbook. Greenwood Publishing Group. ISBN 978-0-313-32696-7.\nDowning, Christine (1996). The Goddess: Mythological Images of the Feminine. Continuum.\nDundes, Alan (1996). \"Madness in Method Plus a Plea for Projective Inversion in Myth\".  In L. L. Patton and W. Doniger (ed.). Myth and Method. University of Virginia Press. pp. 147–. ISBN 978-0-8139-1657-6.\n— (1997). \"Binary Opposition in Myth: The Propp/Levi-Strauss Debate in Retrospect.\" Western Folklore 56(Winter):39–50.\n—, ed. (1984). Sacred Narrative: Readings in the Theory of Myth. University of California Press. ISBN 978-0-520-05192-8.\nHonko, Lauri. \"The Problem of Defining Myth.\"\nKirk, G. S. \"On Defining Myths.\" Pp. 53–61.\nPettazzoni, Raffaele. \"The Truth of Myth.\"\nLincoln, Bruce (1999), \"The Prehistory of Mythos and Logos\", Theorizing Myth: Narrative, Ideology, and Scholarship, University of Chicago Press, ISBN 978-0-226-48202-6\nEliade, Mircea (1960). Myths, dreams, and mysteries: the encounter between contemporary faiths and archaic realities. Translated by Mairet, Philip. Harvill Press. ISBN 978-0-06-131320-2.\n— (1998). Myth and Reality. Waveland Press. ISBN 978-1-4786-0861-5.\nFabiani, Paolo \"The Philosophy of the Imagination in Vico and Malebranche\". F.U.P. (Florence UP), English edition 2009. PDF\nFrankfort, Henri; Frankfort, H.A.; Wilson, John A.; Jacobsen, Thorkild; Irwin, William A. (2013). The Intellectual Adventure of Ancient Man: An Essay of Speculative Thought in the Ancient Near East. University of Chicago Press. ISBN 978-0-226-11256-5.\nFrazer, Sir James George (1913). The Golden Bough: A Study in Magic and Religion. Macmillan and Company, limited. pp. 10–.\nGraf, Fritz (1996). Greek Mythology: An Introduction. Translated by Marier, Thomas. Johns Hopkins University Press. ISBN 978-0-8018-5395-1.\nHumphrey, Sheryl (2012). The Haunted Garden: Death and Transfiguration in the Folklore of Plants. New York: DCA Art Fund Grant from the Council on the Arts and Humanities for Staten Island and public funding from the New York City Department of Cultural Affairs. ISBN 978-1-300-55364-9.\nHyers, Conradl (1984). The Meaning of Creation: Genesis and Modern Science. Westminster John Knox Press. ISBN 978-0-8042-0125-4.\nIndick, William (2004). \"Classical Heroes in Modern Movies: Mythological Patterns of the Superhero\". Journal of Media Psychology. 9 (3): 93–95.\nKirk, Geoffrey Stephen (1973). Myth: Its Meaning and Functions in Ancient and Other Cultures. University of California Press. ISBN 978-0-520-02389-5.\nKoven, Mikel J. (22 May 2003). \"Folklore Studies and Popular Film and Television: A Necessary Critical Survey\". Journal of American Folklore. 116 (460): 176–195. doi:10.1353/jaf.2003.0027. ISSN 1535-1882. S2CID 163091590.\nLeonard, Scott (August 2007). \"The History of Mythology: Part I\". Youngstown State University. Retrieved 17 November 2009.\nLittleton, C. Scott (1973). The New Comparative Mythology: An Anthropological Assessment of the Theories of Georges Dumézil. University of California Press. pp. 1–. ISBN 978-0-520-02404-5.\nMatira, Lopamundra (2008). \"Children's Oral Literature and Modern Mass Media\". Indian Folklore Research Journal. 5 (8): 55–57.\nMeletinsky, Eleazar M. (2014). The Poetics of Myth. Taylor & Francis. ISBN 978-1-135-59913-3.\nOlson, Eric L. (May 3, 2011). \"Great Expectations: the Role of Myth in 1980s Films with Child Heroes\". Virginia Polytechnic Scholarly Library. Virginia Polytechnic Institute And State University. hdl:10919/32929. Archived (PDF) from the original on January 19, 2012. Retrieved September 26, 2020.\n\"Myth\". Encyclopædia Britannica. 2009. 21 March 2009.\nSimpson, Jacqueline, and Steve Roud, eds. 2003. \"Myths.\" In A Dictionary of English Folklore. Oxford: Oxford University Press. ISBN 9780191726644.\n\"Basque Mythology.\" Public Reading Network of the Basque Country. 2018.\nNorthup, Lesley (2006). \"Myth-Placed Priorities: Religion and the Study of Myth.\" Religious Studies Review 32(1):5–10. doi:10.1111/j.1748-0922.2006.00018.x. ISSN 1748-0922.\nSegal, Robert (2015). Myth: A Very Short Introduction. OUP Oxford. pp. 19–. ISBN 978-0-19-103769-6.\nSinger, Irving (2010). Cinematic Mythmaking: Philosophy in Film. MIT Press. pp. 1–. ISBN 978-0-262-26484-6.\nSlattery, Dennis Patrick (2015). Bridge Work: Essays on Mythology, Literature and Psychology. Carpinteria: Mandorla Books.\nWiles, David (2000), \"Myth\", Greek Theatre Performance: An Introduction, Cambridge University Press, ISBN 978-0-521-64857-8\n\n\n== External links ==", "chinese_title": "", "chinese": ""}