{"topic": "People", "english_title": "People", "english": "A people is a plurality of persons considered as a whole, as is the case with an ethnic group, nation or the public of a polity.\n\n\n== In politics ==\n\nVarious states govern or claim to govern in the name of the people. Both the Roman Republic and the Roman Empire used the Latin term Senatus Populusque Romanus, (the Senate and People of Rome). This term was fixed abbreviated (SPQR) to Roman legionary standards, and even after the Roman Emperors achieved a state of total personal autarchy, they continued to wield their power in the name of the Senate and People of Rome.\nA People's Republic is typically a Marxist or socialist one-party state that claims to govern on behalf of the people even if it in practice often turns out to be a dictatorship. Populism is another umbrella term for various political tendencies that claim to represent the people, usually with an implication that they serve the common people instead of the elite.\nChapter One, Article One of the Charter of the United Nations states that \"peoples\" have the right to self-determination. Though the mere status as peoples and their right to self-determination, as for example in the case of Indigenous peoples, does not provide for claiming independence and a sovereign state, since peoples also need territory and a central government to reach sovereignty in international politics.\n\n\n== In law ==\n\nIn criminal law, in certain jurisdictions, criminal prosecutions are brought in the name of the People. Several U.S. states, including California, Illinois, and New York, use this style. Citations outside the jurisdictions in question usually substitute the name of the state for the words \"the People\" in the case captions. Four states — Massachusetts, Virginia, Pennsylvania, and Kentucky — refer to themselves as the Commonwealth in case captions and legal process.  Other states, such as Indiana, typically refer to themselves as the State in case captions and legal process.\nOutside the United States, criminal trials in Ireland and the Philippines are prosecuted in the name of the people of their respective states.\nThe political theory underlying this format is that criminal prosecutions are brought in the name of the sovereign; thus, in these U.S. states, the \"people\" are judged to be the sovereign, even as in the United Kingdom and other dependencies of the British Crown, criminal prosecutions are typically brought in the name of the Crown. \"The people\" identifies the entire body of the citizens of a jurisdiction invested with political power or gathered for political purposes.\n\n\n== See also ==\n\nClan\nKinship\nTribe\nList of contemporary ethnic groups\nList of indigenous peoples\nVolk\nNational identity\nNationality\nPublic\nRepublic\nRepublicanism\nDemocracy\nPeople's republic\n\n\n== References ==", "chinese_title": "", "chinese": ""}