{"topic": "Longevity", "english_title": "Longevity", "english": "The word \"longevity\" is sometimes used as a synonym for \"life expectancy\" in demography.  However, the term longevity is sometimes meant to refer only to especially long-lived members of a population, whereas life expectancy is always defined statistically as the average number of years remaining at a given age. For example, a population's life expectancy at birth is the same as the average age at death for all people born in the same year (in the case of cohorts). Longevity is best thought of as a term for general audiences meaning 'typical length of life' and specific statistical definitions should be clarified when necessary.\nReflections on longevity have usually gone beyond acknowledging the brevity of human life and have included thinking about methods to extend life. Longevity has been a topic not only for the scientific community but also for writers of travel, science fiction, and utopian novels.\nThere are many difficulties in authenticating the longest human life span ever by modern verification standards, owing to inaccurate or incomplete birth statistics. Fiction, legend, and folklore have proposed or claimed life spans in the past or future vastly longer than those verified by modern standards, and longevity narratives and unverified longevity claims frequently speak of their existence in the present.\nA life annuity is a form of longevity insurance.\n\n\n== Life expectancy, as of 2010 ==\n\nVarious factors contribute to an individual's longevity. Significant factors in life expectancy include gender, genetics, access to health care, hygiene, diet and nutrition, exercise, lifestyle, and crime rates. Below is a list of life expectancies in different types of countries:\nDeveloped countries: 77–90 years (e.g. Canada: 81.29 years, 2010 est.)\nDeveloping countries: 32–80 years (e.g. Mozambique: 41.37 years, 2010 est.)Population longevities are increasing as life expectancies around the world grow:\nAustralia: 80 years in 2002, 81.72 years in 2010\nFrance: 79.05 years  in 2002, 81.09 years in 2010\nGermany: 77.78 years in 2002, 79.41 years  in 2010\nItaly: 79.25 years in 2002, 80.33 years in 2010\nJapan: 81.56 years in 2002, 82.84 years in 2010\nMonaco: 79.12 years in 2002, 79.73 years in 2011\nSpain: 79.06 years in 2002, 81.07 years in 2010\nUK: 80 years in 2002, 81.73 years in 2010\nUSA: 77.4 years in 2002, 78.24 years in 2010\n\n\n== Long-lived individuals ==\nThe Gerontology Research Group validates current longevity records by modern standards, and maintains a list of supercentenarians; many other unvalidated longevity claims exist. Record-holding individuals include:\nEilif Philipsen (1682–1785, 102 years, 333 days): first person to reach the ages of 100, 101, and 102 (on July 21, 1782) and whose age could be validated.\nGeert Adriaans Boomgaard (1788–1899, 110 years, 135 days): first person to reach the age of 110 (on September 21, 1898) and whose age could be validated.\nMargaret Ann Neve, (18 May 1792 – 4 April 1903, 110 years, 346 days) the first validated female supercentenarian (on 18 May 1902).\nJeanne Calment (1875–1997, 122 years, 164 days): the oldest person in history whose age has been verified by modern documentation. This defines the modern human life span, which is set by the oldest documented individual who ever lived.\nSarah Knauss (1880–1999, 119 years, 97 days): the second oldest documented person in modern times and the oldest American.\nJiroemon Kimura (1897–2013, 116 years, 54 days): the oldest man in history whose age has been verified by modern documentation.\n\n\n== Major factors ==\n\nEvidence-based studies indicate that longevity is based on two major factors, genetics and lifestyle choices.\n\n\n=== Genetics ===\n\nTwin studies have estimated that approximately 20-30% of the variation in human lifespan can be related to genetics, with the rest due to individual behaviors and environmental factors which can be modified. Although over 200 gene variants have been associated with longevity according to a US-Belgian-UK research database of human genetic variants, these explain only a small fraction of the heritability. A 2012 study found that even modest amounts of leisure time and physical exercise can extend life expectancy by as much as 4.5 years.Lymphoblastoid cell lines established from blood samples of centenarians have significantly higher activity of the DNA repair protein PARP (Poly ADP ribose polymerase) than cell lines from younger (20 to 70 year old) individuals.  The lymphocytic cells of centenarians have characteristics typical of cells from young people, both in their capability of priming the mechanism of repair after H2O2 sublethal oxidative DNA damage and in their PARP gene expression.  These findings suggest that elevated PARP gene expression contributes to the longevity of centenarians, consistent with the DNA damage theory of aging.\n\nIn July 2020 scientists, using public biological data on 1.75 m people with known lifespans overall, identify 10 genomic loci which appear to intrinsically influence healthspan, lifespan, and longevity – of which half have not been reported previously at genome-wide significance and most being associated with cardiovascular disease – and identify haem metabolism as a promising candidate for further research within the field. Their study suggests that high levels of iron in the blood likely reduce, and genes involved in metabolising iron likely increase healthy years of life in humans.Gene editing has dramatically altered lifespans in animals.\n\n\n=== Diet ===\nAccumulating research in unicellular and invertebrate model organisms, rodents, monkeys, and humans indicates that diet has a much more pervasive and prominent role than previously thought in modulating mechanisms of aging and its associated diseases.A study in discordant twins indicated that the intake of vegetables and fruits, as well as physical activity, were inversely associated with epigenetic aging.\n\n\n== Change over time ==\nIn preindustrial times, deaths at young and middle age were more common than they are today. This is not due to genetics, but because of environmental factors such as disease, accidents, and malnutrition, especially since the former were not generally treatable with pre-20th-century medicine. Deaths from childbirth were common for women, and many children did not live past infancy. In addition, most people who did attain old age were likely to die quickly from the above-mentioned untreatable health problems. Despite this, there are many examples of pre-20th-century individuals attaining lifespans of 85 years or greater, including John Adams, Cato the Elder, Thomas Hobbes, Eric of Pomerania, Christopher Polhem, and Michelangelo. This was also true for poorer people like peasants or laborers. Genealogists will almost certainly find ancestors living to their 70s, 80s and even 90s several hundred years ago.\nFor example, an 1871 census in the UK (the first of its kind, but personal data from other censuses dates back to 1841 and numerical data back to 1801) found the average male life expectancy as being 44, but if infant mortality is subtracted, males who lived to adulthood averaged 75 years. The present life expectancy in the UK is 77 years for males and 81 for females, while the United States averages 74 for males and 80 for females.\nStudies have shown that black American males have the shortest lifespans of any group of people in the US, averaging only 69 years (Asian-American females average the longest). This reflects overall poorer health and greater prevalence of heart disease, obesity, diabetes, and cancer among black American men.\nWomen normally outlive men. Theories for this include smaller bodies (and thus less stress on the heart), a stronger immune system (since testosterone acts as an immunosuppressant), and less tendency to engage in physically dangerous activities.\nThere is debate as to whether the pursuit of longevity is a worthwhile health care goal. Bioethicist Ezekiel Emanuel, who is also one of the architects of ObamaCare, has argued that the pursuit of longevity via the compression of morbidity explanation is a \"fantasy\" and that longevity past age 75 should not be considered an end in itself. This has been challenged by neurosurgeon Miguel Faria, who states that life can be worthwhile in healthy old age, that the compression of morbidity is a real phenomenon, and that longevity should be pursued in association with quality of life. Faria has discussed how longevity in association with leading healthy lifestyles can lead to the postponement of senescence as well as happiness and wisdom in old age.\n\n\n== Limited longevity ==\nAll of the biological organisms have a limited longevity, and different species of animals and plants have different potentials of longevity. Misrepair-accumulation aging theory suggests that the potential of longevity of an organism is related to its structural complexity. Limited longevity is due to the limited structural complexity of the organism. If a species of organisms has too high structural complexity, most of its individuals would die before the reproduction age, and the species could not survive. This theory suggests that limited structural complexity and limited longevity are essential for the survival of a species.\n\n\n== Longevity myths ==\n\nLongevity myths are traditions about long-lived people (generally supercentenarians), either as individuals or groups of people, and practices that have been believed to confer longevity, but for which scientific evidence does not support the ages claimed or the reasons for the claims. A comparison and contrast of \"longevity in antiquity\" (such as the Sumerian King List, the genealogies of Genesis, and the Persian Shahnameh) with \"longevity in historical times\" (common-era cases through twentieth-century news reports) is elaborated in detail in Lucian Boia's 2004 book Forever Young: A Cultural History of Longevity from Antiquity to the Present and other sources.After the death of Juan Ponce de León, Gonzalo Fernández de Oviedo y Valdés wrote in Historia General y Natural de las Indias (1535) that Ponce de León was looking for the waters of Bimini to cure his aging. Traditions that have been believed to confer greater human longevity also include alchemy, such as that attributed to Nicolas Flamel. In the modern era, the Okinawa diet has some reputation of linkage to exceptionally high ages.Longevity claims may be subcategorized into four groups: \"In late life, very old people often tend to advance their ages at the rate of about 17 years per decade .... Several celebrated super-centenarians (over 110 years) are believed to have been double lives (father and son, relations with the same names or successive bearers of a title) .... A number of instances have been commercially sponsored, while a fourth category of recent claims are those made for political ends ....\" The estimate of 17 years per decade was corroborated by the 1901 and 1911 British censuses. Time magazine considered that, by the Soviet Union, longevity had been elevated to a state-supported \"Methuselah cult\". Robert Ripley regularly reported supercentenarian claims in Ripley's Believe It or Not!, usually citing his own reputation as a fact-checker to claim reliability.\n\n\n== Future ==\nThe United Nations has also made projections far out into the future, up to 2300, at which point it projects that life expectancies in most developed countries will be between 100 and 106 years and still rising, though more and more slowly than before. These projections also suggest that life expectancies in poor countries will still be less than those in rich countries in 2300, in some cases by as much as 20 years. The UN itself mentioned that gaps in life expectancy so far in the future may well not exist, especially since the exchange of technology between rich and poor countries and the industrialization and development of poor countries may cause their life expectancies to converge fully with those of rich countries long before that point, similarly to the way life expectancies between rich and poor countries have already been converging over the last 60 years as better medicine, technology, and living conditions became accessible to many people in poor countries. The UN has warned that these projections are uncertain, and cautions that any change or advancement in medical technology could invalidate such projections.Recent increases in the rates of lifestyle diseases, such as obesity, diabetes, hypertension, and heart disease, may eventually slow or reverse this trend toward increasing life expectancy in the developed world, but have not yet done so. The average age of the US population is getting higher and these diseases show up in older people.Jennifer Couzin-Frankel examined how much mortality from various causes would have to drop in order to boost life expectancy and concluded that most of the past increases in life expectancy occurred because of improved survival rates for young people.  She states that it seems unlikely that life expectancy at birth will ever exceed 85 years. Michio Kaku argues that genetic engineering, nanotechnology and future breakthroughs will accelerate the rate of life expectancy increase indefinitely. Already genetic engineering has allowed the life expectancy of certain primates to be doubled, and for human skin cells in labs to divide and live indefinitely without becoming cancerous.Reliable data from 1840 through 2002 indicates life expectancy has risen linearly for men and women, albeit more slowly for men. For women the increase has been almost three months per year, for men almost 2.7 months per year. In light of steady increase, without any sign of limitation, the suggestion that life expectancy will top out must be treated with caution. Scientists Oeppen and Vaupel observe that experts who assert that \"life expectancy is approaching a ceiling ... have repeatedly been proven wrong.\" It is thought that life expectancy for women has increased more dramatically owing to the considerable advances in medicine related to childbirth.\n\n\n== Non-human biological longevity ==\n\nCurrently living:\n\nA 5,070-year-old member of the species Pinus longaeva: Oldest known currently living non-clonal tree.\nMethuselah: 4,800-year-old bristlecone pine in the White Mountains of California, the second oldest currently living non-clonal tree.Dead:\n\nThe quahog clam (Arctica islandica) is exceptionally long-lived, with a maximum recorded age of 507 years, the longest of any animal. Other clams of the species have been recorded as living up to 374 years.\nLamellibrachia luymesi, a deep-sea cold-seep tubeworm, is estimated to reach ages of over 250 years based on a model of its growth rates.\nA bowhead whale killed in a hunt was found to be approximately 211 years old (possibly up to 245 years old), the longest-lived mammal known.Revived:\n\nPossibly 250-million year-old bacteria, Bacillus permians, were revived from stasis after being found in sodium chloride crystals in a cavern in New Mexico.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== External links ==\nAmerican Federation for Aging Research\nThe Okinawa Centenarian Study\nList of Longevity Genes\nGlobal Agewatch's country report cards have the most up-to-date, internationally comparable statistics on population ageing and life expectancy from 195 countries.\nBuettner, Dan (May 2015). Want Great Longevity and Health? It Takes a Village. \"The secrets of the world’s longest-lived people include community, family, exercise and plenty of beans.\"  The Wall Street Journal", "chinese_title": "", "chinese": ""}