{"topic": "Forensics", "english_title": "Forensic science", "english": "Forensic science, also known as criminalistics, is the application of science to criminal and civil laws, mainly—on the criminal side—during criminal investigation, as governed by the legal standards of admissible evidence and criminal procedure.\nForensic scientists collect, preserve, and analyze scientific evidence during the course of an investigation. While some forensic scientists travel to the scene of the crime to collect the evidence themselves, others occupy a laboratory role, performing analysis on objects brought to them by other individuals. Still others are involved in analysis of financial, banking, or other numerical data for use in financial crime investigation, and can be employed as consultants from private firms, academia, or as government employees.In addition to their laboratory role, forensic scientists testify as expert witnesses in both criminal and civil cases and can work for either the prosecution or the defense. While any field could technically be forensic, certain sections have developed over time to encompass the majority of forensically related cases.\nForensic science is a combination of two different Latin words: forensis and science. The former, forensic, relates to a discussion or examination performed in public. Because trials in the ancient world were typically held in public, it carries a strong judicial connotation. The second is science, which is derived from the Latin word for 'knowledge' and is today closely tied to the scientific method, a systematic way of acquiring knowledge. Taken together forensic science means the use of the scientific methods and processes for crime solving.\n\n\n== Etymology ==\nThe word forensic comes from the Latin term forēnsis, meaning \"of or before the forum\". The history of the term originates from Roman times, during which a criminal charge meant presenting the case before a group of public individuals in the forum. Both the person accused of the crime and the accuser would give speeches based on their sides of the story. The case would be decided in favor of the individual with the best argument and delivery. This origin is the source of the two modern usages of the word forensic—as a form of legal evidence; and as a category of public presentation.\nIn modern use, the term forensics in the place of forensic science can be considered incorrect, as the term forensic is effectively a synonym for legal or related to courts. However, the term is now so closely associated with the scientific field that many dictionaries include the meaning that equates the word forensics with forensic science.\n\n\n== History ==\n\n\n=== Origins of forensic science and early methods ===\n\nThe ancient world lacked standardized forensic practices, which enabled criminals to escape punishment. Criminal investigations and trials relied heavily on forced confessions and witness testimony. However, ancient sources do contain several accounts of techniques that foreshadow concepts in forensic science developed centuries later.The first written account of using medicine and entomology to solve criminal cases is attributed to the book of Xi Yuan Lu (translated as Washing Away of Wrongs), written in China in 1248 by Song Ci (宋慈, 1186–1249), a director of justice, jail and supervision, during the Song dynasty.\nSong Ci introduced regulations concerning autopsy reports to court, how to protect the evidence in the examining process, and explained why forensic workers must demonstrate impartiality to the public. He devised methods for making antiseptic and for promoting the reappearance of hidden injuries to dead bodies and bones (using sunlight and vinegar under a red-oil umbrella); for calculating the time of death (allowing for weather and insect activity); described how to wash and examine the dead body to ascertain the reason for death. At that time the book had described methods for distinguishing between suicide and faked suicide.In one of Song Ci's accounts (Washing Away of Wrongs), the case of a person murdered with a sickle was solved by an investigator who instructed each suspect to bring his sickle to one location. (He realized it was a sickle by testing various blades on an animal carcass and comparing the wounds.) Flies, attracted by the smell of blood, eventually gathered on a single sickle. In light of this, the owner of that sickle confessed to the murder. As other  examples, the book also described how to distinguish between a drowning (water in the lungs) and strangulation (broken neck cartilage), and described evidence from examining corpses to determine if a death was caused by murder, suicide or accident.Methods from around the world involved saliva and examination of the mouth and tongue to determine innocence or guilt, as a precursor to the Polygraph test. In ancient India, some suspects were made to fill their mouths with dried rice and spit it back out. Similarly, in ancient China, those accused of a crime would have rice powder placed in their mouths. In ancient middle-eastern cultures, the accused were made to lick hot metal rods briefly. It is thought that these tests had some validity since a guilty person would produce less saliva and thus have a drier mouth; the accused would be considered guilty if rice was sticking to their mouths in abundance or if their tongues were severely burned due to lack of shielding from saliva.\n\n\n=== Development of forensic science ===\n\nIn 16th-century Europe, medical practitioners in army and university settings began to gather information on the cause and manner of death. Ambroise Paré, a French army surgeon, systematically studied the effects of violent death on internal organs. Two Italian surgeons, Fortunato Fidelis and Paolo Zacchia, laid the foundation of modern pathology by studying changes that occurred in the structure of the body as the result of disease.  In the late 18th century, writings on these topics began to appear. These included A Treatise on Forensic Medicine and Public Health by the French physician Francois Immanuele Fodéré and The Complete System of Police Medicine by the German medical expert Johann Peter Frank.\nAs the rational values of the Enlightenment era increasingly permeated society in the 18th century, criminal investigation became a more evidence-based, rational procedure − the use of torture to force confessions was curtailed, and belief in witchcraft and other powers of the occult largely ceased to influence the court's decisions. Two examples of English forensic science in individual legal proceedings demonstrate the increasing use of logic and procedure in criminal investigations at the time. In 1784, in Lancaster, John Toms was tried and convicted for murdering Edward Culshaw with a pistol. When the dead body of Culshaw was examined, a pistol wad (crushed paper used to secure powder and balls in the muzzle) found in his head wound matched perfectly with a torn newspaper found in Toms's pocket, leading to the conviction.  \nIn Warwick 1816, a farm laborer was tried and convicted of the murder of a young maidservant. She had been drowned in a shallow pool and bore the marks of violent assault. The police found footprints and an impression from corduroy cloth with a sewn patch in the damp earth near the pool. There were also scattered grains of wheat and chaff. The breeches of a farm labourer who had been threshing wheat nearby were examined and corresponded exactly to the impression in the earth near the pool.An article appearing in Scientific American in 1885 describes the used of microscopy to distinguish between the blood of two persons in a criminal case in Chicago.\n\n\n=== Toxicology ===\nA method for detecting arsenious oxide, simple arsenic, in corpses was devised in 1773 by the Swedish chemist, Carl Wilhelm Scheele. His work was expanded upon, in 1806, by German chemist Valentin Ross, who learned to detect the poison in the walls of a victim's stomach.\n\nJames Marsh was the first to apply this new science to the art of forensics. He was called by the prosecution in a murder trial to give evidence as a chemist in 1832. The defendant, John Bodle, was accused of poisoning his grandfather with arsenic-laced coffee. Marsh performed the standard test by mixing a suspected sample with hydrogen sulfide and hydrochloric acid. While he was able to detect arsenic as yellow arsenic trisulfide, when it was shown to the jury it had deteriorated, allowing the suspect to be acquitted due to reasonable doubt.Annoyed by that, Marsh developed a much better test. He combined a sample containing arsenic with sulfuric acid and arsenic-free zinc, resulting in arsine gas. The gas was ignited, and it decomposed to pure metallic arsenic, which, when passed to a cold surface, would appear as a silvery-black deposit. So sensitive was the test, known formally as the Marsh test, that it could detect as little as one-fiftieth of a milligram of arsenic. He first described this test in The Edinburgh Philosophical Journal in 1836.\n\n\n=== Ballistics ===\n\nHenry Goddard at Scotland Yard pioneered the use of bullet comparison in 1835. He noticed a flaw in the bullet that killed the victim and was able to trace this back to the mold that was used in the manufacturing process.\n\n\n=== Anthropometry ===\n\nThe French police officer Alphonse Bertillon was the first to apply the anthropological technique of anthropometry to law enforcement, thereby creating an identification system based on physical measurements. Before that time, criminals could be identified only by name or photograph. Dissatisfied with the ad hoc methods used to identify captured criminals in France in the 1870s, he began his work on developing a reliable system of anthropometrics for human classification.Bertillon created many other forensics techniques, including forensic document examination, the use of galvanoplastic compounds to preserve footprints, ballistics, and the dynamometer, used to determine the degree of force used in breaking and entering. Although his central methods were soon to be supplanted by fingerprinting, \"his other contributions like the mug shot and the systematization of crime-scene photography remain in place to this day.\"\n\n\n=== Fingerprints ===\nSir William Herschel was one of the first to advocate the use of fingerprinting in the identification of criminal suspects. While working for the Indian Civil Service, he began to use thumbprints on documents as a security measure to prevent the then-rampant repudiation of signatures in 1858.\n\nIn 1877 at Hooghly (near Kolkata), Herschel instituted the use of fingerprints on contracts and deeds, and he registered government pensioners' fingerprints to prevent the collection of money by relatives after a pensioner's death.In 1880, Dr. Henry Faulds, a Scottish surgeon in a Tokyo hospital, published his first paper on the subject in the scientific journal Nature, discussing the usefulness of fingerprints for identification and proposing a method to record them with printing ink. He established their first classification and was also the first to identify fingerprints left on a vial. Returning to the UK in 1886, he offered the concept to the Metropolitan Police in London, but it was dismissed at that time.Faulds wrote to Charles Darwin with a description of his method, but, too old and ill to work on it, Darwin gave the information to his cousin, Francis Galton, who was interested in anthropology. Having been thus inspired to study fingerprints for ten years, Galton published a detailed statistical model of fingerprint analysis and identification and encouraged its use in forensic science in his book Finger Prints. He had calculated that the chance of a \"false positive\" (two different individuals having the same fingerprints) was about 1 in 64 billion.\n\nJuan Vucetich, an Argentine chief police officer, created the first method of recording the fingerprints of individuals on file. In 1892, after studying Galton's pattern types, Vucetich set up the world's first fingerprint bureau. In that same year, Francisca Rojas of Necochea was found in a house with neck injuries whilst her two sons were found dead with their throats cut. Rojas accused a neighbour, but despite brutal interrogation, this neighbour would not confess to the crimes. Inspector Alvarez, a colleague of Vucetich, went to the scene and found a bloody thumb mark on a door. When it was compared with Rojas' prints, it was found to be identical with her right thumb. She then confessed to the murder of her sons.\nA Fingerprint Bureau was established in Calcutta (Kolkata), India, in 1897, after the Council of the Governor General approved a committee report that fingerprints should be used for the classification of criminal records. Working in the Calcutta Anthropometric Bureau, before it became the Fingerprint Bureau, were Azizul Haque and Hem Chandra Bose. Haque and Bose were Indian fingerprint experts who have been credited with the primary development of a fingerprint classification system eventually named after their supervisor, Sir Edward Richard Henry. The Henry Classification System, co-devised by Haque and Bose, was accepted in England and Wales when the first United Kingdom Fingerprint Bureau was founded in Scotland Yard, the Metropolitan Police headquarters, London, in 1901. Sir Edward Richard Henry subsequently achieved improvements in dactyloscopy.In the United States, Dr. Henry P. DeForrest used fingerprinting in the New York Civil Service in 1902, and by December 1905, New York City Police Department Deputy Commissioner Joseph A. Faurot, an expert in the Bertillon system and a fingerprint advocate at Police Headquarters, introduced the fingerprinting of criminals to the United States.\n\n\n=== Uhlenhuth test ===\nThe Uhlenhuth test, or the antigen–antibody precipitin test for species, was invented by Paul Uhlenhuth in 1901 and could distinguish human blood from animal blood, based on the discovery that the blood of different species had one or more characteristic proteins. The test represented a major breakthrough and came to have tremendous importance in forensic science. The test was further refined for forensic use by the Swiss chemist Maurice Müller in the 1960s.\n\n\n=== DNA ===\nForensic DNA analysis was first used in 1984. It was developed by Sir Alec Jeffreys, who realized that variation in the genetic sequence could be used to identify individuals and to tell individuals apart from one another. The first application of DNA profiles was used by Jefferys in a double murder mystery in the small English town of Narborough, Leicestershire, in 1985. A 15-year-old school girl by the name of Lynda Mann was raped and murdered in Carlton Hayes psychiatric hospital. The police did not find a suspect but were able to obtain a semen sample.\nIn 1986, Dawn Ashworth, 15 years old, was also raped and strangled in the nearby village of Enderby. Forensic evidence showed that both killers had the same blood type. Richard Buckland became the suspect because he worked at Carlton Hayes psychiatric hospital, had been spotted near Dawn Ashworth's murder scene and knew unreleased details about the body. He later confessed to Dawn's murder but not Lynda's.  Jefferys was brought into the case to analyze the semen samples. He concluded that there was no match between the samples and Buckland, who became the first person to be exonerated using DNA. Jefferys confirmed that the DNA profiles were identical for the two murder semen samples. To find the perpetrator, DNA samples from the entire male population, more than 4,000 aged from 17 to 34, of the town were collected. They all were compared to semen samples from the crime.  A friend of Colin Pitchfork was heard saying that he had given his sample to the police claiming to be Colin. Colin Pitchfork was arrested in 1987 and it was found that his DNA profile matched the semen samples from the murder.\nBecause of this case, DNA databases were developed. There is the national (FBI) and international databases as well as the European countries (ENFSI : European Network of Forensic Science Institutes). These searchable databases are used to match crime scene DNA profiles to those already in a database.\n\n\n=== Maturation ===\n\nBy the turn of the 20th century, the science of forensics had become largely established in the sphere of criminal investigation. Scientific and surgical investigation was widely employed by the Metropolitan Police during their pursuit of the mysterious Jack the Ripper, who had killed a number of women in the 1880s. This case is a watershed in the application of forensic science. Large teams of policemen conducted house-to-house inquiries throughout Whitechapel. Forensic material was collected and examined. Suspects were identified, traced and either examined more closely or eliminated from the inquiry. Police work follows the same pattern today. Over 2000 people were interviewed, \"upwards of 300\" people were investigated, and 80 people were detained.The investigation was initially conducted by the Criminal Investigation Department (CID), headed by Detective Inspector Edmund Reid. Later, Detective Inspectors Frederick Abberline, Henry Moore, and Walter Andrews were sent from Central Office at Scotland Yard to assist. Initially, butchers, surgeons and physicians were suspected because of the manner of the mutilations. The alibis of local butchers and slaughterers were investigated, with the result that they were eliminated from the inquiry. Some contemporary figures thought the pattern of the murders indicated that the culprit was a butcher or cattle drover on one of the cattle boats that plied between London and mainland Europe. Whitechapel was close to the London Docks, and usually such boats docked on Thursday or Friday and departed on Saturday or Sunday. The cattle boats were examined, but the dates of the murders did not coincide with a single boat's movements, and the transfer of a crewman between boats was also ruled out.At the end of October, Robert Anderson asked police surgeon Thomas Bond to give his opinion on the extent of the murderer's surgical skill and knowledge. The opinion offered by Bond on the character of the \"Whitechapel murderer\" is the earliest surviving offender profile. Bond's assessment was based on his own examination of the most extensively mutilated victim and the post mortem notes from the four previous canonical murders. In his opinion the killer must have been a man of solitary habits, subject to \"periodical attacks of homicidal and erotic mania\", with the character of the mutilations possibly indicating \"satyriasis\". Bond also stated that \"the homicidal impulse may have developed from a revengeful or brooding condition of the mind, or that religious mania may have been the original disease but I do not think either hypothesis is likely\".\n\nHandbook for Coroners, police officials, military policemen was written by the Austrian criminal jurist Hans Gross in 1893, and is generally acknowledged as the birth of the field of criminalistics. The work combined in one system fields of knowledge that had not been previously integrated, such as psychology and physical science, and which could be successfully used against crime. Gross adapted some fields to the needs of criminal investigation, such as crime scene photography. He went on to found the Institute of Criminalistics in 1912, as part of the University of Graz' Law School. This Institute was followed by many similar institutes all over the world.In 1909, Archibald Reiss founded the Institut de police scientifique of the University of Lausanne (UNIL), the first school of forensic science in the world. Dr. Edmond Locard, became known as the \"Sherlock Holmes of France\". He formulated the basic principle of forensic science: \"Every contact leaves a trace\", which became known as Locard's exchange principle. In 1910, he founded what may have been the first criminal laboratory in the world, after persuading the Police Department of Lyon (France) to give him two attic rooms and two assistants.Symbolic of the new found prestige of forensics and the use of reasoning in detective work was the popularity of the fictional character Sherlock Holmes, written by Arthur Conan Doyle in the late 19th century. He remains a great inspiration for forensic science, especially for the way his acute study of a crime scene yielded small clues as to the precise sequence of events. He made great use of trace evidence such as shoe and tire impressions, as well as fingerprints, ballistics and handwriting analysis, now known as questioned document examination. Such evidence is used to test theories conceived by the police, for example, or by the investigator himself. All of the techniques advocated by Holmes later became reality, but were generally in their infancy at the time Conan Doyle was writing. In many of his reported cases, Holmes frequently complains of the way the crime scene has been contaminated by others, especially by the police, emphasising the critical importance of maintaining its integrity, a now well-known feature of crime scene examination. He used analytical chemistry for blood residue analysis as well as toxicology examination and determination for poisons. He used ballistics by measuring bullet calibres and matching them with a suspected murder weapon.\n\n\n=== Late 19th – early 20th century figures ===\n\nHans Gross applied scientific methods to crime scenes and was responsible for the birth of criminalistics.\nEdmond Locard expanded on Gross' work with Locard's Exchange Principle which stated \"whenever two objects come into contact with one another, materials are exchanged between them\". This means that every contact by a criminal leaves a trace.\nAlexander Lacassagne, who taught Locard, produced autopsy standards on actual forensic cases.\nAlphonse Bertillon was a French criminologist and founder of Anthropometry (scientific study of measurements and proportions of the human body). He used anthropometry for identification, stating that, since each individual is unique, by measuring aspects of physical difference there could be a personal identification system. He created the Bertillon System around 1879, a way of identifying criminals and citizens by measuring 20 parts of the body. In 1884, over 240 repeat offenders were caught using the Bertillon system, but the system was largely superseded by fingerprinting.\nFrances Glessner Lee, known as \"the mother of forensic science\", was instrumental in the development of forensic science in the US. She lobbied to have coroners replaced by medical professionals, endowed the Harvard Associates in Police Science, and conducted many seminars to educate homicide investigators. She also created the Nutshell Studies of Unexplained Death, intricate crime scene dioramas used to train investigators, which are still in use today.\n\n\n=== 20th century ===\n\nLater in the 20th century several British pathologists, Mikey Rochman, Francis Camps, Sydney Smith and Keith Simpson pioneered new forensic science methods. Alec Jeffreys pioneered the use of DNA profiling in forensic science in 1984. He realized the scope of DNA fingerprinting, which uses variations in the genetic code to identify individuals. The method has since become important in forensic science to assist police detective work, and it has also proved useful in resolving paternity and immigration disputes. DNA fingerprinting was first used as a police forensic test to identify the rapist and killer of two teenagers, Lynda Mann and Dawn Ashworth, who were both murdered in Narborough, Leicestershire, in 1983 and 1986 respectively. Colin Pitchfork was identified and convicted of murder after samples taken from him matched semen samples taken from the two dead girls.\nForensic science has been fostered by a number of national and international forensic science learned bodies including the Chartered Society of Forensic Sciences, (founded 1959), then known as the Forensic Science Society, publisher of Science & Justice;. American Academy of Forensic Sciences (founded 1948), publishers of the Journal of Forensic Sciences; the Canadian Society of Forensic Science (founded 1953), publishers of the Journal of the Canadian Society of Forensic Science; the British Academy of Forensic Sciences (founded 1960), publishers of Medicine, Science and the Law, the Australian Academy of Forensic Sciences (founded 1967), publishers of the Australian Journal of Forensic Sciences, and the European Network of Forensic Science Institutes (founded 1995).\n\n\n=== 21st century ===\nIn the past decade, documenting forensics scenes has become more efficient. Forensic scientists have started using laser scanners, drones and photogrammetry to obtain 3D point clouds of accidents or crime scenes. Reconstruction of an accident scene on a highway using drones involves data acquisition time of only 10–20 minutes and can be performed without shutting down traffic. The results are not just accurate, in centimeters, for measurement to be presented in court but also easy to digitally preserve in the long term.\nNow, in the 21st century, much of forensic science's future is up for discussion. The National Institute of Standards and Technology (NIST) has offered the community some guidelines upon which the science should build. NIST recommends that forensic science rethinks its system. If local laboratories abide by these guidelines, 21st century forensics will be dramatically different from what it has been up till now. One of the more recent additions by NIST is a document called NISTIR-7941, titled \"Forensic Science Laboratories: Handbook for Facility Planning, Design, Construction, and Relocation\". The handbook provides a clear blueprint for approaching Forensic Science. The details even include what type of staff should be hired for certain positions.\n\n\n== Subdivisions ==\n\nArt forensics concerns the art authentication cases to help research the work's authenticity. Art authentication methods are used to detect and identify forgery, faking and copying of art works, e.g. paintings.\nBloodstain pattern analysis is the scientific examination of blood spatter patterns found at a crime scene to reconstruct the events of the crime.\nComparative forensics is the application of visual comparison techniques do verify similarity of physical evidence. This includes fingerprint analysis, toolmark analysis, and ballistic analysis.\nComputational forensics concerns the development of algorithms and software to assist forensic examination.\nCriminalistics is the application of various sciences to answer questions relating to examination and comparison of biological evidence, trace evidence, impression evidence (such as fingerprints, footwear impressions, and tire tracks), controlled substances, ballistics, firearm and toolmark examination, and other evidence in criminal investigations. In typical circumstances evidence is processed in a crime lab.\nDigital forensics is the application of proven scientific methods and techniques in order to recover data from electronic / digital media. Digital Forensic specialists work in the field as well as in the lab.\nEar print analysis is used as a means of forensic identification intended as an identification tool similar to fingerprinting. An earprint is a two-dimensional reproduction of the parts of the outer ear that have touched a specific surface (most commonly the helix, antihelix, tragus and antitragus).\nElection forensics is the use of statistics to determine if election results are normal or abnormal.\nForensic accounting is the study and interpretation of accounting evidence.\nForensic aerial photography is the study and interpretation of aerial photographic evidence.\nForensic anthropology is the application of physical anthropology in a legal setting, usually for the recovery and identification of skeletonized human remains.\nForensic archaeology is the application of a combination of archaeological techniques and forensic science, typically in law enforcement.\nForensic astronomy uses methods from astronomy to determine past celestial constellations for forensic purposes.\nForensic botany is the study of plant life in order to gain information regarding possible crimes.\nForensic chemistry is the study of detection and identification of illicit drugs, accelerants used in arson cases, explosive and gunshot residue.\nForensic dactyloscopy is the study of fingerprints.\nForensic document examination or questioned document examination answers questions about a disputed document using a variety of scientific processes and methods. Many examinations involve a comparison of the questioned document, or components of the document, with a set of known standards. The most common type of examination involves handwriting, whereby the examiner tries to address concerns about potential authorship.\nForensic DNA analysis takes advantage of the uniqueness of an individual's DNA to answer forensic questions such as paternity/maternity testing and placing a suspect at a crime scene, e.g. in a rape investigation.\nForensic engineering is the scientific examination and analysis of structures and products relating to their failure or cause of damage.\nForensic entomology deals with the examination of insects in, on and around human remains to assist in determination of time or location of death. It is also possible to determine if the body was moved after death using entomology.\nForensic geology deals with trace evidence in the form of soils, minerals and petroleum.\nForensic geomorphology is the study of the ground surface to look for potential location(s) of buried object(s).\nForensic geophysics is the application of geophysical techniques such as radar for detecting objects hidden underground or underwater.\nForensic intelligence process starts with the collection of data and ends with the integration of results within into the analysis of crimes under investigation.\nForensic Interviews are conducted using the science of professionally using expertise to conduct a variety of investigative interviews with victims, witnesses, suspects or other sources to determine the facts regarding suspicions, allegations or specific incidents in either public or private sector settings.\nForensic limnology is the analysis of evidence collected from crime scenes in or around fresh-water sources. Examination of biological organisms, in particular diatoms, can be useful in connecting suspects with victims.\nForensic linguistics deals with issues in the legal system that requires linguistic expertise.\nForensic meteorology is a site-specific analysis of past weather conditions for a point of loss.\nForensic microbiology is the study of the necrobiome.\nForensic nursing is the application of Nursing sciences to abusive crimes, like child abuse, or sexual abuse. Categorization of wounds and traumas, collection of bodily fluids and emotional support are some of the duties of forensic nurses.\nForensic odontology is the study of the uniqueness of dentition, better known as the study of teeth.\nForensic optometry is the study of glasses and other eyewear relating to crime scenes and criminal investigations.\nForensic pathology is a field in which the principles of medicine and pathology are applied to determine a cause of death or injury in the context of a legal inquiry.\nForensic podiatry is an application of the study of feet footprint or footwear and their traces to analyze scene of crime and to establish personal identity in forensic examinations.\nForensic psychiatry is a specialized branch of psychiatry as applied to and based on scientific criminology.\nForensic psychology is the study of the mind of an individual, using forensic methods. Usually it determines the circumstances behind a criminal's behavior.\nForensic seismology is the study of techniques to distinguish the seismic signals generated by underground nuclear explosions from those generated by earthquakes.\nForensic serology is the study of the body fluids.\nForensic social work is the specialist study of social work theories and their applications to a clinical, criminal justice or psychiatric setting. Practitioners of forensic social work connected with the criminal justice system are often termed Social Supervisors, whilst the remaining use the interchangeable titles forensic social worker, approved mental health professional or forensic practitioner and they conduct specialist assessments of risk, care planning and act as an officer of the court.\nForensic toxicology is the study of the effect of drugs and poisons on/in the human body.\nForensic video analysis is the scientific examination, comparison and evaluation of video in legal matters.\nMobile device forensics is the scientific examination and evaluation of evidence found in mobile phones, e.g. Call History and Deleted SMS, and includes SIM Card Forensics.\nTrace evidence analysis is the analysis and comparison of trace evidence including glass, paint, fibres and hair (e.g., using micro-spectrophotometry).\nWildlife forensic science applies a range of scientific disciplines to legal cases involving non-human biological evidence, to solve crimes such as poaching, animal abuse, and trade in endangered species.\n\n\n== Questionable techniques ==\nSome forensic techniques, believed to be scientifically sound at the time they were used, have turned out later to have much less scientific merit or none. Some such techniques include:\n\nComparative bullet-lead analysis was used by the FBI for over four decades, starting with the John F. Kennedy assassination in 1963.  The theory was that each batch of ammunition possessed a chemical makeup so distinct that a bullet could be traced back to a particular batch or even a specific box.  Internal studies and an outside study by the National Academy of Sciences found that the technique was unreliable due to improper interpretation, and the FBI abandoned the test in 2005.\nForensic dentistry has come under fire:  in at least three cases bite-mark evidence has been used to convict people of murder who were later freed by DNA evidence. A 1999 study by a member of the American Board of Forensic Odontology found a 63 percent rate of false identifications and is commonly referenced within online news stories and conspiracy websites. The study was based on an informal workshop during an ABFO meeting, which many members did not consider a valid scientific setting.\nBy the late 2000s, scientists were able to show that it is possible to fabricate DNA evidence, thus \"undermining the credibility of what has been considered the gold standard of proof in criminal cases\".\n\n\n== Litigation science ==\nLitigation science describes analysis or data developed or produced expressly for use in a trial versus those produced in the course of independent research. This distinction was made by the U.S. 9th Circuit Court of Appeals when evaluating the admissibility of experts.This uses demonstrative evidence, which is evidence created in preparation of trial by attorneys or paralegals.\n\n\n== Demographics ==\nIn the United States there are over 17,200 forensic science technicians, as of 2019.\n\n\n== Media impact ==\nReal-life crime scene investigators and forensic scientists warn that popular television shows do not give a realistic picture of the work, often wildly distorting its nature, and exaggerating the ease, speed, effectiveness, drama, glamour, influence and comfort level of their jobs—which they describe as far more mundane, tedious and boring.Some claim these modern TV shows have changed individuals' expectations of forensic science, sometimes unrealistically—an influence termed the \"CSI effect\".Further, research has suggested that public misperceptions about criminal forensics can create, in the mind of a juror, unrealistic expectations of forensic evidence—which they expect to see before convicting—implicitly biasing the juror towards the defendant. Citing the \"CSI Effect,\" at least one researcher has suggested screening jurors for their level of influence from such TV programs\n\n\n== Controversies ==\nQuestions about certain areas of forensic science, such as fingerprint evidence and the assumptions behind these disciplines have been brought to light in some publications including the New York Post. The article stated that \"No one has proved even the basic assumption: That everyone's fingerprint is unique.\" The article also stated that \"Now such assumptions are being questioned—and with it may come a radical change in how forensic science is used by police departments and prosecutors.\" Law professor Jessica Gabel said on NOVA that forensic science \"lacks the rigors, the standards, the quality controls and procedures that we find, usually, in science.\"In the US, on 25 June 2009, the Supreme Court issued a 5-to-4 decision in Melendez-Diaz v. Massachusetts stating that crime laboratory reports may not be used against criminal defendants at trial unless the analysts responsible for creating them give testimony and subject themselves to cross-examination.  The Supreme Court cited the National Academies of Sciences report Strengthening Forensic Science in the United States in their decision. Writing for the majority, Justice Antonin Scalia referred to the National Research Council report in his assertion that \"Forensic evidence is not uniquely immune from the risk of manipulation.\"\nIn the US, another area of forensic science that has come under question in recent years is the lack of laws requiring the accreditation of forensic labs.  Some states require accreditation, but some states do not.  Because of this, many labs have been caught performing very poor work resulting in false convictions or acquittals.  For example, it was discovered after an audit of the Houston Police Department in 2002 that the lab had fabricated evidence which led George Rodriguez being convicted of raping a fourteen-year-old girl.  The former director of the lab, when asked, said that the total number of cases that could have been contaminated by improper work could be in the range of 5,000 to 10,000.  This could have been avoided if the lab had been accredited by organizations such as ASCLD/Lab, which require crime labs to undergo rigorous assessments to show that they are able to perform multiple tests accurately.  Once they become accredited, they are periodically re-evaluated to ensure that the lab is still functioning at its best.  Periodic evaluations of a lab's performance by an independent organization will help to prevent scandals from occurring in forensic science laboratories.\nAlthough forensic science has greatly enhanced the investigator's ability to solve crimes, it has limitations and must be scrutinized in and out of the courtroom to avoid the occurrence of wrongful convictions. The Innocence Project data base of DNA exonerations shows that many wrongful convictions contained forensic science errors. As indicated by the National Academy of Sciences report cited Strengthening Forensic Sciences in the United States, part of the problem is that many traditional forensic sciences have never been empirically validated; and part of the problem is that all examiners are subject to forensic confirmation biases and should be shielded from contextual information not relevant to the judgment they make.\nMany studies have discovered a difference in rape-related injuries reporting based on race, with white victims reporting a higher frequency of injuries than black victims. However, since current forensic examination techniques may not be sensitive to all injuries across a range of skin colors, more research needs to be conducted to understand if this trend is due to skin confounding healthcare providers when examining injuries or if darker skin extends a protective element. In clinical practice, for patients with darker skin, one study recommends that attention must be paid to the thighs, labia majora, posterior fourchette and fossa navicularis, so that no rape-related injuries are missed upon close examination.\n\n\n== Forensic science and humanitarian work ==\nThe International Committee of the Red Cross (ICRC) uses forensic science for humanitarian purposes to clarify the fate of missing persons after armed conflict, disasters or migration, and is one of the services related to Restoring Family Links and Missing Persons. Knowing what has happened to a missing relative can often make it easier to proceed with the grieving process and move on with life for families of missing persons.\nForensic science is used by various other organizations to clarify the fate and whereabouts of persons who have gone missing. Examples include the NGO Argentine Forensic Anthropology Team, working to clarify the fate of people who disappeared during the period of the 1976–1983 military dictatorship. The International Commission on Missing Persons (ICMP) uses forensic science to find missing persons, for example after the conflicts in the Balkans.Recognising the role of forensic science for humanitarian purposes, as well as the importance of forensic investigations in fulfilling the state's responsibilities to investigate human rights violations, a group of experts in the late-1980s devised a UN Manual on the Prevention and Investigation of Extra-Legal, Arbitrary and Summary Executions, which became known as the Minnesota Protocol. This document was revised and re-published by the Office of the High Commissioner for Human Rights in 2016.\n\n\n== See also ==\n\n\n== Bibliography ==\n\n\n== References ==\n\n\n== External links ==\nForensic Science at Curlie\nForensic educational resources", "chinese_title": "", "chinese": ""}