{"topic": "Informatics", "english_title": "Informatics", "english": "Informatics is the study of computational systems, especially those for data storage and retrieval. According to ACM Europe and Informatics Europe, informatics is synonymous with computer science and computing as a profession, in which the central notion is transformation of information. In other countries, the term \"informatics\" is used with a different meaning in the context of library science.\n\n\n== Different meanings ==\n\nIn some countries, depending on local interpretations, the term \"informatics\" is used synonymously to mean information systems, information science, information theory, information engineering, information technology, information processing, or other theoretical or practical fields. In Germany, the term informatics almost exactly corresponds to modern computer science. Accordingly, universities in continental Europe usually translate \"informatics\" as computer science, or sometimes information and computer science, although technical universities may translate it as computer science & engineering.In the United States, however, the term informatics is mostly used in context of data science, library science or its applications in healthcare (biomedical informatics), where it first appeared in the US.\nThe University of Washington uses this term to refer to social computing. In some countries, this term is associated with natural computation and neural computation.The Government of Canada uses the term to refer to operational units offering network and computer services to the various departments.\n\n\n== Etymology ==\n\nIn 1956, the German informatician Karl Steinbuch coined the word Informatik, publishing a paper called Informatik: Automatische Informationsverarbeitung (\"Informatics: Automatic Information Processing\"). The morphology—informat-ion + -ics—uses \"the accepted form for names of sciences, as conics, mathematics, linguistics, optics, or matters of practice, as economics, politics, tactics\", and so, linguistically, the meaning extends easily to encompass both the science of information and the practice of information processing. The German word Informatik is usually translated to English as computer science by universities or computer science & engineering by technical universities (German equivalents for institutes of technology). Depending on the context, informatics is also translated into computing, scientific computing or information and computer technology. The French term informatique was coined in 1962 by Philippe Dreyfus. In the same month was also proposed independently by Walter F. Bauer (1924–2015) and associates who co-founded software company Informatics Inc. The term for the new discipline quickly spread throughout Europe, but it did not catch on in the United States. Over the years, many different definitions of informatics have been developed, most of them claim that the essence of informatics is one of these concepts: information processing, algorithms, computation, information, algorithmic processes, computational processes or computational systems.\n\nThe earliest uses of the term informatics in the United States was during the 1950s with the beginning of computer use in healthcare.  Early practitioners interested in the field soon learned that there were no formal education programs, and none emerged until the late 1960s. Unfortunately, they introduced the term informatics only in the context of archival science, which is only a small part of informatics. Professional development, therefore, played a significant role in the development of health informatics. According to Imhoff et al., 2001, healthcare informatics is not only the application of computer technology to problems in healthcare, but covers all aspects of generation, handling, communication, storage, retrieval, management, analysis, discovery, and synthesis of data information and knowledge in the entire scope of healthcare. Furthermore, they stated that the primary goal of health informatics can be distinguished as follows: To provide solutions for problems related to data, information, and knowledge processing. To study general principles of processing data information and knowledge in medicine and healthcare. The term health informatics quickly spread throughout the United States in various forms such as nursing informatics, public health informatics or medical informatics. Analogous terms were later introduced for use of computers in various fields, such as business informatics, forest informatics, legal informatics etc. Unfortunately, these fields still mainly use term informatics in context of library science.\n\n\n== Informatics as library science ==\n\nIn the fields of geoinformatics or irrigation informatics, the term -informatics usually mean information science, in context related to library science. This was the first meaning of informatics introduced in Russia in 1966 by A.I. Mikhailov, R.S. Gilyarevskii, and A.I. Chernyi, which referred to a scientific discipline that studies the structure and properties of scientific information. In this context, the term was also used by the International Neuroinformatics Coordinating Facility. Some scientists use this term, however, to refer to the science of information processing, not data management.In the English-speaking world, the term informatics was first widely used in the compound medical informatics, taken to include \"the cognitive, information processing, and communication tasks of medical practice, education, and research, including information science and the technology to support these tasks\". Many such compounds are now in use; they can be viewed as different areas of \"applied informatics\".\n\n\n== Informatics as information processing science ==\n\nIn the early 1990s, K.K. Kolin proposed an interpretation of informatics as a fundamental science that studies information processes in nature, society, and technical systems.A broad interpretation of informatics, as \"the study of the structure, algorithms, behaviour, and interactions of natural and artificial computational systems,\" was introduced by the University of Edinburgh in 1994. This has led to the merger of the institutes of computer science, artificial intelligence and cognitive science into a single School of Informatics in 2002.More than a dozen nearby universities joined Scottish Informatics and Computer Science Alliance. Some non-European universities have also adopted this definition (e.g. Kyoto University School of Informatics).\nIn 2003, Yingxu Wang popularized term cognitive informatics, described as follows:\nSupplementary to matter and energy, information is the third essence for modeling the world. Cognitive informatics focuses on internal information processing mechanisms and the natural intelligence of the brain.\nInformatics as a fundamental science of information in natural and artifficial systems was proposed again in Russia in 2006.In 2007, the influential book Decoding the Universe was published.\nFormer president of Association for Computing Machinery, Peter Denning wrote in 2007:\nThe old definition of computer science - the study of phenomena surrounding computers - is now obsolete. Computing is the study of natural and artificial information processes.\nThe 2008 Research Assessment Exercise, of the UK Funding Councils, includes a new, Computer Science and Informatics, unit of assessment (UoA), whose scope is described as follows:\n\nThe UoA includes the study of methods for acquiring, storing, processing, communicating and reasoning about information, and the role of interactivity in natural and artificial systems, through the implementation, organisation and use of computer hardware, software and other resources. The subjects are characterised by the rigorous application of analysis, experimentation and design.In 2008, the construction of the Informatics Forum was completed. In 2018, the MIT Schwarzman College of Computing was established. Its construction is planned to be completed in 2021.\n\n\n== Controversial fields ==\nevolutionary informatics - a new field that comes from the concept of an intelligent design. According to Evolutionary Informatics Lab, evolutionary informatics studies how evolving systems incorporate, transform, and export information. In 2017, the influential book \"Introduction To Evolutionary Informatics\" was published.\n\n\n== Informatics as computer science ==\n\n\n=== Related topics ===\nComputer scientists study computational processes and systems. Computing Research Repository (CoRR) classification distinguishes the following main topics in computer science (alphabetic order):\n\n\n=== Journals and conferences ===\n\n\n== Community ==\n\n\n=== Related organisations ===\n\n\n=== Academic schools and departments ===\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==", "chinese_title": "", "chinese": ""}