{"topic": "Overconsumption", "english_title": "Overconsumption", "english": "Overconsumption describes a situation where the use of a natural resource has exceeded the sustainable capacity of a system. A prolonged pattern of overconsumption leads to the eventual loss of resource bases. The term overconsumption is quite controversial in use, and does not necessarily have a single unifying definition. Overconsumption is driven by a number of factors of the current global economy, including forces like consumerism, planned obsolescence and other unsustainable business models and can be contrasted with sustainable consumption. \nDefining what counts as \"overconsumption\" is challenging because defining a sustainable capacity of the system requires accounting for many variables. Total capacity of a system occurs at both the regional and worldwide levels, which means that certain regions may have higher consumption levels of certain resources then others due to greater resources without overconsuming a resource.  A long term pattern of overconsumption in any given region or ecological system can cause a reduction in natural resources that often results in environmental degradation.\nThe discussion of overconsumption often parallels that of population size and growth, and human development: more people demanding higher qualities of living, currently requires greater extraction of resources, which causes subsequent environmental degradation such as climate change and biodiversity loss. Currently, the inhabitants of high wealth, \"developed\" nations consume resources at a rate almost 32 times greater than those of the developing world, who make up the majority of the human population (7.4 billion people). However, the developing world is a growing market for consumption. These nations are quickly gaining more purchasing power and it is expected that the Global South, which includes cities in Asia, America and Africa, will account for 56% of consumption growth by 2030.  This means that if current trends continue relative consumption rates will shift more into these developing countries, whereas developed countries would start to plateau. Sustainable Development Goal 12 \"responsible consumption and production\" is the main international policy tool with goals to abate the impact of overconsumption.\n\n\n== Causes ==\n\n\n=== Economic growth ===\n\nEconomic growth is sometimes seen as a driver for overconsumption. Economic growth can be seen as a catalyst of overconsumption due to it requiring greater resource input to sustain the growth. China is an example where this phenomenon has been observed readily. China’s GDP increased massively from 1978, and the energy consumption has increased by 6-fold. By 1983, China’s consumption surpassed the biocapacity of their natural resources, leading to overconsumption. In the last 30-40 years, China has seen significant increases in its pollution, land degradation, and non-renewable resource depletion, which aligns with its considerable economic growth. It is unknown if other rapidly developing nations will see similar trends in resource overconsumption. \nThe Worldwatch Institute said China and India, with their booming economies, along with the United States, are the three planetary forces that are shaping the global biosphere. The State of the World 2005 report said the two countries' high economic growth exposed the reality of severe pollution. The report states that\n\nThe world's ecological capacity is simply insufficient to satisfy the ambitions of China, India, Japan, Europe, and the United States as well as the aspirations of the rest of the world in a sustainable way.\nIn 2019, a warning on the climate crisis signed by 11,000 scientists from over 150 nations said economic growth is the driving force behind the \"excessive extraction of materials and overexploitation of ecosystems\" and that this \"must be quickly curtailed to maintain long-term sustainability of the biosphere.\" Also in 2019, the Global Assessment Report on Biodiversity and Ecosystem Services published by the United Nations' Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services, which found that up to one million species of plants and animals are at risk of extinction from human activity, asserted that\n\nA key element of more sustainable future policies is the evolution of global financial and economic systems to build a global sustainable economy, steering away from the current limited paradigm of economic growth.\n\n\n=== Consumerism ===\nThere is a spectrum of goods and services that the world population constantly consume. These range from food and beverage, clothing and footwear, housing, energy, technology, transportation, education, health and personal care, financial services and other utilities. When the resources required to produce these goods and services is depleted beyond a reasonable level, it can be considered to be overconsumption. Because developing nations are rising quickly into the consumer class, the trends happening in these nations are of special interest. According to the World Bank, the highest shares of consumption, regardless of income lie in food, beverage, clothing, and footwear. As of 2015, the top five consumer markets in the world included the United States, Japan, Germany, China, and France.Planned and perceived obsolescence is an important factor that explains why some overconsumption of consumer products exist.  This factor of production revolves around the designing products with the intent to be discarded after a short period of time. Perceived obsolescence is prevalent within the fashion and technology industries. Through this technique, products are made obsolete and replaced on a semi-regular basis. Frequent new launches of technology or fashion lines can be seen as a form of marketing induced perceived obsolescence. Products designed to break after a certain period of time or use would be considered to be planned obsolescence.\n\n\n== Effects ==\n\nA fundamental effect of overconsumption is a reduction in the planet's carrying capacity. Excessive unsustainable consumption will exceed the long-term carrying capacity of its environment (ecological overshoot) and subsequent resource depletion, environmental degradation and reduced ecosystem health. In 2020 multinational team of scientists published a study, saying that overconsumption is the biggest threat to sustainability. According to the study, a drastic lifestyle change is necessary for solving the ecological crisis. According to one of the authors Julia Steinberger: “To protect ourselves from the worsening climate crisis, we must reduce inequality and challenge the notion that riches, and those who possess them, are inherently good.” The research was published on the site of the World Economic Forum. The leader of the forum professor Klaus Schwab, calls to a \"great reset of capitalism\".According to a 2020 study in which both population growth and deforestation were used as proxies for total resource consumption, if consumption continues at the current rate for the next 20–40 years, it can trigger a full or almost full extinction of humanity. To avoid it humanity should pass from a civilization dominated by the economy to a \"cultural society\" that \"privileges the interest of the ecosystem above the individual interest of its components, but eventually in accordance with the overall communal interest\"\n\nThe scale of modern life's overconsumption has enabled an overclass to exist, displaying affluenza and obesity. However once again both of these claims are controversial with the latter being correlated to other factors more so than over-consumption. Within the topic of overconsumption, many other ideas should be considered to find the true cause of it. Some important events that coincide are poverty, population, and the development of an area. Overconsumption can also lead to a decline in the economy and financial instability.\n \nIn the long term, these effects can lead to increased conflict over dwindling resources and in the worst case a Malthusian catastrophe. Lester Brown of the Earth Policy Institute, has said: \"It would take 1.5 Earths to sustain our present level of consumption.  Environmentally, the world is in an overshoot mode.\"As of 2012, the United States alone was using 30% of the world's resources and if everyone were to consume at that rate, we would need 3-5 planets to sustain this type of living. Resources are quickly becoming depleted, with about ⅓ already gone. With new consumer markets rising in the developing countries which account for a much higher percentage of the world's population, this number can only rise. According to Sierra Club’s Dave Tilford, \"With less than 5 percent of world population, the U.S. uses one-third of the world’s paper, a quarter of the world’s oil, 23 percent of the coal, 27 percent of the aluminum, and 19 percent of the copper.\" According to BBC, a World Bank study has found that \"Americans produce 16.5 tonnes of carbon dioxide per capita every year. By comparison, only 0.1 tonnes of the greenhouse gas is generated in Ethiopia per inhabitant.\"A 2021 study published in Frontiers in Conservation Science posits that aggregate consumption growth will continue into the near future and perhaps beyond, largely due to increasing affluence and population growth. The authors argue that \"there is no way—ethically or otherwise (barring extreme and unprecedented increases in human mortality)—to avoid rising human numbers and the accompanying overconsumption\", although they do say that the negative impacts of overconsumption can perhaps be diminished by implementing human rights policies to lower fertility rates and decelerate current consumption patterns.\n\n\n=== Effects on health ===\nA report from the Lancet commission says the same. The experts write: \"Until now, undernutrition and obesity have been seen as polar opposites of either too few or too many calories,\" \"In reality, they are both driven by the same unhealthy, inequitable food systems, underpinned by the same political economy that is single-focused on economic growth, and ignores the negative health and equity outcomes. Climate change has the same story of profits and power,\". Obesity was a medical problem for people who overconsumed food and worked too little already in ancient Rome, and its impact slowly grew through history. As to 2012, mortality from Obesity was 3 times larger than from hunger, reaching 2.8 million people per year by 2017Overuse of artificial energy, for example, in cars, hurts health and the planet. Promoting active living and reducing sedentary lifestyle, for example, by cycling, reduces greenhouse gas emissions and improve health\n\n\n== Footprint ==\n\nThe idea of overconsumption is also strongly tied to the idea of an ecological footprint.  The term \"ecological footprint\" refers to the \"resource accounting framework for measuring human demand on the biosphere.\"  Currently, China, for instance, has a per person ecological footprint roughly half the size of the USA, yet has a population that is more than four times the size of the USA.  It is estimated that if China developed to the level of the United States that world consumption rates would roughly double.Humans, their prevailing growth of demands for livestock and other domestic animals, has added overshoot through domestic animal breeding, keeping, and consumption, especially with the environmentally destructive industrial livestock production.Globalization and modernization has brought Western consumer cultures to countries like China and India, including meat-intensive diets which are supplanting traditional plant-based diets. More than 200 billion animals are consumed by a global population of over 7 billion annually. A 2018 study published in Science postulates that meat consumption is set to increase as the result of human population growth and rising affluence, which will increase greenhouse gas emissions and further reduce biodiversity. Meat consumption needs to be reduced in order to make agriculture sustainable by up to 90% according to a 2018 study published in Nature.\n\n\n== Counteractions ==\nThe most obvious solution to the issue of overconsumption is to simply slow the rate at which materials are becoming depleted. From a capitalistic point of view, less consumption has negative effects on economies and so instead, countries must look to curb consumption rates but also allow for new industries, such as renewable energy and recycling technologies, to flourish and deflect some of the economic burdens. Some movements think that a reduction in consumption in some cases can benefit the economy and society. They think that a fundamental shift in the global economy may be necessary to account for the current change that is taking place or that will need to take place. Movements and lifestyle choices related to stopping overconsumption include: anti-consumerism, freeganism, green economics, ecological economics, degrowth, frugality, downshifting, simple living, minimalism, and thrifting.\nMany consider the final target of the movements as arriving to a steady-state economy in which the rate of consumption is optimal for health and environment.Recent grassroots movements have been coming up with creative ways to decrease the number of goods we consume. The Freecycle Network is a network of people in one's community that are willing to trade goods for other goods or services. It is a new take on thrifting while still being beneficial to both parties.Other researchers and movements such as the Zeitgeist Movement suggest a new socioeconomic model which, through a structural increase of efficiency, collaboration and locality in production as well as effective sharing, increased modularity, sustainability and optimal design of products, are expected to reduce resource-consumption.\nSolutions offered include consumers using market forces to influence businesses towards more sustainable manufacturing and products.Another way to reduce consumption is to slow population growth by improving family planning services worldwide. In developing countries, more than 200 million women do not have adequate access. Women's empowerment in these countries will also result in smaller families.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nHickel, Jason (2020). Less is More: How Degrowth Will Save the World. Penguin Random House. ISBN 9781785152498.\nIvanova, Diana; Stadler, Konstantin; Steen-Olsen, Kjartan; Wood, Richard; Vita, Gibran; Tukker, Arnold; Hertwich, Edgar G. (18 December 2015). \"Environmental Impact Assessment of Household Consumption\". Journal of Industrial Ecology. 20 (3): 526–536. doi:10.1111/jiec.12371.\n\n\n== External links ==\nFifty Possible Ways to Challenge Over-Commercialism by Albert J. Fritsch, SJ, PhD\nWhy people hate fat Americans by Daniel Ben-Ami\nOptimum Population Trust\nUN Division for Sustainable Development, Agenda 21, Chapter 4 – \"Changing Consumption Patterns\"\nFootprint For Nations\nThe Story of Stuff (video)\nEnergy statistics-Oil Consumption by Country\nWorld Energy Use Graph\nGlobal GDP by Country\n[1]", "chinese_title": "", "chinese": ""}