{"topic": "Creative", "english_title": "", "english": "", "chinese_title": "creativity ", "chinese": "Creativity, or creativity, meditation is a process of human mental phenomena based on conceptual tools and spiritual techniques and eventually producing or developing as creativity, inspiration, and intuitive processes.\nFrom a scientific point of view, the product of creative ideas (sometimes called discrete thinking) is often considered to be originally created and picked. On the other hand, in daily life, single is a new thing that creates new things every day is already a creative idea, creative thinking and inertial thinking a difference in different points in creative thinking without a fixed routine or specific method standard, a bit like Buddhism Epiphany, when a person is full of remembering or solving something or in a uncomfortable environment, this is the best time to inspire the creation.\n\n\n== Creative ==\nWhat is creativity? Creative is to transcend the boundaries, jump from existing frameworks, redefine the relationship between things and things. That is to find out the relevance between things, or the opposite characteristics, breaking the existing elements, disassemble, re-deleted, re-combined to present new features, functions or intentions.\n\n\n== Created extension ==\nCreating scalable into innovative manufacturing, manufacturing more technical and more practical products based on innovation, creating is not myth, is an upgrade of human productivity, one of the important driving power of human progress, if God The creation of people is to be more advanced, and there is no technique that has not been controlled by humans. The generation of this product and new vocabulary is seen as a range of human patented technology to the product is the creation of human services.\n\n\n== Created range ==\n\n\n=== Creation ===\nIn terms of artistic creation, some people use a continuous spectrum to express their creativity, from the smallest \"interpretation\" to complete \"innovation\".\nFor artistic sports and genre creators following the status, its creation is often streamdabed to \"reinterpret\" for existing items, which makes the original art worker struggled to \"innovative\" benchmarks.\nHowever, even if there are art workers, we often hope that they have created for some people (eg, dancers, actors, orchestra), and hope they will reinterpret existing works; but on the other hand, for other art work For example,: authors, pictures, composers), we tend to see them more creation.\n\n\n=== Thinking ===\nSome people also link creative and scientific inspiration, which started at least from ancient Greece's Aquith. The trend psychology sometimes linked it with the foregoing activities or right brain activity or even horizontal thinking.\n\n\n== Created direction ==\n\n\n=== \"Deductive\" to complete \"innovation\" ===\nDeduct, also called re-interpretation, old things refurbished, and create new things through certain rules through a certain rule. For example: writing, painting ...\n\nInnovation, there is no born, and new things are created on the basis of discovery. For example: inventions ...\n\n\n=== Logic and intuition ===\nLogic vertical thinking\n\nIntuitive horizontal thinking\n\n\n== Multi-angle think ==\nAlso called multi-angle thinking\n\n\n== Created type ==\nIn \"Created Behavior\" book, Arthur Castler (1964 and a variety of imprints)\nEnumeral 3 types of creative individuals, \"artists\", \"sage\" and \"kids\". Paul birch and cloth\nRyan Cleig (\"Coli Creative Creative Course\", 2002) has already called 3 types of creative knots\n\"Aaahhhh\", \"Aaha\", and \"haha\". Artists have established beautiful or challenge \"Aaahhh\". Rattail\nEstablish ideas or solutions (\"ah\") and joking people cause humor (\"haha\"). In these three\nThe beliefs in the integrated belief holds all the necessary three elements in business and can identify their total \"Really Creative\" company.\nA person can also classify creativity through its place.\n\n\n== Creativity evaluation ==\nCreativity can be evaluated at a few-dimensional:\n\nLeadership Leaders: Creative ideologists can establish new and hopeful theories of other people to track to track; essentially start moving, ideology or trends.\nSensitivity to the problem: A new field that can identify issues for challenges and develop an idea is a creative mark.\nOriginality: Creative ideas can find ideas or solutions that have no other people can get. The patent is only announced on the initial idea.\nMachinery: Anemissile solution can solve problems in a neat and amazing mode or see a new vision when watching problems.\nUnconventional: Creative thought home can see the distant connection between the ideas. When the word linkage is conducted, the people in the field of very creative literature (such as poets) make high proportion of unique responses.\n\n\n== Meaning creativity ==\n\n\n=== Creation number ===\nMany people have tried to refer to the \"IQ\" (IQ) to define \"Creation\".\nCreative quotient (Creativity Quotient), referred to as \"Creative Commercial\" or \"Creator\" (CQ); it is a person's ability to think about the ability, open capacity, innovation ability, and creativity .\nCore concept of Creeders: OIC, Open (Open) + Innovation + Creatment. OIC includes three chains:\n\nCore Problem Chain of OIC: Open Solution (OPS) + Innovative Solution (IPS) + Creative Solution (CPS).\nOIC's Core Thinking Chain: All Brain Thinking (WBT) + Open Thinking (OT) + Innovative Thinking (IT) + Create Thinking (CT).\nOIC's Core Capability Chain: Open Capacity (OA) + Innovation Ability (IA) + Creative Ability (CA). Development Ways: Brain Nerve Chain Construction + Concept Chain Regeneration + Thinking Chain Inclusion + Capacity Chain. Senior is a deepening and externalization of people's IQ, which is a standard for measuring the degree of application transformation in discovering unknown issues and solving practical problems. It is a weight that measures a person's realistic driving ability and success.\nHowever, these recommendations are not successful, because these metrics are all distinctive to the testers, and to form a neutral and standardized assessment criteria. It is actually difficult.\n\n\n== Reference ==\n\n\n=== Quote ===\n\n\n=== Source ===\nPublications Articles Rushton, J.P. Creativity, Intelligence, and PsyChoticism. Personality and Individual Difference. 1990, 11: 1291-1298. The creative act by marcel duchamp. (1957)\n'Amazing \"AHA!\" Puzzles' by lloyd king (Page Archive Backup, Save Internet Archive)\n\n\n== See ==\nart\nCreative thinking\ndesign\nMultiple intelligence theory\nEmotional business\nIQ "}