{"topic": "Firefighting", "english_title": "Firefighting", "english": "Firefighting is the act of attempting to prevent the spread of and extinguish significant unwanted fires in buildings, vehicles, and woodlands. A firefighter suppresses fires to protect lives, property and the environment.Firefighters typically undergo a high degree of technical training. This involves structural firefighting and wildland firefighting. Specialized training includes aircraft firefighting, shipboard firefighting, aerial firefighting, maritime firefighting, and proximity firefighting.\nOne of the major hazards associated with firefighting operations is the toxic environment created by combustible materials. The four major risks are smoke, oxygen deficiency, elevated temperatures, and poisonous atmospheres. Additional hazards include falls and structural collapse that can exacerbate the problems encountered in a toxic environment. To combat some of these risks, firefighters carry self-contained breathing apparatus.\nThe first step in a firefighting operation is reconnaissance to search for the origin of the fire and to identify the specific risks.\nFires can be extinguished by water, fuel or oxidant removal, or chemical flame inhibition; though, because fires are classified depending on the elements involved, such as grease, paper, electrical, etcetera, a specific type of fire extinguisher may be required. The classification is based on the type of fires that the extinguisher is more suitable for. In the United States, the types of fire are described by the National Fire Protection Association.\n\n\n== History ==\n\nThe earliest known firefighters were in the city of Rome. In 60 A.D., emperor Nero established a Corps of Vigils (Vigiles) to protect Rome after a disastrous fire. It consisted of 7,000 people equipped with buckets and axes who fought fires and served as police.\n\n\n=== Historic tactics and tools ===\nIn the 3rd century B.C., an Alexandrian Greek named Ctesibius made a double force pump called a siphona. As water rose in the chamber, it compressed the air inside, which forced the water to eject in a steady stream through a pipe and nozzle.In the 16th century, syringes were also used as firefighting tools, the larger ones being mounted on wheels. Another traditional firefighting method that survived was the bucket brigade, involving two lines of people formed between the water source and the fire. Typically, men in one of the lines would pass along the full buckets of water toward the fire while in the other line women and children would pass back the empty buckets to be refilled.In the 17th century the first \"fire engines\" were made, notably in Amsterdam. In 1721, the English inventor Richard Newsham made a popular fire engine that was essentially a rectangular box on wheels filled using a bucket brigade to provide a reservoir while hand-powered pumps supplied sufficient water pressure to douse fires at a distance.\n\n\n=== Ancient Rome ===\nAncient Rome did not have municipal firefighters. Instead, private individuals relied on their slaves or supporters to take action. They would not only form bucket brigades or attempt to smother smaller fires, but would also demolish or raze nearby buildings to slow the spread of the fire. However, there is no mention of fires being extinguished, rather they were contained and burned themselves out. Ancient Rome did not have an organized firefighting force until the Vigiles were formed during the reign of Augustus.The first ever Roman fire brigade was created by Marcus Licinius Crassus. Fires were almost a daily occurrence in Rome, and Crassus took advantage of the fact that Rome had no fire department, by creating his own brigade—500 men strong—which rushed to burning buildings at the first cry of alarm. Upon arriving at the scene, however, the firefighters did nothing while Crassus offered to buy the burning building from the distressed property owner, at a miserable price. If the owner agreed to sell the property, his men would put out the fire; if the owner refused, then they would simply let the structure burn to the ground. After buying many properties this way, he rebuilt them, and often leased the properties to their original owners or new tenants.\n\n\n=== United Kingdom ===\nPrior to the Great Fire of London in 1666, some parishes in the UK had begun to organize rudimentary firefighting crews. After the Great Fire, Nicholas Barbon introduced the first fire insurance. In order to reduce insurance costs, Barbon also formed his own fire brigade, and other companies followed suit.\nBy the start of the 1800s, insured buildings were identified with a badge or mark indicating that they were eligible for a company's firefighting services. Buildings not insured with a particular company were left by its firefighters to burn, unless they happened to be adjacent to an insured building, in which case it was often in the company's interest to prevent the fire from spreading. In 1833 fire insurance companies in London merged to form The London Fire Company Establishment.\nSteam-powered apparatuses were first introduced in the 1850s, allowing a greater quantity of water to be directed onto a fire; in the early 1930s they were superseded by versions powered by an internal combustion engine.\nIn World War II the Auxiliary Fire Service, and later the National Fire Service, were established to supplement local fire services. Before 1938, there was no countrywide standard for firefighting terms, procedures, ranks, or equipment (such as hose couplings). In the month of August in 1939 with war looking very possible the Fire Service's act of 1938 came into effect. This unified Great Britain's fire service and prepared them for the German war machine. During the London Blitz, 700 fire men and 20 fire women , as known during the time period died as a result of heavy bombing, 91 of these perished at the same time defending London. By the end of the London Blitz, 327 firefighters had lost their lives.\nFollowing the war, leaps and bounds came to the fire service striving into the modern era. This included every firefighter being trained with the Mark 4 proto set. And also reverting back too compressed cork helmets.\nFirefighting improved even more with the introduction of the Dennis fire appliances that remain iconic in the UK to this day.\nSadly, despite the introduction of more advanced firefighting strategies, tactics, and equipment to British firefighting following the blitz, there have been nearly 300 firefighters killed .\n\n\n=== United States ===\nIn January 1608, a fire destroyed many of the colonists' provisions and lodgings in Jamestown, Virginia. Boston, New York City, and Philadelphia were all plagued by fires, and volunteer fire brigades formed soon after such disasters.In 1736, Benjamin Franklin founded the Union Fire Company in Philadelphia, which became the standard for volunteer fire organizations. These firefighters had two critical tools: salvage bags and so-called bed keys. Salvage bags were used to quickly collect and save valuables, and bed keys were used to separate the wooden frame of a bed (often the most valuable item in a home at the time) into pieces for safe and rapid removal from the fire.The first American attempt at fire insurance failed after a large fire in Charlestown, Massachusetts in 1736. Later in 1740, Benjamin Franklin organized the Philadelphia Contributionship to provide fire insurance, which was more successful. The Contributionship adopted \"fire marks\" to easily identify insured buildings. Firefighting started to become formalized with rules for providing buckets, ladders, and hooks, and with the formation of volunteer companies. A chain of command was also established.\n\n\n== Firefighter duties ==\n\nA firefighter's goals are to save lives, protect property, and protect the environment. A fire can rapidly spread and endanger many lives, but with modern firefighting techniques, catastrophe can often be avoided. To prevent fires from starting, a firefighter's duties may include public education about fire safety and conducting fire inspections of locations to verify their adherence to local fire codes.\n\n\n=== Firefighter skills ===\n\nFirefighting requires skills in fire suppression, rescue, and hazardous materials mitigation. Firefighters must also have, or be able to acquire, knowledge of department organizations, operations, and procedures, and the district or city street system they will have to negotiate in order to perform their duties.\nThey must meet minimum physical fitness standards and learn various firefighting duties within a reasonable periodExamples are:\n\nBuilding construction\nFire dynamics\nFirefighting PPE\nFire extinguishers\nRopes and knots\nGround ladders\nForcible entry\nStructural search and rescue\nTactical ventilation\nFire hose operations and streams\nFire suppression\nOverhaul, property conservation, and scene preservation\nBuilding materials, structural collapse, and effects of fire suppression\nTechnical rescue support and vehicle extrication operations\nFoam fire fighting, liquid fires, and gas fires\nHazardous materials response\n\n\n=== Specialized skills ===\nSpecialized areas of operations may require subject-specific training.\n\nExamples are:\n\nFire apparatus driver/operator - trained to drive fire apparatus to and from fires and other emergencies, operate fire-apparatus pumps and aerial devices, and maintain apparatus.\nHazardous materials technician - certified to mitigate hazardous materials and CBRNE emergencies.\nRescue technician - certified to perform rescues such as high-angle rope, trench, structural collapse, confined space, vehicle and machinery, water, ice, and cave or mine rescues.\nAirport firefighter - trained in ARFF.\nWildland firefighter - trained to extinguish fires in outdoor vegetation, including the wildland/urban interface.\n\n\n=== Shift hours ===\nFull-time career firefighters typically follow a 24-hour shift schedule, although some fire departments work 8- or 12-hour shifts. Australian firefighters work a 10/14 shift, in which the day shift works ten hours and the night shift works 14 hours. Firefighting personnel are split up into alternating shifts. Usually, the 24-hour shifts are followed by two days off. The shift personnel arrive for roll call at a specified time, ready to complete a regular tour of duty. While on shift, the firefighter remains at the fire station unless relieved or assigned other duties.\n\n\n=== Fire wardens ===\n\nIn fire fighting, there are also people designated as fire wardens, also known as the chief officer. Their duties vary, some may ensure evacuation of that part of the building for which they are responsible; others may be responsible for fire control in a particular area, direct a crew in the suppression of forest fires, or function as fire patrolmen in a logging area.The chief officer is in charge of his firefighters during fires or emergencies, and he is expected to command and control the overall situation while effectively combating a fire or other emergency. Chief officers must be able to evaluate their firefighters, use sound judgement when deciding when it is time to withdraw firefighters from a fire, and react calmly in emergency situations. The chief officer must direct the activities of a fire department and supervise all firefighting activities. In addition, he must have extensive knowledge of the city, the location of streets, fire hydrants and fire alarm boxes, and the principal buildings. Also he must have knowledge of explosives, hazardous chemicals, and the combustion qualities of materials in buildings, homes, and industrial plants.In certain jurisdictions, civilians can get certified to be a Fire Warden, and some cities require certain types of buildings, such as high rises, to have a certain number of Fire Wardens. For example, the City of Houston, Texas, requires every tenant in a high-rise to have at least one Fire Warden for every 7500 sq. ft. occupied, and a minimum of two Fire Wardens per floor. In this example, their duties include investigating any fire alarms (see if there really is a fire and if so, its nature), ensuring the fire department is contacted, directing the evacuation of the facility, activating or delaying activation of fire suppression equipment such as halon and sprinklers (delayed in case of a false alarm), meeting the fire department and taking them to the location of the alarm or to the fire past any security or locked doors, and, if necessary, fighting the fire until the fire department arrives.\n\n\n== Hazards caused by fire ==\n\n\n=== During a fire ===\n\nOne of the major hazards associated with firefighting operations is the toxic environment created by combusting materials. The four major hazards are:\nSmoke, which is becoming increasingly dangerous due to the increased variety and amount of synthetic household materials\nOxygen deficient atmosphere (21% O2 is normal and 19.5% O2 is considered oxygen deficient)\nElevated temperatures\nToxic atmospheresTo deal with such hazards, firefighters carry a self-contained breathing apparatus (SCBA; an open-circuit positive pressure system) to prevent smoke inhalation. These are not oxygen tanks (oxygen as a powerful fire accelerant would represent a grave risk when combined with virtually anything combustible in the presence of fire) but use compressed air in a similar manner to SCUBA diving gear. A firefighter's SCBA usually hold 30 to 45 minutes of air, depending on the size of the tank and the rate of consumption during strenuous activities. While this gear helps to eliminate the risks, firefighters are still exposed to smoke, toxic dust, fumes and radiation that have contributed to firefighters being 14% more likely to develop cancer.\nObvious risks associated with the immense heat generated by a fire, even without direct contact with the flames (direct flame impingement), such as conductive heat and radiant heat, can cause serious burns even from great distances. There are a number of comparably serious heat-related risks, such as burns from hot gases (e.g., air), steam, and hot and/or toxic smoke. Prolonged, intense exertion in hot environments also increases firefighters' risk for health-related illnesses, such as rhabdomyolysis. Accordingly, firefighters are equipped with personal protective equipment (PPE) that includes fire-resistant clothing such as Nomex or polybenzimidazole fiber (PBI) and helmets that limit the transmission of heat towards the body. No PPE, however, can completely protect the user from the effects of all possible fire conditions.Heat can cause flammable liquid contained in tanks to explode violently, producing what is called a BLEVE (boiling liquid expanding vapor explosion). Some chemical products such as ammonium nitrate fertilizers can also explode, potentially causing physical trauma from blast or shrapnel injuries. Sufficient heat causes human flesh to burn as fuel, or the water within to boil, leading to potentially severe medical problems.\nFurthers risks include the occurrences of backdrafts. Backdrafts occur when there is a large amount of oxygen introduced to an oxygen-depleted fire.  If a fire is compartmentalized and most or all of the oxygen has been burned up, there is a high risk of backdraft if something such as a window or door is opened. Introducing oxygen to a low burning fire can be devastating as it will ignite all of the oxygen along the way. It can also be heard from miles away as it has a concussive blast that adds to the effect. Firefighters need to have extreme communication at all times on the fire ground as one broken window at the wrong time could seriously harm anyone operating on the building.\nDepending on the heat of the fire, burns can occur in a fraction of a second.\nAdditional risks of fire are the obscuring of vision due to\nsmoke, potentially causing a fall or disorientation; becoming trapped in a fire; and structural collapse.\"Three hours of fighting a fire stiffens arteries and impairs cardiac function in firefighters\" according to a study by Bo Fernhall, a professor in the department of kinesiology and community health in the College of Applied Health Sciences, and Gavin Horn, director of research at the Illinois Fire Service Institute. The conditions (observed in healthy male firefighters) are \"also apparent found in weightlifters and endurance athletes...\"\n\n\n=== During debris cleanup ===\n\nOnce extinguished, fire debris cleanup poses several safety and health risks for workers.Many hazardous substances are commonly found in fire debris. Silica can be found in concrete, roofing tiles, or it may be a naturally occurring element. Occupational exposures to silica dust can cause silicosis, lung cancer, pulmonary tuberculosis, airway diseases, and some additional non-respiratory diseases. Inhalation of asbestos can result in various diseases including asbestosis, lung cancer, and mesothelioma. Sources of metals exposure include burnt or melted electronics, cars, refrigerators, stoves, etc. Fire debris cleanup workers may be exposed to these metals or their combustion products in the air or on their skin. These metals may include beryllium, cadmium, chromium, cobalt, lead, manganese, nickel, and many more. Polyaromatic hydrocarbons (PAHs), some of which are carcinogenic, come from the incomplete combustion of organic materials and are often found as a result of structural and wildland fires.Safety hazards of fire cleanup include the risk of reignition of smoldering debris, electrocution from downed or exposed electrical lines or in instances where water has come into contact with electrical equipment. Structures that have been burned may be unstable and at risk of sudden collapse.Standard personal protective equipment for fire cleanup include hard hats, goggles or safety glasses, heavy work gloves, earplugs or other hearing protection, steel-toe boots, and fall protection devices. Hazard controls for electrical injury include assuming all power lines are energized until confirmation they are de-energized, and grounding power lines to guard against electrical feedback, and using appropriate personal protective equipment. Proper respiratory protection can protect against hazardous substances. Proper ventilation of an area is an engineering control that can be used to avoid or minimize exposure to hazardous substances. When ventilation is insufficient or dust cannot be avoided, personal protective equipment such as N95 respirators can be used.\n\n\n== Reconnaissance and \"reading\" the fire ==\nThe first step in a firefighting operation is reconnaissance to search for the origin of the fire (which may not be obvious for an indoor fire, especially if there are no witnesses), to identify any specific risks, and to detect possible casualties. An outdoor fire may not require reconnaissance, but a fire in a cellar or an underground car park with only a few centimeters of visibility may require long reconnaissance to identify the source of the fire.\nThe \"reading\" of a fire is the analysis by firefighters of indications of thermal events such as flashover, backdraft or smoke explosion. It is performed during reconnaissance and fire suppression maneuvers.\nThe main signs are:\n\nHot zones, which can be detected with a gloved hand, for example by touching a door before opening it;\nSoot on windows, which usually means that combustion is incomplete, and thus, a lack of air in the room;\nSmoke pulsing in and out around a door frame, as if the fire were breathing, which usually also means a lack of air to support combustion.Spraying water on the ceiling in short pulses of a diffused spray (e.g., a cone with an opening angle of 60°) can be undertaken to test the heat of smoke: If the temperature is moderate, the water falls down in drops with a sound like rain; if the temperature is high, the water vaporizes with a hiss—the sign of a potentially extremely dangerous impending flashover.\nIdeally, part of reconnaissance is consulting a plan for the building that provides information about structures, firefighter hazards, and in some cases the most appropriate strategies and tactics for fighting a fire in that context.\n\n\n== Science of extinguishment ==\n\nThere are four elements needed to start and sustain a fire and/or flame. These are a reducing agent (fuel), heat, an oxidizing agent (oxygen), and a chemical reaction. A fire can be extinguished by taking away any of the four components.The fuel is the substance being oxidized or burned in the combustion process. The most common fuels contain carbon along with combinations of hydrogen and oxygen. Heat is the energy component of a fire. When it comes into contact with a fuel, it provides the energy necessary for ignition, causes the continuous production and ignition of fuel vapors or gases so that the combustion reaction can continue, and causes the vaporization of solid and liquid fuels. The resulting self-sustained chemical chain reaction is complex and requires fuel, an oxidizer, and heat energy to come together in a very specific way. An oxidizing agent is a material or substance that will release gases, including oxygen, when the proper conditions exist. It is crucial to the sustainment of a flame or fire.\nUsing water is one common method to extinguish a fire. Water extinguishes a fire by cooling, which removes heat because of water’s ability to absorb massive amounts of heat as it converts to water vapor. Without heat, the fuel cannot keep the oxidizer from reducing the fuel in order to sustain the fire. Water also extinguishes a fire by smothering it. When water is heated to its boiling point, it converts to water vapor. When this conversion takes place, it dilutes the oxygen in the air above the fire, thus removing one of the elements that the fire requires to burn. This can also be done with foam.\nAnother way to extinguish a fire is fuel removal. This can be accomplished by stopping the flow of liquid or gaseous fuel, by removing solid fuel in the path of a fire, or by allowing the fire to burn until all the fuel is consumed, at which point the fire will self-extinguish.\nOne final extinguishing method is chemical flame inhibition. This can be accomplished by applying dry chemical or halogenated agents that interrupt the chemical chain reaction and stop flaming. This method is effective on gas and liquid fuel because they must have flame to burn.\nSound waves have been successfully used in a device fabricated by two George Mason University senior engineering students, Viet Tran and Seth Robertson, but the procedure is still awaiting a patent (2015).\n\n\n== Use of water ==\n\nOne common way to extinguish a fire is to spray it with water. The water has two roles: It vaporizes when it comes in contact with fire, and this vapor displaces the oxygen (the volume of water vapor is 1,700 times greater than liquid water, at 1,000 °F (538 °C) it expands over 4,000 times). This leaves the fire without enough of the combustive agent, and it dies out. The vaporization of water also absorbs heat; it thereby cools the smoke, air, walls, and objects that could act as further fuel, and thus prevents one of the means by which fires grow, which is by \"jumping\" to nearby heat/fuel sources to start new fires, which then combine. Water extinguishment is thus a combination of \"asphyxia\" (cutting off the oxygen supply) and cooling. The flame itself is suppressed by asphyxia, but the cooling is the most important element in mastering a fire in a closed area.\nWater may be accessed from a pressurized fire hydrant, pumped from water sources such as lakes or rivers, delivered by tanker truck, or dropped from water bombers, which are aircraft adapted as tankers for fighting forest fires. An armored vehicle (firefighting tank) may be used where access to the area is difficult.\n\n\n=== Open air fire ===\nFor outdoor fires, the seat of the fire is sprayed with a straight spray: the cooling effect immediately follows the \"asphyxia\" caused by vaporization and reduces the further amount of water required. A straight spray is used so the water arrives massively to the seat of the fire before it vaporizes. A strong spray may also have a mechanical effect; it can disperse the combustible product and thus prevent the fire from starting again. Spray is always aimed at a surface or an object. For this reason, the strategy is sometimes called a two-dimensional or 2D attack.\nAn outdoor fire is always fed with air, and the risk to people is limited as they can move away from it, except in the case of wildfires or bushfires where they risk being easily surrounded by the flames. It might, however, be necessary to protect specific objects like houses or gas tanks against infrared radiation, and thus to use a diffused spray between the fire and the object. Breathing apparatus is often required as there is still the risk of inhaling smoke or poisonous gases.\n\n\n=== Closed volume fire ===\n\nUntil the 1970s, fires were usually attacked while they declined, using the same strategy as for open air fires. Now fires are attacked in their development phase because firefighters arrive sooner at the site of a fire and because of changes in building construction. The increasing use of thermal insulation confines the heat, and modern materials, especially polymers, produce much more heat than do traditional materials like wood, plaster, stone, and bricks. Under these conditions, there is a greater risk of backdraft and flashover.\nDirectly spraying the seat of the fire in enclosed areas can have unfortunate consequences: the force of water pushes air in front of it, which supplies the fire with extra oxygen before the water. The most important issue is not combating the flames, but controlling the fire; for example, cooling the smoke so that it cannot spread and start fires further away, and endanger the lives of people, including the firefighters.\nWhen a fire spreads beyond the building of its origin and spreads throughout the neighborhood, it is called a “conflagration.” Today, a conflagration is a large fire that is beyond the capability of the fire service to contain.The volume of the fire must be cooled before its seat is attacked. This strategy, originally of Swedish origin (Mats Rosander & Krister Giselsson), was adapted by London Fire Officer Paul Grimwood following a decade of operational use in the busy West End of London between 1984 and 1994 and termed the three-dimensional or 3D attack.\nUse of a diffuse spray was first proposed by Chief Lloyd Layman of the Parkersburg Fire Department, at the 1950 Fire Department Instructors Conference (FDIC) held in Memphis. Using Grimwood's modified 3D attack strategy, the ceiling is first sprayed with short pulses of a diffuse spray. This \ncools the smoke which is then less likely to start a fire when it moves away. As gas cools it becomes denser (Charles's law); thus, it also reduces the mobility of the smoke and avoids a \"backfire\" of water vapor. Also, the diffuse spray creates an inert \"water vapor sky\", which prevents \"roll-over\" (rolls of flames on the ceiling created by hot burning gases).\nOnly short pulses of water need to be sprayed, otherwise the spraying modifies the equilibrium, and the gases mix instead of remaining stratified: the hot gases (initially at the ceiling) move around the room, and the temperature rises at the ground, which is dangerous for firefighters.\nAn alternative is to cool all the atmosphere by spraying the whole atmosphere as if drawing letters in the air (\"penciling\").\nModern methods for extinguishing an urban fire dictate the use of a massive initial water flow, e.g. 500 L/min for each fire hose. The aim is to absorb as much heat as possible at the beginning to stop the expansion of the fire and to reduce the smoke. If the flow is too low, the cooling is insufficient, and the steam that is produced can burn firefighters (the drop of pressure is too small and the vapor is pushed back in their direction).\nAlthough it may seem paradoxical, the use of a strong flow with an efficient fire hose and an efficient strategy (diffuse spray, small droplets) requires a smaller amount of water. This is because once the temperature is lowered, only a limited amount of water is necessary to suppress the fire seat with a straight spray. For a living room of 50 m2 (60 sq yd), the required amount of water is estimated as 60 L (15 gal).\nFrench firefighters used an alternative method in the 1970s: spraying water on the hot walls to create a water vapor atmosphere and asphyxiate the fire. This method is no longer used because it turned out to be risky; the pressure created pushed the hot gases and vapor towards the firefighters, causing severe burns, and pushed the hot gases into other rooms where they could start other fires.\n\n\n== Asphyxiating a fire ==\nIn some cases, the use of water is undesirable. This is because some chemical products react with water to produce poisonous gases, or they may even burn when they come into contact with water (e.g., sodium), see water-reactive substances. Another problem is that some products float on water, such as hydrocarbons (gasoline, oil, and alcohol, etc.); a burning layer can then be spread by the fire. If\na pressurized fuel tank is endangered by fire it is necessary to avoid heat shocks that may damage the tank if it is sprayed with cooling water; the resulting decompression might produce a BLEVE (boiling liquid expanding vapor explosion).\nElectrical fires cannot be extinguished with water since the water could act as a conductor.\nIn such cases, it is necessary to asphyxiate the fire. This can be done in a variety of ways. Chemical products which react with the fuel can be used to stop the combustion. A layer of water-based fire retardant foam can be applied by the fire hose in order to separate the oxygen in the air from the fuel. carbon dioxide, halon, or sodium bicarbonate can be used. In the case of very small fires and in the absence of other extinguishing agents, covering the flame with a fire blanket can eliminate oxygen flow to the fire. A simple and usually effective way to put out a fire in a stove-top pan is to put a lid on the pan and leave it there.\n\n\n== Tactical ventilation or isolation of the fire ==\nOne of the main risks of a fire is the smoke; because, it carries heat and poisonous gases, and obscures vision. In the case of a fire in a closed location (building), the following two different strategies may be used: isolation of the fire or ventilation.\nPaul Grimwood introduced the concept of tactical ventilation in the 1980s to encourage a better thought-out approach to this aspect of firefighting. Following work with Warrington Fire Research Consultants (FRDG 6/94) his terminology and concepts were adopted officially by the UK fire services, and are now referred to throughout revised Home Office training manuals (1996–97). Grimwood's original definition of his 1991 unified strategy stated that, \"tactical ventilation is either the venting, or containment (isolation) actions by on-scene firefighters, used to take control from the outset of a fire's burning regime, in an effort to gain tactical advantage during interior structural firefighting operations.\"\nWhen properly used, ventilation improves life safety, fire extinguishment, and property conservation by 'pulling' fire away from trapped occupants and objects.\nIn most cases of structural firefighting, a 4x4 foot opening is cut into the roof directly over the fire room. This allows hot smoke and gases to escape through the opening, returning the conditions inside the room to normal. It is important to coordinate the ventilation with an interior fire attack since the opening of a ventilation hole supplies more air, and thus oxygen, to the fire. Ventilation may also \"limit fire spread by channeling fire toward nearby openings and allows fire fighters to safely attack the fire\" as well as limit smoke, heat, and water damage.Positive pressure ventilation (PPV) consists of using a fan to create excess pressure in a part of the building. This pressure pushes the smoke and heat out of the building, and thus facilitates rescue and fire fighting operations. It is necessary to have an exit for the smoke, to know the building layout well to predict where the smoke will go, and to ensure that the doors ensuring the ventilation remain open by wedging or propping them. The main risk of this method is that it may accelerate the fire, or even create a flash-over; for example, if the smoke and the heat accumulate in a dead end.\nHydraulic ventilation is the process of directing a stream of water from the inside of a structure out the window using a fog pattern. This will effectively pull smoke out of room. Smoke ejectors may also be used for this purpose.\n\n\n== Categorizing fires ==\n\n\n=== United States ===\n\nIn the US, fires are sometimes categorized as \"one alarm\", \"all hands\", \"two alarm\", \"three alarm\" (or higher) fires. There is no standard definition for what this means quantifiably; though, it always refers to the level of response by the local authorities. In some cities, the numeric rating refers to the number of fire stations that have been summoned to the fire. In others, it reflects the number of \"dispatches\" requesting additional personnel and equipment.Alarms levels are generally used to define the tiers of the response as to what resources are to be used. For example, a structure fire response draws the following equipment: four engine/pumper companies, one truck/ladder/aerial/quint company, and one battalion chief unit. This is referred to as an Initial Alarm or Box Alarm. A working fire request (for the same incident) would call for air/light units and \nchief officers/fireground commanders (if not provided in the original dispatch). This summarizes the response to a First Alarm fire. Second and subsequent alarms call for two engine companies and one truck company.\nThe reason behind the \"Alarm\" designation is so the Incident Commander does not have to list each apparatus required. He can simply say, \"Give me a second alarm here\", instead of \"Give me a truck company and two engine companies\" along with requesting where they should come from. Categorization of fires varies among fire departments. A single alarm for one department may be a second alarm for another. Response always depends on the size of the fire and the department.\n\n\n=== United Kingdom ===\nIn the fire services in the United Kingdom, the scale of a fire is measured by the number of \"pumps\" (ordinary fire engines) that were present. For example, a fire which was attended by 4 engines would be recorded as a \"4-pump fire\".\n\n\n== See also ==\nGlossary of firefighting—list of firefighting terms and acronyms, with descriptions\nGlossary of firefighting equipment—expansion of Glossary of firefighting\nGlossary of wildfire terms—expansion of Glossary of firefighting\nIndex of firefighting articles—alphabetical list of firefighting articles\nList of fire departments\nOutline of firefighting—structured list of firefighting topics, organized by subject area\nOccupational hazards of fire debris cleanup – Conditions caused by fire presenting health  and safety hazards to cleanup crews\nUnited States Air Force Fire Protection - United States Air Force Firefighting\n\n\n== References ==\n\n\n== External links ==\nCDC - NIOSH Fire Fighter Fatality Investigation and Prevention Program\nFire Product Search - Dedicated to Firefighting", "chinese_title": "", "chinese": ""}