{"topic": "Atlas", "english_title": "Atlas", "english": "An atlas is a collection of maps; it is typically a bundle of maps of Earth or a region of Earth.\nAtlases have traditionally been bound into book form, but today many atlases are in multimedia formats.  In addition to presenting geographic features and political boundaries, many atlases often feature geopolitical, social, religious and economic statistics. They also have information about the map and places in it.\n\n\n== Etymology ==\n\nThe concept of atlas in its modern sense and the genre of atlas in its own right were the brainchild and among the pioneering contributions of early modern Netherlandish cartographers, geographers and cosmographers; most notably Gerardus Mercator (who first used the term 'atlas' for a collection of maps) and Abraham Ortelius (who is often recognized as the creator of the  first true atlas in the modern sense). The use of the word \"atlas\" in a geographical context dates from 1595 when the German-Flemish geographer Gerardus Mercator published Atlas Sive Cosmographicae Meditationes de Fabrica Mundi et Fabricati Figura (Atlas or cosmographical meditations upon the creation of the universe, and the universe as created). This title provides Mercator's definition of the word as a description of the creation and form of the whole universe, not simply as a collection of maps. The volume that was published posthumously one year after his death is a wide-ranging text but, as the editions evolved, it became simply a collection of maps and it is in that sense that the word was used from the middle of the seventeenth century.  The neologism coined by Mercator was a mark of his respect for the Titan, Atlas, the \"King of Mauretania\", whom he considered to be the first great geographer.\n\n\n== History of atlases ==\nThe first work that contained systematically arranged maps of uniform size representing the first modern atlas was prepared by Italian cartographer Pietro Coppo in early 16th century, however it wasn't published at the time so is conventionally not considered the first atlas. Rather, this title is awarded to the collection of maps Theatrum Orbis Terrarum by the Brabantian cartographer Abraham Ortelius printed in 1570.\nThere is, however, quite a difference in the way atlases were published in the 16th-19th centuries and nowadays. Unlike now most atlases were not bound and ready for the customer to buy, but their possible components were shelved separately. The client could change the contents to their liking, have the maps coloured/gilded or not and after publisher and customer agreed the atlas was bound. Therefore it is possible that early printed atlases with the same title page can be different in contents.\n\n\n== Types of atlases ==\nA travel atlas is made for easy use during travel, and often has spiral bindings so it may be folded flat (for example Geographers' A-Z Map Company famous A–Z atlases). It has maps at a large zoom so the maps can be reviewed easily. A travel atlas may also be referred to as a road map.A desk atlas is made similar to a reference book. It may be in hardback or paperback form.\nThere are atlases of the other planets (and their satellites) in the Solar System.Atlases of anatomy exist, mapping out organs of the human body or other organisms.\n\n\n== Selected atlases ==\n\nSome cartographically or commercially important atlases include the following:\n\n17th century and earlierAtlas Sive Cosmographicae (Mercator, Duisburg, in present-day Germany, 1595)\nAtlas Novus (Blaeu, Netherlands, 1635–1658)\nAtlas Maior (Blaeu, Netherlands, 1662–1667)\nCartes générales de toutes les parties du monde (France, 1658–1676)\nDell'Arcano del Mare (England/Italy, 1645–1661)\nPiri Reis map (Ottoman Empire, 1570–1612)\nTheatrum Orbis Terrarum (Ortelius, Netherlands, 1570–1612)\nKlencke Atlas (1660; one of the world's largest books)\nThe Brittania (John Ogilby, 1670–1676)18th centuryAtlas Nouveau (Amsterdam, 1742)\nBritannia Depicta (London, 1720)\nCary's New and Correct English Atlas (London, 1787)19th centuryAndrees Allgemeiner Handatlas (Germany, 1881–1939; in the UK as Times Atlas of the World, 1895)\nRand McNally Atlas (United States, 1881–present)\nStielers Handatlas (Germany, 1817–1944)\nTimes Atlas of the World (United Kingdom, 1895–present)20th centuryAtlante Internazionale del Touring Club Italiano (Italy, 1927–1978)\nAtlas Linguisticus (Austria, 1934)\nAtlas Mira (Soviet Union/Russia, 1937–present)\nGeographers' A–Z Street Atlas (United Kingdom, 1938–present)\nGran Atlas Aguilar (Spain, 1969/1970)\nThe Historical Atlas of China (China)\nNational Geographic Atlas of the World (United States, 1963–present)\nPergamon World Atlas (1962/1968)21st centuryNorth American Environmental Atlas\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nSourcesOn the origin of the term \"Atlas\"Online atlasesWorld Atlas\nÖROK-Atlas Online: Atlas on spatial development in Austria\nGeography Network\nMapChart EarthAtlas, free online atlas with interactive maps about topics like demography, economy, health and environment.\nNational Geographic MapMachineHistory of atlasesAtlases, at the US Library of Congress site - a discussion of many significant atlases, with some illustrations.  Part of  Geography and Maps, an Illustrated Guide.Historical atlases onlineCentennia Historical Atlas required reading at the US Naval Academy for over a decade.\nHistorical map web sites list, Perry–Castañeda Library, University of Texas\nRyhiner Collection Composite atlas with maps, plans and views from the 16th-18th centuries, covering the globe, with about 16,000 images in total.\nManuscript Atlases held by the University of Pennsylvania Libraries - fully digitized with descriptions.\nHistorical Atlas in Persuasive Cartography, The PJ Mode Collection, Cornell University LibraryOther linksGoogle Earth: a visual 3D interactive atlas.\nNASA's World Wind software.\nWikimapia a wikiproject designed to describe the entire world.", "chinese_title": "", "chinese": ""}