{"topic": "Cognitive", "english_title": "Cognition", "english": "Cognition ( (listen)) refers to \"the mental action or process of acquiring knowledge and understanding through thought, experience, and the senses\". It encompasses many aspects of intellectual functions and processes such as: perception, attention, the formation of knowledge, memory and working memory, judgment and evaluation, reasoning and \"computation\", problem solving and decision making, comprehension and production of language. Cognitive processes use existing knowledge and discover new knowledge.\nCognitive processes are analyzed from different perspectives within different contexts, notably in the fields of linguistics, anesthesia, neuroscience, psychiatry, psychology, education, philosophy, anthropology, biology, systemics, logic, and computer science. These and other different approaches to the analysis of cognition are synthesised in the developing field of cognitive science, a progressively autonomous academic discipline.\n\n\n== Etymology ==\nThe word cognition dates back to the 15th century, where it meant \"thinking and awareness\". The term comes from the Latin noun cognitio ('examination,' 'learning,' or 'knowledge'), derived from the verb cognosco, a compound of con ('with') and gnōscō ('know'). The latter half, gnōscō, itself is a cognate of a Greek verb, gi(g)nόsko (γι(γ)νώσκω, 'I know,' or 'perceive').\n\n\n== Early studies ==\nDespite the word cognitive itself dating back to the 15th century, attention to cognitive processes came about more than eighteen centuries earlier, beginning with Aristotle (384–322 BC) and his interest in the inner workings of the mind and how they affect the human experience. Aristotle focused on cognitive areas pertaining to memory, perception, and mental imagery. He placed great importance on ensuring that his studies were based on empirical evidence, that is, scientific information that is gathered through observation and conscientious experimentation. Two millennia later, the groundwork for modern concepts of cognition was laid during the Enlightenment by thinkers such as John Locke and Dugald Stewart who sought to develop a model of the mind in which ideas were acquired, remembered and manipulated.During the early nineteenth century cognitive models were developed both in philosophy—particularly by authors writing about the philosophy of mind—and within medicine, especially by physicians seeking to understand how to cure madness. In Britain, these models were studied in the academy by scholars such as James Sully at University College London, and they were even used by politicians when considering the national Elementary Education Act of 1870.As psychology emerged as a burgeoning field of study in Europe, whilst also gaining a following in America, scientists such as Wilhelm Wundt, Herman Ebbinghaus, Mary Whiton Calkins, and William James would offer their contributions to the study of human cognition.\n\n\n=== Early theorists ===\nWilhelm Wundt (1832–1920) emphasized the notion of what he called introspection: examining the inner feelings of an individual. With introspection, the subject had to be careful to describe their feelings in the most objective manner possible in order for Wundt to find the information scientific. Though Wundt's contributions are by no means minimal, modern psychologists find his methods to be quite subjective and choose to rely on more objective procedures of experimentation to make conclusions about the human cognitive process.\nHermann Ebbinghaus (1850–1909) conducted cognitive studies that mainly examined the function and capacity of human memory. Ebbinghaus developed his own experiment in which he constructed over 2,000 syllables made out of nonexistent words, for instance EAS. He then examined his own personal ability to learn these non-words. He purposely chose non-words as opposed to real words to control for the influence of pre-existing experience on what the words might symbolize, thus enabling easier recollection of them. Ebbinghaus observed and hypothesized a number of variables that may have affected his ability to learn and recall the non-words he created. One of the reasons, he concluded, was the amount of time between the presentation of the list of stimuli and the recitation or recall of same.  Ebbinghaus was the first to record and plot a \"learning curve\" and a \"forgetting curve\". His work heavily influenced the study of serial position and its effect on memory (discussed further below).\nMary Whiton Calkins (1863–1930) was an influential American pioneer in the realm of psychology. Her work also focused on the human memory capacity. A common theory, called the recency effect, can be attributed to the studies that she conducted. The recency effect, also discussed in the subsequent experiment section, is the tendency for individuals to be able to accurately recollect the final items presented in a sequence of stimuli. Calkin's theory is closely related to the aforementioned study and conclusion of the memory experiments conducted by Hermann Ebbinghaus.William James (1842–1910) is another pivotal figure in the history of cognitive science. James was quite discontent with Wundt's emphasis on introspection and Ebbinghaus' use of nonsense stimuli. He instead chose to focus on the human learning experience in everyday life and its importance to the study of cognition. James' most significant contribution to the study and theory of cognition was his textbook Principles of Psychology that preliminarily examines aspects of cognition such as perception, memory, reasoning, and attention.René Descartes (1596-1650) was a seventeenth-century philosopher who came up with the phrase \"Cogito, ergo sum.\" Which means \"I think, therefore I am.\" He took a philosophical approach to the study of cognition and the mind, with his Meditations he wanted people to meditate along with him to come to the same conclusions as he did but in their own free cognition.\n\n\n== Psychology ==\n\nIn psychology, the term \"cognition\" is usually used within an information processing view of an individual's psychological functions, and such is the same in cognitive engineering. In the study of social cognition, a branch of social psychology, the term is used to explain attitudes, attribution, and group dynamics.Human cognition is conscious and unconscious, concrete or abstract, as well as intuitive (like knowledge of a language) and conceptual (like a model of a language). It encompasses processes such as memory, association, concept formation, pattern recognition, language, attention, perception, action, problem solving, and mental imagery. Traditionally, emotion was not thought of as a cognitive process, but now much research is being undertaken to examine the cognitive psychology of emotion; research is also focused on one's awareness of one's own strategies and methods of cognition, which is called metacognition.\nWhile few people would deny that cognitive processes are a function of the brain, a cognitive theory will not necessarily make reference to the brain or to biological processes (cf. neurocognitive). It may purely describe behavior in terms of information flow or function. Relatively recent fields of study such as neuropsychology aim to bridge this gap, using cognitive paradigms to understand how the brain implements the information-processing functions (cf. cognitive neuroscience), or to understand how pure information-processing systems (e.g., computers) can simulate human cognition (cf. artificial intelligence). The branch of psychology that studies brain injury to infer normal cognitive function is called cognitive neuropsychology. The links of cognition to evolutionary demands are studied through the investigation of animal cognition.\n\n\n=== Piaget's theory of cognitive development ===\n\nFor years, sociologists and psychologists have conducted studies on cognitive development, i.e. the construction of human thought or mental processes.\nJean Piaget was one of the most important and influential people in the field of developmental psychology. He believed that humans are unique in comparison to animals because we have the capacity to do \"abstract symbolic reasoning\". His work can be compared to Lev Vygotsky, Sigmund Freud, and Erik Erikson who were also great contributors in the field of developmental psychology. Today, Piaget is known for studying the cognitive development in children, having studied his own three children and their intellectual development, from which he would come to a theory of cognitive development that describes the developmental stages of childhood.\n\n\n=== Common types of tests on human cognition ===\nSerial position\nThe serial position experiment is meant to test a theory of memory that states that when information is given in a serial manner, we tend to remember information in the beginning of the sequence, called the primacy effect, and information in the end of the sequence, called the recency effect. Consequently, information given in the middle of the sequence is typically forgotten, or not recalled as easily. This study predicts that the recency effect is stronger than the primacy effect, because the information that is most recently learned is still in working memory when asked to be recalled. Information that is learned first still has to go through a retrieval process. This experiment focuses on human memory processes.Word superiority\nThe word superiority experiment presents a subject with a word, or a letter by itself, for a brief period of time, i.e. 40ms, and they are then asked to recall the letter that was in a particular location in the word. In theory, the subject should be better able to correctly recall the letter when it was presented in a word than when it was presented in isolation. This experiment focuses on human speech and language.Brown-Peterson\nIn the Brown-Peterson experiment, participants are briefly presented with a trigram and in one particular version of the experiment, they are then given a distractor task, asking them to identify whether a sequence of words are in fact words, or non-words (due to being misspelled, etc.). After the distractor task, they are asked to recall the trigram from before the distractor task. In theory, the longer the distractor task, the harder it will be for participants to correctly recall the trigram. This experiment focuses on human short-term memory.Memory span\nDuring the memory span experiment, each subject is presented with a sequence of stimuli of the same kind; words depicting objects, numbers, letters that sound similar, and letters that sound dissimilar. After being presented with the stimuli, the subject is asked to recall the sequence of stimuli that they were given in the exact order in which it was given. In one particular version of the experiment, if the subject recalled a list correctly, the list length was increased by one for that type of material, and vice versa if it was recalled incorrectly. The theory is that people have a memory span of about seven items for numbers, the same for letters that sound dissimilar and short words. The memory span is projected to be shorter with letters that sound similar and with longer words.Visual search\nIn one version of the visual search experiment, a participant is presented with a window that displays circles and squares scattered across it. The participant is to identify whether there is a green circle on the window. In the featured search, the subject is presented with several trial windows that have blue squares or circles and one green circle or no green circle in it at all. In the conjunctive search, the subject is presented with trial windows that have blue circles or green squares and a present or absent green circle whose presence the participant is asked to identify. What is expected is that in the feature searches, reaction time, that is the time it takes for a participant to identify whether a green circle is present or not, should not change as the number of distractors increases. Conjunctive searches where the target is absent should have a longer reaction time than the conjunctive searches where the target is present. The theory is that in feature searches, it is easy to spot the target, or if it is absent, because of the difference in color between the target and the distractors. In conjunctive searches where the target is absent, reaction time increases because the subject has to look at each shape to determine whether it is the target or not because some of the distractors if not all of them, are the same color as the target stimuli. Conjunctive searches where the target is present take less time because if the target is found, the search between each shape stops.Knowledge representation\nThe semantic network of knowledge representation systems has been studied in various paradigms. One of the oldest paradigms is the leveling and sharpening of stories as they are repeated from memory studied by Bartlett. The semantic differential used factor analysis to determine the main meanings of words, finding that value or \"goodness\" of words is the first factor. More controlled experiments examine the categorical relationships of words in free recall. The hierarchical structure of words has been explicitly mapped in George Miller's Wordnet. More dynamic models of semantic networks have been created and tested with neural network experiments based on computational systems such as latent semantic analysis (LSA), Bayesian analysis, and multidimensional factor analysis. The semantics (meaning) of words is studied by all the disciplines of cognitive science.\n\n\n== Metacognition ==\n\n\n== Improving cognition ==\nPhysical exercise\nAerobic and anaerobic exercise has been studied concerning cognitive improvement. There appears to be short-term increases in attention span, verbal and visual memory in some studies. However, the effects are transient and diminishes over time and after cessation of the physical activity.Dietary supplements\nStudies evaluating phytoestrogen, blueberry supplementation and antioxidants showed minor increases in cognitive function after the supplementation compared to before but no significant effects compared to placebo.Pleasurable social stimulation\nExposing individuals with cognitive impairment (i.e., Dementia) to daily activities designed to stimulate thinking and memory in a social setting, seems to improve cognition. Although study materials are small, and larger studies need to confirm the results, the effect of social cognitive stimulation seems to be larger than the effects of some drug treatments.Other methods\nTranscranial magnetic stimulation (TMS) has been shown to improve cognition in individuals without dementia 1 month after treatment session compared to before treatment. The effect was not significantly larger compared to placebo. Computerized cognitive training, utilising a computer based training regime for different cognitive functions has been examined in a clinical setting but no lasting effects has been shown.\n\n\n== See also ==\n\nCognitive biology\nCognitive computing\nCognitive psychology\nCognitive science\nCognitivism\nComparative cognition\nInformation processing technology and aging\nMental chronometry – i.e., the measuring of cognitive processing speed\nNootropic\nOutline of human intelligence – a list of traits, capacities, models, and research fields of human intelligence, and more.\nOutline of thought – a list that identifies many types of thoughts, types of thinking, aspects of thought, related fields, and more.\nCognitive Abilities Screening Instrument\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nCognition An international journal publishing theoretical and experimental papers on the study of the mind.\nInformation on music cognition, University of Amsterdam\nCognitie.NL Information on cognition research, Netherlands Organisation for Scientific Research (NWO) and University of Amsterdam (UvA)\nEmotional and Decision Making Lab, Carnegie Mellon, EDM Lab\nThe Limits of Human Cognition – an article describing the evolution of mammals' cognitive abilities\nHalf-heard phone conversations reduce cognitive performance\nThe limits of intelligence  Douglas Fox, Scientific American, 14 June 14, 2011.", "chinese_title": "", "chinese": ""}