{"topic": "Acceleration", "english_title": "Acceleration", "english": "In mechanics, acceleration is the rate of change of the velocity of an object with respect to time.\nAccelerations are vector quantities (in that they have magnitude and direction). The orientation of an object's acceleration is given by the orientation of the net force acting on that object.  The magnitude of an object's acceleration, as described by Newton's Second Law, is the combined effect of two causes:\n\nthe net balance of all external forces acting onto that object — magnitude is directly proportional to this net resulting force;\nthat object's mass, depending on the materials out of which it is made — magnitude is inversely proportional to the object's mass.The SI unit for acceleration is metre per second squared (m⋅s−2, \n  \n    \n      \n        \n          \n            \n              m\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\tfrac {\\operatorname {m} }{\\operatorname {s} ^{2}}}}\n  ).\nFor example, when a vehicle starts from a standstill (zero velocity, in an inertial frame of reference) and travels in a straight line at increasing speeds, it is accelerating in the direction of travel.  If the vehicle turns, an acceleration occurs toward the new direction and changes its motion vector.  The acceleration of the vehicle in its current direction of motion is called a linear (or tangential during circular motions) acceleration, the reaction to which the passengers on board experience as a force pushing them back into their seats.  When changing direction, the effecting acceleration is called radial (or orthogonal during circular motions) acceleration, the reaction to which the passengers experience as a centrifugal force.  If the speed of the vehicle decreases, this is an acceleration in the opposite direction and mathematically a negative, sometimes called deceleration, and passengers experience the reaction to deceleration as an inertial force pushing them forward.  Such negative accelerations are often achieved by retrorocket burning in spacecraft.  Both acceleration and deceleration are treated the same, they are both changes in velocity.  Each of these accelerations (tangential, radial, deceleration) is felt by passengers until their relative (differential) velocity are neutralized in reference to the vehicle.  \na=d\\dt v\n\n\n== Definition and properties ==\n\n\n=== Average acceleration ===\n\nAn object's average acceleration over a period of time is its change in velocity \n  \n    \n      \n        (\n        Δ\n        \n          v\n        \n        )\n      \n    \n    {\\displaystyle (\\Delta \\mathbf {v} )}\n   divided by the duration of the period \n  \n    \n      \n        (\n        Δ\n        t\n        )\n      \n    \n    {\\displaystyle (\\Delta t)}\n  . Mathematically,\n\n  \n    \n      \n        \n          \n            \n              \n                a\n              \n              ¯\n            \n          \n        \n        =\n        \n          \n            \n              Δ\n              \n                v\n              \n            \n            \n              Δ\n              t\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {\\bar {\\mathbf {a} }}={\\frac {\\Delta \\mathbf {v} }{\\Delta t}}.}\n  \n\n\n=== Instantaneous acceleration ===\n\nInstantaneous acceleration, meanwhile, is the limit of the average acceleration over an infinitesimal interval of time. In the terms of calculus, instantaneous acceleration is the derivative of the velocity vector with respect to time:\n\n  \n    \n      \n        \n          a\n        \n        =\n        \n          lim\n          \n            \n              Δ\n              t\n            \n            →\n            0\n          \n        \n        \n          \n            \n              Δ\n              \n                v\n              \n            \n            \n              Δ\n              t\n            \n          \n        \n        =\n        \n          \n            \n              d\n              \n                v\n              \n            \n            \n              d\n              t\n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {a} =\\lim _{{\\Delta t}\\to 0}{\\frac {\\Delta \\mathbf {v} }{\\Delta t}}={\\frac {d\\mathbf {v} }{dt}}}\n  As acceleration is defined as the derivative of velocity, v, with respect to time t and velocity is defined as the derivative of position, x, with respect to time, acceleration can be thought of as the second derivative of x with respect to t:\n\n  \n    \n      \n        \n          a\n        \n        =\n        \n          \n            \n              d\n              \n                v\n              \n            \n            \n              d\n              t\n            \n          \n        \n        =\n        \n          \n            \n              \n                d\n                \n                  2\n                \n              \n              \n                x\n              \n            \n            \n              d\n              \n                t\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {a} ={\\frac {d\\mathbf {v} }{dt}}={\\frac {d^{2}\\mathbf {x} }{dt^{2}}}}\n  (Here and elsewhere, if motion is in a straight line, vector quantities can be substituted by scalars in the equations.)\nBy the fundamental theorem of calculus, it can be seen that the integral of the acceleration function a(t) is the velocity function v(t); that is, the area under the curve of an acceleration vs. time (a vs. t) graph corresponds to velocity.\n\n  \n    \n      \n        \n          v\n        \n        =\n        ∫\n        \n          a\n        \n         \n        d\n        t\n      \n    \n    {\\displaystyle \\mathbf {v} =\\int \\mathbf {a} \\ dt}\n  Likewise, the integral of the jerk function j(t), the derivative of the acceleration function, can be used to find acceleration at a certain time:\n\n  \n    \n      \n        \n          a\n        \n        =\n        ∫\n        \n          j\n        \n         \n        d\n        t\n      \n    \n    {\\displaystyle \\mathbf {a} =\\int \\mathbf {j} \\ dt}\n  \n\n\n=== Units ===\nAcceleration has the dimensions of velocity (L/T) divided by time, i.e. L T−2. The SI unit of acceleration is the metre per second squared (m s−2); or \"metre per second per second\", as the velocity in metres per second changes by the acceleration value, every second.\n\n\n=== Other forms ===\nAn object moving in a circular motion—such as a satellite orbiting the Earth—is accelerating due to the change of direction of motion, although its speed may be constant. In this case it is said to be undergoing centripetal (directed towards the center) acceleration.\nProper acceleration, the acceleration of a body relative to a free-fall condition, is measured by an instrument called an accelerometer.\nIn classical mechanics, for a body with constant mass, the (vector) acceleration of the body's center of mass is proportional to the net force vector (i.e. sum of all forces) acting on it (Newton's second law):\n\n  \n    \n      \n        \n          F\n        \n        =\n        m\n        \n          a\n        \n        \n        →\n        \n        \n          a\n        \n        =\n        \n          \n            \n              F\n            \n            m\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {F} =m\\mathbf {a} \\quad \\to \\quad \\mathbf {a} ={\\frac {\\mathbf {F} }{m}}}\n  where F is the net force acting on the body, m is  the mass of the body, and a is the center-of-mass acceleration. As speeds approach the speed of light, relativistic effects become increasingly large.\n\n\n== Tangential and centripetal acceleration ==\n\nThe velocity of a particle moving on a curved path as a function of time can be written as:\n\n  \n    \n      \n        \n          v\n        \n        (\n        t\n        )\n        =\n        v\n        (\n        t\n        )\n        \n          \n            \n              \n                v\n              \n              (\n              t\n              )\n            \n            \n              v\n              (\n              t\n              )\n            \n          \n        \n        =\n        v\n        (\n        t\n        )\n        \n          \n            u\n          \n          \n            \n              t\n            \n          \n        \n        (\n        t\n        )\n        ,\n      \n    \n    {\\displaystyle \\mathbf {v} (t)=v(t){\\frac {\\mathbf {v} (t)}{v(t)}}=v(t)\\mathbf {u} _{\\mathrm {t} }(t),}\n  with v(t) equal to the speed of travel along the path, and\n\n  \n    \n      \n        \n          \n            u\n          \n          \n            \n              t\n            \n          \n        \n        =\n        \n          \n            \n              \n                v\n              \n              (\n              t\n              )\n            \n            \n              v\n              (\n              t\n              )\n            \n          \n        \n         \n        ,\n      \n    \n    {\\displaystyle \\mathbf {u} _{\\mathrm {t} }={\\frac {\\mathbf {v} (t)}{v(t)}}\\ ,}\n  a unit vector tangent to the path pointing in the direction of motion at the chosen moment in time. Taking into account both the changing speed v(t) and the changing direction of ut, the acceleration of a particle moving on a curved path can be written using the chain rule of differentiation for the product of two functions of time as:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  a\n                \n              \n              \n                \n                =\n                \n                  \n                    \n                      \n                        d\n                      \n                      \n                        v\n                      \n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      \n                        d\n                      \n                      v\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n                \n                  \n                    u\n                  \n                  \n                    \n                      t\n                    \n                  \n                \n                +\n                v\n                (\n                t\n                )\n                \n                  \n                    \n                      d\n                      \n                        \n                          u\n                        \n                        \n                          \n                            t\n                          \n                        \n                      \n                    \n                    \n                      d\n                      t\n                    \n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      \n                        d\n                      \n                      v\n                    \n                    \n                      \n                        d\n                      \n                      t\n                    \n                  \n                \n                \n                  \n                    u\n                  \n                  \n                    \n                      t\n                    \n                  \n                \n                +\n                \n                  \n                    \n                      v\n                      \n                        2\n                      \n                    \n                    r\n                  \n                \n                \n                  \n                    u\n                  \n                  \n                    \n                      n\n                    \n                  \n                \n                 \n                ,\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{alignedat}{3}\\mathbf {a} &={\\frac {\\mathrm {d} \\mathbf {v} }{\\mathrm {d} t}}\\\\&={\\frac {\\mathrm {d} v}{\\mathrm {d} t}}\\mathbf {u} _{\\mathrm {t} }+v(t){\\frac {d\\mathbf {u} _{\\mathrm {t} }}{dt}}\\\\&={\\frac {\\mathrm {d} v}{\\mathrm {d} t}}\\mathbf {u} _{\\mathrm {t} }+{\\frac {v^{2}}{r}}\\mathbf {u} _{\\mathrm {n} }\\ ,\\\\\\end{alignedat}}}\n  where un is the  unit (inward) normal vector to the particle's trajectory (also called the principal normal), and r is its instantaneous radius of curvature based upon the osculating circle at time t. These components are called the tangential acceleration and the normal or radial acceleration (or centripetal acceleration in circular motion, see also circular motion and centripetal force).\nGeometrical analysis of three-dimensional space curves, which explains tangent, (principal) normal and binormal, is described by the Frenet–Serret formulas.\n\n\n== Special cases ==\n\n\n=== Uniform acceleration ===\n\nUniform or constant acceleration is a type of motion in which the velocity of an object changes by an equal amount in every equal time period.\nA frequently cited example of uniform acceleration is that of an object in free fall in a uniform gravitational field. The acceleration of a falling body in the absence of resistances to motion is dependent only on the gravitational field strength g (also called acceleration due to gravity). By Newton's Second Law the force \n  \n    \n      \n        \n          \n            F\n            \n              g\n            \n          \n        \n      \n    \n    {\\displaystyle \\mathbf {F_{g}} }\n   acting on a body is given by:\n\n  \n    \n      \n        \n          \n            F\n            \n              g\n            \n          \n        \n        =\n        m\n        \n          g\n        \n      \n    \n    {\\displaystyle \\mathbf {F_{g}} =m\\mathbf {g} }\n  Because of the simple analytic properties of the case of constant acceleration, there are simple formulas relating the displacement, initial and time-dependent velocities, and acceleration to the time elapsed:\n\n  \n    \n      \n        \n          s\n        \n        (\n        t\n        )\n        =\n        \n          \n            s\n          \n          \n            0\n          \n        \n        +\n        \n          \n            v\n          \n          \n            0\n          \n        \n        t\n        +\n        \n          \n            \n              1\n              2\n            \n          \n        \n        \n          a\n        \n        \n          t\n          \n            2\n          \n        \n        =\n        \n          \n            s\n          \n          \n            0\n          \n        \n        +\n        \n          \n            \n              \n                \n                  v\n                \n                \n                  0\n                \n              \n              +\n              \n                v\n              \n              (\n              t\n              )\n            \n            2\n          \n        \n        t\n      \n    \n    {\\displaystyle \\mathbf {s} (t)=\\mathbf {s} _{0}+\\mathbf {v} _{0}t+{\\tfrac {1}{2}}\\mathbf {a} t^{2}=\\mathbf {s} _{0}+{\\frac {\\mathbf {v} _{0}+\\mathbf {v} (t)}{2}}t}\n  \n\n  \n    \n      \n        \n          v\n        \n        (\n        t\n        )\n        =\n        \n          \n            v\n          \n          \n            0\n          \n        \n        +\n        \n          a\n        \n        t\n      \n    \n    {\\displaystyle \\mathbf {v} (t)=\\mathbf {v} _{0}+\\mathbf {a} t}\n  \n\n  \n    \n      \n        \n          \n            v\n            \n              2\n            \n          \n        \n        (\n        t\n        )\n        =\n        \n          \n            \n              v\n              \n                0\n              \n            \n          \n          \n            2\n          \n        \n        +\n        2\n        \n          a\n          ⋅\n        \n        [\n        \n          s\n        \n        (\n        t\n        )\n        −\n        \n          \n            s\n          \n          \n            0\n          \n        \n        ]\n      \n    \n    {\\displaystyle {v^{2}}(t)={v_{0}}^{2}+2\\mathbf {a\\cdot } [\\mathbf {s} (t)-\\mathbf {s} _{0}]}\n  where\n\n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n   is the elapsed time,\n\n  \n    \n      \n        \n          \n            s\n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {s} _{0}}\n   is the initial displacement from the origin,\n\n  \n    \n      \n        \n          s\n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle \\mathbf {s} (t)}\n   is the displacement from the origin at time \n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  ,\n\n  \n    \n      \n        \n          \n            v\n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle \\mathbf {v} _{0}}\n   is the initial velocity,\n\n  \n    \n      \n        \n          v\n        \n        (\n        t\n        )\n      \n    \n    {\\displaystyle \\mathbf {v} (t)}\n   is the velocity at time \n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  , and\n\n  \n    \n      \n        \n          a\n        \n      \n    \n    {\\displaystyle \\mathbf {a} }\n   is the uniform rate of acceleration.In particular, the motion can be resolved into two orthogonal parts, one of constant velocity and the other according to the above equations.  As Galileo showed, the net result is parabolic motion, which describes, e. g., the trajectory of a projectile in a vacuum near the surface of Earth.\n\n\n=== Circular motion ===\n\nIn uniform circular motion, that is moving with constant speed along a circular path, a particle experiences an acceleration resulting from the change of the direction of the velocity vector, while its magnitude remains constant. The derivative of the location of a point on a curve with respect to time, i.e. its velocity, turns out to be always exactly tangential to the curve, respectively orthogonal to the radius in this point. Since in uniform motion the velocity in the tangential direction does not change, the acceleration must be in radial direction, pointing to the center of the circle. This acceleration constantly changes the direction of the velocity to be tangent in the neighboring point, thereby rotating the velocity vector along the circle.\n• For a given speed \n  \n    \n      \n        v\n      \n    \n    {\\displaystyle v}\n  , the magnitude of this geometrically caused acceleration (centripetal acceleration) is inversely proportional to the radius \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n   of the circle, and increases as the square of this speed:\n\n  \n    \n      \n        \n          a\n          \n            c\n          \n        \n        =\n        \n          \n            \n              v\n              \n                2\n              \n            \n            r\n          \n        \n        \n        .\n      \n    \n    {\\displaystyle a_{c}={\\frac {v^{2}}{r}}\\;.}\n  • Note that, for a given angular velocity \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  , the centripetal acceleration is directly proportional to radius \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  . This is due to the dependence of velocity \n  \n    \n      \n        v\n      \n    \n    {\\displaystyle v}\n   on the radius \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  .\n\n  \n    \n      \n        v\n        =\n        ω\n        r\n        .\n      \n    \n    {\\displaystyle v=\\omega r.}\n  Expressing centripetal acceleration vector in polar components, where \n  \n    \n      \n        \n          r\n        \n      \n    \n    {\\displaystyle \\mathbf {r} }\n   is a vector from the centre of the circle to the particle with magnitude equal to this distance, and considering the orientation of the acceleration towards the center, yields\n\n  \n    \n      \n        \n          \n            a\n            \n              c\n            \n          \n        \n        =\n        −\n        \n          \n            \n              v\n              \n                2\n              \n            \n            \n              \n                |\n              \n              \n                r\n              \n              \n                |\n              \n            \n          \n        \n        ⋅\n        \n          \n            \n              r\n            \n            \n              \n                |\n              \n              \n                r\n              \n              \n                |\n              \n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {a_{c}} =-{\\frac {v^{2}}{|\\mathbf {r} |}}\\cdot {\\frac {\\mathbf {r} }{|\\mathbf {r} |}}\\;.}\n  As usual in rotations, the speed \n  \n    \n      \n        v\n      \n    \n    {\\displaystyle v}\n   of a particle may be expressed as an angular speed with respect to a point at the distance \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n   as\n\n  \n    \n      \n        ω\n        =\n        \n          \n            v\n            r\n          \n        \n        .\n      \n    \n    {\\displaystyle \\omega ={\\frac {v}{r}}.}\n  Thus \n  \n    \n      \n        \n          \n            a\n            \n              c\n            \n          \n        \n        =\n        −\n        \n          ω\n          \n            2\n          \n        \n        \n          r\n        \n        \n        .\n      \n    \n    {\\displaystyle \\mathbf {a_{c}} =-\\omega ^{2}\\mathbf {r} \\;.}\n  \nThis acceleration and the mass of the particle determine the necessary centripetal force, directed toward the centre of the circle, as the net force acting on this particle to keep it in this uniform circular motion. The so-called 'centrifugal force', appearing to act outward on the body, is a so-called pseudo force experienced in the frame of reference of the body in circular motion, due to the body's linear momentum, a vector tangent to the circle of motion.\nIn a nonuniform circular motion, i.e., the speed along the curved path is changing, the acceleration has a non-zero component tangential to the curve, and is not confined to the principal normal, which directs to the center of the osculating circle, that determines the radius \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n   for the centripetal acceleration. The tangential component is given by the angular acceleration \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  , i.e., the rate of change \n  \n    \n      \n        α\n        =\n        \n          \n            \n              ω\n              ˙\n            \n          \n        \n      \n    \n    {\\displaystyle \\alpha ={\\dot {\\omega }}}\n   of the angular speed \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n   times the radius \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  . That is,\n\n  \n    \n      \n        \n          a\n          \n            t\n          \n        \n        =\n        r\n        α\n        .\n      \n    \n    {\\displaystyle a_{t}=r\\alpha .}\n  The sign of the tangential component of the acceleration is determined by the sign of the angular acceleration (\n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  ), and the tangent is always directed at right angles to the radius vector.\n\n\n== Relation to relativity ==\n\n\n=== Special relativity ===\n\nThe special theory of relativity describes the behavior of objects traveling relative to other objects at speeds approaching that of light in a vacuum. Newtonian mechanics is exactly revealed to be an approximation to reality, valid to great accuracy at lower speeds. As the relevant speeds increase toward the speed of light, acceleration no longer follows classical equations.\nAs speeds approach that of light, the acceleration produced by a given force decreases, becoming infinitesimally small as light speed is approached; an object with mass can approach this speed asymptotically, but never reach it.\n\n\n=== General relativity ===\n\nUnless the state of motion of an object is known, it is impossible to distinguish whether an observed force is due to gravity or to acceleration—gravity and inertial acceleration have identical effects. Albert Einstein called this the equivalence principle, and said that only observers who feel no force at all—including the force of gravity—are justified in concluding that they are not accelerating.\n\n\n== Conversions ==\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nAcceleration Calculator Simple acceleration unit converter\nAcceleration Calculator Acceleration Conversion calculator converts units form meter per second square, kilometer per second square, millimeter per second square & more with metric conversion.", "chinese_title": "", "chinese": ""}