{"topic": "region", "english_title": "Region", "english": "In geography, regions are areas that are broadly divided by physical characteristics (physical geography), human impact characteristics (human geography), and the interaction of humanity and the environment (environmental geography). Geographic regions and sub-regions are mostly described by their imprecisely defined, and sometimes transitory boundaries, except in human geography, where jurisdiction areas such as national borders are defined in law.\nApart from the global continental regions, there are also hydrospheric and atmospheric regions that cover the oceans, and discrete climates above the land and water masses of the planet. The land and water global regions are divided into subregions geographically bounded by large geological features that influence large-scale ecologies, such as plains and features.\nAs a way of describing spatial areas, the concept of regions is important and widely used among the many branches of geography, each of which can describe areas in regional terms.  For example, ecoregion is a term used in environmental geography, cultural region in cultural geography, bioregion in biogeography, and so on.  The field of geography that studies regions themselves is called regional geography.\nIn the fields of physical geography, ecology, biogeography, zoogeography, and environmental geography, regions tend to be based on natural features such as ecosystems or biotopes, biomes, drainage basins, natural regions, mountain ranges, soil types. Where human geography is concerned, the regions and subregions are described by the discipline of ethnography.\nA region has its own nature that could not be moved. The first nature is its natural environment (landform, climate, etc.). The second nature is its physical elements complex that was built by people in the past. The third nature is its socio-cultural context that could not be replaced by new immigrants.\n\n\n== Globalization ==\n\nGlobal regions distinguishable from space, and are therefore clearly distinguished by the two basic terrestrial environments, land and water. However, they have been generally recognized as such much earlier by terrestrial cartography because of their impact on human geography. They are divided into the largest of land regions, known as continents and the largest of water regions known as oceans. There are also significant regions that do not belong to either classification, such as archipelago regions that are littoral regions, or earthquake regions that are defined in geology.\n\n\n=== Continental regions ===\nContinental regions are usually based on broad experiences in human history and attempt to reduce very large areas to more manageable regionalization for the purpose of the study. As such they are conceptual constructs, usually lacking distinct boundaries. The oceanic division into maritime regions is used in conjunction with the relationship to the central area of the continent, using directions of the compass.\nSome continental regions are defined by the major continental feature of their identity, such as the Amazon basin, or the Sahara, which both occupy a significant percentage of their respective continental land area.\nTo a large extent, major continental regions are mental constructs created by considering an efficient way to define large areas of the continents. For the most part, the images of the world are derived as much from academic studies, from all types of media, or from personal experience of global exploration. They are a matter of collective human knowledge of their own planet and are attempts to better understand their environments.\n\n\n=== Regional geography ===\nRegional geography is a branch of geography that studies regions of all sizes across the Earth. It has a prevailing descriptive character. The main aim is to understand or define the uniqueness or character of a particular region, which consists of natural as well as human elements. Attention is paid also to regionalization, which covers the proper techniques of space delimitation into regions.\nRegional geography is also considered as a certain approach to study in geographical sciences (similar to quantitative or critical geographies; for more information, see history of geography).\n\n\n== Human geography ==\nHuman geography is a branch of geography that focuses on the study of patterns and processes that shape human interaction with various discrete environments. It encompasses human, political, cultural, social, and economic aspects among others that are often clearly delineated. While the major focus of human geography is not the physical landscape of the Earth (see physical geography), it is hardly possible to discuss human geography without referring to the physical landscape on which human activities are being played out, and environmental geography is emerging as a link between the two. Regions of human geography can be divided into many broad categories:\n\nCultural geography\nDemography\nDevelopment geography\nEconomic geography\nEthnography\nGeopolitics\nHealth geography\nHistorical geography\nLanguage geography\nReligion geography\nSocial geography\nTime geography\nTourism geography\nTransportation geography\nUrban geography\nMedia Geography\n\n\n=== Historical regions ===\n\nThe field of historical geography involves the study of human history as it relates to places and regions or the study of how places and regions have changed over time.\nD. W. Meinig, a historical geographer of America, describes many historical regions in his book The Shaping of America: A Geographical Perspective on 500 Years of History.  For example, in identifying European \"source regions\" in early American colonization efforts, he defines and describes the Northwest European Atlantic Protestant Region, which includes sub-regions such as the \"Western Channel Community\", which itself is made of sub-regions such as the English West Country of Cornwall, Devon, Somerset, and Dorset.\nIn describing historic regions of America, Meinig writes of \"The Great Fishery\" off the coast of Newfoundland and New England, an oceanic region that includes the Grand Banks. He rejects regions traditionally used in describing American history, like New France, \"West Indies\", the Middle Colonies, and the individual colonies themselves (Province of Maryland, for example).  Instead he writes of \"discrete colonization areas,\" which may be named after colonies but rarely adhere strictly to political boundaries. Historic regions of this type Meinig writes about include \"Greater New England\" and its major sub-regions of \"Plymouth,\" \"New Haven shores\" (including parts of Long Island), \"Rhode Island\" (or \"Narragansett Bay\"), \"the Piscataqua,\" \"Massachusetts Bay,\" \"Connecticut Valley,\" and to a lesser degree, regions in the sphere of influence of Greater New England, \"Acadia\" (Nova Scotia), \"Newfoundland and The Fishery/The Banks.\"\nOther examples of historical regions include Iroquoia, Ohio Country, Illinois Country, and Rupert's Land.\nIn Russia, historical regions include Siberia and the Russian North, as well as the Ural Mountains.  These regions had an identity that developed from the early modern period and led to Siberian regionalism.\n\n\n=== Tourism region ===\n\nA tourism region is a geographical region that has been designated by a governmental organization or tourism bureau as having common cultural or environmental characteristics. These regions are often named after a geographical, former, or current administrative region or may have a name created for tourism purposes. The names often evoke certain positive qualities of the area and suggest a coherent tourism experience to visitors. Countries, states, provinces, and other administrative regions are often carved up into tourism regions to facilitate attracting visitors.\nSome of the more famous tourism regions based on historical or current administrative regions include Tuscany in Italy and Yucatán in Mexico. Famous examples of regions created by a government or tourism bureau include the United Kingdom's Lake District and California's Wine Country.\ngreat plains region\n\n\n=== Natural resource regions ===\nNatural resources often occur in distinct regions.  Natural resource regions can be a topic of physical geography or environmental geography, but also have a strong element of human geography and economic geography.  A coal region, for example, is a physical or geomorphological region, but its development and exploitation can make it into an economic and a cultural region.  Some examples of natural resource regions include the Rumaila Field, the oil field that lies along the border or Iraq and Kuwait and played a role in the Gulf War; the Coal Region of Pennsylvania, which is a historical region as well as a cultural, physical, and natural resource region; the South Wales Coalfield, which like Pennsylvania's coal region is a historical, cultural, and natural region; the Kuznetsk Basin, a similarly important coal mining region in Russia; Kryvbas, the economic and iron ore mining region of Ukraine; and the James Bay Project, a large region of Quebec where one of the largest hydroelectric systems in the world has been developed.\n\n\n=== Religious regions ===\nSometimes a region associated with a religion is given a name, like Christendom, a term with medieval and renaissance connotations of Christianity as a sort of social and political polity.  The term Muslim world is sometimes used to refer to the region of the world where Islam is dominant.  These broad terms are very vague when used to describe regions.\nWithin some religions there are clearly defined regions.  The Roman Catholic Church, the Church of England, the Eastern Orthodox Church, and others, define ecclesiastical regions with names such as diocese, eparchy, ecclesiastical provinces, and parish.\nFor example, the United States is divided into 32 Roman Catholic ecclesiastical provinces.  The Lutheran Church–Missouri Synod is organized into 33 geographic districts, which are subdivided into circuits (the Atlantic District (LCMS), for example).  The Church of Jesus Christ of Latter-day Saints uses regions similar to dioceses and parishes, but uses terms like ward and stake.\n\n\n=== Political regions ===\n\nIn the field of political geography, regions tend to be based on political units such as sovereign states; subnational units such as administrative regions,  provinces, states (in the United States), counties, townships, territories, etc.; and multinational groupings, including formally defined units such as the European Union, the Association of Southeast Asian Nations, and NATO, as well as informally defined regions such as the Third World, Western Europe, and the Middle East.\n\n\n=== Administrative regions ===\n\nThe word \"region\" is taken from the Latin regio (derived from regere, 'to rule'), and a number of countries have borrowed the term as the formal name for a type of subnational entity (e.g., the región, used in Chile). In English, the word is also used as the conventional translation for equivalent terms in other languages (e.g., the область (oblast), used in Russia alongside a broader term регион).\nThe following countries use the term \"region\" (or its cognate) as the name of a type of subnational administrative unit:\n\nBelgium (in French, région; in German, Region; the Dutch term gewest is often translated as \"region\")\nChad (région, effective from 2002)\nChile (región)\nCôte d'Ivoire (région)\nDenmark (effective from 2007)\nEngland (not the United Kingdom as a whole)\nEritrea\nFrance (région)\nGhana\nGuinea (région)\nGuinea-Bissau (região)\nGuyana\nHungary (régió)\nItaly (regione)\nMadagascar (région)\nMali (région)\nMalta (reġjun)\nNamibia\nNew Zealand\nPeru (región)\nPortugal (região)\nPhilippines (rehiyon)\nSenegal (région)\nTanzania\nThailand\nTogo (région)\nTrinidad and Tobago (Regional Corporation)The Canadian province of Québec also uses the \"administrative region\" (région administrative).\nScotland had local government regions from 1975 to 1996.\nIn Spain the official name of the autonomous community of Murcia is Región de Murcia. Also, some single-province autonomous communities such as Madrid use the term región interchangeably with comunidad autónoma.\nTwo län (counties) in Sweden are officially called 'regions': Skåne and Västra Götaland, and there is currently a controversial proposal to divide the rest of Sweden into large regions, replacing the current counties.\nThe government of the Philippines uses the term \"region\" (in Filipino, rehiyon) when it's necessary to group provinces, the primary administrative subdivision of the country. This is also the case in Brazil, which groups its primary administrative divisions (estados; \"states\") into grandes regiões (greater regions) for statistical purposes, while Russia uses экономические районы (economic regions) in a similar way, as does Romania and Venezuela.\nThe government of Singapore makes use of the term \"region\" for its own administrative purposes.\nThe following countries use an administrative subdivision conventionally referred to as a region in English:\n\nBulgaria, which uses the област (oblast)\nRussia, which uses the область (oblast'), and for some regions the край (krai)\nUkraine, which uses the область (oblast')\nSlovakia (kraj)China has five 自治区 (zìzhìqū) and two 特別行政區 (or 特别行政区; tèbiéxíngzhèngqū), which are translated as \"autonomous region\" and \"special administrative region\", respectively.\n\n\n==== Local administrative regions ====\nThere are many relatively small regions based on local government agencies such as districts, agencies, or regions. In general, they are all regions in the general sense of being bounded spatial units.  Examples include electoral districts such as Washington's 6th congressional district and Tennessee's 1st congressional district; school districts such as Granite School District and Los Angeles Unified School District; economic districts such as the Reedy Creek Improvement District; metropolitan areas such as the Seattle metropolitan area, and metropolitan districts such as the Metropolitan Water Reclamation District of Greater Chicago, the Las Vegas-Clark County Library District, the Metropolitan Police Service of Greater London, as well as other local districts like the York Rural Sanitary District, the Delaware River Port Authority, the Nassau County Soil and Water Conservation District, and C-TRAN.\n\n\n=== Traditional or informal regions ===\n\nThe traditional territorial divisions of some countries are also commonly rendered in English as \"regions\". These informal divisions do not form the basis of the modern administrative divisions of these countries, but still define and delimit local regional identity and sense of belonging. Examples include:\n\nFinland\nJapan\nKorea\nNorway (landsdeler)\nRomania\nSlovakia\nUnited States\n\n\n=== Functional regions ===\nFunctional regions are usually understood to be the areas organised by the horizontal functional relations (flows, interactions) that are maximised within a region and minimised across its borders so that the principles of internal cohesiveness and external separation regarding spatial interactions are met (see, for instance, Farmer and Fotheringham, 2011; Klapka, Halas, 2016; Smart, 1974). A functional region is not an abstract spatial concept, but to a certain extent it can be regarded as a reflection of the spatial behaviour of individuals in a geographic space. \nThe functional region is conceived as a general concept while its inner structure, inner spatial flows, and interactions need not necessarily show any regular pattern, only selfcontainment. The concept of self-containment remains the only crucial defining characteristic of a functional region. Nodal regions, functional urban regions, daily urban systems, local labour-market areas (LLMAs), or travel-to-work areas (TTWAs) are considered to be special instances of a general functional region that need to fulfil some specific conditions regarding, for instance, the character of the region-organising interaction or the presence of urban cores, (Halas et al., 2015).\n\n\n=== Military regions ===\n\nIn military usage, a region is shorthand for the name of a military formation larger than an Army Group and smaller than an Army Theater or simply Theater. The full name of the military formation is Army Region. The size of an Army Region can vary widely but is generally somewhere between about 1 million and 3 million soldiers. Two or more Army Regions could make up an Army Theater. An Army Region is typically commanded by a full General (US four stars), a Field Marshal, or General of the Army (US five stars), or Generalissimo (Soviet Union), in the US Armed Forces, an Admiral may also command a region. Due to the large size of this formation, its use is rarely employed. Some of the very few examples of an Army Region are each of the Eastern, Western, and southern (mostly in Italy) fronts in Europe during World War II. The military map unit symbol for this echelon of formation (see Military organization and APP-6A) consists of six Xs.\n\n\n=== Media geography ===\nMedia geography is a spatio-temporal understanding, brought through different gadgets of media, nowadays, media became inevitable at different proportions and everyone supposed to consumed at different gravity. The spatial attributes are studied with the help of media outputs in shape of images which are contested in nature and pattern as well where politics is inseparable. Media geography is giving spatial understanding of mediated image.\n\n\n== See also ==\nAutonomous region\nCommittee of the Regions\nContinent\nContinental fragment\nEuroregion\nLatin names of regions\nMilitary district\nRegional district\nRegionalism (disambiguation)\nRegional municipality\nSubcontinent\nSubmerged continents\nSubregion\nSupercontinent\nUnited Nations geoscheme\n\n\n== Notes ==\n\n\n== References ==\nBailey, Robert G. (1996) Ecosystem Geography. New York: Springer-Verlag. ISBN 0-387-94586-5\nMeinig, D.W. (1986). The Shaping of America: A Geographical Perspective on 500 Years of History, Volume 1: Atlantic America, 1492-1800. New Haven: Yale University Press. ISBN 0-300-03548-9\nMoinuddin Shekh. (2017) \" Mediascape and the State: A Geographical Interpretation of Image Politics in Uttar Pradesh, India. Netherland, Springer.\nSmith-Peter, Susan (2018) Imagining Russian Regions: Subnational Identity and Civil Society in Nineteenth-Century Russia. Leiden: Brill, 2017. ISBN 9789004353497\n\n\n== External links ==\nMap and descriptions of hydrologic unit regions of the United States\nFederal Standards for Delineation of Hydrologic Unit Boundaries\nPhysiographic regions of the United States", "chinese_title": "", "chinese": ""}