{"topic": "policy", "english_title": "Policy", "english": "Policy is a deliberate system of principles to guide decisions and achieve rational outcomes. A policy is a statement of intent, and is implemented as a procedure or protocol. Policies are generally adopted by a governance body within an organization. Policies can assist in both subjective and objective decision making. Policies used in subjective decision making usually assist senior management with decisions that must be based on the relative merits of a number of factors, and as a result are often hard to test objectively, e.g. work–life balance policy. In contrast, policies to assist in objective decision making are usually operational in nature and can be objectively tested, e.g. password policy.The term may apply to government, public sector organizations and groups, as well as individuals, Presidential executive orders, corporate privacy policies, and parliamentary rules of order are all examples of policy. Policy differs from rules or law. While law can compel or prohibit behaviors (e.g. a law requiring the payment of taxes on income), policy merely guides actions toward those that are most likely to achieve a desired outcome.Policy or policy study may also refer to the process of making important organizational decisions, including the identification of different alternatives such as programs or spending priorities, and choosing among them on the basis of the impact they will have. Policies can be understood as political, managerial, financial, and administrative mechanisms arranged to reach explicit goals. In public corporate finance, a critical accounting policy is a policy for a firm/company or an industry that is considered to have a notably high subjective element, and that has a material impact on the financial statements.\n\n\n== Impact ==\n\n\n=== Intended effects ===\nThe intended effects of a policy vary widely according to the organization and the context in which they are made. Broadly, policies are typically instituted to avoid some negative effect that has been noticed in the \norganization, or to seek some positive benefit.Corporate purchasing policies provide an example of how organizations attempt to avoid negative  effects. Many large companies have policies that all purchases above a certain value must be performed through a purchasing process. By requiring this standard purchasing process through policy, the organization can limit waste and standardize the way purchasing is done.The State of California provides an example of benefit-seeking policy. In recent years, the numbers of hybrid cars in California has increased dramatically, in part because of policy changes in Federal law that provided USD $1,500 in tax credits (since phased out) as well as the use of high-occupancy vehicle lanes to hybrid owners (no loew hybrid vehicles). In this case, the organization (state and/or federal government) created an effect (increased ownership and use of hybrid vehicles) through policy (tax breaks, highway lanes).\n\n\n=== Unintended effects ===\nPolicies frequently have side effects or unintended consequences.  Because the environments that policies seek to influence or manipulate are typically complex adaptive systems (e.g. governments, societies, large companies), making a policy change can have counterintuitive results.  For example, a government may make a policy decision to raise taxes, in hopes of increasing overall tax revenue.  Depending on the size of the tax increase, this may have the overall effect of reducing tax revenue by causing capital flight or by creating a rate so high that citizens are deterred from earning the money that is taxed. (See the Laffer curve.)The policy formulation process theoretically includes an attempt to assess as many areas of potential policy impact as possible, to lessen the chances that a given policy will have unexpected or unintended consequences. \n\n\n== Policy cycle ==\nIn political science, the policy cycle is a tool used for analyzing the development of a policy item. It can also be referred to as a \"stagist approach\", \"stages heuristic\" or \"stages approach\". It is thus a rule of thumb rather than the actual reality of how policy is created, but has been influential in how political scientists looked at policy in general. It was developed as a theory from Harold Lasswell's work.\nHarold Lasswell's popular model of the policy cycle divided the process into seven distinct stages, asking questions of both how and why public policies should be made.  With the stages ranging from (1) intelligence, (2) promotion, (3) prescription, (4) invocation, (5) application, (6) termination and (7) appraisal, this process inherently attempts to combine policy implementation to formulated policy goals. One version by James E. Anderson, in his Public Policy-Making (1974) has the following stages:\n\nAgenda setting (Problem identification) – The recognition of certain subject as a problem demanding further government attention.\nPolicy formulation – Involves exploring a variation of options or alternative courses of action available for addressing the problem. (appraisal, dialogue, formulation, and consolidation)\nDecision-making – Government decides on an ultimate course of action, whether to perpetuate the policy status quo or alter it. (Decision could be 'positive', 'negative', or 'no-action')\nImplementation – The ultimate decision made earlier will be put into practice.\nEvaluation – Assesses the effectiveness of a public policy in terms of its perceived intentions and results. Policy actors attempt to determine whether the course of action is a success or failure by examining its impact and outcomes.An eight step policy cycle is developed in detail in The Australian Policy Handbook by Peter Bridgman and Glyn Davis: (now with Catherine Althaus in its 4th and 5th editions)\n\nIssue identification\nPolicy analysis\nConsultation (which permeates the entire process)\nPolicy instrument development\nBuilding coordination and coalitions\nProgram Design: Decision making\nPolicy Implementation\nPolicy EvaluationThe Althaus, Bridgman & Davis model is heuristic and iterative. It is intentionally normative and not meant to be diagnostic or predictive. Policy cycles are typically characterized as adopting a classical approach, and tend to describe processes from the perspective of policy decision makers. Accordingly, some postpositivist academics challenge cyclical models as unresponsive and unrealistic, preferring systemic and more complex models. They consider a broader range of actors involved in the policy space that includes civil society organisations, the media, intellectuals, think tanks or policy research institutes, corporations, lobbyists, etc.\n\n\n== Content ==\nPolicies are typically promulgated through official written documents. Policy documents often come with the endorsement or signature of the executive powers within an organization to legitimize the policy and demonstrate that it is considered in force. Such documents often have standard formats that are particular to the organization issuing the policy.  While such formats differ in form, policy documents usually contain certain standard components including:\nA purpose statement, outlining why the organization is issuing the policy, and what its desired effect or outcome of the policy should be.\nAn applicability and scope statement, describing who the policy affects and which actions are impacted by the policy. The applicability and scope may expressly exclude certain people, organizations, or actions from the policy requirements.  Applicability and scope is used to focus the policy on only the desired targets, and avoid unintended consequences where possible.\nAn effective date which indicates when the policy comes into force.  Retroactive policies are rare, but can be found.\nA responsibilities section, indicating which parties and organizations are responsible for carrying out individual policy statements.  Many policies may require the establishment of some ongoing function or action.  For example, a purchasing policy might specify that a purchasing office be created to process purchase requests, and that this office would be responsible for ongoing actions.  Responsibilities often include identification of any relevant oversight and/or governance structures.\nPolicy statements indicating the specific regulations, requirements, or modifications to organizational behavior that the policy is creating.  Policy statements are extremely diverse depending on the organization and intent, and may take almost any form.Some policies may contain additional sections, including:\n\nBackground, indicating any reasons, history, ethical background statements, and/or intent that led to the creation of the policy, which may be listed as motivating factors.  This information is often quite valuable when policies must be evaluated or used in ambiguous situations, just as the intent of a law can be useful to a court when deciding a case that involves that law.\nDefinitions, providing clear and unambiguous definitions for terms and concepts found in the policy document.\n\n\n== Typologies ==\nThe American political scientist Theodore J. Lowi proposed four types of policy, namely distributive, redistributive, regulatory and constituent in his article \"Four Systems of Policy, Politics and Choice\" and in \"American Business, Public Policy, Case Studies and Political Theory\". Policy addresses the intent of the organization, whether government, business, professional, or voluntary. Policy is intended to affect the \"real\" world, by guiding the decisions that are made. Whether they are formally written or not, most organizations have identified policies.Policies may be classified in many different ways. The following is a sample of several different types of policies broken down by their effect on members of the organization.\n\n\n=== Distributive policies ===\nDistributive policies extend goods and services to members of an organization, as well as distributing the costs of the goods/services amongst the members of the organization. Examples include government policies that impact spending for welfare, public education, highways, and public safety, or a professional organization's benefits plan.\n\n\n=== Regulatory policies ===\nRegulatory policies, or mandates, limit the discretion of individuals and agencies, or otherwise compel certain types of behavior. These policies are generally thought to be best applied when good behavior can be easily defined and bad behavior can be easily regulated and punished through fines or sanctions. An example of a fairly successful public regulatory policy is that of a highway speed limit.\n\n\n=== Constituent policies ===\nConstituent policies create executive power entities, or deal with laws. Constituent policies also deal with fiscal policy in some circumstances.\n\n\n=== Redistributive policies ===\nPolicies are dynamic; they are not just static lists of goals or laws. Policy blueprints have to be implemented, often with unexpected results. Social policies are what happens 'on the ground' when they are implemented, as well as what happens at the decision making or legislative stage.When the term policy is used, it may also refer to:\nOfficial government policy (legislation or guidelines that govern how laws should be put into operation)\nBroad ideas and goals in political manifestos and pamphlets\nA company or organization's policy on a particular topic.  For example, the equal opportunity policy of a company shows that the company aims to treat all its staff equally.The actions the organization actually takes may often vary significantly from stated policy. This difference is sometimes caused by political compromise over policy, while in other situations it is caused by lack of policy implementation and enforcement. Implementing policy may have unexpected results, stemming from a policy whose reach extends further than the problem it was originally crafted to address. Additionally, unpredictable results may arise from selective or idiosyncratic enforcement of policy.Types of policy analysis include: \n\nCausal (resp. non-causal)\nDeterministic (resp. stochastic, randomized and sometimes non-deterministic)\nIndex\nMemoryless (e.g., non-stationary)\nOpportunistic (resp. non-opportunistic)\nStationary (resp. non-stationary)These qualifiers can be combined, so one could, for example, have a stationary-memoryless-index policy.\n\n\n== Study of policy ==\n\n\n=== Notable Institutions ===\n\nBalsillie School of International Affairs\nBlavatnik School of Government\nLondon School of Economics\nKing's College London\nThe University of Chicago Harris School of Public Policy\nHarvard Kennedy School of Government\nHertie School of Governance\nMunk School of Global Affairs and Public Policy\nNorman Paterson School of International Affairs\nPaul H. Nitze School of Advanced International Studies\nPrinceton School of Public and International Affairs\nSciences Po Paris\nUniversity of Cambridge\nUniversity of Warwick\nKenya School of Government\n\n\n== Specific policy types ==\n\n\n== Other uses of the term ==\nIn enterprise architecture for systems design, policy appliances are technical control and logging mechanisms to enforce or reconcile policy (systems use) rules and to ensure accountability in information systems.\nIn insurance, policies are contracts between insurer and insured used to indemnify (protect) against potential loss from specified perils. While these documents are referred to as policies, they are in actuality a form of contract – see insurance contract.\nIn gambling, policy is a form of an unsanctioned lottery, where players purport to purchase insurance against a chosen number being picked by a legitimate lottery. Or can refer to an ordinary numbers game\nIn artificial intelligence planning  and reinforcement learning, a policy prescribes a non-empty deliberation (sequence of actions) given a non-empty sequence of states.\nIn debate, the term \"policy\" is slang for policy or cross-examination debate.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nK. Cummins, Linda (2011). Policy Practice for Social Workers: New Strategies for a New Era. Pearson. ISBN 9780205022441.\nHicks, Daniel L.; Hicks, Joan Hamory; Maldonado, Beatriz (January 2016). \"Women as policy makers and donors: female legislators and foreign aid\". European Journal of Political Economy. 41: 46–60. doi:10.1016/j.ejpoleco.2015.10.007.\n\n\n== External links ==\nPolicy institutes at Curlie\n\"Policy Studies Organization\". ipsonet.org.", "chinese_title": "", "chinese": ""}