{"topic": "divided", "english_title": "Division (mathematics)", "english": "Division is one of the four basic operations of arithmetic, the ways that numbers are combined to make new numbers. The other operations are addition, subtraction, and multiplication. The division sign ÷, a symbol consisting of a short horizontal line with a dot above and another dot below, is often used to indicate mathematical division. This usage, though widespread in anglophone countries, is neither universal nor recommended: the ISO 80000-2 standard for mathematical notation recommends only the solidus / or fraction bar for division, or the colon for ratios; it says that this symbol, ÷, \"should not be used\" for division.At an elementary level the division of two natural numbers is, among other possible interpretations, the process of calculating the number of times one number is contained within another. This number of times is not always an integer (a number that can be obtained using the other arithmetic operations on the natural numbers).\nThe division with remainder or Euclidean division of two natural numbers provides an integer quotient, which is the number of times the second number is completely contained in the first number, and a remainder, which is the part of the first number that remains, when in the course of computing the quotient, no further full chunk of the size of the second number can be allocated.\nFor a modification of this division to yield only one single result, the natural numbers must be extended to rational numbers (the numbers that can be obtained by using arithmetic on natural numbers) or real numbers. In these enlarged number systems, division is the inverse operation to multiplication, that is a = c / b means a × b = c, as long as b is not zero. If b = 0, then this is a division by zero, which is not defined.Both forms of division appear in various algebraic structures, different ways of defining mathematical structure. Those in which a Euclidean division (with remainder) is defined are called Euclidean domains and include polynomial rings in one indeterminate (which define multiplication and addition over single-variabled formulas). Those in which a division (with a single result) by all nonzero elements is defined are called fields and division rings. In a ring the elements by which division is always possible are called the units (for example, 1 and −1 in the ring of integers). Another generalization of division to algebraic structures is the quotient group, in which the result of \"division\" is a group rather than a number.\n\n\n== Introduction ==\nThe simplest way of viewing division is in terms of quotition and partition: from the quotition perspective, 20 / 5 means the number of 5s that must be added to get 20. In terms of partition, 20 / 5 means the size of each of 5 parts into which a set of size 20 is divided. For example, 20 apples divide into five groups of four apples, meaning that twenty divided by five is equal to four. This is denoted as 20 / 5 = 4, or 20/5 = 4. What is being divided is called the dividend, which is divided by the divisor, and the result is called the quotient. In the example, 20 is the dividend, 5 is the divisor, and 4 is the quotient.\nUnlike the other basic operations, when dividing natural numbers there is sometimes a remainder that will not go evenly into the dividend; for example, 10 / 3 leaves a remainder of 1, as 10 is not a multiple of 3. Sometimes this remainder is added to the quotient as a fractional part, so 10 / 3 is equal to 3+1/3 or 3.33..., but in the context of integer division, where numbers have no fractional part, the remainder is kept separately (exceptionally, discarded or rounded). When the remainder is kept as a fraction, it leads to a rational number. The set of all rational numbers is created by extending the integers with all possible results of divisions of integers.\nUnlike multiplication and addition, division is not commutative, meaning that a / b is not always equal to b / a. Division is also not, in general, associative, meaning that when dividing multiple times, the order of division can change the result. For example, (20 / 5) / 2 = 2, but 20 / (5 / 2) = 8 (where the use of parentheses indicates that the operations inside parentheses are performed before the operations outside parentheses).\nDivision is traditionally considered as left-associative. That is, if there are multiple divisions in a row, the order of calculation goes from left to right:\n\n  \n    \n      \n        a\n        \n          /\n        \n        b\n        \n          /\n        \n        c\n        =\n        (\n        a\n        \n          /\n        \n        b\n        )\n        \n          /\n        \n        c\n        =\n        a\n        \n          /\n        \n        (\n        b\n        ×\n        c\n        )\n        ≠\n        a\n        \n          /\n        \n        (\n        b\n        \n          /\n        \n        c\n        )\n        =\n        (\n        a\n        ×\n        c\n        )\n        \n          /\n        \n        b\n        .\n      \n    \n    {\\displaystyle a/b/c=(a/b)/c=a/(b\\times c)\\neq a/(b/c)=(a\\times c)/b.}\n  Division is right-distributive over addition and subtraction, in the sense that \n\n  \n    \n      \n        \n          \n            \n              a\n              ±\n              b\n            \n            c\n          \n        \n        =\n        (\n        a\n        ±\n        b\n        )\n        \n          /\n        \n        c\n        =\n        (\n        a\n        \n          /\n        \n        c\n        )\n        ±\n        (\n        b\n        \n          /\n        \n        c\n        )\n        =\n        \n          \n            a\n            c\n          \n        \n        ±\n        \n          \n            b\n            c\n          \n        \n        .\n      \n    \n    {\\displaystyle {\\frac {a\\pm b}{c}}=(a\\pm b)/c=(a/c)\\pm (b/c)={\\frac {a}{c}}\\pm {\\frac {b}{c}}.}\n  This is the same for multiplication, as \n  \n    \n      \n        (\n        a\n        +\n        b\n        )\n        ×\n        c\n        =\n        a\n        ×\n        c\n        +\n        b\n        ×\n        c\n      \n    \n    {\\displaystyle (a+b)\\times c=a\\times c+b\\times c}\n  . However, division is not left-distributive, as\n\n  \n    \n      \n        \n          \n            a\n            \n              b\n              +\n              c\n            \n          \n        \n        =\n        a\n        \n          /\n        \n        (\n        b\n        +\n        c\n        )\n        ≠\n        (\n        a\n        \n          /\n        \n        b\n        )\n        +\n        (\n        a\n        \n          /\n        \n        c\n        )\n        =\n        \n          \n            \n              a\n              c\n              +\n              a\n              b\n            \n            \n              b\n              c\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {\\frac {a}{b+c}}=a/(b+c)\\neq (a/b)+(a/c)={\\frac {ac+ab}{bc}}.}\n  This is unlike the case in multiplication, which is both left-distributive and right-distributive, and thus distributive.\n\n\n== Notation ==\n\nDivision is often shown in algebra and science by placing the dividend over the divisor with a horizontal line, also called a fraction bar, between them. For example, \"a divided by b\" can written as:\n\n  \n    \n      \n        \n          \n            a\n            b\n          \n        \n      \n    \n    {\\displaystyle {\\frac {a}{b}}}\n  which can also be read out loud as \"divide a by b\" or \"a over b\". A way to express division all on one line is to write the dividend (or numerator), then a slash, then the divisor (or denominator), as follows:\n\n  \n    \n      \n        a\n        \n          /\n        \n        b\n      \n    \n    {\\displaystyle a/b}\n  This is the usual way of specifying division in most computer programming languages, since it can easily be typed as a simple sequence of ASCII characters. Some mathematical software, such as MATLAB and GNU Octave, allows the operands to be written in the reverse order by using the backslash as the division operator:\n\n  \n    \n      \n        b\n        ∖\n        a\n      \n    \n    {\\displaystyle b\\backslash a}\n  A typographical variation halfway between these two forms uses a solidus (fraction slash), but elevates the dividend and lowers the divisor:\n\n  \n    \n      \n        \n          \n\n          \n          \n            a\n          \n        \n        \n          /\n        \n        \n          \n\n          \n          \n            b\n          \n        \n      \n    \n    {\\displaystyle {}^{a}/{}_{b}}\n  Any of these forms can be used to display a fraction. A fraction is a division expression where both dividend and divisor are integers (typically called the numerator and denominator), and there is no implication that the division must be evaluated further. A second way to show division is to use the division sign (÷, also known as obelus though the term has additional meanings), common in arithmetic, in this manner:\n\n  \n    \n      \n        a\n        ÷\n        b\n      \n    \n    {\\displaystyle a\\div b}\n  This form is infrequent except in elementary arithmetic. ISO 80000-2-9.6 states it should not be used. This division sign is also used alone to represent the division operation itself, as for instance as a label on a key of a calculator. The obelus was introduced by Swiss mathematician Johann Rahn in 1659 in Teutsche Algebra. The ÷ symbol is used to indicate subtraction in some European countries, so its use may be misunderstood.\nIn some non-English-speaking countries, a colon is used to denote division:\n\n  \n    \n      \n        a\n        :\n        b\n      \n    \n    {\\displaystyle a:b}\n  This notation was introduced by Gottfried Wilhelm Leibniz in his 1684 Acta eruditorum. Leibniz disliked having separate symbols for ratio and division. However, in English usage the colon is restricted to expressing the related concept of ratios.\nSince the 19th century, US textbooks have used \n  \n    \n      \n        b\n        )\n        a\n      \n    \n    {\\displaystyle b)a}\n   or \n  \n    \n      \n        b\n        \n          \n            \n              )\n              a\n            \n            ¯\n          \n        \n      \n    \n    {\\displaystyle b{\\overline {)a}}}\n   to denote a divided by b, especially when discussing long division. The history of this notation is not entirely clear because it evolved over time.\n\n\n== Computing ==\n\n\n=== Manual methods ===\nDivision is often introduced through the notion of \"sharing out\" a set of objects, for example a pile of lollies, into a number of equal portions. Distributing the objects several at a time in each round of sharing to each portion leads to the idea of 'chunking' –  a form of division where one repeatedly subtracts multiples of the divisor from the dividend itself.\nBy allowing one to subtract more multiples than what the partial remainder allows at a given stage, more flexible methods, such as the bidirectional variant of chunking, can be developed as well.More systematic and more efficient (but also more formalised, more rule-based, and more removed from an overall holistic picture of what division is achieving), a person who knows the multiplication tables can divide two integers with pencil and paper using the method of short division, if the divisor is small, or long division, if the divisor is larger. If the dividend has a fractional part (expressed as a decimal fraction), one can continue the algorithm past the ones place as far as desired. If the divisor has a fractional part, one can restate the problem by moving the decimal to the right in both numbers until the divisor has no fraction.\nA person can calculate division with an abacus.A person can use logarithm tables to divide two numbers, by subtracting the two numbers' logarithms, then looking up the antilogarithm of the result.\nA person can calculate division with a slide rule by aligning the divisor on the C scale with the dividend on the D scale. The quotient can be found on the D scale where it is aligned with the left index on the C scale. The user is responsible, however, for mentally keeping track of the decimal point.\n\n\n=== By computer or with computer assistance ===\nModern computers compute division by methods that are faster than long division, with the more efficient ones relying on approximation techniques from numerical analysis. For division with remainder, see Division algorithm.\nIn modular arithmetic (modulo a prime number) and for real numbers, nonzero numbers have a multiplicative inverse. In these cases, a division by x may be computed as the product by the multiplicative inverse of x. This approach is often associated with the faster methods in computer arithmetic.\n\n\n== Division in different contexts ==\n\n\n=== Euclidean division ===\n\nEuclidean division is the mathematical formulation of the outcome of the usual process of division of integers. It asserts that, given two integers, a, the dividend, and b, the divisor, such that b ≠ 0, there are unique integers q, the quotient, and r, the remainder,  such that a = bq + r and 0 ≤ r < |b|, where |b| denotes the absolute value of b.\n\n\n=== Of integers ===\nIntegers are not closed under division. Apart from division by zero being undefined, the quotient is not an integer unless the dividend is an integer multiple of the divisor. For example, 26 cannot be divided by 11 to give an integer. Such a case uses one of five approaches:\n\nSay that 26 cannot be divided by 11; division becomes a partial function.\nGive an approximate answer as a \"real\" number. This is the approach usually taken in numerical computation.\nGive the answer as a fraction representing a rational number, so the result of the division of 26 by 11 is \n  \n    \n      \n        \n          \n            \n              26\n              11\n            \n          \n        \n      \n    \n    {\\displaystyle {\\tfrac {26}{11}}}\n   (or as a mixed number, so \n  \n    \n      \n        \n          \n            \n              26\n              11\n            \n          \n        \n        =\n        2\n        \n          \n            \n              4\n              11\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {\\tfrac {26}{11}}=2{\\tfrac {4}{11}}.}\n  ) Usually the resulting fraction should be simplified: the result of the division of 52 by 22 is also \n  \n    \n      \n        \n          \n            \n              26\n              11\n            \n          \n        \n      \n    \n    {\\displaystyle {\\tfrac {26}{11}}}\n  . This simplification may be done by factoring out the greatest common divisor.\nGive the answer as an integer quotient and a remainder, so \n  \n    \n      \n        \n          \n            \n              26\n              11\n            \n          \n        \n        =\n        2\n        \n          \n             remainder \n          \n        \n        4.\n      \n    \n    {\\displaystyle {\\tfrac {26}{11}}=2{\\mbox{ remainder }}4.}\n   To make the distinction with the previous case, this division, with two integers as result, is sometimes called Euclidean division, because it is the basis of the Euclidean algorithm.\nGive the integer quotient as the answer, so \n  \n    \n      \n        \n          \n            \n              26\n              11\n            \n          \n        \n        =\n        2.\n      \n    \n    {\\displaystyle {\\tfrac {26}{11}}=2.}\n   This is the floor function, also sometimes called integer division at an elementary level.Dividing integers in a computer program requires special care. Some programming languages, such as C, treat integer division as in case 5 above, so the answer is an integer. Other languages, such as MATLAB and every computer algebra system return a rational number as the answer, as in case 3 above. These languages also provide functions to get the results of the other cases, either directly or from the result of case 3.\nNames and symbols used for integer division include div, /, \\, and %. Definitions vary regarding integer division when the dividend or the divisor is negative: rounding may be toward zero (so called T-division) or toward −∞ (F-division); rarer styles can occur – see Modulo operation for the details.\nDivisibility rules can sometimes be used to quickly determine whether one integer divides exactly into another.\n\n\n=== Of rational numbers ===\nThe result of dividing two rational numbers is another rational number when the divisor is not 0. The division of two rational numbers p/q and r/s can be computed as\n\n  \n    \n      \n        \n          \n            \n              p\n              \n                /\n              \n              q\n            \n            \n              r\n              \n                /\n              \n              s\n            \n          \n        \n        =\n        \n          \n            p\n            q\n          \n        \n        ×\n        \n          \n            s\n            r\n          \n        \n        =\n        \n          \n            \n              p\n              s\n            \n            \n              q\n              r\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {p/q \\over r/s}={p \\over q}\\times {s \\over r}={ps \\over qr}.}\n  All four quantities are integers, and only p may be 0. This definition ensures that division is the inverse operation of multiplication.\n\n\n=== Of real numbers ===\nDivision of two real numbers results in another real number (when the divisor is nonzero). It is defined such that a/b = c if and only if a = cb and b ≠ 0.\n\n\n=== Of complex numbers ===\nDividing two complex numbers (when the divisor is nonzero) results in another complex number, which is found using the conjugate of the denominator:\n\n  \n    \n      \n        \n          \n            \n              p\n              +\n              i\n              q\n            \n            \n              r\n              +\n              i\n              s\n            \n          \n        \n        =\n        \n          \n            \n              (\n              p\n              +\n              i\n              q\n              )\n              (\n              r\n              −\n              i\n              s\n              )\n            \n            \n              (\n              r\n              +\n              i\n              s\n              )\n              (\n              r\n              −\n              i\n              s\n              )\n            \n          \n        \n        =\n        \n          \n            \n              p\n              r\n              +\n              q\n              s\n              +\n              i\n              (\n              q\n              r\n              −\n              p\n              s\n              )\n            \n            \n              \n                r\n                \n                  2\n                \n              \n              +\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n        =\n        \n          \n            \n              p\n              r\n              +\n              q\n              s\n            \n            \n              \n                r\n                \n                  2\n                \n              \n              +\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n        +\n        i\n        \n          \n            \n              q\n              r\n              −\n              p\n              s\n            \n            \n              \n                r\n                \n                  2\n                \n              \n              +\n              \n                s\n                \n                  2\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {p+iq \\over r+is}={(p+iq)(r-is) \\over (r+is)(r-is)}={pr+qs+i(qr-ps) \\over r^{2}+s^{2}}={pr+qs \\over r^{2}+s^{2}}+i{qr-ps \\over r^{2}+s^{2}}.}\n  This process of multiplying and dividing by \n  \n    \n      \n        r\n        −\n        i\n        s\n      \n    \n    {\\displaystyle r-is}\n   is called 'realisation' or (by analogy) rationalisation. All four quantities p, q, r, s are real numbers, and r and s may not both be 0.\nDivision for complex numbers expressed in polar form is simpler than the definition above:\n\n  \n    \n      \n        \n          \n            \n              p\n              \n                e\n                \n                  i\n                  q\n                \n              \n            \n            \n              r\n              \n                e\n                \n                  i\n                  s\n                \n              \n            \n          \n        \n        =\n        \n          \n            \n              p\n              \n                e\n                \n                  i\n                  q\n                \n              \n              \n                e\n                \n                  −\n                  i\n                  s\n                \n              \n            \n            \n              r\n              \n                e\n                \n                  i\n                  s\n                \n              \n              \n                e\n                \n                  −\n                  i\n                  s\n                \n              \n            \n          \n        \n        =\n        \n          \n            p\n            r\n          \n        \n        \n          e\n          \n            i\n            (\n            q\n            −\n            s\n            )\n          \n        \n        .\n      \n    \n    {\\displaystyle {pe^{iq} \\over re^{is}}={pe^{iq}e^{-is} \\over re^{is}e^{-is}}={p \\over r}e^{i(q-s)}.}\n  Again all four quantities p, q, r, s are real numbers, and r may not be 0.\n\n\n=== Of polynomials ===\nOne can define the division operation for polynomials in one variable over a field. Then, as in the case of integers, one has a remainder. See Euclidean division of polynomials, and, for hand-written computation, polynomial long division or synthetic division.\n\n\n=== Of matrices ===\nOne can define a division operation for matrices. The usual way to do this is to define A / B = AB−1, where B−1 denotes the inverse of B, but it is far more common to write out AB−1 explicitly to avoid confusion. An elementwise division can also be defined in terms of the Hadamard product.\n\n\n==== Left and right division ====\nBecause matrix multiplication is not commutative, one can also define a left division or so-called backslash-division as A \\ B = A−1B. For this to be well defined, B−1 need not exist, however A−1 does need to exist. To avoid confusion, division as defined by A / B = AB−1 is sometimes called right division or slash-division in this context.\nNote that with left and right division defined this way, A / (BC) is in general not the same as (A / B) / C, nor is (AB) \\ C the same as A \\ (B \\ C). However, it holds that A / (BC) = (A / C) / B and (AB) \\ C = B \\ (A \\ C).\n\n\n==== Pseudoinverse ====\nTo avoid problems when A−1 and/or B−1 do not exist, division can also be defined as multiplication by the pseudoinverse. That is, A / B = AB+ and A \\ B = A+B, where A+ and B+ denote the pseudoinverses of A and B.\n\n\n=== Abstract algebra ===\nIn abstract algebra, given a magma with binary operation ∗ (which could nominally be termed multiplication), left division of b by a (written a \\ b) is typically defined as the solution x to the equation a ∗ x = b, if this exists and is unique.  Similarly, right division of b by a (written b / a) is the solution y to the equation y ∗ a = b.  Division in this sense does not require ∗ to have any particular properties (such as commutativity, associativity, or an identity element).\n\"Division\" in the sense of \"cancellation\" can be done in any magma by an element with the cancellation property.  Examples include matrix algebras and quaternion algebras.  A quasigroup is a structure in which division is always possible, even without an identity element and hence inverses.  In an integral domain, where not every element need have an inverse, division by a cancellative element a can still be performed on elements of the form ab or ca by left or right cancellation, respectively.  If a ring is finite and every nonzero element is cancellative, then by an application of the pigeonhole principle, every nonzero element of the ring is invertible, and division by any nonzero element is possible. To learn about when algebras (in the technical sense) have a division operation, refer to the page on division algebras. In particular Bott periodicity can be used to show that any real normed division algebra must be isomorphic to either the real numbers R, the complex numbers C, the quaternions H, or the octonions O.\n\n\n=== Calculus ===\nThe derivative of the quotient of two functions is given by the quotient rule:\n\n  \n    \n      \n        \n          \n            \n              (\n              \n                \n                  f\n                  g\n                \n              \n              )\n            \n          \n          ′\n        \n        =\n        \n          \n            \n              \n                f\n                ′\n              \n              g\n              −\n              f\n              \n                g\n                ′\n              \n            \n            \n              g\n              \n                2\n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle {\\left({\\frac {f}{g}}\\right)}'={\\frac {f'g-fg'}{g^{2}}}.}\n  \n\n\n== Division by zero ==\n\nDivision of any number by zero in most mathematical systems is undefined, because zero multiplied by any finite number always results in a product of zero. Entry of such an expression into most calculators produces an error message. However, in certain higher level mathematics division by zero is possible by the zero ring and algebras such as wheels. In these algebras, the meaning of division is different from traditional definitions.\n\n\n== See also ==\n400AD Sunzi division algorithm\nDivision by two\nGalley division\nInverse element\nOrder of operations\nRepeating decimal\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nPlanetmath division\nDivision on a Japanese abacus selected from Abacus: Mystery of the Bead\nChinese Short Division Techniques on a Suan Pan\nRules of divisibility", "chinese_title": "", "chinese": ""}