{"topic": "Underwater", "english_title": "Underwater environment", "english": "The underwater environment refers to the region below the surface of, and immersed in, liquid water in a natural or artificial feature (called a body of water), such as an ocean, sea, lake, pond, reservoir, river, canal, or aquifer. Some characteristics of the underwater environment are universal, but many depend on the local situation.\nLiquid water has been present on Earth for most of the history of the planet. The underwater environment is thought to be the place of the origin of life on Earth, and it remains the ecological region most critical to the support of life and the natural habitat of the majority of living organisms. Several branches of science are dedicated to the study of this environment or specific parts or aspects of it.\nA number of human activities are conducted in the more accessible parts of the underwater environment. These include research, underwater diving for work or recreation, and underwater warfare with submarines. However, the underwater environment is hostile to humans in many ways and often inaccessible, and therefore relatively little explored.\n\n\n== Extent ==\n\nThree quarters of the planet Earth is covered by water. Most of the planet's solid surface is abyssal plain, at depths between 4,000 and 5,500 metres (13,100 and 18,000 ft) below the surface of the oceans. The solid surface location on the planet closest to the centre of the geoid is the Challenger Deep, located in the Mariana Trench at a depth of 10,924 metres (35,840 ft). There is a smaller part of the surface covered by bodies of fresh water and a large volume of underground water in aquifers. The underwater environment is hostile to humans in many ways and therefore little explored. It can be mapped by sonar, or more directly explored via manned, remotely operated, or autonomous submersibles. The ocean floors have been surveyed via sonar to at least a coarse resolution; particularly-strategic areas have been mapped in detail, to assist in navigating and detecting submarines, though the resulting maps may be classified.\n\n\n=== Oceans and seas ===\n\nAn ocean is a body of water that composes much of a planet's hydrosphere. On Earth, an ocean is one of the major conventional divisions of the World Ocean. These are, in descending order by area, the Pacific, Atlantic, Indian, Southern (Antarctic), and Arctic Oceans. The word \"ocean\" is often used interchangeably with \"sea\" in American English. Strictly speaking, a sea is a body of water (generally a division of the world ocean) partly or fully enclosed by land, though \"the sea\" refers also to the oceans.\nSaline water covers approximately 361,000,000 km2 (139,000,000 sq mi) and is customarily divided into several principal oceans and smaller seas, with the ocean covering approximately 71% of Earth's surface and 90% of the Earth's biosphere. The ocean contains 97% of Earth's water, and oceanographers have stated that less than 5% of the World Ocean has been explored. The total volume is approximately 1.35 billion cubic kilometers (320 million cu mi) with an average depth of nearly 3,700 meters (12,100 ft).\n\n\n=== Lakes, ponds, and rivers ===\n\nA lake is an area filled with water, localized in a basin, that is surrounded by land, apart from any river or other outlet that serves to feed or drain the lake. Lakes lie on land and are not part of the ocean, and therefore are distinct from lagoons, and are also larger and deeper than ponds, though there are no official or scientific definitions. Lakes can be contrasted with rivers or streams, which are usually flowing. Most lakes are fed and drained by rivers and streams. Natural lakes are generally found in mountainous areas, rift zones, and areas with ongoing glaciation. Other lakes are found in endorheic basins or along the courses of mature rivers. In some parts of the world there are many lakes because of chaotic drainage patterns left over from the last Ice Age. All lakes are temporary over geologic time scales, as they will slowly fill in with sediments or spill out of the basin containing them. Many lakes are artificial and are constructed for industrial or agricultural use, for hydro-electric power generation or domestic water supply, or for aesthetic, recreational purposes, or other activities.\nA pond is an area filled with water, either natural or artificial, that is smaller than a lake. It may arise naturally in floodplains as part of a river system, or be a somewhat isolated depression (such as a kettle, vernal pool, or prairie pothole). It may contain shallow water with marsh and aquatic plants and animals. Ponds are frequently man-made, or expanded beyond their original depth and bounds. Among their many uses, ponds provide water for agriculture and livestock, aid in habitat restoration, serve as fish hatcheries, are components of landscape architecture, may store thermal energy as  solar ponds, and treat wastewater as treatment ponds. Ponds may be fresh, saltwater, or brackish.\nA river is a natural flowing watercourse, usually freshwater, flowing under the influence of gravity towards an ocean, lake, another river, or into the ground. Small rivers can be referred to using names such as stream, creek, brook, rivulet, and rill. There are no official definitions for the generic term river as applied to geographic features, Rivers are part of the hydrological cycle; water generally collects in a river from precipitation in a drainage basin from surface runoff and other sources such as groundwater recharge, springs, and the release of stored water in natural ice and snow. Potamology is the scientific study of rivers, while limnology is the study of inland waters in general.\n\n\n=== Subterranean water ===\n\nAn aquifer is an underground layer of water-bearing permeable rock, rock fractures or unconsolidated materials (gravel, sand, or silt). The study of water flow in aquifers and the characterization of aquifers is called hydrogeology.  If an impermeable layer overlies the aquifer, pressure could cause it to become a confined aquifer.\nAquifers may be classified as porous or karst, where a porous aquifer contains the water in the spaces between the grains of a loose sediment or rock (typically sand or sandstone), while a karst aquifer contains water mainly in relatively large voids in relatively impermeable rock, such as limestone or dolomite.\nWater filled caves can be classified as active and relict: active caves have water flowing through them; relict caves do not, though water may be retained in them. Types of active caves include inflow caves (\"into which a stream sinks\"), outflow caves (\"from which a stream emerges\"), and through caves (\"traversed by a stream\").\n\n\n=== Artificial bodies of water ===\n\nA reservoir is, most commonly, an enlarged natural or artificial lake, pond or impoundment created using a dam or lock to store water. Reservoirs can be created in a number of ways, including controlling a watercourse that drains an existing body of water, interrupting a watercourse to form an embayment within it, through excavation, or building retaining walls or levees. Canals are artificial waterways which may have dams and locks that create reservoirs of low speed current flow.\n\n\n== Physical characteristics ==\n\nWater is a transparent, tasteless, odorless, and nearly colorless chemical substance. Its chemical formula is H2O, meaning that each of its molecules contains one oxygen and two hydrogen atoms, connected by covalent bonds. Water is the name of the liquid state of H2O at standard ambient temperature and pressure. Water at the surface of the Earth moves continually through the water cycle of evaporation, transpiration (evapotranspiration), condensation, precipitation, and runoff, usually reaching the sea. Water seldom exists in a pure form, it almost always contains dissolved substances, and usually other matter in suspension.\n\n\n=== Density ===\n\nThe density of water is about 1 gram per cubic centimetre (62 lb/cu ft) The density varies with temperature, but not linearly: as the temperature increases, the density rises to a peak at  3.98 °C (39.16 °F) and then decreases; this is unusual. Regular, hexagonal ice is also less dense than liquid water—upon freezing, the density of water decreases by about 9%. These effects are due to the reduction of thermal motion with cooling, which allows water molecules to form more hydrogen bonds that prevent the molecules from coming close to each other. While below 4 °C the breakage of hydrogen bonds due to heating allows water molecules to pack closer despite the increase in the thermal motion (which tends to expand a liquid),  above 4 °C water expands as the temperature increases. Water near the boiling point is about 4% less dense than water at 4 °C (39 °F).\n\nThe unusual density curve and lower density of ice than of water is vital to life—if water were most dense at the freezing point, then in winter the very cold water at the surface of lakes and other water bodies would sink, the lake could freeze from the bottom up, and all life in them would be killed. Furthermore, given that water is a good thermal insulator (due to its heat capacity), some frozen lakes might not completely thaw in summer. The layer of ice that floats on top insulates the water below. Water at about 4 °C (39 °F) also sinks to the bottom, thus keeping the temperature of the water at the bottom constant (see diagram).The density of sea water depends on the dissolved salt content as well as the temperature. Ice still floats in the oceans, otherwise they would freeze from the bottom up. However, the salt content lowers the freezing point by about 1.9 °C and lowers the temperature of the density maximum of water to the fresh water freezing point at 0 °C. This is why, in ocean water, the downward convection of colder water is not blocked by an expansion of water as it becomes colder near the freezing point. The oceans' cold water near the freezing point continues to sink. So creatures that live at the bottom of cold oceans like the Arctic Ocean generally live in water  4 °C colder than at the bottom of frozen-over fresh water lakes and rivers.\nAs the surface of sea water begins to freeze (at −1.9 °C for salinity 3.5%) the ice that forms is essentially salt-free, with about the same density as freshwater ice. This ice floats on the surface, and the salt that is \"frozen out\" adds to the salinity and density of the sea water just below it, in a process known as brine rejection. This denser salt water sinks by convection. This produces essentially freshwater ice at −1.9 °C on the surface. On a large scale, the process of brine rejection and sinking cold salty water results in ocean currents forming to transport such water away from the Poles, leading to a global system of currents called the thermohaline circulation.\n\n\n==== Pressure ====\n\nThe density of water causes ambient pressures that increase dramatically with depth. The atmospheric pressure at the surface is 14.7 pounds per square inch or around 100 kPa. A comparable hydrostatic pressure occurs at a depth of only 10 metres (33 ft) (9.8 metres (32 ft) for sea water). Thus, at about 10 m below the surface, the water exerts twice the pressure (2 atmospheres or 200 kPa) as air at surface level.\n\n\n==== Buoyancy ====\n\nAny object immersed in water is subjected to a buoyant force that counters the force of gravity, appearing to make the object less heavy. If the overall density of the object exceeds the density of water, the object sinks. If the overall density is less than the density of water, the object rises until it floats on the surface.\n\n\n=== Penetration of light ===\n\nWith increasing depth underwater, sunlight is absorbed, and the amount of visible light diminishes. Because absorption is greater for long wavelengths (red end of the visible spectrum) than for short wavelengths (blue end of the visible spectrum), the colour spectrum is rapidly altered with increasing depth. White objects at the surface appear bluish underwater, and red objects appear dark, even black. Although light penetration will be less if water is turbid, in the very clear water of the open ocean less than 25% of the surface light reaches a depth of 10 m (33 feet). At 100 m (330 ft) the light present from the sun is normally about 0.5% of that at the surface.The euphotic depth is the depth at which light intensity falls to 1% of the value at the surface. This depth is dependent upon water clarity, being only a few metres underwater in a turbid estuary, but may reach up to 200 metres in the open ocean. At the euphotic depth, plants (such as phytoplankton) have no net energy gain from photosynthesis and thus cannot grow.\n\n\n=== Temperature ===\nThere are three layers of ocean temperature: the surface layer, the thermocline, and the deep ocean. The average temperature of surface layer is about 17 °C. About 90% of ocean's water is below the thermocline in the deep ocean, where most of the water is below 4 °C.There are temperature anomalies at active volcanic sites and hydrothermal vents, where deep-water temperatures can significantly exceed 100°C.\n\n\n=== Thermal conductivity ===\nWater conducts heat around 25 times more efficiently than air. Hypothermia, a potentially fatal condition, occurs when the human body's core temperature falls below 35 °C. Insulating the body's warmth from water is the main purpose of diving suits and exposure suits when used in water temperatures below 25 °C.\n\n\n=== Acoustic properties ===\n\nSound is transmitted about 4.3 times faster in water (1,484 m/s in fresh water) than in air (343 m/s). The human brain can determine the direction of sound in air by detecting small differences in the time it takes for sound waves in air to reach each of the two ears. For these reasons divers find it difficult to determine the direction of sound underwater. However, some animals have adapted to this difference and many use sound to navigate underwater.\n\n\n=== Electrical conductivity ===\n\n\n=== Dissolved materials ===\n\n\n==== Salinity ====\n\n\n==== Dissolved gases ====\n\n\n== Ecosystems ==\n\nAn aquatic ecosystem is an ecosystem in a body of water. Communities of organisms that are dependent on each other and on their environment live in aquatic ecosystems. The two main types of aquatic ecosystems are marine ecosystems and freshwater ecosystems.Marine ecosystems are the largest of Earth's aquatic ecosystems and are distinguished by waters that have a high salt content. Marine waters cover more than 70% of the surface of the Earth and account for more than 97% of Earth's water supply and 90% of habitable space on Earth. Marine ecosystems include nearshore systems, such as the salt marshes, mudflats, seagrass meadows, mangroves, rocky intertidal systems and coral reefs. They also extend outwards from the coast to include offshore systems, such as the surface ocean, pelagic ocean waters, the deep sea, oceanic hydrothermal vents, and the sea floor. Marine ecosystems are characterized by the biological community of organisms that they are associated with and their physical environment. As the world ocean is the principal component of Earth's hydrosphere, it is integral to life, forms part of the carbon cycle, and influences climate and weather patterns. The World Ocean is the habitat of 230,000 known species, but because much of it is unexplored, the number of species that exist in the ocean is much larger, possibly over two million.Freshwater ecosystems include lakes and ponds, rivers, streams, springs, aquifers, bogs, and wetlands. They have a lower salt content than marine ecosystems. Freshwater habitats can be classified by different factors, including temperature, light penetration, nutrients, and vegetation. Freshwater ecosystems can be divided into lentic ecosystems (still water) and lotic ecosystems (flowing water).Aquatic ecosystems are characterised by the limitation on ambient lighting due to absorption by the water itself and by dissolved and suspended matter in the water column, and by the support provided by buoyancy. Nutrients usable by plants are dissolved in the water, making them easily available. Outside the euphotic zone, photosynthesis cannot occur and life must use other sources of energy than sunlight.\n\n\n== History ==\n\nThe Origin of water on Earth is unknown; oceans are thought to have formed in the Hadean eon and may have been the impetus for the emergence of life.\n\n\n=== Evolutionary pressures of the underwater environment ===\n\n\n== Humans in the underwater environment ==\n\nAlthough a number of human activities are conducted underwater—such as research, underwater diving for work or recreation, and underwater warfare with submarines, the underwater environment is hostile to humans in many ways and therefore little explored.\nAn immediate obstacle to human activity under water is that human lungs cannot naturally function in this environment. Unlike the gills of fish, human lungs are adapted to the exchange of gases at atmospheric pressure. Any penetration into the underwater environment for more than a few minutes requires artificial aids to maintain life.\nFor solid and liquid tissues like bone, muscle and blood, the high ambient pressure is not much of a problem; but it is a problem for any gas-filled spaces like the mouth, ears, paranasal sinuses and lungs. This is because the gas in those spaces is much more compressible than the solids and liquids, and reduces in volume much more when under pressure and so does not provide those spaces with support against the higher outside pressure. Even at a depth of 8 ft (2.4 m) underwater, an inability to equalize air pressure in the middle ear with outside water pressure can cause pain, and the tympanic membrane (eardrum) can rupture at depths under 10 ft (3 m). The danger of pressure damage is greatest in shallow water because the ratio of pressure change is greatest near the surface of the water. The raised pressure also affects the solution of breathing gases in the tissues over time, and can lead to a range of adverse effects, such as inert gas narcosis, and oxygen toxicity. Decompression must be controlled to avoid bubble formation in the tissues and the consequent symptoms of decompression sickness.\nWith a few exceptions, the underwater environment tends to cool the unprotected human body. This heat loss will generally lead to hypothermia eventually.\n\n\n=== Hazards of the underwater environment ===\n\nThere are several classes of hazards to humans inherent to the underwater environment. \n\nAbsence of breathable gas, which can cause asphyxia, specifically by drowning.\nAmbient pressures which could cause barotrauma, or toxic effects of breathing gas components at raised partial pressures.\nAmbient temperatures which may lead to hypothermia, or in unusual cases, to hyperthermia, due to high rates of heat exchange.\nSolution of inert breathing gas components may lead to decompression sickness if decompression is too rapid.\nEntrainment of diver by moving water in currents and waves can cause injury by impacting the diver against hard objects or moving them to inappropriate depths.\nDangerous aquatic organisms of various sorts.\n\n\n=== Ambient pressure diving ===\n\nIn ambient pressure diving, the diver is directly exposed to the pressure of the surrounding water. The ambient pressure diver may dive on breath-hold, or use breathing apparatus for scuba diving or surface-supplied diving, and the saturation diving technique reduces the risk of decompression sickness (DCS) after long-duration deep dives. Immersion in water and exposure to cold water and high pressure have physiological effects on the diver which limit the depths and duration possible in ambient pressure diving. Breath-hold endurance is a severe limitation, and breathing at high ambient pressure adds further complications, both directly and indirectly. Technological solutions have been developed which can greatly extend depth and duration of human ambient pressure dives, and allow useful work to be done underwater.\n\n\n=== Atmospheric pressure diving ===\n\nA diver can be isolated from the ambient pressure by using an atmospheric diving suit (ADS), which is a small one-person articulated anthropomorphic submersible which resembles a suit of armour, with elaborate pressure resisting joints to allow articulation while maintaining an internal pressure of one atmosphere. An ADS can be used for relatively deep dives of up to 2,300 feet (700 m) for many hours, and eliminates the majority of significant physiological dangers associated with deep diving; the occupant need not decompress, there is no need for special gas mixtures, nor is there danger of decompression sickness or nitrogen narcosis, and the diver is effectively isolated from most aquatic organisms. Divers do not even need to be skilled swimmers, but mobility and dexterity are significantly degraded.\n\n\n=== Submersibles and submarines ===\n\nA submersible is a small watercraft designed to operate underwater. The term submersible is often used to differentiate from other underwater vessels known as submarines, in that a submarine is a fully autonomous craft, capable of renewing its own power and breathing air, whereas a submersible is usually supported by a surface vessel, platform, shore team or sometimes a larger submarine. There are many types of submersibles, including both manned and unmanned craft, otherwise known as remotely operated vehicles or ROVs.\n\n\n=== Remotely operated vehicles and autonomous underwater vehicles ===\n\nRemotely operated underwater vehicles and autonomous underwater vehicles are part of a larger group of undersea systems known as unmanned underwater vehicles. ROVs are unoccupied, usually highly maneuverable, and operated by a crew either aboard a vessel/floating platform or on proximate land. They are linked to a host ship by a neutrally buoyant tether, or a load-carrying umbilical cable is used along with a tether management system (TMS). The umbilical cable contains a group of electrical conductors and fiber optics that carry electric power, video, and data signals between the operator and the TMS. Where used, the TMS then relays the signals and power for the ROV down the tether cable. Once at the ROV, the electric power is distributed between the components of the ROV. In high-power applications, most of the electric power drives a high-power electric motor which drives a hydraulic pump for propulsion and to power equipment. Most ROVs are equipped with at least a video camera and lights. Additional equipment is commonly added to expand the vehicle's capabilities. Autonomous underwater vehicles (AUVs) are robots that travel underwater without requiring input from an operator. Underwater gliders are a subclass of AUVs.\n\n\n== Anthropogenic effects on the underwater environment ==\n\n\n== Sciences of the underwater environment ==\nHydrology – The science of the movement, distribution, and quality of water on Earth and other planets\nHydrography – Applied science of measurement and description of physical features of bodies of water\nLimnology – The science of inland aquatic ecosystems\nMarine biology – The scientific study of organisms that live in the ocean\nMarine ecology – The study of the interactions between organisms and environment in the sea\nMarine geology – The study of the history and structure of the ocean floor\nOcean chemistry – chemistry of marine environments\nOceanography – The study of the physical and biological aspects of the ocean\nPotamology – The study of rivers\nUnderwater archaeology – Archaeological techniques practiced at underwater sites\n\n\n== See also ==\nTimeline of diving technology – A chronological list of notable events in the history of underwater diving equipment\nUnderwater acoustics – The study of the propagation of sound in water and the interaction of sound waves with the water and its boundaries\nUnderwater photography – Genre of photography\nUnderwater vision – Effects of the underwater environment on (human) vision\nScience of underwater diving – Scientific concepts that are closely associated with underwater diving\nUNESCO Convention on the Protection of the Underwater Cultural Heritage – Treaty adopted on 2 November 2001\n\n\n== References ==\n\n\n== Footnotes ==", "chinese_title": "", "chinese": ""}